{"timestamp": "20240719_135916", "data": [{"Ticker": "JPM", "Time": "2024-07-19T10:30:00.000Z", "Headline": "Credit Card Charge-Offs Rose in the First Half of 2024. Is JPMorgan Chase Bracing for a Recession?", "Summary": "For the 10th consecutive quarter, charge-offs for credit cards at JPMorgan Chase (NYSE: JPM) rose, indicating that increasing numbers of people are struggling to keep up with their growing debt. In the second quarter, the largest bank in the U.S. charged off $1.8 billion in card loans.\nThe bank also built up its reserves for potential losses and now has $3.1 billion provisioned in the event of further losses. With consumer credit metrics weakening, is JPMorgan indicating an economic downturn is on the horizon?\nConsumer credit metrics are showing cracks\nJPMorgan posted solid Q2 earnings results, with rising revenue and net income while posting stellar results on key capital levels and return ratios. However, one weakness that persists for the largest U.S. bank is its consumer credit trends.\nThe bank's net charge-off rate is the proportion of debt the bank is unlikely to collect and is an annualized ratio of net charge-offs to average loans outstanding. In Q2, JPMorgan's net charge-off rate on its card services loans (credit cards issued to consumers and small businesses) was 3.5%, the highest level since the pandemic.\nWhy is this important? In the later stages of the pandemic, consumer credit trends were strong. Delinquencies and charge-offs fell among all banks as the gigantic fiscal stimulus from the federal government helped buoy consumers and businesses. As you can see in the chart below, JPMorgan's net charge-off rate on card services bottomed out in late 2021 and early 2022.\nChart by author.\nHowever, as the economy emerged from the pandemic, rising inflation brought along higher interest rates while pandemic-era stimulus waned and economic conditions returned to a more normalized state.\nDuring the past few years, credit card loan balances have risen and now stand at $1.12 trillion, according to the Federal Reserve Bank of New York. These high credit card loan balances come as credit card interest rates are near record levels, which has put a strain on consumers.\nThis stress has resulted in higher credit card delinquency rates. JPMorgan Chase's latest delinquency rate was above its average of 3.11% in the year before the pandemic, a sign that people are feeling the pinch.\nHow banks are preparing for the unknown\nEarlier this year, JPMorgan Chase Chief Executive Officer Jamie Dimon said that he believes the chances of a recession are \"higher than people think\" and that he continues to see risks to the economy, including ongoing geopolitical tensions, large fiscal deficits, and uncertainty about the Federal Reserve's interest rate increases and its effect on banks.\nBanks across the industry have built up their provisions for credit losses to account for rising delinquencies. These provisions reflect estimates of the potential losses a bank could experience; they are expensed on a bank's net income statement. In JPMorgan Chase's case, it charged off $2.2 billion in the quarter and built additional reserves of $821 million to account for future charge-offs.\nDuring the bank's most recent earnings call, Chief Financial Officer Jeremy Barnum told analysts that the uptick in charge-offs and delinquencies is \"normalization, not deterioration\" and that \"there's not much to see there.\" He said consumer credit quality is \"certainly a lot stronger than anyone would have thought given the tightness of monetary conditions.\"\nFor now, the reserve build and credit quality are in line with expectations laid out in the first quarter, when the bank projected net charge-offs from card services to be about 3.4% for the full year.\nDoes JPMorgan Chase expect a recession soon?\nJPMorgan Chase continues to take a cautious approach to the economy and its reserve increases indicate that the bank believes further credit losses are possible in the near future. That doesn't necessarily mean a recession will happen, but it does suggest a higher degree of uncertainty about what happens next in the economy.\nAs the largest bank in the U.S., JPMorgan must consider the various risks, including interest rate or credit risk, that could affect its business and bottom line. With this perspective, the bank maintains a fortress balance sheet. This helps it to get ahead of those risks and position itself to do well today and in an uncertain future, proving why it is one of the best-run banks today.\nShould you invest $1,000 in JPMorgan Chase right now?\nBefore you buy stock in JPMorgan Chase, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and JPMorgan Chase wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $722,993!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2024\nJPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. Courtney Carlsen has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends JPMorgan Chase. The Motley Fool has a disclosure policy.\nCredit Card Charge-Offs Rose in the First Half of 2024. Is JPMorgan Chase Bracing for a Recession? was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/Credit-Card-Charge-Offs-Rose-103000247.Html", "Sentiment_Score": -0.8971928954, "Sentiment_Category": "bearish"}, {"Ticker": "JPM", "Time": "2024-07-18T23:42:49.000Z", "Headline": "Why is JPMorgan Chase & Co. (JPM) the Best Financial Stock to Buy Now?", "Summary": "We recently compiled a list of the 10 Best Financial Stocks To Buy According to Hedge Funds. In this article, we are going to take a look at where JPMorgan Chase & Co. (NYSE:JPM) stands against the other financial stocks.\nThe financial services industry in the US is poised for a dynamic and challenging year ahead, shaped by a confluence of economic, technological, and regulatory factors. The global economy is anticipated to grow modestly, with advanced economies like the US expecting around 1.4% growth. This is influenced by ongoing geopolitical tensions, climate-related disruptions, and persistently high inflation rates. These macroeconomic conditions are expected to significantly impact the operations and profitability of financial institutions. High interest rates have been a double-edged sword for the industry. While they have led to substantial increases in net interest income, particularly for larger banks, they have also driven up funding costs, especially for smaller and regional banks, squeezing their margins. According to Deloitte, the Federal Reserve's monetary policy will be crucial, with expectations that rates will remain elevated initially but may decrease later in the year. This will necessitate careful management of the balance between deposit rates and lending rates to sustain profitability. Economic uncertainty and the potential for slower growth have prompted banks to increase their loan loss provisions as a precautionary measure to cover potential defaults. This trend is expected to persist, reflecting a cautious approach to managing credit risk amidst economic volatility and increased regulatory scrutiny.\nConcurrently, the financial services sector is experiencing significant technological shifts. Advances in AI and generative AI are set to transform various aspects of the industry, from retail investing and fraud detection to insurance offerings. However, these advancements also introduce new risks, such as heightened fraud potential and the need for robust cybersecurity measures. On the regulatory front, changes are becoming more stringent, particularly around climate-related disclosures and sustainability. Financial institutions are required to adapt to these new regulations aimed at enhancing transparency and effectively managing climate risks. These regulatory changes, coupled with technological advancements, are forcing financial institutions to innovate and evolve their business models and strategies. Overall, banks and financial institutions must remain agile and proactive, navigating these multifaceted challenges to maintain profitability and drive growth in 2024. This will involve balancing the benefits and risks of high interest rates, managing loan loss provisions prudently, leveraging technological advancements, and complying with evolving regulatory requirements.\nIn a recent development, major U.S. banks withstood a hypothetical 40% decline in commercial real estate values in the U.S. Federal Reserve's annual health test, which alleviated concerns about the banking sector amid rising interest rates. With increasing risks in the commercial real estate (CRE) sector, investors were keenly observing the Fed's stress tests to gauge the exposure of American lenders at a time when pandemic-era work patterns have left office towers largely vacant, pushing vacancy rates to a historic high of 20%. Chris Marinac, head of research at Janney Montgomery Scott, commented, “In many ways, there should be a sense of relief that banks can endure a severe crisis. However, this doesn’t mean the Fed believes commercial real estate is in the clear. We are still in the early stages of this credit cycle”. The Fed's stress tests evaluate banks' balance sheets against a hypothetical severe economic downturn, including a 36% drop in U.S. home prices, a 55% plunge in equity prices, and an unemployment rate of 10%, reported Reuters.\nResults of the stress test released recently showed that banks could continue lending to households and businesses in the event of a severe global recession and indicated the capital needed to be deemed healthy and to determine how much they can return to shareholders through dividends and buybacks. The 31 large banks tested demonstrated they had enough capital to absorb nearly $685 billion in losses. This test comes over a year after the collapse of mid-sized lenders like Silicon Valley Bank, Signature Bank, and First Republic, which sparked criticism that the Fed had underestimated banks' vulnerabilities to rising interest rates, previously assuming rates would fall during a severe recession. Commercial office space is a significant concern, with $929 billion of the $4.7 trillion in outstanding commercial mortgages maturing in 2024, according to the Mortgage Bankers Association. This approaching maturity wall occurs amid declining property values and reduced rental income. Analysts foresee a challenging period for CRE, with banks still having \"considerable concentration risks,\" according to Moody's Ratings. Of the banks tested, Goldman Sachs had the highest projected loan loss for commercial real estate at 15.9%, followed by RBC USA (15.8%), Capital One (14.6%), and Northern Trust (13%). One critique from analysts is that the Fed's stress test did not include regional banks, which hold most of the CRE loans and are less regulated than their larger counterparts.\nOver the coming months, senior leaders in the financial services industry anticipate a challenging landscape marked by high interest rates, increased regulatory scrutiny, and persistent inflation concerns. While these trends are familiar to industry veterans, many younger employees have not encountered such conditions before. According to Deloitte, leaders will need to guide their teams through uncertainty, focusing on navigating near-term challenges and identifying potential opportunities. Looking ahead, rapid technological advancements—including generative AI, cloud migration, heightened fraud and cyber risks, and the convergence of industries through embedded finance—will demand unprecedented agility from financial services leaders. Adapting to these changes will require creating new strategic pathways to align with evolving market dynamics. Throughout history, the financial services sector has often driven progress by helping organizations and individuals navigate economic and societal shifts. By the end of this decade, 2024 may be recognized as a pivotal year when the future began to materialize in tangible ways. Investing now in innovative products and services that foster positive outcomes could position firms for sustained competitive advantage in the years ahead.\nOur Methodology\nWe leveraged Insider Monkey’s comprehensive database of 920 prominent hedge funds to identify the top 10 financial stocks with the highest level of hedge fund investment as of Q1 2024. These stocks are listed in order of increasing hedge fund ownership, providing insight into the most popular financial stocks among elite investors.\nA group of business people discussing plans around a boardroom table adorned with a financial services company logo.\nJPMorgan Chase & Co. (NYSE:JPM)\nNumber of Hedge Fund Holders: 112 \nTopping our list of 10 Best Financial Stocks To Buy According to Hedge Funds is JPMorgan Chase & Co. (NYSE:JPM). In recent development on June 25, JPMorgan Chase & Co. (NYSE:JPM) has attracted over $15 billion in assets from affluent clients for its growing tax strategy business. This move underscores the bank's efforts to expand its market presence and compete effectively with rivals such as Goldman Sachs Group Inc. and Morgan Stanley. On June 21, JPMorgan Chase & Co. (NYSE:JPM) revealed its expansion plans in South Florida, highlighting the region's strategic importance for the bank. It announced the opening of a 13,000-square-foot office in West Palm Beach. This expansion is projected to stimulate approximately $151 million in additional economic activity for South Florida and create around 380 local construction jobs annually during the building phase.\nIn the first quarter of 2024, the number of hedge funds with positions in JPMorgan Chase & Co. (NYSE:JPM) rose to 112 from 103, according to Insider Monkey’s database, which tracks 920 hedge funds. The combined value of these holdings is approximately $8.41 billion. During this period, Ken Fisher’s Fisher Asset Management became the largest shareholder among these hedge funds.\nCarillon Eagle Growth & Income Fund stated the following regarding JPMorgan Chase & Co. (NYSE:JPM) in its first quarter 2024 investor letter:\n“JPMorgan Chase & Co. (NYSE:JPM) contributed positively to performance following solid financial results and positive guidance for the remainder of 2024. Moreover, growing chatter around rising capital markets activity likely contributed to the stock’s strong performance relative to other banks. Recall that JPMorgan has a robust capital markets franchise.”\nOverall JPM ranks 1st on our list of the best financial stocks to buy. You can visit 10 Best Financial Stocks To Buy According to Hedge Funds to see the other financial stocks that are on hedge funds’ radar. While we acknowledge the potential of JPM as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than JPM but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n READ NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These 10 Stocks in June.\n Disclosure: None. This article is originally published at Insider Monkey.", "Link": "Https://Finance.Yahoo.Com/News/Why-Jpmorgan-Chase-Co-Jpm-234249255.Html", "Sentiment_Score": 0.0095920004, "Sentiment_Category": "neutral"}, {"Ticker": "JPM", "Time": "2024-07-18T19:25:00.000Z", "Headline": "JPMorgan Acquires Loan Linked to 777 Partners, the Troubled Private-Equity Firm", "Summary": "The country’s largest bank has become a surprise participant in the unfolding saga surrounding 777 and its failed pursuit of a popular U.K. soccer team.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/Ba080Ceb-2A52-3655-Aa7B-E620014C40C3/Jpmorgan-Acquires-Loan-Linked.Html", "Sentiment_Score": 0.1525201499, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-18T16:00:09.000Z", "Headline": "JPMorgan Chase & Co. (JPM) Is Up 0.07% in One Week: What You Should Know", "Summary": "Momentum investing is all about the idea of following a stock's recent trend, which can be in either direction. In the 'long' context, investors will essentially be \"buying high, but hoping to sell even higher.\" And for investors following this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving in that direction. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades.\nEven though momentum is a popular stock characteristic, it can be tough to define. Debate surrounding which are the best and worst metrics to focus on is lengthy, but the Zacks Momentum Style Score, part of the Zacks Style Scores, helps address this issue for us.\nBelow, we take a look at JPMorgan Chase & Co. (JPM), which currently has a Momentum Style Score of A. We also discuss some of the main drivers of the Momentum Style Score, like price change and earnings estimate revisions.\nIt's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. JPMorgan Chase & Co. Currently has a Zacks Rank of #2 (Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period.\nYou can see the current list of Zacks #1 Rank Stocks here >>>\nSet to Beat the Market?\nLet's discuss some of the components of the Momentum Style Score for JPM that show why this company shows promise as a solid momentum pick.\nA good momentum benchmark for a stock is to look at its short-term price activity, as this can reflect both current interest and if buyers or sellers currently have the upper hand. It's also helpful to compare a security to its industry; this can show investors the best companies in a particular area.\nFor JPM, shares are up 0.07% over the past week while the Zacks Banks - Major Regional industry is up 6.86% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 10.09% compares favorably with the industry's 13.95% performance as well.\nWhile any stock can see its price increase, it takes a real winner to consistently beat the market. That is why looking at longer term price metrics -- such as performance over the past three months or year -- can be useful as well. Shares of JPMorgan Chase & Co. Have increased 12.32% over the past quarter, and have gained 40.6% in the last year. On the other hand, the S&P 500 has only moved 11.65% and 25.12%, respectively.\nInvestors should also pay attention to JPM's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. JPM is currently averaging 9,755,117 shares for the last 20 days.\nEarnings Outlook\nThe Zacks Momentum Style Score encompasses many things, including estimate revisions and a stock's price movement. Investors should note that earnings estimates are also significant to the Zacks Rank, and a nice path here can be promising. We have recently been noticing this with JPM.\nOver the past two months, 5 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost JPM's consensus estimate, increasing from $16.27 to $16.67 in the past 60 days. Looking at the next fiscal year, 9 estimates have moved upwards while there have been no downward revisions in the same time period.\nBottom Line\nGiven these factors, it shouldn't be surprising that JPM is a #2 (Buy) stock and boasts a Momentum Score of A. If you're looking for a fresh pick that's set to soar in the near-term, make sure to keep JPMorgan Chase & Co. On your short list.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Jpmorgan-Chase-Co-Jpm-0-160009847.Html", "Sentiment_Score": 0.7789385915, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-18T16:00:00.000Z", "Headline": "Bank earnings woes, Discover lawsuit and other issues facing investors", "Summary": "Earnings season is in full bloom across the financial services industry, with many bank stocks up for the year so far. But the looming high interest rate environment, combined with credit volatility and net interest margin fluctuations, impacted performance in other market segments. Experts are now wondering if share price growth can keep pace.\nIndexes measuring the overall performance of bank stocks, including the KBW Nasdaq Bank Index and the Dow Jones U.S. Banks Index, were up year to date at roughly 14% and 19% as of Tuesday.\nWhile still significantly elevated, inflation decreased slightly, by 10 basis points to 3%, as reported by the U.S. Department of Labor's Bureau of Labor Statistics on July 11, bringing the figure to its lowest level in 12 months.\nRead more: Why bank stocks may struggle to muster more momentum\nCooling inflation could help bring about an interest rate cut from the Federal Reserve by September at the earliest, according to Julien Lafargue, chief market strategist at Barclays Private Bank.\n\"We expect to see continued, albeit slow, disinflation,\" he said in a recent interview with American Banker's Jim Dobbs, adding that future rate reversals will be done gradually and will see borrowing costs remain elevated going into 2025.\nAmong those reporting positive second quarter earnings are the $563 billion-asset PNC Financial Services Group, $326 billion-asset State Street and the $428.5 billion-asset Bank of New York Mellon. Increased interest income played a hand in the Pittsburgh-based PNC's performance, while boosted assets under custody and administration and assets under management drove progress at both BNY and State Street.\nBut not every institution that recorded growth over the last three months did so unscathed.\nWells Fargo saw profits jump to $4.9 billion between April and June, up $300 million from the previous three months, but saw its net interest income sink below $12 billion for the first time in roughly two years due to heightened deposit costs and other driving conditions.\nRead more: It's time for a more collaborative approach to bank regulation\nSome executives have been working with regulators in the background of these results on multi-million dollar settlements for recent and past misdeeds.\nIn addition to recent fines against Citigroup for faults in its risk management and internal controls systems, the bank is navigating a complex overhaul plan with the Office of the Comptroller of the Currency to remedy those vulnerabilities. This is in tandem with its CEO Jane Frasier trying to streamline the organization.\nThe latest hurdle in Discover Financial Services' merger saga with Capital One Financial has seen the credit card network set aside $1.2 billion to close out a lawsuit with merchants that it overcharged for more than a decade.\nRead more about the recent issues facing the banking industry and what they mean for investors.\nWells Fargo's profits rose to $4.9 billion between April and June, up from $4.6 billion three months earlier, as higher fee revenues and the bank's campaign to trim noninterest expenses helped reduce the drag from lower interest income. Credit: Cooper Neill/Bloomberg\nWells Fargo's profits weighed down by rising deposit costs\n\nWells Fargo's profits rose to $4.9 billion across the last three months, driven by higher fee revenue and efforts to reduce noninterest expenses, but rising deposit costs put a damper on overall growth.\nIncreased competition with other financial institutions drove the bank to offer more interest to depositors, while high borrowing costs led to \"tepid\" loan demand from businesses, according to Charlie Scharf, chief executive of Wells Fargo. This combination of factors saw Wells Fargo's net interest income to dip below $12 billion for the first time since the Federal Reserve began raising rates in 2022.\n\"They're still having to pay more to their deposit customers,\" Kyle Sanders, senior equity research analyst at Edward Jones, recently told American Banker's Polo Rocha. \"Until the Fed cuts, that's going to continue to happen.\"\nRead more: Wells Fargo's rising deposit costs continue to put a drag on profits\nCitigroup has been forecasting full-year operating expenses of between $53.5 billion and $53.8 billion. Chief Financial Officer Mark Mason said earlier this month that the final tally will likely wind up at the higher end of that range. Credit: Juan Cristobal Cobo/Bloomberg\nCiti stays the course for expenses amid OCC fines\n\nCitigroup executives are remaining steadfast in their full-year operating expense guidance for the bank this year, despite incurring two concurrent fines from the Federal Reserve and the Office of the Comptroller of the Currency this month. The civil penalties, totaling $136 million, seek to address issues related to poor data quality management that were at the heart of a pair of consent orders from 2020.\nPredictions for Citi's total operating expenses estimated between $53.5 billion and $53.8 billion, but Chief Financial Officer Mark Mason told investors during the bank's earnings call on July 12 that the final number would likely be towards the higher end of that range.\n\"We are actively managing that with an eye towards what's required\" for the risk management overhaul in order \"to keep it on track, to accelerate in areas where we're behind,\" Mason said.\nDespite the regulatory shake up, American Banker's Allissa Kline writes that Citi's total revenue was up 4% year-over-year, to $20.1 billion, and net income jumped by 10% from the same quarter last year, to $3.2 billion.\nRead more: Citi sticks to expense forecast as it prepares key plan for OCC\nFifth Third said this month that it waived charges or reimbursed customers years ago, that the fake accounts involved less than $30,000 in improper charges and that it will work with the CFPB to remediate customers to whom the bank has not already provided compensation. Credit: Liam Kennedy/Bloomberg\nFifth Third reaches $20 million settlement with CFPB over wrongdoings\n\nFifth Third Bancorp reached a $20 million agreement with the Consumer Financial Protection Bureau this month to resolve offenses relating to fake checking accounts and force-placed auto insurance.\nAmerican Banker's Kate Berry writes that according to the CFPB, the $214 billion-asset Fifth Third force-placed or maintained duplicative insurance more than 37,000 times over roughly a decade ending in 2019, leading to the vehicles of 1,000 consumers being illegally repossessed. These offenses amounted to $5 million out of the total $20 million in penalties.\nThe remainder of the settlement deals with a suit filed against the bank by the CFPB in 2020, where the regulator alleged that Fifth Third opened checking accounts without the authorization of its consumer customers.\nRead more: Fifth Third settles with CFPB over fake accounts, insurance violations\nJPMorgan Chase reported $13.1 billion of net income for the second quarter. That marked a slight drop from the first quarter, excluding a massive windfall that the megabank collected in May by cashing in Visa shares.\nFraud proofing branches, rising credit card charge-offs: JPMorgan updates\n\nVery few financial institutions are untouched by the high interest rate environment regardless of asset size, and JPMorgan Chase is no exception. The $4.1 trillion-asset bank saw a 50% boost in investment banking fees year-over-year, but was held back by consistently increasing credit card charge-offs.\nJPMorgan's net charge-off rate rose to 3.5% for the second quarter, up from 2.4% the year prior, but executives told analysts in the bank's earnings call this month that the rise in credit costs was \"not a very interesting story.\" Credit loss provisions at the bank more than doubled since the last quarter, from $1.9 billion to $3.1 billion, to account for bad loans that were charged off and provide a cushion for future instances.\nAnalysts with Piper Sandler were similarly unworried by the increase in reserves, saying in an interview with American Banker reporter Catherine Leffert that the bank's credit \"normalization\" is not indicative of any widespread challenges.\n\"I think they're just being appropriate with their reserve building, particularly given that [the] credit card [business] has been a growth area for them,\" said Scott Siefers, an analyst at Piper Sandler. \"So you just need to keep pace with that balance sheet growth.\"\nIn the foreground of JPMorgan Chase's earnings season, the bank is changing up its approach to fraud prevention by incorporating more technology across its branch network. Identity checks will be done via kiosks that prompt customers for their account password or other identification, as opposed to a teller manually verifying credentials.\nRead more: JPMorgan gets lift from investment bank, offsetting jump in credit costs\nHow JPMorgan Chase is fraud-proofing its branches\nThe credit card company, which disclosed the news earlier this month, had already set aside the money to cover the refunds it will pay under the agreement. Credit: JHVEPhoto - stock.adobe.com\nDiscover approaches $1.2 billion finish line in merchant lawsuit\n\nDiscover announced on July 3 that it is preparing to pay $1.2 billion as part of a settlement with merchants who sued the credit card company after being overcharged for almost 16 years. Within that announcement, Discover said that it had already allocated the necessary capital needed to cover the refunds under the agreement.\nThe lawsuit was among a host of issues that likely resulted in the resignation of Roger Hochschild, former president and CEO of Discover, in August 2023.\nClearing this legal hurdle is a vital part of the proposed merger between Discover and Capital One, which still requires regulatory approval and has drawn intense criticism from consumer advocacy groups fearing decreased competition in the market.\nRead more: Discover settles $1.2B loose end ahead of Capital One merger", "Link": "Https://Finance.Yahoo.Com/News/Bank-Earnings-Woes-Discover-Lawsuit-160000213.Html", "Sentiment_Score": -0.3700406253, "Sentiment_Category": "bearish"}, {"Ticker": "JPM", "Time": "2024-07-18T11:35:10.000Z", "Headline": "AI-led B2B payments platform Slope secures $65m funding", "Summary": "Slope has closed an additional financing round, taking total funding to $252m. The funding will be used to scale operations. Alongside J.P. Morgan Payments, other participants in the round include Y Combinator, Jack Altman and Max Altman’s new fund, Saga.\nSlope offers order-to-cash automation using AI tools that power checkout, customer and vendor risk assessment, embedded short-term financing, and payment reconciliation.\nJ.P. Morgan Payments has chosen Slope to help provide clients access to a short-term financing solution that offers an extension of payment terms to such clients’ business customers, powered by Slope’s platform.\nSlope will join the J.P. Morgan Payments Partner Network, which delivers end-to-end payment experiences through an ecosystem of third-party applications that can grow businesses faster.\nJ.P. Morgan will also provide a debt facility to help the business achieve additional scale.\nLawrence Lin Murata, CEO and co-founder of Slope, commented: “We announced our round late last year and were not looking to raise additional capital. However, working closely with J.P. Morgan, one of the world’s largest banks, represented a unique opportunity. We are excited to join the J.P. Morgan Payments Partner Network, with the equity investment and debt facility helping to support future growth. Working with J.P. Morgan will help us advance our technology so we can better serve more members of the Fortune 500. Slope embodies ‘Fin-Tech’ to the very core and is well positioned to win the opportunity to digitise the $125trn B2B economy.”\nJames Fraser, Global Head of Trade & Working Capital at J.P. Morgan Payments, said: “The US embedded finance market is determined to be worth $20bn, with many corporates looking to implement solutions that reduce friction, streamline processes and support origination. Working with Slope, our team at J.P. Morgan Payments can help meet client demand by providing access to a financing solution that integrates directly into the point-of-sale, translating into higher conversion rates. By combining J.P. Morgan’s fortress balance sheet and depth of client relationships with Slope’s strengths in underwriting and credit risk monitoring as well as platform flexibility, we are a well-positioned partner to meet our clients’ needs in a rapidly evolving market.”\n\"AI-led B2B payments platform Slope secures $65m funding\" was originally created and published by Electronic Payments International, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/Ai-Led-B2B-Payments-Platform-113510372.Html", "Sentiment_Score": 0.8636351824, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-18T11:00:05.000Z", "Headline": "Is JPMorgan Disciplined Equity A (JDEAX) a Strong Mutual Fund Pick Right Now?", "Summary": "Large Cap Blend fund seekers should consider taking a look at JPMorgan Disciplined Equity A (JDEAX). JDEAX has a Zacks Mutual Fund Rank of 1 (Strong Buy), which is based on various forecasting factors like size, cost, and past performance.\nObjective\nJDEAX is classified in the Large Cap Blend segment by Zacks, which is an area full of potential. Targeting companies with market caps of more than $10 billion, Large Cap Blend mutual funds offer a stable investment choice; these funds are perfect for investors with a \" buy and hold \" mindset. Since blended funds mix large, more established firms into their portfolios, investors are exposed to both value and growth opportunities.\nHistory of Fund/Manager\nJ.P. Morgan is responsible for JDEAX, and the company is based out of Boston, MA. JPMorgan Disciplined Equity A debuted in January of 1997. Since then, JDEAX has accumulated assets of about $189.20 million, according to the most recently available information. The fund's current manager, Raffaele Zingone, has been in charge of the fund since July of 2002.\nPerformance\nInvestors naturally seek funds with strong performance. This fund carries a 5-year annualized total return of 16.12%, and it sits in the top third among its category peers. If you're interested in shorter time frames, do not dismiss looking at the fund's 3 -year annualized total return of 10.74%, which places it in the top third during this time-frame.\nIt is important to note that the product's returns may not reflect all its expenses. Any fees not reflected would lower the returns. Total returns do not reflect the fund's [%] sale charge. If sales charges were included, total returns would have been lower.\nWhen looking at a fund's performance, it is also important to note the standard deviation of the returns. The lower the standard deviation, the less volatility the fund experiences. The standard deviation of JDEAX over the past three years is 17.75% compared to the category average of 15.34%. Looking at the past 5 years, the fund's standard deviation is 18.32% compared to the category average of 16.22%. This makes the fund more volatile than its peers over the past half-decade.\nRisk Factors\nWith a 5-year beta of 1.01, the fund is likely to be as volatile as the market average. Alpha is an additional metric to take into consideration, since it represents a portfolio's performance on a risk-adjusted basis relative to a benchmark, which in this case, is the S&P 500. JDEAX has generated a positive alpha over the past five years of 0.85, demonstrating that managers in this portfolio are skilled in picking securities that generate better-than-benchmark returns.\nExpenses\nCosts are increasingly important for mutual fund investing, and particularly as competition heats up in this market. And all things being equal, a lower cost product will outperform its otherwise identical counterpart, so taking a closer look at these metrics is key for investors. In terms of fees, JDEAX is a load fund. It has an expense ratio of 0.60% compared to the category average of 0.89%. JDEAX is actually cheaper than its peers when you consider factors like cost.\nInvestors should also note, that according to our data, the fund does not have any minimum investment requirements.\nFees charged by investment advisors have not been taken into considiration. Returns would be less if those were included.\nBottom Line\nOverall, JPMorgan Disciplined Equity A ( JDEAX ) has a high Zacks Mutual Fund rank, and in conjunction with its comparatively strong performance, average downside risk, and lower fees, JPMorgan Disciplined Equity A ( JDEAX ) looks like a good potential choice for investors right now.\nDon't stop here for your research on Large Cap Blend funds. We also have plenty more on our site in order to help you find the best possible fund for your portfolio. Make sure to check out www.zacks.com/funds/mutual-funds for more information about the world of funds, and feel free to compare JDEAX to its peers as well for additional information. If you are more of a stock investor, make sure to also check out our Zacks Rank, and our full suite of tools we have available for novice and professional investors alike.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nGet Your Free (JDEAX): Fund Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Jpmorgan-Disciplined-Equity-Jdeax-Strong-110005004.Html", "Sentiment_Score": 0.3289861977, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-18T15:23:24.000Z", "Headline": "Jamie Dimon Just Gave Investors a Big Warning -- Should You Be Worried?", "Summary": "JPMorgan Chase (NYSE: JPM) recently kicked off earnings season for the big U.S. banks, and for the most part, the numbers looked strong. The megabank beat analyst expectations on both the top and bottom lines. Earnings and revenue grew by 25% and 20%, respectively, year over year, and investment-banking revenue jumped by more than 50%.\nWhile the earnings results generally looked strong, it's important to note that CEO Jamie Dimon had some cautionary words for investors. With the recent surge in market optimism due to signs that inflation could finally be under control, investors might want to hear what Dimon has to say before jumping head first into inflation- and rate-sensitive stocks.\nJPMorgan Chase's strong results\nFor the second quarter, JPMorgan Chase posted generally strong numbers throughout its business. Revenue grew by 20% year over year led by investment banking fees and 21% growth in equities trading revenue.\nConsumer banking remained strong, although net interest margins declined year over year as has been the case throughout the banking industry. In the company's asset and wealth management business, client assets were up 15% to $3.7 trillion, fueled by a combination of strong market returns and $52 billion in net inflows for the quarter.\nJamie Dimon's cautionary comments\nRecent data clearly shows that inflation has come down quite a bit from the 2022 peak and continues to do so. But Dimon advises investors not to simply assume the inflation problem is entirely in the past.\nIn the bank's earnings press release, Dimon said:\nThere has been some progress bringing inflation down, but there are still multiple inflationary forces in front of us: large fiscal deficits, infrastructure needs, restructuring of trade and remilitarization of the world. Therefore, inflation and interest rates may stay higher than the market expects.\nIn short, he said that just because inflation data looks like we're getting closer to where the Federal Reserve wants, it's important not to declare victory just yet. As Dimon sees it, there's still a lot that can cause the data to move the other way.\nOne of the only major stats from the earnings release that was concerning is the bank's reserve build of $3.05 billion, which was significantly higher than expected. It also indicates that the bank sees more loan defaults in the future than analysts do.\nDimon's comments and recent inflation data: Which is right?\nDimon's comments were included in JPMorgan Chase's earnings release, which was revealed just a day after the positive inflation data that caused the market to spike higher. We don't know whether he actually wrote those comments before or after he had the latest data in front of him.\nIt's also important to mention that while the cautionary comments have been the focus of most headlines — and rightly so — Dimon also had a lot of positive things to say, especially how the bank and its customers are doing. For example, he highlighted how JPMorgan Chase's client investment assets hit $1 trillion and the platform brought in the most first-time investors ever.\nFinally, while investors certainly take Dimon seriously, it's also clear that the recent inflation data is still driving investor expectations. According to the CME FedWatch tool, which indicates what investors expect benchmark interest rates to do, the median expectation has increased to three Federal Reserve rate cuts by the end of 2024.\nThe bottom line is that nobody has a crystal ball, so it's important to consider cautionary comments like Dimon's and not just pay attention to the positive data we've seen. But the data shows that an economic soft landing is becoming more of a possibility — just be prepared for a few more curveballs in the economy before we get there.\nShould you invest $1,000 in JPMorgan Chase right now?\nBefore you buy stock in JPMorgan Chase, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and JPMorgan Chase wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $774,281!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2024\nJPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. Matt Frankel has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends JPMorgan Chase. The Motley Fool has a disclosure policy.\nJamie Dimon Just Gave Investors a Big Warning -- Should You Be Worried? was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/Jamie-Dimon-Just-Gave-Investors-100300796.Html", "Sentiment_Score": -0.0526349992, "Sentiment_Category": "bearish"}, {"Ticker": "JPM", "Time": "2024-07-18T09:35:08.000Z", "Headline": "JP Morgan and UBS top M&A financial advisers in Asia-Pacific region during H1 2024", "Summary": "JP Morgan and UBS were the top mergers and acquisitions (M&A) financial advisers in the Asia-Pacific region during the first half (H1) of 2024 by value and volume, respectively, according to the latest financial advisers league table by GlobalData, publishers of RBI, which ranks financial advisers by the value and volume of M&A deals on which they advised.\nAn analysis of GlobalData’s Deals Database reveals that JP Morgan achieved the leading position in terms of value by advising on $10.8bn worth of deals. Meanwhile, UBS led in terms of volume by advising on a total of 21 deals.\nAurojyoti Bose, Lead Analyst at GlobalData, comments: “UBS was the clear winner by volume as it was the only adviser with double-digit deal volume during H1 2024. Apart from leading by volume, UBS also occupied the second position by value in H1 2024.\n“Meanwhile, JP Morgan was the only adviser to touch the $10bn mark during the review period. Apart from leading by value, JP Morgan also held the seventh position by volume during H1 2024. Interestingly both UBS and JP Morgan occupied the top spot by volume and value, respectively, in H1 2023 as well.”\nUBS occupied the second position in terms of value, by advising on $9.1bn worth of deals\nThis is then followed by Morgan Stanley with $7.6bn, Bank of America with $6.1bn and Deutsche Bank with $5.7bn.\nMeanwhile, Moelis & Company occupied the second position in terms of volume with eight deals, followed by Ernst & Young with seven deals, Nomura with six deals and Rothschild & Co with six deals.\nSimpson Thacher & Bartlett and TriLegal were the top mergers and acquisitions (M&A) legal advisers in the Asia-Pacific region during the first half (H1) of 2024 by value and volume, respectively, according to the latest legal advisers league table by GlobalData, which ranks legal advisers by the value and volume of M&A deals on which they advised.\n\"JP Morgan and UBS top M&A financial advisers in Asia-Pacific region during H1 2024\" was originally created and published by Retail Banker International, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/Jp-Morgan-Ubs-Top-M-093508334.Html", "Sentiment_Score": 0.1520961076, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-18T09:04:00.000Z", "Headline": "Zacks.com featured highlights include Netflix, JPMorgan and Dycom", "Summary": "For Immediate Release\nChicago, IL – July 18, 2024 – Stocks in this week’s article are Netflix, Inc. NFLX, JPMorgan Chase & Co. JPM and Dycom Industries, Inc. DY\n3 Best Earnings Growth Stocks to Invest In\nStudy a company’s revenues over a given period, subtract the production cost, and you have earnings. Irrespective of whether it is a start-up or a well-known company, earnings growth is the top priority for any organization. This is because if the company doesn’t make money, it won’t survive.\nBy the way, earnings are also considered the most important variable influencing the share price. But, expectations of earnings play a striking role.\nNonetheless, stocks such as Netflix, Inc., JPMorgan Chase & Co. and Dycom Industries, Inc. are currently exhibiting superb earnings growth.\nEarnings Estimates & Share Price Movements\nFrequently, we have seen a decline in the stock price despite earnings growth and a rally in price following an earnings decline. This is largely the result of a company’s earnings failing to meet market expectations.\nEarnings estimates embody analysts’ opinions on factors such as sales growth, product demand, competitive industry environment, profit margins, and cost control. Thus, earnings estimates serve as a valuable tool, while making investment decisions. Earnings estimates also help analysts assess the cash flow to determine the fair value of a firm.\nThus, investors should be on the lookout for stocks ready to make a big move. Hence, investors need to buy stocks with historical earnings growth and are seeing a rise in quarterly and annual earnings estimates.\nWe use that basis to determine our stock selections above using Zack’s Research Wizard Tool.\nThe above criteria narrowed the universe of around 7,839 stocks to only 20. Here are the top three stocks:\nNetflix\nNetflix is considered a pioneer in the streaming space. The expected earnings growth rate for the current year is 52.5%. NFLX currently has a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nJPMorgan Chase\nJPMorgan is one of the biggest global banks. The expected earnings growth rate for the current year is 1.7%. JPM presently has a Zacks Rank #2.\nDycom Industries\nDycom Industries is a specialty contracting firm operating in the telecom industry. The expected earnings growth rate for the current year is 8.1%. DY, at present, has a Zacks Rank #2.\nYou can sign up now for your 2-week free trial to the Research Wizard and start using this screen in your own trading. Further, you can also create your own strategies and test them first before taking the investment plunge.\nThe Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.\nClick here to sign up for a free trial to the Research Wizard today.\nFor the rest of this Screen of the Week article please visit Zacks.com at: https://www.zacks.com/stock/news/2303871/3-best-earnings-growth-stocks-to-invest-in-nflx-jpm-dy\nZacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.\nContact: Jim Giaquinto\nCompany: Zacks.com\nPhone: 312-265-9268\nEmail: pr@zacks.com\nVisit: https://www.zacks.com/\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer.\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\nNetflix, Inc. (NFLX) : Free Stock Analysis Report\nDycom Industries, Inc. (DY) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Zacks-Com-Featured-Highlights-Netflix-090400335.Html", "Sentiment_Score": 0.020169599, "Sentiment_Category": "neutral"}, {"Ticker": "JPM", "Time": "2024-07-18T07:30:00.000Z", "Headline": "Bank Stocks Rallied on Earnings. The Results Held a Warning About the Health of the Consumer.", "Summary": "Shares of JPMorgan and others have been rallying, but the struggles faced by everyday Americans were visible in their earnings.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/10592939-D84F-3646-84Ff-4F8037D3220C/Bank-Stocks-Rallied-On.Html", "Sentiment_Score": -0.7140046954, "Sentiment_Category": "bearish"}, {"Ticker": "JPM", "Time": "2024-07-18T08:48:04.000Z", "Headline": "Regional bank stocks rally thanks to Powell (and maybe Trump)", "Summary": "Regional bank stocks are rallying.\nThe reason: Fed Chair Jay Powell. And maybe Donald Trump too.\nThe boss of the central bank made it clear over the last week that the Fed is inching closer to cutting interest rates. Powell’s colleagues dropped some of the same hints Wednesday, with one Fed governor giving a speech titled \"Getting Closer.\"\nAn easing of monetary policy after two years of tightening would come as a great relief for midsize banks across the US that have been struggling with the impact of high rates on their profits and their borrowers.\nSuch optimism helped boost an index tracking regional banks (KRE) by 17% over the last seven trading days. It is now up more than 8% for the year.\nThe individual stocks of several well-known regional banks also surged over the last week, including PNC (PNC) and US Bancorp (USB).\n\"A lot of this, we've been saying for a while, 'It's better than you understand,'\" Chris Marinac, a regional bank analyst with Janney Montgomery Scott, told Yahoo Finance.\n\"Now it feels like people have decided, 'Oh, it's better than we understand. We should own some of these stocks,'\" he added.\nRegional bank investors also appear encouraged by Trump’s 2024 presidential campaign, which got a boost after a calamitous debate performance from President Joe Biden seemed to increase the odds of a second Trump term.\nThey found more reasons to cheer this week when Trump picked Sen. J.D. Vance as his vice presidential nominee, adding a voice to the GOP ticket that has shown some sympathy for the plight of midsize lenders.\nSen. J.D. Vance. (AP Photo/Jeff Dean, File) (ASSOCIATED PRESS)\nVance, for example, has questioned a regulatory proposal that would require large regional banks to hold greater buffers against future losses.\nHe also raised concerns last year about a decision by regulators to sell the operations of the failed First Republic bank to JPMorgan Chase (JPM) instead of a smaller regional lender — a view also shared by Democratic Sen. Elizabeth Warren.\nRegional banks are certainly more stable than they were in the spring of 2023 when the seizure of three sizable lenders triggered widespread panic about the stability of midsize financial institutions.\nIf the Fed begins lowering rates, regional banks will immediately see more relief as they lower rates they pay to depositors, Alexander Yokum, a regional bank analyst with CFRA, told Yahoo Finance.\nLower rates would also be \"good for the commercial real estate, specifically office, and then also the securities portfolios,\" Yokum added.\nRead more: What the Fed rate decision means for bank accounts, CDs, loans, and credit cards\nFederal Reserve Chair Jerome Powell. (AP Photo/Manuel Balce Ceneta) (ASSOCIATED PRESS)\nBut it’s clear that at the moment, these banks still face plenty of challenges, despite the recent bout of optimism.\nBetween Tuesday and Wednesday, large regional banks PNC, US Bancorp, and Citizens Financial (CFG) posted second quarter results showing their net interest income fell from the year-ago period.\nNet interest income is a key measure of profitability, showing the difference between what banks make from their loans and pay out in their deposits. Regional banks rely more heavily on this income than industry giants.\nYet the stock prices of those three banks still have surged 9.3%, 11%, and 11.6%, respectively, over the last five days.\nExecutives from these banks offered encouragement to analysts about the outlook for the second half of the year and 2025.\n“We feel good about our positioning for rate cuts,\" US Bancorp CFO John Stern told analysts Wednesday.\nPNC CEO Bill Demchak told analysts Tuesday that \"we are on a growth trajectory towards expected record net interest income in 2025.\"\nWilliam Demchak, CEO of PNC Financial Services Group. (Tom Williams/CQ-Roll Call, Inc via Getty Images) (Tom Williams via Getty Images)\nCitizens CEO Bruce Van Saun said, \"We're kind of prepared for a slog here on office\" after reporting that profits fell 18% from a year earlier, and the bank wrote off more loans tied to commercial offices.\nBut “if the Fed starts to move rates down, that could also start to move things in the other direction,” he added.\nMarinac warned that the stocks of regional banks could still quickly see a “meaningful pullback,” as has happened several times in the past year.\n\"I do think folks are jumping the election trade very early, but it also is because the stocks were ignored and so cheap,” Marinac said.\n\"The market's so short-term oriented that it may darn well love banks today and hate them by Friday.\"\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance", "Link": "Https://Finance.Yahoo.Com/News/Regional-Bank-Stocks-Rally-Thanks-To-Powell-And-Maybe-Trump-210401939.Html", "Sentiment_Score": 0.8386479616, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-17T16:28:49.000Z", "Headline": "JPM analysis: Chinese utilities could prosper amid rising US-China trade tensions", "Summary": "Investing.com - Analysts from JPMorgan Chase&Co. (NYSE:JPM) suggested on Wednesday that the utilities sector could emerge as a potential winner amid escalating US-China trade tensions.\nThe report comes as the Hang Seng Index (HSI) and Hang Seng Tech Index (HSTECH) fell 3.1% and 4.2%, respectively, since Monday. In contrast, the CSI-300 Index has risen by 0.8%.\nThe market's behavior has been influenced by various factors, including higher expectations of a Federal Reserve rate cut in September, increased chances of a Trump presidency, and weaker-than-anticipated retail sales and GDP growth data from China for June and Q2.\nJPMorgan's revised GDP growth forecast for China in 2024 stands at 4.7%, down from an earlier 5.2% prediction. The firm's analysts believe that the slowing growth in Q2 2024, largely due to a drag from property and consumption sectors, was unexpected. However, the firm does not anticipate new stimulus measures to combat this slowdown.\nThe research note highlighted that during the three periods of heightened US-China trade tensions from 2018 to 2020, the MXCN Utilities sector consistently outperformed the MXCN, with an average outperformance of 12.8%.\nJPMorgan's top picks in this space include Huaneng Hydro (SS:600025), Power Assets (HK:0006), Hong Kong and China Gas Co (HK:0003), and Huaneng Power International (HK:0902).\nThe 2024 Republican Party Platform has proposed several policy changes that could significantly impact China-US trade relations. For instance, the platform suggests revoking China's Most Favored Nation status, phasing out imports of essential goods, and halting China's ability to purchase American real estate and industries. This implies that the US could impose any import tariff rates on Chinese goods.\nThe proposed policies also include plans to seal the southern border, enforce immigration laws, and initiate the largest deportation program in American history. These stricter immigration regulations may incrementally weaken rental and housing demand.\nMoreover, the platform advocates for the restoration of domestic manufacturing, bringing critical supply chains back to the US, and strengthening Buy American and Hire American policies. These policies may negatively impact Chinese tech exporters, although this risk appears to have been largely priced in for Chinese tech companies.\nRelated Articles\nJPM analysis: Chinese utilities could prosper amid rising US-China trade tensions\nUnited Airlines reports Q2 revenue miss, softer guidance as demand slows\nBeyond Meat engages with bondholders to discuss balance-sheet restructuring, WSJ reports", "Link": "Https://Finance.Yahoo.Com/News/Jpm-Analysis-Chinese-Utilities-Could-162849744.Html", "Sentiment_Score": 0.9279257655, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-17T15:18:05.000Z", "Headline": "2nd-Quarter Earnings Season Kicks Off With Mixed Bank Results", "Summary": "Bank results come in mixed, economic headwinds persist, but for how much longer?\nWe are off to the races for the second-quarter earnings season now that all six big banks have reported decent, albeit mixed, results. The banks aren't necessarily a bellwether for things to come during the earnings season; they underperformed the broader market in the second quarter (the KBW Nasdaq Index advanced only 0.80% during the quarter versus growth of 4.10% for the S&P 500 Index), but they do tend to set the tone for the season.\nComing into the second-quarter season, Financials were one of the lagging sectors, with banks (Regional and Diversified) in particular being responsible for low year-over-year earnings growth.[1] And while all the banks that have reported thus far have surpassed Wall Street estimates on the top and bottom line, according to FactSet data, there are still headwinds at play that have some banking executives remaining cautious.\nFor JPMorgan Chase (NYSE:JPM), despite reporting record profits due to higher investment banking fees, it was a surprising increase in loan loss provisions - to $3.05 billion vs. expectations of $2.78 billion - that offset otherwise decent second-quarter results.[2] Increasing loan loss provisions to such an extent suggests that the bank is expecting more loan defaults in the future as the U.S. consumer continues to soften. There were also comments from CEO Jamie Dimon that erred on the side of uncertainty. The geopolitical situation remains complex and potentially the most dangerous since World War II though its outcome and effect on the global economy remain unknown, Dimon said. There has been some progress bringing inflation down, but there are still multiple inflationary forces in front of us: large fiscal deficits, infrastructure needs, restructuring of trade and remilitarization of the world.[3]\nWells Fargo's (NYSE:WFC) results reflect another one of banking's big headwinds for 2024, decreasing net interest income (NII). As interest rates stay higher for longer, banks have seen narrowing in the gap between what it makes in interest and what it pays out for deposits as customers demand higher payouts. In the case of WFC, NII dropped 9% YoY.[4] Bank of America (NYSE:BAC) also saw NII slip 3% year over year, however they guided for a rebound in the metric by the fourth quarter in anticipation of interest rate cuts, causing investors to take the stock higher by 4% following today's before-the-bell report.[5]\nOn the investment banking front, Goldman Sachs (NYSE:GS) did not quite capitalize on the momentum in IPOs and M&A as expected. Investment banking fees only increased 21% compared to JPMorgan's and Citigroup's (NYSE:C) 50%-plus increases.[6] But what they didn't gain in investment banking fees, they offset with their decreasing exposure to consumer loans which allowed the bank to cut their credit loss provisions by 54% YoY.[7] Its largest peer in the investment banking space, Morgan Stanley (MS), was able to grow investment banking fees by 51% YoY, but similar to WFC and BAC reported NII that plummeted 17% YoY due to lower deposit levels.[8]\nA presidential election, inflation and the Fed\nWhile banking earnings helped to keep market momentum going, there's a lot that has overshadowed that in the last 72 hours. Mainly the unsuccessful assassination attempt on former President Trump. Investors lifted markets yesterday as they believed that event would boost the Republican's campaign for the White House, which has been gaining momentum since President Biden's poor performance in last month's debate. Many on Wall Street are betting that if Trump returns to office, that would usher in a new era of tax cuts, higher tariffs and looser regulations, among other things. Of course, lower corporate taxes would mean a boost for companies' bottom lines.\nAdd to that, reassuring comments from Federal Reserve Chairman Jerome Powell at the Economic Club of Washington D.C. on Monday that the central bank would not wait until inflation was down to 2% to cut rates. The implication of that is that if you wait until inflation gets all the way down to 2%, you've probably waited too long, because the tightening that you're doing, or the level of tightness that you have, is still having effects which will probably drive inflation below 2%, Powell said.[9] According to the CME Group's FedWatch tool, the expectation is that the September Fed meeting will bring the first interest rate cut since 2020.[10]\nCEO uncertainty remains high\nAfter falling to its lowest level in its nine years in the first quarter of 2024, the Late Earnings Report Index, our proprietary measure of CEO uncertainty, is back up for the second quarter in a row for the third quarter.\nThe LERI tracks outlier earnings date changes among publicly traded companies with market capitalizations of $250 million and higher. The LERI has a baseline reading of 100, anything above that indicates companies are feeling uncertain about their current and short-term prospects. A LERI reading under 100 suggests companies feel they have a pretty good crystal ball for the near-term.\nThe official pre-peak season LERI reading for the second quarter (data collected in the third quarter) stands at 161, well above the baseline reading, suggesting companies are feeling less certain about economic conditions than they were at the beginning of the year. Some of that uncertainty was evident in banking commentary (see Jamie Dimon's remarks above). As of July 12, there were 66 late outliers and 37 early outliers.\n2nd-Quarter Earnings Season Kicks Off With Mixed Bank Results\nSource: Wall Street Horizon\nOn deck this week\nThis week will continue on with more results from the financials sector, mainly regional and diversified banks. We'll also get a read on the consumer when names within consumer finance such as American Express (NYSE:AXP) and Discover (NYSE:DFS) report, as well as United Airlines (NASDAQ:UAL), Domino's Pizza (NYSE:DPZ) and Netflix (NASDAQ:NFLX).\n2nd-Quarter Earnings Season Kicks Off With Mixed Bank Results\nSource: Wall Street Horizon\nSecond-quarter earnings wave\nThis season peak weeks will fall between July 22 and Aug. 16, with each week expected to see over 1,000 reports. Currently Aug. 8 is predicted to be the most active day with 1,445 companies anticipated to report. Thus far only 53% of companies have confirmed their earnings date (out of our universe of 11,000-plus global names), so this is subject to change. The remaining dates are estimated based on historical reporting data.\n2nd-Quarter Earnings Season Kicks Off With Mixed Bank Results\nSource: Wall Street Horizon\n1 FactSet Earnings Insight, FactSet, John Butters, July 12, 2024, https://advantage.factset.com2 JPMorgan Chase & Co., 2Q24 Earnings Press Release, July 12, 2024. https://www.jpmorganchase.com3 JPMorgan Chase & Co., 2Q24 Earnings Press Release, July 12, 2024. https://www.jpmorganchase.com4 JPMorgan Chase & Co., 2Q24 Earnings Press Release, July 12, 2024. https://www.jpmorganchase.com5 Bank of America, 2Q24 Earnings Press Release, July 16. 2024. https://d1io3yog0oux5.cloudfront.netf 6 Goldman Sachs, Secohttps://www.goldmansachs.com7 Goldman Sachs, Second Quarter 2024 Earnings Release, July 15. https://www.goldmansachs.com8 Morgan Stanley Second Quarter 2024 Earnings Results, July 16. https://www.morganstanley.com9 CNBC, Powell indicates Fed won't wait until inflation is down to 2% before cutting rates, July 15, 2024. https://www.cnbc.com10 CME Group FedWatch Tool, July 16, 2024, ?https://www.cmegroup.com\nCopyright 2024 Wall Street Horizon, Inc. All rights reserved. Do not copy, distribute, sell or modify this document without Wall Street Horizon's prior written consent. This information is provided for information purposes only. Neither TMX Group Limited nor any of its affiliated companies guarantees the completeness of the information contained in this publication, and we are not responsible for any errors or omissions in or your use of, or reliance on, the information. This publication is not intended to provide legal, accounting, tax, investment, financial or other advice and should not be relied upon for such advice. The information provided is not an invitation to purchase securities, including any listed on Toronto Stock Exchange and/or TSX Venture Exchange. TMX Group and its affiliated companies do not endorse or recommend any securities referenced in this publication. TMX, the TMX design, TMX Group, Toronto Stock Exchange, TSX, and TSX Venture Exchange are the trademarks of TSX Inc. and are used under license. Wall Street Horizon is the trademark of Wall Street Horizon, Inc. All other trademarks used in this publication are the property of their respective owners.\nThis article first appeared on GuruFocus.", "Link": "Https://Finance.Yahoo.Com/News/2Nd-Quarter-Earnings-Season-Kicks-151805848.Html", "Sentiment_Score": -0.1854765713, "Sentiment_Category": "bearish"}, {"Ticker": "JPM", "Time": "2024-07-17T14:00:00.000Z", "Headline": "JPMorganChase and UnidosUS Strengthen Partnership to Support Expanded Affordable Homeownership Opportunities in Latino Communities Across the Country", "Summary": "$6 million philanthropic commitment and joint policy recommendations will help scale solutions to increase Latino homeownership\nLAS VEGAS, July 17, 2024--(BUSINESS WIRE)--JPMorganChase is leveraging its philanthropic, policy and business resources to increase affordable homeownership solutions in Latino communities across the country. Today at the UnidosUS Annual Conference in Las Vegas, the firm announced a $6 million philanthropic commitment and joint policy recommendations to support homebuyer readiness, expanded access to credit, increased housing supply, and the preservation of Latino homeownership.\nToday’s announcement follows a recent expansion of the Chase homebuyer grant, which increased from $5,000 to $7,500 in communities nationwide identified by the U.S. Census as majority-Black, Hispanic or Latino. This includes more than 200 tracts in the Las Vegas local metro area, and will help all eligible individuals lower their interest rate and/or reduce their down payment and closing cost when purchasing a home.\n\"At JPMorganChase, we are deeply committed to addressing housing access and affordability, particularly within the Latino community,\" said Abi Suarez, Head of Neighborhood Development at JPMorganChase. \"Today's announcement is part of a holistic strategy to help more individuals take advantage of the benefits of homeownership. By leveraging philanthropy, policy recommendations, and business practices, we aim to create pathways to homeownership that foster financial stability and inclusive economic growth in underserved communities across the country.\"\nSupporting UnidosUS HOME Initiative to Increase Latino Homeownership\nWhile Latino homeownership has risen over the years, nearing 50% in 2023, significant barriers remain. As of 2023, the Latino homeownership rate was nearly 25% below homeownership rates for White households. This creates barriers to homeownership as a key source of financial stability and transfer of intergenerational wealth.\nPhilanthropic funding will support UnidosUS capacity building and their HOME (Home Ownership Means Equity) initiative, a national effort to create 4 million new Latino homeowners by 2030. JPMorganChase’s support of the HOME initiative will help scale solutions for cost-burdened households and ensure equitable access to homeownership by:\nCreating a state-wide Latino homeownership blueprint in California by developing a coalition of organizations to identify barriers to Latino homeownership in California and advance data-driven solutions with the potential to scale to other states\nSupporting a first-of-its-kind Latino-focused research network to inform and promote strategies and policies that advance access to Latino homeownership\nFacilitating the exchange of best practices and expertise among a network of Unidos affiliates and practitioners working to address housing supply, equitable mortgages, and estate planning through convenings and collaborative assessments\nToday’s commitment to UnidosUS is part of JPMorganChase’s broader commitment to support local and national organizations in helping underserved individuals throughout their homeownership journey. To date, the firm has committed more than $20 million to UnidosUS and its local affiliates over 15 years, while serving on the UnidosUS Corporate Board of Advisors and sponsoring major events like the UnidosUS Annual Conference, where policy, industry, and public sector leaders regularly convene.\nThe firm has also worked with a number of community-based organizations across the country that are working to improve housing affordability and access in Latino communities, including recently announced winners of the UnidosUS Premio HOME competition. They include Hacienda Community Development Corporation in Portland, OR, The Resurrection Project in Chicago, IL, cdcb (come dream. come build.) in the Rio Grande Valley, TX, Mission Economic Development Agency in San Francisco, CA, and East LA Community Corporation in Los Angeles, CA.\n\"Public-private partnerships like JPMorganChase’s support for HOME are critical to expanding Latino homeownership and building power across our community,\" said Laura Arce, Senior Vice President of Economic Initiatives at UnidosUS. \"The firm combines philanthropic investment with research and advocacy and helps our organization scale solutions that improve financial health and make wealth building more accessible.\"\nAdvancing Policy Solutions that Tackle Barriers to Homeownership\nCross-sector policy change driven by research and data is key to increasing access to homeownership and advancing a more inclusive economy. The JPMorganChase PolicyCenter and UnidosUS have released joint policy recommendations to help ensure Latino communities can access and benefit from affordable homeownership opportunities, including:\nExpanding funding to increase affordable housing supply through the creation of a new, national Neighborhood Homes Tax Credit to boost the production of single-family homes\nReducing barriers to homeownership by expanding housing counseling and down payment assistance programs to relieve households of burdensome homeownership costs\nPrioritizing affordable and sustainable mortgages by increasing access to mortgage credit\nPreserving wealth across generations by addressing heirs property and property undervaluation challenges by increasing access to estate planning legal services, building customer awareness, and establishing interventions to support heirs property owners in suspected cases of appraisal bias\nAbout JPMorganChase\nJPMorgan Chase & Co. (NYSE: JPM) is a leading financial services firm based in the United States of America (\"U.S.\"), with operations worldwide. JPMorgan Chase had $4.1 trillion in assets and $337 billion in stockholders’ equity as of March 31, 2024. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing and asset management. Under the J.P. Morgan and Chase brands, the Firm serves millions of customers in the U.S., and many of the world’s most prominent corporate, institutional and government clients globally. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240717499546/en/\nContacts\nGabriela Alba\ngabriela.alba@jpmchase.com\n(862) 347 - 1709", "Link": "Https://Finance.Yahoo.Com/News/Jpmorganchase-Unidosus-Strengthen-Partnership-Support-140000909.Html", "Sentiment_Score": 0.9321269989, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-17T12:04:18.000Z", "Headline": "JPMorgan to Open Munich Office Amid Deeper Push Into Germany", "Summary": "(Bloomberg) -- JPMorgan Chase & Co. is planning to set up shop in Munich as the US banking giant keeps expanding in Europe’s largest economy.\nMost Read from Bloomberg\nUS Floats Tougher Trade Rules to Rein In China Chip Industry\nHigh-Flying Chipmakers See Worst Plunge Since 2020: Markets Wrap\nBlackRock Says Gunman From Trump Rally Appeared in Firm’s Ad\nAmazon Sold a Used Diaper. It Tanked a Mom-and-Pop Business\nTrump Security Tightened on Iran Plot Intel; No Link to Shooting\nThe new office in southern Germany’s largest city will focus on asset management and corporate banking, according to remarks made by Chief Executive Officer Jamie Dimon in an interview with the local newspaper Handelsblatt.\nThe office will ultimately employ about 30 people, a person familiar with the matter said. Hiring is underway although a physical office is not expected to open before next year, the person said, asking not to be named discussing private information. A handful of executives already work in Munich, including Andreas Hierl and Claudio Wendenburg, the person said. Hierl joined JPMorgan in April and Wendenburg started in July, according to their LinkedIn profiles.\nJPMorgan has long been expanding its operations in Germany, having established its European hub in Frankfurt after Brexit. The lender is seeking to increase business with smaller corporate clients and it has also unveiled a plan to launch a digital consumer bank in the country.\n“We want to do more business with corporations and medium-sized companies. We want to grow in payments and in investment banking. We want to introduce new products and we continue to increase our staff,” Dimon said in the newspaper interview, referring to his plans for Germany. “There isn’t really any area where we don’t want to grow.”\nDimon declined to say when exactly JPMorgan wants to launch the local consumer bank, which is being developed in Germany’s capital, Berlin. The bank continues to add staff in the city, he said.\nDimon acknowledged in the interview that the German economy has been struggling to recover from an energy crisis following Russia’s invasion of Ukraine, but said “there are many exceptional companies in this country, talented employees and a good work ethic.”\nDimon added that rising national debt, increased military spending, the conversion of supply chains and the economic shift toward sustainability could keep inflation higher in the US.\nHe said he could see himself continuing as chairman of the bank for a few years after he steps down as CEO, though that was a decision for the board, according to the interview.\n--With assistance from Joshua Gallu.\n(Adds names of new hires in third paragraph)\nMost Read from Bloomberg Businessweek\nTop Takeaways From Businessweek’s Donald Trump Interview\nWhy the Nobel-Laureate Pioneer of Microfinance Risks Life in Jail\nInterviewing Trump on His Plans for the US Economy\nHow Trader Joe’s Mini Cooler Bags Became a Viral Hit\nWhat Americans Invest In Now\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Jpmorgan-Open-Munich-Office-Amid-120418021.Html", "Sentiment_Score": 0.2907204926, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-17T10:20:05.000Z", "Headline": "Should JPMorgan BetaBuilders U.S. Small Cap Equity ETF (BBSC) Be on Your Investing Radar?", "Summary": "Launched on 11/16/2020, the JPMorgan BetaBuilders U.S. Small Cap Equity ETF (BBSC) is a passively managed exchange traded fund designed to provide a broad exposure to the Small Cap Value segment of the US equity market.\nThe fund is sponsored by J.P. Morgan. It has amassed assets over $553.57 million, making it one of the average sized ETFs attempting to match the Small Cap Value segment of the US equity market.\nWhy Small Cap Value\nWith more potential comes more risk, and small cap companies, with market capitalization below $2 billion, epitomizes this way of thinking.\nValue stocks are known for their lower than average price-to-earnings and price-to-book ratios, but investors should also note their lower than average sales and earnings growth rates. Looking at their long-term performance, value stocks have outperformed growth stocks in almost all markets. They are however likely to underperform growth stocks in strong bull markets.\nCosts\nWhen considering an ETF's total return, expense ratios are an important factor, and cheaper funds can significantly outperform their more expensive counterparts in the long term if all other factors remain equal.\nAnnual operating expenses for this ETF are 0.09%, making it one of the least expensive products in the space.\nIt has a 12-month trailing dividend yield of 1.44%.\nSector Exposure and Top Holdings\nEven though ETFs offer diversified exposure which minimizes single stock risk, it is still important to look into a fund's holdings before investing. Luckily, most ETFs are very transparent products that disclose their holdings on a daily basis.\nThis ETF has heaviest allocation to the Financials sector--about 19.70% of the portfolio. Industrials and Healthcare round out the top three.\nLooking at individual holdings, Jpmorgan Us Govt Mmkt Fun accounts for about 1.58% of total assets, followed by Carvana Co Common Stock (CVNA) and Abercrombie & Fitch Co (ANF).\nThe top 10 holdings account for about 6.28% of total assets under management.\nPerformance and Risk\nBBSC seeks to match the performance of the MORNINGSTAR US SML CP TRG MRK EXP EXT ID before fees and expenses. The Morningstar US Small Cap Target Market Exposure Extended Index is a free-float adjusted, market-cap weighted index that targets small cap securities traded in the U.S.\nThe ETF has added about 10.33% so far this year and was up about 17.32% in the last one year (as of 07/17/2024). In the past 52-week period, it has traded between $48.58 and $67.50.\nThe ETF has a beta of 1.09 and standard deviation of 23.16% for the trailing three-year period. With about 829 holdings, it effectively diversifies company-specific risk.\nAlternatives\nJPMorgan BetaBuilders U.S. Small Cap Equity ETF holds a Zacks ETF Rank of 2 (Buy), which is based on expected asset class return, expense ratio, and momentum, among other factors. Because of this, BBSC is an excellent option for investors seeking exposure to the Style Box - Small Cap Value segment of the market. There are other additional ETFs in the space that investors could consider as well.\nThe Avantis U.S. Small Cap Value ETF (AVUV) and the Vanguard Small-Cap Value ETF (VBR) track a similar index. While Avantis U.S. Small Cap Value ETF has $12.73 billion in assets, Vanguard Small-Cap Value ETF has $29.61 billion. AVUV has an expense ratio of 0.25% and VBR charges 0.07%.\nBottom-Line\nRetail and institutional investors increasingly turn to passively managed ETFs because they offer low costs, transparency, flexibility, and tax efficiency; these kind of funds are also excellent vehicles for long term investors.\nTo learn more about this product and other ETFs, screen for products that match your investment objectives and read articles on latest developments in the ETF investing universe, please visit Zacks ETF Center.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nJPMorgan BetaBuilders U.S. Small Cap Equity ETF (BBSC): ETF Research Reports\nAbercrombie & Fitch Company (ANF) : Free Stock Analysis Report\nVanguard Small-Cap Value ETF (VBR): ETF Research Reports\nCarvana Co. (CVNA) : Free Stock Analysis Report\nAvantis U.S. Small Cap Value ETF (AVUV): ETF Research Reports\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Jpmorgan-Betabuilders-U-Small-Cap-102005303.Html", "Sentiment_Score": 0.0829419047, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-16T21:57:23.000Z", "Headline": "Bank earnings, spot ether ETF, US labor data: Market Domination", "Summary": "The weather is sweltering today, but equities are still thriving (^DJI, ^IXIC, ^GSPC) Julie Hyman and Josh Lipton monitor the latest market movements and report on the biggest industry stories heading into Tuesday's market close.\nMizuho US chief economist Steven Ricchiuto joins Market Domination to talk about what he is seeing in US labor and employment data and what it could mean about the supposed cooling economy.\nBank earnings continue to roll out with Bank of America (BAC), Morgan Stanley (MS), and Charles Schwab (SCHW) reporting results today. CFRA director of equity research Ken Leon comes onto the program to discuss prevalent trends in Big Bank earnings and the direction investment banking businesses could head in the latter half of 2024.\nAhead of Netflix's (NFLX) earnings due out on Thursday, July 18, Bloomberg Intelligence senior media analyst Geetha Ranganathan comments on the \"very, very high\" expectations for the streaming giant that it very well could live up to and even surpass for its past quarter.\nOther top trending stocks on the Yahoo Finance platform include UnitedHealth Group (UNH), Warner Bros. Discovery (WBD), Adidas (ADS.DE, ADDYY), and cryptocurrency ethereum (ETH-USD) around the expected launch of spot ether ETF products.\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Bank-Earnings-Spot-Ether-Etf-215723650.Html", "Sentiment_Score": 0.0114147775, "Sentiment_Category": "neutral"}, {"Ticker": "JPM", "Time": "2024-07-16T20:38:46.000Z", "Headline": "How long will the investment banking boost last?", "Summary": "With the potential for the Federal Reserve to cut interest rates as soon as this September, there may be added hurdles for investment banking to keep profitability high even after several banks reported positive second quarter results.\nCFRA director of equity research Ken Leon joins Market Domination to discuss the state of investment banking and how these big banks may operate moving forward in current and future interest rate environments.\nOn sustainability of growth for investment banking, Leon comments: \"We hit the trough for investment banking fees last year, probably in July. We're still at just the beginning of a rebound, but saying that, the first quarter, first half of this year had record results for debt cap, debt underwriting. But equity underwriting and IPOs, are still really in early innings of recovery. And keep in mind, there's two major sources for deals: one is obviously corporates, but the one that has not been participating as it tries to figure out valuation with rates is financial sponsors.\"\nFor more expert insight and the latest market action, click here to watch this full episode of Market Domination.\nThis post was written by Nicholas Jacobino", "Link": "Https://Finance.Yahoo.Com/Video/Long-Investment-Banking-Boost-Last-203846171.Html", "Sentiment_Score": 0.0677114949, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-16T20:00:00.000Z", "Headline": "JPMorgan Executive Leaves to Join Wealth Tech Platform as CIO", "Summary": "(Bloomberg) -- JPMorgan Chase & Co.’s Ankit Misra is leaving the firm to join wealth tech platform Collective Liquidity as its chief investment officer.\nMost Read from Bloomberg\nBlackRock Says Gunman From Trump Rally Appeared in Firm’s Ad\nTrump Security Tightened on Iran Plot Intel; No Link to Shooting\nAmazon Sold a Used Diaper. It Tanked a Mom-and-Pop Business\nFrom Elon Musk to David Sacks, Silicon Valley’s Trump Backers Cheer Vance as VP Pick\nAmbani's $600 Million Wedding Is Just Business as Usual\nMisra, who will be based in New York, will oversee the fund’s investments and will also manage the development of its proprietary valuation technology, according to a statement reviewed by Bloomberg News.\nA spokesperson for JPMorgan didn’t immediately respond to a request for comment.\nMisra joined JPMorgan in its London office in 2013 and was most recently the bank’s executive director of strategic investments focusing on financial technology and enterprise technology companies. Prior to that, Misra worked at Blackstone Inc. and McKinsey & Co.\nCollective Liquidity allows employees of late-stage private growth companies and institutional investors to trade shares of a portfolio of startups with valuations of more than $1 billion. It also offers the employees of those companies financial tools to manage their wealth.\nThe company raised $12 million in its series A funding round last year, according to a statement at the time.\nMost Read from Bloomberg Businessweek\nTop Takeaways From Businessweek’s Donald Trump Interview\nWhy the Nobel-Laureate Pioneer of Microfinance Risks Life in Jail\nInterviewing Trump on His Plans for the US Economy\nHere’s How to Create a Social Safety Net With Bipartisan Support\nHow Rivian Became the Anti-Tesla\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Jpmorgan-Executive-Leaves-Join-Wealth-200000602.Html", "Sentiment_Score": -0.0010770336, "Sentiment_Category": "neutral"}, {"Ticker": "JPM", "Time": "2024-07-16T17:45:00.000Z", "Headline": "Three Major Takeaways From Big Banks’ Earnings", "Summary": "Investment-banking and trading revenue rose at major U.S. banks including Goldman Sachs and JPMorgan Chase More stable economic conditions gave corporate-banking clients the confidence to use bread-and-butter banking services such as deal advisory and debt offerings. A clearer outlook on interest rates is giving bankers hope that dealmaking is emerging from a two-year slowdown.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/6F788B05-0Db6-36Cb-A339-63Dbc2D2744D/Three-Major-Takeaways-From.Html", "Sentiment_Score": -0.068347156, "Sentiment_Category": "bearish"}, {"Ticker": "JPM", "Time": "2024-07-16T14:38:35.000Z", "Headline": "Morgan Stanley's investment banking surge solidifies Wall Street dealmaking revival", "Summary": "An investment banking surge at Morgan Stanley (MS) solidified a dealmaking revival across Wall Street, but the company’s wealth management unit fell short of analyst expectations.\nFees from investment banking jumped 51% from a year ago, the second-largest leap among big banks after Citigroup (C).\nInvestment banking fees also jumped at JPMorgan Chase (JPM), Wells Fargo (WFC), Goldman Sachs (GS), and Bank of America (BAC) as dealmaking showed new signs of life following a two-year drought.\nWhen asked Tuesday about the investment banking rebound, Morgan Stanley CEO Ted Pick told analysts \"a number of folks have been calling for this.\"\nHe referenced earlier industry talk of \"green shoots\" that failed to show up after some false starts in 2023.\n\"It has been sort of a delayed shoots, if you will,\" he said.\nThe pick-up in investment banking and an increase in trading helped Morgan Stanley push its net profit up by 41% from a year earlier, to $3.07 billion. Its total net revenue of $15.02 billion rose 12%.\nBoth figures exceeded what analysts expected.\nMorgan Stanley CEO Ted Pick. (REUTERS/Jeenah Moon) (REUTERS / Reuters)\nThe stock rose nearly 1% Tuesday. As of late Monday, the stock was up nearly 13% since the beginning of January, trailing rises for some of its other big-bank rivals.\nOne challenge that emerged Tuesday was Morgan Stanley’s recent performance in wealth management, the business of providing financial advice to higher-net-worth individuals.\nNet new assets in that division fell 59% from a year ago and 62% from the last quarter, to $36.4 billion. Revenues were $6.79 billion, a 2% increase from a year ago but a 1.28% decrease from the last quarter.\nBoth measures were weaker than analysts expected.\n\"The firm delivered another strong quarter in an improving capital markets environment,\" Pick said in a press release.\n\"We continue to execute on our strategy and remain well positioned to deliver growth and long-term value for our shareholders.\"\nCorrection: A previous version of this article misstated Morgan Stanley's second quarter revenue. We regret the error.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanleys-Investment-Banking-Surge-Solidifies-Wall-Street-Dealmaking-Revival-143835560.Html", "Sentiment_Score": 0.9071925282, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-16T13:00:13.000Z", "Headline": "Here is What to Know Beyond Why JPMorgan Chase & Co. (JPM) is a Trending Stock", "Summary": "JPMorgan Chase & Co. (JPM) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nOver the past month, shares of this company have returned +7.7%, compared to the Zacks S&P 500 composite's +3.8% change. During this period, the Zacks Banks - Major Regional industry, which JPMorgan Chase & Co. falls in, has gained 8%. The key question now is: What could be the stock's future direction?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nEarnings Estimate Revisions\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nJPMorgan Chase & Co. is expected to post earnings of $4.04 per share for the current quarter, representing a year-over-year change of -6.7%. Over the last 30 days, the Zacks Consensus Estimate has changed +0.9%.\nFor the current fiscal year, the consensus earnings estimate of $16.50 points to a change of +1.7% from the prior year. Over the last 30 days, this estimate has changed +0.6%.\nFor the next fiscal year, the consensus earnings estimate of $16.71 indicates a change of +1.3% from what JPMorgan Chase & Co. is expected to report a year ago. Over the past month, the estimate has changed +2.1%.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #2 (Buy) for JPMorgan Chase & Co.\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\n12-month consensus EPS estimate for JPM _12MonthEPSChartUrl\nProjected Revenue Growth\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nFor JPMorgan Chase & Co. the consensus sales estimate for the current quarter of $41.25 billion indicates a year-over-year change of +3.4%. For the current and next fiscal years, $169.02 billion and $167.97 billion estimates indicate +6.9% and -0.6% changes, respectively.\nLast Reported Results and Surprise History\nJPMorgan Chase & Co. reported revenues of $50.2 billion in the last reported quarter, representing a year-over-year change of +21.5%. EPS of $4.40 for the same period compares with $4.37 a year ago.\nCompared to the Zacks Consensus Estimate of $45.04 billion, the reported revenues represent a surprise of +11.45%. The EPS surprise was +5.01%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates three times over this period.\nValuation\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nJPMorgan Chase & Co. is graded F on this front, indicating that it is trading at a premium to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about JPMorgan Chase & Co. However, its Zacks Rank #2 does suggest that it may outperform the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Know-Beyond-Why-Jpmorgan-Chase-130013765.Html", "Sentiment_Score": -0.0206199102, "Sentiment_Category": "neutral"}, {"Ticker": "JPM", "Time": "2024-07-16T20:44:31.000Z", "Headline": "Bank of America leans on Wall Street as high rates pose challenges to Main Street operations", "Summary": "Second quarter profits at Bank of America (BAC) fell 7% from a year ago as its consumer operations wrestled with higher interest rates, but it was able to churn out more investment banking fees and trading revenue.\nThe divergence between the businesses at Bank of America that serve Main Street and Wall Street reinforced a dominant trend this earnings season for the nation’s biggest financial institutions.\nHigher interest rates and elevated deposit costs are eating away at more traditional consumer banking margins, forcing giant banks to lean more heavily on their trading and investment banking as dealmaking shows new signs of life.\n\"The strength and earnings power of our leading consumer banking business is complemented by the growth and profitability of our global Markets, global banking, and wealth management businesses,\" said Bank of America CEO Brian Moynihan.\nBank of America Chairman and CEO Brian Moynihan. (REUTERS/Elizabeth Frantz) (REUTERS / Reuters)\nBank of America’s net income fell to $6.89 billion, which was slightly better than expectations, while rising 3% from the first quarter. Its total revenue of $25.37 billion rose slightly from a year ago.\nA key measure of lending revenue known as net interest income fell more than 3% from a year ago and more than 2% from the previous quarter, to $13.70 billion.\nThis margin — which measures the difference a bank earns by making loans and paying out depositors — has been tightening at many big banks due to higher rates and elevated funding costs.\nThis same measure also fell sequentially at JPMorgan Chase (JPM), Wells Fargo (WFC), and Citigroup (C) as their customers continued migrating to higher-yielding deposit products like CDs.\nThere were other signs of challenges for Bank of America and its consumer borrowers. It set aside more money for future loan losses when compared with a year ago, a sign that it expects credit conditions to worsen.\nIts credit card charge-offs more than doubled from a year earlier and more than 6% from the last quarter, another signal that more of its customers are having trouble paying down their bills. However, the pace of delinquencies slowed.\n\"Delinquencies have plateaued for the second consecutive quarter. This should lead to stabilized net credit losses in credit card in the second half of the year,\" Moynihan told analysts.\nBut there were some bright spots. Bank of America expects net interest income to rise later this year as the Federal Reserve starts to lower interest rates and the bank replaces under-earning bonds and fixed-rate loans with higher-yielding assets.\nIt said it expected fourth quarter net interest income to be $600 million higher than its second quarter figure.\nAnd its Wall Street operations really stood out. Investment banking fees jumped 28% from a year ago while its equities trading rose nearly 20%.\n\"The fundamental trends have been strong capital markets and weak net interest income,\" Portales Partners founder Charlie Peabody told Yahoo Finance Monday, referring to the trends of bank earnings season thus far.\n\"The question is if that spread income is going to reflect positively in the second half of the year.\"\nInvestment banking fees and trading revenue also jumped at JPMorgan Chase, Citigroup, Wells Fargo, and Goldman Sachs.\nBank of America's stock rose more than 5% Tuesday. As of Monday night it was up 20% so far this year.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance", "Link": "Https://Finance.Yahoo.Com/News/Bank-Of-America-Leans-On-Wall-Street-As-High-Rates-Pose-Challenges-To-Main-Street-Operations-122457107.Html", "Sentiment_Score": 0.5517465472, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-16T12:18:35.000Z", "Headline": "Is JPMorgan Chase & Co (NYSE:JPM) the Best Undervalued Bank Stock to Buy According to Jim Cramer?", "Summary": "We recently published a list of Jim Cramer Says You Should Buy These 10 Stocks. Since JPMorgan Chase & Co (NYSE:JPM) ranks 2nd on the list, it deserves a deeper look.\nJim Cramer last week talked about the decline of tech stocks after the latest CPI report, saying investors “abandoned” tech stocks like “rats from the sinking ship.”\n“It was titanic! They took their money and went all in on small and medium-sized companies we call the Russell 2000 because we got a much softer than expected consumer price index.”\nCramer said that the latest CPI number shows inflation “has been beaten” and interest rates are “coming down.” The CNBC host said if we keep getting positive data, he won’t be surprised to see not one but two or three rate cuts this year.\nCramer wondered how major tech companies could fall on the low inflation numbers, and answered his own question by saying that sometimes in the backdrop of lower bond yields stocks of companies that “need lower rates” can suddenly rise.\n“What happened today always happens when rates plunged,” Cramer said.\nHowever, Cramer said that there isn’t enough positive data available yet to keep supporting this rally of stocks that benefit from lower rates, adding that such short-term rallies last for about three days. Cramer predicted that big tech stocks will be back after a “few more plunging days.”\nFor this article we watched several latest programs of Jim Cramer and picked 10 stocks he’s bullish on. With each company we have mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nDoes Jim Cramer Say You Should Buy JPMorgan Chase & Co (NYSE:JPM)?\nJPMorgan Chase & Co (NYSE:JPM)\nNumber of Hedge Fund Investors: 112\nJim Cramer is bullish on JPMorgan Chase & Co (NYSE:JPM) and said in a recent program that he believes the stock could touch the $1 trillion market cap. Cramer said that JPMorgan Chase & Co (NYSE:JPM) is one of the “best banks in the world” and sells only 12 times earnings. The CNBC host said this multiple is “way” too low and “way lower” than the average stock for the S&P 500.\n“If the Fed starts cutting I think this one can undergo some huge multiple expansion.”\nCramer thinks that JPMorgan Chase & Co (NYSE:JPM) has generated a level of “earnings consistency” that merits a “much higher stock price.”\nHowever, he thinks it would take a “couple of years” before this stock could hit the $1 trillion market cap.\nWhile JPMorgan Chase & Co (NYSE:JPM) managed to beat estimates on the latest earnings report, its earnings were helped by one-time benefit from its Visa stake exchange. The bank also increased its provision for credit losses that shows expected problems from bad loans ahead. However, amid signs of easing inflation and JPMorgan Chase & Co’s (NYSE:JPM) dominance in the banking industry, the risks that the bank faces are capped.\nIn its latest report JPMorgan Chase & Co (NYSE:JPM) kept its net interest income guidance it gave in May. Following a steep decline in 2020 and 2021 during the COVID-19 pandemic, its net interest income has nearly doubled from a low of $52.3 billion in FY 2021 to $91.6 billion currently (on a TTM basis). Upbeat NII is driven by a favorable interest rate environment and stable loan balances.\nWhile JPMorgan Chase & Co (NYSE:JPM) looks undervalued based on its P/E ratio when compared to the broader market, it’s not a fast growth stock. Wall Street expects JPMorgan Chase & Co (NYSE:JPM) earnings to grow just over 1% over the next five years annually.\nIts dividend yield is 2.2% with over a decade of consistent dividend increases. In this backdrop, JPMorgan Chase & Co (NYSE:JPM) is a suitable income stock for investors looking for stability instead of strong growth.\nCarillon Eagle Growth & Income Fund stated the following regarding JPMorgan Chase & Co. (NYSE:JPM) in its first quarter 2024 investor letter:\n“JPMorgan Chase & Co. (NYSE:JPM) contributed positively to performance following solid financial results and positive guidance for the remainder of 2024. Moreover, growing chatter around rising capital markets activity likely contributed to the stock’s strong performance relative to other banks. Recall that JPMorgan has a robust capital markets franchise.”\nOverall, JPMorgan Chase & Co (NYSE:JPM) ranks 2nd on Insider Monkey’s list titled Jim Cramer Says You Should Buy These 10 Stocks. While we acknowledge the potential of JPMorgan Chase & Co (NYSE:JPM), our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than JPM but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.", "Link": "Https://Finance.Yahoo.Com/News/Jpmorgan-Chase-Co-Nyse-Jpm-121835800.Html", "Sentiment_Score": 0.124784559, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-16T11:01:03.000Z", "Headline": "Marathon Asset Management CEO Sees ‘Amazing’ Opportunity in Real Estate", "Summary": "(Bloomberg) -- Trillions of dollars of problematic commercial real estate will have to be worked out over the next two to three years, creating an “amazing amount of opportunity” for investors, according to Marathon Asset Management Chief Executive Officer Bruce Richards.\nMost Read from Bloomberg\nBlackRock Says Gunman From Trump Rally Appeared in Firm’s Ad\nAmazon Sold a Used Diaper. It Tanked a Mom-and-Pop Business\nTrump Shooting Changes Biden’s Plan to Revive 2024 Campaign\nFrom Elon Musk to David Sacks, Silicon Valley’s Trump Backers Cheer Vance as VP Pick\nXi Jinping’s Great Economic Rewiring Is Cushioning China’s Slowdown\n“There’s going to be problems because of all these loans that have been amended and extended into this calendar year, and been pushed out to next year, have to work their way through the system,” he said in an interview with Bloomberg Television on Tuesday.\nOpportunistic buyers have been positioning to take advantage of the emerging turmoil after borrowing costs rose and office values plummeted. John Brady, global head of real estate at Oaktree Capital Management, wrote in a recent note that investors could be on the precipice “of one of the most significant real estate distressed investment cycles of the last 40 years.”\nAfter being at the center of CRE distress over recent years, anticipated interest-rate cuts will benefit smaller lenders, Richards said, adding that banks have “been through the worst.”\nIn addition, credit markets and private credit will be a “magnificent investment.”\nPrivate Credit\nAddressing Jamie Dimon’s recent warning that problems will emerge in the private credit market, Richards said that the JPMorgan Chase & Co. Chief Executive Officer wants “a little bit of the market share back in the banking book after private credit really stepped up” and kept the economy moving during tighter monetary policy.\nInvestors in the space might want to lean into longer duration fixed rate paper, he said. That’s in part because he sees the pace of Federal Reserve rate cuts being a slow one.\n“When they start lowering rates, they lower rates once or twice and then pause,” he said. “I think it’ll be a very slow path down.”\nIf Donald Trump is elected US president, markets will probably react more favorably than for a Joe Biden victory, he said.\nTrades will be nuanced, however. Less regulation for oil and gas means “probably a lower commodity price, so what’s the investment you make there, possibly oil services,” he added.\n--With assistance from Guy Johnson, Tom Mackenzie and Cecile Gutscher.\n(Updates with private credit comments in sixth paragraph.)\nMost Read from Bloomberg Businessweek\nHow Rivian Became the Anti-Tesla\nHere’s How to Create a Social Safety Net With Bipartisan Support\nLooser Visa Rules for Indian Travelers Stoke a Tourism Boom\nUkraine Is Fighting Russia With Toy Drones and Duct-Taped Bombs\nAsia Is The New Hot Destination for Luxury Travel\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Marathon-Asset-Management-Ceo-Sees-090910214.Html", "Sentiment_Score": 0.7875620127, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-15T21:18:00.000Z", "Headline": "JPMorgan Raises $9 Billion of Bonds in Post-Earnings Spree", "Summary": "(Bloomberg) -- JPMorgan Chase & Co. sold $9 billion of bonds in the US investment-grade market, the first in what’s expected to be a flood of issuance from Wall Street’s six biggest banks.\nMost Read from Bloomberg\nBlackRock Says Gunman From Trump Rally Appeared in Firm’s Ad\nTrump Shooting Changes Biden’s Plan to Revive 2024 Campaign\nAmazon Sold a Used Diaper. It Tanked a Mom-and-Pop Business\nTrump Classified Documents Case Dismissed by Florida Judge\nXi Jinping’s Great Economic Rewiring Is Cushioning China’s Slowdown\nThe biggest US bank issued bonds in four parts, according to a person with knowledge of the matter. The longest portion of the offering, an 11-year security, yields 1.07 percentage point, or 107 basis points above Treasuries, after initial discussions of around 135 basis points, said the person, who asked not to be identified as the details are private.\nThe deal comes after the bank reported record profit as investment bankers and equities traders smashed expectations and the firm took a multibillion-dollar gain tied to a Visa Inc. share exchange.\nA representative for JPMorgan declined to comment.\nWells Fargo & Co., meanwhile, tapped the European debt market with a €2.75 billion ($3 billion), two-part offering on Monday. Citigroup Inc. and Goldman Sachs Group Inc. have also posted earnings and are candidates to sell debt. Bank of America Corp. and Morgan Stanley are scheduled to report on Tuesday.\nThe risk of a hard landing in the US economy remains low, which makes bonds from financial institutions attractive, according to Matt Brill, head of North America investment-grade credit at Invesco Ltd.\n“While slowing, the economy is still strong, and when the Fed starts cutting, banks should benefit,” said Brill in an emailed response to questions on Monday.\nThe top banks are expected to borrow more than they usually do after they post earnings as they take advantage of falling yields and get ahead of upcoming US elections that could potentially bring market turmoil.\nJPMorgan credit analyst Kabir Caprihan expects $21 billion to $24 billion of issuance from the six biggest domestic banks, more than the 10-year July average of roughly $17 billion. Barclays Plc is calling for about $30 billion of sales from the set in the third quarter, with most of that expected this month.\nThe funding backdrop is attractive for bank issuers. Risk premiums on investment-grade bonds — the added premium over US Treasuries investors get paid to hold riskier debt — narrowed 1 basis point to 89 basis points Friday. The average spread on a financial institution bond is just 4 basis points wider than the broader high-grade index.\nMoreover, the overall cost to sell debt has fallen to the lowest in five months.\nJPMorgan was among six companies issuing $18.1 billion of dollar bonds Monday. Bank of New York Mellon Corp. sold a four-part deal while PepsiCo Inc. borrowed in a three-tranche offering to partly repay commercial paper. Syndicate desks are calling for as much as $30 billion in new bond sales this week.\n(Updates with pricing details in first and second paragraphs.)\nMost Read from Bloomberg Businessweek\nHow Rivian Became the Anti-Tesla\nLooser Visa Rules for Indian Travelers Stoke a Tourism Boom\nUkraine Is Fighting Russia With Toy Drones and Duct-Taped Bombs\nAsia Is The New Hot Destination for Luxury Travel\nFrench Elections Result Is Least Worst Outcome for Business\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Jpmorgan-Comes-First-Wall-Street-153034316.Html", "Sentiment_Score": 0.309643507, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-15T21:03:59.000Z", "Headline": "Goldman Sachs earnings prove bank still very cyclical", "Summary": "Among the Big Bank stocks, JPMorgan Chase & Co. (JPM), Wells Fargo (WFC), Citigroup (C), Goldman Sachs (GS), and BlackRock (BLK) have been the first to report second-quarter results this earnings season.\nPortales Partners founder and Wall Street Beats partner Charlie Peabody comes on Market Domination to talk about the prevalent themes emerging in bank earnings, such as net interest income figures\n\"Short term, there's momentum in the capital markets. And so Goldman is a good momentum play, but we argue that their earnings stream remains much more cyclical than the market is valuing them at,\" Peabody states. \"And that's the big debate out there in management as they moved away from their failed consumer banking strategy back to their roots as an investment bank, have been trying to convince the street that there is a core underlying earnings power that's sustainable and stable. And I don't believe them.\"\nPeabody also looks ahead to the bank earnings due out this week, such as Morgan Stanley (MS): \"I think it's going to be more of the same — strong, investment banking with an eye towards a pick up in M&A and IPOs in the second half of the year. And then trading will be driven more by equity trading and less so by fixed income trading.\"\nFor more expert insight and the latest market action, click here to watch this full episode of Market Domination.\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Goldman-Sachs-Earnings-Prove-Bank-210359849.Html", "Sentiment_Score": -0.9227243662, "Sentiment_Category": "bearish"}, {"Ticker": "JPM", "Time": "2024-07-15T20:49:00.000Z", "Headline": "JPMorganChase Declares Preferred Stock Dividends", "Summary": "NEW YORK, July 15, 2024--(BUSINESS WIRE)--JPMorgan Chase & Co. (NYSE: JPM) (\"JPMorganChase\" or the \"Firm\") has declared dividends on the outstanding shares of the Firm’s Series DD, EE, GG, JJ, KK, LL, MM and NN preferred stock. Information can be found on the Firm’s Investor Relations website at https://www.jpmorganchase.com/ir/news.\nJPMorgan Chase & Co. (NYSE: JPM) is a leading financial services firm based in the United States of America (\"U.S.\"), with operations worldwide. JPMorganChase had $4.1 trillion in assets and $341 billion in stockholders’ equity as of June 30, 2024. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing and asset management. Under the J.P. Morgan and Chase brands, the Firm serves millions of customers in the U.S., and many of the world’s most prominent corporate, institutional and government clients globally. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240715078682/en/\nContacts\nInvestor Contact:\nMikael Grubb, 212-270-2479\nMedia Contact:\nJoseph Evangelisti, 212-270-7438", "Link": "Https://Finance.Yahoo.Com/News/Jpmorganchase-Declares-Preferred-Stock-Dividends-204900772.Html", "Sentiment_Score": -0.0150303748, "Sentiment_Category": "neutral"}, {"Ticker": "JPM", "Time": "2024-07-15T19:16:36.000Z", "Headline": "JPMorgan Chase Second Quarter 2024 Earnings: Beats Expectations", "Summary": "JPMorgan Chase (NYSE:JPM) Second Quarter 2024 Results\nKey Financial Results\nRevenue: US$47.1b (up 32% from 2Q 2023).\nNet income: US$17.7b (up 27% from 2Q 2023).\nProfit margin: 38% (down from 39% in 2Q 2023). The decrease in margin was driven by higher expenses.\nEPS: US$6.13 (up from US$4.76 in 2Q 2023).\nearnings-and-revenue-growth\nAll figures shown in the chart above are for the trailing 12 month (TTM) period\nJPMorgan Chase Revenues and Earnings Beat Expectations\nRevenue exceeded analyst estimates by 9.9%. Earnings per share (EPS) also surpassed analyst estimates by 20%.\nLooking ahead, revenue is forecast to grow 1.0% p.a. on average during the next 3 years, compared to a 5.5% growth forecast for the Banks industry in the US.\nPerformance of the American Banks industry.\nThe company's share price is broadly unchanged from a week ago.\nRisk Analysis\nWhat about risks? Every company has them, and we've spotted 2 warning signs for JPMorgan Chase (of which 1 is concerning!) you should know about.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com", "Link": "Https://Finance.Yahoo.Com/News/Jpmorgan-Chase-Second-Quarter-2024-191636359.Html", "Sentiment_Score": 0.886915803, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-15T18:00:09.000Z", "Headline": "Are Big Banks Opening Up Their Pockets For Dividend Investors?", "Summary": "Are Big Banks Opening Up Their Pockets For Dividend Investors?\nWe’ve just begun the second quarter earnings season cycle. The earnings season happens four times a year, and it’s always a time for investors and analysts to check in with the companies they follow and invest in. The season is often kicked off by three of the biggest banks: JPMorgan Chase (NYSE:JPM), Citibank (NYSE:C), and Wells Fargo (NYSE:WFC). Their performance can tell us a lot about the state of the economy. There appears to be some promising news for those of us looking for a dividend with our stock appreciation.\nPrivate credit offers up to 20% APY. Potential.\nAnother Record For JPMorgan Chase\nMany big banks have enjoyed strong returns over the last several years, first among them JPMorgan Chase, which hit another record profit in the second quarter. Net income rose to $18.1 billion, and net revenue was over $51 billion. The consumer banking division activated more than 450,000 new accounts, making this the 50th consecutive quarter of net new account growth. Investment assets rose by 14%.\nJPMorgan Chase CEO Jamie Dimon is known for being a bit of a doomsayer. Despite the strong returns, he noted caution in his statement, saying that the macroeconomic climate remains uncertain, with geopolitical risk still higher than average. He also stated that while inflation is cooling, it is possible that both \"inflation and interest rates may stay higher than the market expects.\"\nJPMorgan Chase isn't a stock one usually purchases for the dividend yield. The forward dividend yield is a modest 2.22%. After keeping its dividend at $1 for nearly two years, JPMorgan Chase raised it by 15% over the last four quarters to $1.15. The bank announced it is now looking to raise that to $1.25, an increase of over 8% from the previous increase. During the quarter, the bank spent a whopping $4.9 billion on share buybacks even though the stock price has increased over 20% in the past six months.\nOn the earnings call, HSBC analyst Saul Martinez questioned if JPMorgan Chase might pay a special dividend in the future. Chief Financial Officer Jeremy Barnum indicated that paying a special dividend is not Dimon's preference and that, instead, the focus is on paying a dividend that is \"sustainable and also sustainable in a stressed environment.\" So, it seems an additional payout is off the table for now.\nCitigroup In Transition\nIt's been a different story at Citigroup for the last several years. CEO Jane Fraser has led the company through a massive reorganization, cutting thousands of jobs. The bank reported $3.2 billion in net income, up 10%. Revenue just barely beat expectations, coming in at $20.14 billion.\nCitigroup's troubles may be mostly in the past, but regulators still keep a sharp eye on it. The Federal Reserve Board fined the bank $60.6 million for making slow progress on managing its data appropriately. The health of the U.S. consumer is also a worry for Citi. Speaking to analysts, Chief Financial Officer Mark A.L. Mason observed that the company is seeing a divergence in consumer behavior, with its lower-income customers starting to show signs of strain. Fraser underlined that point: \"A lot of the spending and the growth areas we are seeing, and the underlying numbers, are being driven by the affluent customer.\"\nCitigroup has been even more cautious about its dividend payment. It held the payment at $0.51 from 2019 to the middle of 2023 and then only raised it by $0.02. It recently announced plans to increase the dividend by 6% to $0.56, which, while not a huge amount, is at least a step in the right direction. The forward yield before this increase stands at 3.23%. The company will also restart buybacks with a plan to spend $1 billion on buybacks during the coming quarter.\nCommercial real estate has historically outperformed the stock market, but few investors have the capital or resources needed to invest in this asset class. This platform allows individuals to invest in commercial real estate.\nWells Fargo Moves Forward\nWells Fargo has struggled on multiple fronts over the past several years. It has faced steep fines from regulators over account mismanagement issues that led to undeserved fees and other negative consequences for its customers. Wells Fargo also has significant exposure to the mortgage market, although it has dramatically scaled back its mortgage lending, reducing its head count by 45% over the past year. Second-quarter revenue was slightly surprising to expectations, coming in at $20.29 billion.\nWhen it comes to dividend good news, we've saved the best as far as percentages. Wells Fargo reiterated its commitment to raising its dividend by 14% to $0.40 per share. It last raised its dividend one year ago and has a forward dividend yield of 2.33%. Wells Fargo was the biggest spender of these banks on buybacks, spending $12 billion over the first half the year. CEO Charlie Scharf told analysts that \"while the pace will slow, we have the capacity to continue repurchasing stock.\"\nFor Wells Fargo, one dark cloud impacting its dividend future growth could be commercial real estate. On the earnings call, Scharf explained that its office real estate loan portfolio is a point of weakness: \"Fundamentals in the institutional-owned office real estate market continued to deteriorate as lower appraisals reflect the weak leasing market in many large metropolitan areas across the country.\"\nWhile dividends aren't the main reason to invest in large banks, these banks have all demonstrated a commitment to maintaining dividends in good times and bad.\nAre You Missing Out On Higher Yields?\nThe current high-interest-rate environment has created an incredible opportunity for income-seeking investors to earn massive yields, but not through dividend stocks... Certain private market real estate investments are giving retail investors the opportunity to capitalize on these high-yield opportunities and Benzinga has identified some of the most attractive options for you to consider.\nFor example, the Jeff Bezos-backed investment platform just launched its Private Credit Fund, which provides access to a pool of short-term loans backed by residential real estate with a target 7% to 9% net annual yield paid to investors monthly. The best part? Unlike other private credit funds, this one has a minimum investment of only $100. \nDon't miss out on this opportunity to take advantage of high-yield investments while rates are high. Check out Benzinga's favorite high-yield offerings.\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Are Big Banks Opening Up Their Pockets For Dividend Investors? originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "Link": "Https://Finance.Yahoo.Com/News/Big-Banks-Opening-Pockets-Dividend-180009306.Html", "Sentiment_Score": 0.0051422752, "Sentiment_Category": "neutral"}, {"Ticker": "JPM", "Time": "2024-07-15T15:03:08.000Z", "Headline": "Jamie Dimon, Larry Fink among Wall Street leaders calling for unity following attempted Trump assassination", "Summary": "Some of the biggest names on Wall Street urged unity and calm following Saturday's assassination attempt on Donald Trump, using new memos to employees and conference calls with analysts to condemn the violence and call for civil discourse.\n\"I truly hope this is a moment that will spur reflection and action that celebrates what unites us as citizens and as a society,\" Goldman Sachs CEO David Solomon said Monday morning as he led off his firm's quarterly earnings call.\nSolomon was joined by CEOs from JPMorgan Chase (JPM), Citigroup (C), BlackRock (BLK), and Bank of America (BAC).\nJPMorgan Chase CEO Jamie Dimon, center, testifies before Congress alongside other bank CEOs during a 2023 oversight hearing. (Tom Williams/CQ-Roll Call, Inc via Getty Images) (Tom Williams via Getty Images)\nJPMorgan Chase CEO Jamie Dimon weighed in over the weekend in a memo to his employees after his bank, the largest in the US, reported its earnings on Friday.\n\"We are deeply saddened by the political violence and the assassination attempt on former President Trump last evening,\" he wrote on Sunday morning in a memo shared with Yahoo Finance. \"It is only through constructive dialogue that we can tackle our nation's toughest challenges.\"\nBank of America CEO Brian Moynihan also penned a letter to his employees over the weekend, saying, \"Any form of violence in action or speech has no place in political discourse or engagement\" and adding, \"This is the longstanding position of our company.\"\nIn her own letter Monday morning, Citigroup CEO Jane Fraser wrote to her employees that \"I hope these events will cause everyone to think about the words we use and tone down the rhetoric so we can have a more civil discourse.\"\n\"There is so much riding on it,\" she added.\nOne firm with an inadvertent connection to the shooter\nAnother call for calm came from BlackRock CEO Larry Fink, who said, \"We must condemn political violence of any kind, period\" during his own firm's quarterly earnings call Monday morning.\nWhile the vast majority of the call was devoted to the firm's results, Fink began and ended that call with allusions to the political climate.\nBlackRock, the world's largest asset manager, also confronted an inadvertent connection to the shooter when it surfaced online that an old BlackRock ad focused on a Pennsylvania teacher had briefly shown then-student Thomas Matthew Crooks.\nCrooks is the 20-year-old who the FBI has identified as the alleged shooter who wounded Trump and was then quickly killed by Secret Service agents.\nThomas Matthew Crooks is briefly seen in a screen grab of an BlackRock ad where he appeared for less than a second. (BlackRock)\nIn a statement over the weekend, BlackRock confirmed that the footage was authentic and underlined that Crooks, who was briefly shown sitting at a desk and never speaks in the video, was unpaid.\n\"We will make all video footage available to the appropriate authorities, and we have removed the video from circulation out of respect for the victims,\" the statement added.\nWill the calls be heeded?\nThe wave of financial commentary mirrored a business world outpouring over the weekend from many CEOs, including many in the technology sector.\n\"I pray for President Trump's rapid recovery,\" wrote Apple (AAPL) CEO Tim Cook in just one example, adding, \"I strongly condemn this violence.\"\nWhat remains to be seen if the calls for calm coming from business and world leaders will be heeded. There are signs that US political leaders in both parties are going to at least try to tone down the rhetoric.\n\"The political rhetoric in this country has gotten very heated,\" Joe Biden said in an address to the nation Sunday night. \"It's time to cool it down.\"\nAnd Donald Trump, who saw the bullet pass inches from his skull and injure his ear as he began his speech in Pennsylvania, said in an interview with the Washington Examiner that he'd changed his convention speech in order to help \"bring the country together.\"\n\"UNITE AMERICA!\" he added on social media.\nDonald Trump supporters demonstrate in front of Trump Tower after the former U.S. President was injured during shooting at campaign rally at the Butler Farm Show in Pennsylvania. (Beata Zawrzel/NurPhoto via Getty Images) (NurPhoto via Getty Images)\nBut the aftermath has already been marked by heated — and many say irresponsible — rhetoric from partisans on both sides. Some either looked to downplay the violence or even claimed it was staged with no evidence.\nAlso, in the case of some Republicans, some tried to blame President Biden for the actions of Thomas Crooks.\nBiden's \"rhetoric led directly to President Trump's attempted assassination\" read one highly criticized missive from Sen. J.D. Vance, who is a finalist to become Trump's vice presidential nominee this week.\nTrump is already in Milwaukee preparing for this week's Republican National Convention and is expected to make an appearance this evening when proceedings get underway.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance. Ben Werschkul is Washington correspondent for Yahoo Finance.\nClick here for politics news related to business and money\nRead the latest financial and business news from Yahoo Finance", "Link": "Https://Finance.Yahoo.Com/News/Jamie-Dimon-Larry-Fink-Among-Wall-Street-Leaders-Calling-For-Unity-Following-Attempted-Trump-Assassination-150307322.Html", "Sentiment_Score": 0.0588535964, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-15T14:47:00.000Z", "Headline": "Big Banks Helped by Wall Street Comeback", "Summary": "The dealmaking that Goldman Sachs and its peers rely on to power earnings is showing signs of life. Goldman joined JPMorgan Chase Citigroup and Wells Fargo in reporting double-digit gains in investment-banking revenue in the second quarter as economic conditions and booming markets turned more favorable. “From what we’re seeing, we are in the early innings of a capital markets and M&A recovery,” Goldman Chief Executive David Solomon said on a call with analysts Monday.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/28Fce43B-2De3-3341-9Fe2-Ccfbda5E12Fc/Big-Banks-Helped-By-Wall.Html", "Sentiment_Score": 0.2868964374, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-15T13:30:09.000Z", "Headline": "Is It Worth Investing in JPMorgan Chase & Co. (JPM) Based on Wall Street's Bullish Views?", "Summary": "When deciding whether to buy, sell, or hold a stock, investors often rely on analyst recommendations. Media reports about rating changes by these brokerage-firm-employed (or sell-side) analysts often influence a stock's price, but are they really important?\nLet's take a look at what these Wall Street heavyweights have to say about JPMorgan Chase & Co. (JPM) before we discuss the reliability of brokerage recommendations and how to use them to your advantage.\nJPMorgan Chase & Co. currently has an average brokerage recommendation (ABR) of 1.68, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by 25 brokerage firms. An ABR of 1.68 approximates between Strong Buy and Buy.\nOf the 25 recommendations that derive the current ABR, 16 are Strong Buy and one is Buy. Strong Buy and Buy respectively account for 64% and 4% of all recommendations.\nBrokerage Recommendation Trends for JPM\nBroker Rating Breakdown Chart for JPM\n\n\nCheck price target & stock forecast for JPMorgan Chase & Co. here>>>\n\nThe ABR suggests buying JPMorgan Chase & Co., but making an investment decision solely on the basis of this information might not be a good idea. According to several studies, brokerage recommendations have little to no success guiding investors to choose stocks with the most potential for price appreciation.\nAre you wondering why? The vested interest of brokerage firms in a stock they cover often results in a strong positive bias of their analysts in rating it. Our research shows that for every \"Strong Sell\" recommendation, brokerage firms assign five \"Strong Buy\" recommendations.\nIn other words, their interests aren't always aligned with retail investors, rarely indicating where the price of a stock could actually be heading. Therefore, the best use of this information could be validating your own research or an indicator that has proven to be highly successful in predicting a stock's price movement.\nZacks Rank, our proprietary stock rating tool with an impressive externally audited track record, categorizes stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), and is an effective indicator of a stock's price performance in the near future. Therefore, using the ABR to validate the Zacks Rank could be an efficient way of making a profitable investment decision.\nABR Should Not Be Confused With Zacks Rank\nIn spite of the fact that Zacks Rank and ABR both appear on a scale from 1 to 5, they are two completely different measures.\nBroker recommendations are the sole basis for calculating the ABR, which is typically displayed in decimals (such as 1.28). The Zacks Rank, on the other hand, is a quantitative model designed to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\nIt has been and continues to be the case that analysts employed by brokerage firms are overly optimistic with their recommendations. Because of their employers' vested interests, these analysts issue more favorable ratings than their research would support, misguiding investors far more often than helping them.\nIn contrast, the Zacks Rank is driven by earnings estimate revisions. And near-term stock price movements are strongly correlated with trends in earnings estimate revisions, according to empirical research.\nFurthermore, the different grades of the Zacks Rank are applied proportionately across all stocks for which brokerage analysts provide earnings estimates for the current year. In other words, at all times, this tool maintains a balance among the five ranks it assigns.\nAnother key difference between the ABR and Zacks Rank is freshness. The ABR is not necessarily up-to-date when you look at it. But, since brokerage analysts keep revising their earnings estimates to account for a company's changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in indicating future price movements.\nIs JPM a Good Investment?\nIn terms of earnings estimate revisions for JPMorgan Chase & Co., the Zacks Consensus Estimate for the current year has increased 0.7% over the past month to $16.50.\nAnalysts' growing optimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates higher, could be a legitimate reason for the stock to soar in the near term.\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #2 (Buy) for JPMorgan Chase & Co. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\nTherefore, the Buy-equivalent ABR for JPMorgan Chase & Co. may serve as a useful guide for investors.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Worth-Investing-Jpmorgan-Chase-Co-133009228.Html", "Sentiment_Score": 0.0978639871, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-15T20:04:50.000Z", "Headline": "Goldman profits surge 150% from year ago on Wall Street rebound", "Summary": "Goldman Sachs (GS) reported that its second quarter profits soared 150% from a year ago as investment banking surged, the latest signal that Wall Street is warming up after a two-year drought.\nNet income was $3.04 billion, which beat analyst expectations. Its total revenue of $12.73 billion also rose 17% from a year ago.\nThe result gives CEO David Solomon more momentum following his most challenging year ever as boss.\nA year ago, he was grappling with a dealmaking slump, a costly exit from consumer banking, and a series of high-profile departures from the firm.\nDavid Solomon, CEO of Goldman Sachs. REUTERS/Mike Blake (REUTERS / Reuters)\nGoldman’s stock rose more than 2% Monday, and it has climbed 28% year to date.\n\"We are in the early innings of a capital markets and M&A recovery, and while certain transaction volumes are still well below their tenure averages, we remain very well positioned to benefit from a continued resurgence of activity,\" Goldman's Solomon said during a conference call with analysts.\nGoldman is the latest big bank to demonstrate it is benefiting from an investment banking rebound.\nOn Friday, JPMorgan Chase (JPM), Wells Fargo (WFC), and Citigroup (C) each posted sizable jumps in the revenue stream compared with the second quarter of last year.\nThe revival provided a boost to those banks at a time of rising challenges for their Main Street consumer operations.\nGoldman is even more reliant on Wall Street for its performance.\nIts investment banking fees rose 21% from a year ago, to $1.7 billion, led by big jumps in debt and equity underwriting. Advisory fees were also up, by 7%.\nIts investment banking performance did drop when compared to the first quarter. Fees dipped by 17%.\nWhat propelled its second quarter earnings higher than a year ago was Goldman's better-than-expected trading results as well as its increased focus on asset and wealth management.\nGoldman’s fixed-income trading revenue rose 17% year over year, while asset and wealth management revenues increased 27%.\nThe firm also touched on its decision to challenge results from the Federal Reserve’s latest annual stress test, which called for an increase to Goldman's stress capital buffer.\nIn light of that expected increase, CFO Denis Coleman said the firm planned to moderate its pace of stock buybacks compared to the most recent quarter.\nBut Solomon said the firm doesn’t think the results reflect Goldman's current risk profile.\n\"Given this discrepancy, we are engaging with our regulators to better understand its determinations,\" he added.\nCorrection: A previous version of this article misspelled the first name of Goldman Sachs CFO Denis Coleman. We regret the error.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Profits-Surge-150-From-Year-Ago-On-Wall-Street-Rebound-113043583.Html", "Sentiment_Score": 0.9021360874, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-15T08:28:35.000Z", "Headline": "Saudi Wealth Fund Picks JPMorgan, Morgan Stanley for Nupco IPO", "Summary": "(Bloomberg) -- Saudi Arabia’s sovereign wealth fund has picked banks for the planned initial public offering of the kingdom’s largest medical procurement firm, as it hunts for cash to finance the crown prince’s ambitious economic agenda.\nMost Read from Bloomberg\nTrump Shooting Changes Biden’s Plan to Revive 2024 Campaign\nBlackRock Says Gunman From Trump Rally Appeared in Firm’s Ad\nTrump Emerges Defiant From Rally Attack Set to Shake Up ’24 Race\nBold and Bloodied Trump Seizes the Moment After Being Shot\nTrump Classified Documents Case Dismissed by Florida Judge\nJPMorgan Chase & Co., Morgan Stanley and SNB Capital have been hired to work on Nupco’s IPO, according to people familiar with the matter. The deal could come as soon as this year, the people said, asking not to be identified as the information isn’t public.\nThe Public Investment Fund could raise close to $1 billion by selling a 30% stake in the firm, according to one of the people. Bloomberg News has previously reported that the deal was likely to raise less than $1 billion.\nRepresentatives for the PIF, JPMorgan, Morgan Stanley and SNB Capital declined to comment.\nNew from Bloomberg: Get the Mideast Money newsletter, a weekly look at the intersection of wealth and power in the region.\nSaudi Arabia is considering cutting spending on some of its biggest development projects as it grapples with the scale of Crown Prince Mohammed Bin Salman’s Vision 2030 agenda, Bloomberg News reported last week. That’ll put additional pressure on the PIF, which is the main entity tasked with driving the multi-trillion-dollar economic diversification plan.\nThe $925 billion wealth fund has listed several of its portfolio companies in recent years and is becoming an active debt issuer.\nSaudi Arabia has been a busy market for share sales over the past few years, together with other Gulf countries, as governments sought to raise funds to reduce their reliance on the energy sector while encouraging private firms to list to develop their capital markets.\nFounded in 2009, Nupco seeks to raise the level of health services in the kingdom, improve the efficiency of government spending for the purchase of medical supplies and increase the effectiveness of supply chains in the public health-care sector, according to its website.\nHealth care is one of the main focus areas of Vision 2030 as the country seeks to develop its drug industry. Dr Soliman Abdel Kader Fakeeh Hospital Co. raised $763 million in a Riyadh IPO in June, but its shares have risen just 2% from their offer price.\n(Updates with details on valuation in 3rd paragraph)\nMost Read from Bloomberg Businessweek\nHow Rivian Became the Anti-Tesla\nLooser Visa Rules for Indian Travelers Stoke a Tourism Boom\nAsia Is The New Hot Destination for Luxury Travel\nUkraine Is Fighting Russia With Toy Drones and Duct-Taped Bombs\nFrench Elections Result Is Least Worst Outcome for Business\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Saudi-Wealth-Fund-Picks-Jpmorgan-064138113.Html", "Sentiment_Score": 0.0621188432, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-13T12:00:00.000Z", "Headline": "Rate Cuts Could Make Things Worse for Banks Before They Help", "Summary": "With the Federal Reserve poised to begin cutting interest rates, lenders could get caught between falling yields and rising deposit costs, especially if loan growth is slow.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/611D3D1A-0992-368C-Bd1A-090E2F2Ecadf/Rate-Cuts-Could-Make-Things.Html", "Sentiment_Score": -0.9102104902, "Sentiment_Category": "bearish"}, {"Ticker": "JPM", "Time": "2024-07-13T11:00:55.000Z", "Headline": "JPMorgan Chase (NYSE:JPM) shareholders have earned a 16% CAGR over the last five years", "Summary": "If you buy and hold a stock for many years, you'd hope to be making a profit. Better yet, you'd like to see the share price move up more than the market average. But JPMorgan Chase & Co. (NYSE:JPM) has fallen short of that second goal, with a share price rise of 81% over five years, which is below the market return. But if you include dividends then the return is market-beating. However, more recent buyers should be happy with the increase of 37% over the last year.\nSo let's investigate and see if the longer term performance of the company has been in line with the underlying business' progress.\nSee our latest analysis for JPMorgan Chase\nTo quote Buffett, 'Ships will sail around the world but the Flat Earth Society will flourish. There will continue to be wide discrepancies between price and value in the marketplace...' One way to examine how market sentiment has changed over time is to look at the interaction between a company's share price and its earnings per share (EPS).\nOver half a decade, JPMorgan Chase managed to grow its earnings per share at 13% a year. That makes the EPS growth particularly close to the yearly share price growth of 13%. Therefore one could conclude that sentiment towards the shares hasn't morphed very much. Indeed, it would appear the share price is reacting to the EPS.\nYou can see how EPS has changed over time in the image below (click on the chart to see the exact values).\nearnings-per-share-growth\nWe know that JPMorgan Chase has improved its bottom line lately, but is it going to grow revenue? Check if analysts think JPMorgan Chase will grow revenue in the future.\nWhat About Dividends?\nWhen looking at investment returns, it is important to consider the difference between total shareholder return (TSR) and share price return. The TSR is a return calculation that accounts for the value of cash dividends (assuming that any dividend received was reinvested) and the calculated value of any discounted capital raisings and spin-offs. It's fair to say that the TSR gives a more complete picture for stocks that pay a dividend. As it happens, JPMorgan Chase's TSR for the last 5 years was 109%, which exceeds the share price return mentioned earlier. The dividends paid by the company have thusly boosted the total shareholder return.\nA Different Perspective\nWe're pleased to report that JPMorgan Chase shareholders have received a total shareholder return of 40% over one year. And that does include the dividend. That's better than the annualised return of 16% over half a decade, implying that the company is doing better recently. Someone with an optimistic perspective could view the recent improvement in TSR as indicating that the business itself is getting better with time. While it is well worth considering the different impacts that market conditions can have on the share price, there are other factors that are even more important. Even so, be aware that JPMorgan Chase is showing 2 warning signs in our investment analysis , and 1 of those is concerning...\nFor those who like to find winning investments this free list of undervalued companies with recent insider purchasing, could be just the ticket.\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com", "Link": "Https://Finance.Yahoo.Com/News/Jpmorgan-Chase-Nyse-Jpm-Shareholders-110055805.Html", "Sentiment_Score": 0.8134630919, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-13T05:41:00.000Z", "Headline": "Q2 2024 JPMorgan Chase & Co Earnings Call", "Summary": "Participants\nJeremy Barnum; Chief Financial Officer; JPMorgan Chase & Co\nSteven Chubak; Analyst; Wolfe Research, LLC\nSaul Martinez; Analyst; HSBC\nKen Usdin; Analyst; Jefferies LLC\nGlenn Schorr; Analyst; Evercore ISI\nMatt O'Connor; Analyst; Deutsche Bank\nMike Mayo; Analyst; Wells Fargo Securities, LLC\nBetsy Graseck; Analyst; Morgan Stanley\nGerard Cassidy; Analyst; RBC Capital Markets\nErika Najarian; Analyst; UBS Investment Bank\nJim Mitchell; Analyst; Seaport Global Securities LLC\nPresentation\nOperator\nGood morning, ladies and gentlemen, Welcome to JPMorgan Chase's second quarter 2024 earnings call. This call is being recorded. (Operator Instructions) We will now go live to the presentation. The presentation is available on JPMorgan Chase's website and please refer to the disclaimer in the back concerning forward-looking statements. Please standby. At this time, I would like to turn the call over to JPMorgan Chase's Chief Financial Officer, Jeremy Barnum. Mr. Barnum, please go ahead.\nJeremy Barnum\nThank you, and good morning, everyone. Starting on page 1, the firm reported net income of $18.1 billion, EPS of $6.12 on revenue of $51 billion with an ROTCE of 28%. These results included the $7.9 billion net gain related to Visa shares and the $1 billion foundation contribution of the appreciated Visa stock. Also included is $546 million of net investment securities losses in corporate. Excluding these items, the firm had net income of $13.1 billion, EPS of $4.40, and an ROTCE of 20%.\nTouching on a couple of highlights. In the CIB, IB fees were up 50% year on year and 17% quarter on quarter. And market revenue is up 10% year on year and CCB, we had a record number of first-time investors, strong customer acquisition across checking account and card. And we've continued to see strong net inflows across AWM.\nNow before I give more detail on the results, I just wanted to mention that starting this quarter, we are no longer explicitly calling out the First Republic contribution in the presentation. Going forward, we'll only specifically call it out if it is a meaningful driver in the year-on-year comparison.\nAs a reminder, we acquired First Republic in May of last year, so the prior year quarter only has two months of First Republic result compared to the full three months this quarter. Also in the prior year quarter, most of the expenses were corporate, whereas now they are primarily in the relevant line of business.\nNow turning to page 2 for the firm-wide results. The firm reported revenue of $51 billion, up $8.6 billion or 20% year on year, excluding both the Visa gain that I mentioned earlier, as well as last year's First Republic bargain purchase gain of $2.7 billion.\nRevenue of $43.1 billion was up $3.4 billion or 9%. NII ex markets was up $568 million or 3% driven by the impact of balance sheet mix and higher rates, higher revolving balances in card, and the additional month of First Republic related NII, partially offset by deposit margin compression and lower deposit balances.\nNIR ex markets was up $7.3 billion or 56%. Excluding the items I just mentioned, it was up $2.1 billion or 21%, largely driven by higher investment banking revenue and asset management fees. Both periods included net investment securities losses.\nAnd markets revenue was up $731 million or 10% year on year. Expenses of $23.7 billion were up $2.9 billion or 14% year on year. Excluding the foundation contribution I previously mentioned, expenses were up 9%, primarily driven by compensation, including revenue related compensation and growth in employees.\nAnd credit costs were $3.1 billion, reflecting net charge-offs of $2.2 billion and a net reserve build of $821 million. Net charge-offs were up $820 million year on year, predominantly driven by card. The net reserve build included $609 million in consumer and $189 million in wholesale.\nOnto balance sheet and capital on page 3, we ended the quarter with a CET1 ratio of 15.3%, up 30 basis points versus the prior quarter, primarily driven by net income, largely offset by capital distributions and higher RWA. As you know we completed CCAR a couple of weeks ago and have already disclosed a number of the key points, let me summarize them again here.\nOur preliminary SCB is 3.3%, although the final SCB could be higher. The preliminary SCB, which is up from the current requirement of 2.9% results in a 12.3% standardized CET1 ratio requirement, which goes into effect in the fourth quarter of 2024. And finally, the firm announced that the Board intends to increase the quarterly common stock dividend from $1.15 to $1.25 per share in the third quarter of 2024.\nNow let's go to our businesses, starting with CCB on page 4. CCB reported net income of $4.2 billion on revenue of $17.7 billion, which was up 3% year on year. In banking and wealth management, revenue was down 5% year on year, reflecting lower deposits and deposit margin compression, partially offset by growth in wealth management revenue. Average deposits were down 7% year on year and 1% quarter on quarter.\nClient investment assets were up 14% year on year, predominantly driven by market performance. In home lending, revenue of $1.3 billion was up 31% year on year, predominantly driven by higher NII, including one additional month of the First Republic portfolio.\nTurning to card services and auto, revenue was up 14% year on year, predominantly driven by higher card NII on higher revolving balances. Card outstandings were up 12% due to strong account acquisition and the continued normalization of all. And then auto, originations were $10.8 billion, down 10% coming off strong originations from a year ago, while continuing to maintain healthy margins.\nExpenses of $9.4 billion were up 13% year on year, predominantly driven by First Republic expenses now reflected in the lines of business, as I mentioned earlier, as well as field compensation and continued growth in technology and marketing.\nIn terms of credit performance, this quarter, credit costs were $2.6 billion, reflecting net charge-offs of $2.1 billion, up $813 million year on year, predominantly driven by card as newer vintages season and credit normalization continues. The net reserve build was $579 million, also driven by card through loan growth and updates to certain macroeconomic variables.\nNext, the commercial and investment bank on page 5. Our new commercial and investment bank reported net income of $5.9 billion on revenue of $17.9 billion. You'll note that we are disclosing revenue by business as well as breaking down the banking and payments revenue by client coverage segment in order to best highlight the relevant trends in both important dimensions of the wholesale franchise.\nThis quarter IB fees were up 50% year on year, and we ranked number one with year-to-date wallet share of 9.5%. In advisory, fees were up 45%, primarily driven by the closing of a few large deals and a weak prior year quarter. Underwriting fees were up meaningfully with equity up 56% and debt up 51%, benefiting from favorable market conditions.\nIn terms of the outlook, we're pleased with both the year-on-year and sequential improvement in the quarter. We remain cautiously optimistic about the pipeline, although many of the same headwinds are still in effect. It's also worth noting that pull forward refinancing activity was a meaningful contributor to the strong performance in the first half of the year. Payments revenue was $4.5 billion, down 4% year on year as deposit margin compression and higher deposit related client credits were largely offset by fee growth.\nMoving to markets. Total revenue was $7.8 billion, up 10% year on year. Fixed income was up 5%, with continued strength in securitized products and equity markets was up 21% with equity derivatives up on improved client activity. And we saw record revenue in time and growth in client balances amid supportive equity market levels.\nSecurities services revenue was $1.3 billion, was up 3% year on year, driven by higher volumes and market levels, largely offset by deposit margin compression. Expenses of $9.2 billion were up 12% year on year, largely driven by higher revenue-related compensation, legal expense, and volume-related non-compensation expense.\nIn banking and payments, average loans were up 2% year on year due to the impact of the First Republic acquisition in flat sequentially. Demand for new loans remains muted as middle market and large corporate clients remained somewhat cautious due to the economic environment and revolver utilization continues to be below pre-pandemic levels.\nAlso, capital markets are open and are providing an alternative to traditional bank lending for these clients. In CRE, higher rates continue to suppress both loan origination and payoff activity. Average client deposits were up 2% year on year and relatively flat sequentially.\nFinally, credit costs were $384 million and that reserve build of $220 million was primarily driven by incorporating the First Republic portfolio in the firm's modeled approach. Net charge-offs were $164 million, of which about half was in office.\nThen to complete our lines of business AWM on page 6, asset and wealth management reported net income of $1.3 billion, with pre-tax margin of 32%. Revenue of $5.3 billion was up 6% year on year, driven by growth in management fees on higher average market levels and strong net inflows as well as higher brokerage activity, largely offset by deposit margin compression.\nExpenses of $3.5 billion were up 12% year on year, largely driven by higher compensation, primarily revenue related compensation and continued growth in our private banking advisor teams. For the quarter, long-term net inflows were $52 billion, led by equities and fixed income. And in liquidity, we saw net inflows of $16 billion.\nAUM of $3.7 trillion was up 15% year on year. And client assets of $5.4 trillion were up 18% year on year, driven by higher market levels and continued net inflows. And finally, loans and deposits were both flat quarter on quarter.\nTurning to corporate on page 7, Corporate reported net income of $6.8 billion on revenue of $10.1 billion. Excluding this quarter's Visa-related gain and the First Republic bargain purchase gain in the prior year, NIR was up approximately $450 million year on year, NII was up $626 million year on year, driven by the impact of balance sheet mix and higher rates.\nExpenses of $1.6 billion were up $427 million year on year. Excluding the foundation contribution, expenses were down $573 million year on year, largely as a result of moving First Republic related expense out of corporate into the relevant segments.\nTo finish up, we have the outlook on page 8. Our 2024 guidance, including the drivers remains unchanged from what we said at Investor Day. We continue to expect NII and NII ex markets are approximately $91 billion, adjusted expense of about $92 billion, a non-credit card net charge-off rate of approximately 3.4%.\nTo wrap up, the reported performance for the quarter was exceptional and actually represents record revenue and net income. And more importantly, after excluding the significant items, the underlying performance continues to be quite strong. And as always, we remain focused on continuing to execute with discipline. And with that, let's open the line for Q&A.\nQuestion and Answer Session\nOperator\nSteven Chubak, Wolfe Research.\nSteven Chubak\nHi, good morning, Jeremy. So I wanted to start off with a question on capital. Just given some indications that the Fed is considering favorable revisions to both Basel III Endgame and the GSIB surcharge calculations, which I know you've been pushing for, for some time.\nAs you evaluate just different capital scenarios, are these revisions material enough for they could support a higher normalized ROTCE at the firm versus the 17% target? And if so, just how that might impact or inform your appetite for buybacks going forward?\nJeremy Barnum\nRight. And thanks, Steve, actually, before answering the question, I just want to remind everyone that Jamie is not able to join because he has a travel conflict overseas. So it's just going to be me today.\nOkay, good question on the capital and the ROTCE. So let me start with the ROTCE point first. In short, my answer to that question would be no. It's hard to imagine a scenario coming out of the whole potential range of outcomes on capital that involves an upward revision on ROTCE.\nIf you think about the way we've been talking about this, we've said that before the Basel III Endgame proposal, we had a [17%] through-cycle target. And that well, you can imagine a range of different outcomes. The vast majority of them involve expansions of the denominator.\nAnd while we had ideas about changing the perimeter and repricing, all of which are still sort of an effect, you know, most of those would be thought of as mitigants rather than things that would actually like increase the ROTCE. And I don't really think that answer has particularly changed.\nSo as of now, that's what I would say, which is a good pivot to the next point, which is, yeah, we've been reading the same press coverage you've been reading and you know, it's fun and interesting to speculate about the potential outcomes here.\nBut in reality, we don't know anything. We don't know how reliable the press coverage is. And so in that sense, I feel like on the overall capital return and buyback trajectory, not much has actually changed, relative to what I laid out at Investor Day, the comment that I made, the comment that Jamie made then, as well as the comments that Jamie made subsequent week at an industry conference.\nSo maybe I'll just briefly summarize for everyone's benefit, what we think that is, which is one, we do recognize that our current practice on capital return and buybacks does lead to an ever expanding CET1 ratio. But obviously, we're going to run the company over the cycle over time at a reasonable CET1 ratio with a reasonable buffer relative to our requirements.\nSo after all, the uncertainty is sorted out. The question of the deployment of the capital one way or another is a matter of when not if. On the capital hierarchy, it's also worth noting that's another thing that remains unchanged. So to view it quickly, growing the business organically and inorganically, sustainable dividend. And in that context, it's worth noting that the Board's announced intention to increase it to $1.25, it is a 19% increase prior to last year. So that's a testament to our performance and that is a return on capital.\nAnd then finally, buyback, that hierarchy does not permit us to return 100% of the capital generation in any given quarter. And so as we sit here today, when you look at the relationship between the opportunity cost of not deploying the capital and the opportunities to deploy the capital outside the fund, it's kind of hard to imagine an environment where that relationship argues more strongly for patience.\nSo given all that, putting it all together, I'm sorry, for the long answer, we remain comfortable with the current amount of excess capital. And as Jamie has said, we really continue to think about it as earnings in store as much as anything else.\nSteven Chubak\nDon't need to apologize, Jeremy. That was a really helpful perspective. Maybe just for my follow-up on NII, you've been very consistent just in flagging the risks related to NII over earning, especially in light of potential deposit attrition as well as repricing headwinds. In the second quarter, we did see at least some moderation in repricing pressures.\nDeposit balances were also more resilient in what's a seasonally weak quarter for deposit growth. So just given the evidence that some deposit pressures appear to be abating, do you see the potential for NII normalizing higher? And where do you think that level could ultimately be in terms of stabilization?\nJeremy Barnum\nYeah, interesting question, Steve. So let's talk about deposit balances. So yeah, I see your point about how balanced pressures are slightly abating. You know, when you look at the system as a whole, just to go through it, Q2 is still a bit of a headwind, loan growth is modest and not enough to offset that, and our peers seems to have settled in roughly at its current levels.\nAnd there are reasons to believe that it might not go down that much more, although that could always change and that could supply extra reserves into the system. But on balance, net across all those various effects, we still think that there are net headwinds to deposit balances. So when we think of our balance outlook, we see it as a flat, slightly down maybe with our sort of market share and growth ambitions offsetting those system-wide headwinds.\nSo in terms of normalizing higher, I guess it depends on relative to what. But I think it's definitely too early to be sort of calling the end of the overall earning narrative or the normalization narrative. Clearly, the main difference in our current guidance relative to what we had earlier in the year, which implies a lot more sequential decline, it is just the change in the Fed outlook.\nSo two cuts versus six cuts is the main difference there. But obviously, based on the latest inflation data and so on, you could easily get back to a situation with a lot more cuts in the yield curve. So we'll see how it goes. And in the end, we're kind of focused on just running the place recognizing and trying not to be distracted by what remains some amount of over-earning, whatever it is.\nSteven Chubak\nUnderstood, Jeremy. Thanks so much for taking my questions.\nOperator\nSaul Martinez, HSBC.\nSaul Martinez\nGood morning. Thanks for taking my question. Jeremy, can you give an update on the stress capital buffer? You noted obviously that you think there is an error in the Fed's calculation due to OCI. Can you just give us a sense of what the dialogue with the Fed looks like is there a process to modify the SCB higher? And if you can give us a sense of what that process looks like.\nJeremy Barnum\nYeah. So I'm not going to comment about any conversations with the Fed, you know, not to confirm or deny that they even exist, that stuff is private. And then if you could talk about like the timing here, right, so you know that the stress capital buffer that's going to release the 3.3% as a preliminary number, by rule, the Fed has to release that by August 31. It may come sooner.\nYou talked about an error in the calculation. We haven't used that word, you know what we know, what we believe rather is that the amount of OCI gain that came through the first disclosed results looked not intuitively high to us. And you know, if you adjust that in ways that we think are reasonable, you know, you would get a slightly higher stress capital buffer.\nWhether the Fed agrees and whether they decide to make that change or not is up to them. And we'll see what happens. I think the larger point is that if you look at the industry as a whole and if you sort of put us into that with some higher pro forma SCB, whatever it might suitably be, you actually see once again, quite a bit of volatility in the year-on-year change in the stress capital buffer for many firms, so sort of reiterating.\nAnd another example of what we've said a lot over the years that it's volatile, it's transparent, it makes it very hard to manage the capital of the bank. It leads to excessively high management buffers. And we think that it's really not a great way to do things. So I'll leave it at that.\nSaul Martinez\nOkay, got it. That's helpful. Just following up on capital returns, on Steve's question, I think you highlighted in response, it's a matter of when, not if. And obviously, Jamie is not there, you can't speak for Jamie, but seems to have shown limited enthusiasm for special dividend or buybacks at current valuations? Can you just give us a sense of how you're thinking about the various options?\nAny updated thoughts on a special dividend and you do other things like, for example, have a materially increasing your dividend payout sort of a step function increase where you keep that flat and grow into that, grow your earnings into that over time, can you just maybe give us a sense of how you're thinking about what options you have available to deploy that capital?\nJeremy Barnum\nSure, yeah, I mean, I would direct you to read. I'm sure you have Jamie's comments at the Industry Conference where you participated that week after Investor Day because you wanted a good amount of detail on this stuff, addressing some of these points. And I think this comment there about the special dividend was that it's not really our preference. We hear from people that many of our investors wouldn't find that particularly appealing.\nAnd he said as much that it wouldn't be sort of our first choice. So I think the larger point assisted to a little bit to your question, there are a number of tools in the toolkit and they're really the same tools that are part of our capital hierarchy. So first and foremost, we're, you know, looking to deploy the capital into organic or inorganic growth. And then the dividend, I think we're always going to want to keep it and that sort of like sustainable and also sustainable in a stressed environment. So that continues to be the way we think about that.\nAnd then at the end of it, it's buybacks and Jamie has been on the record for, you know, over a decade, I think over many shareholder letters talking about how he thinks about price and buybacks and valuation. And price is a factor, so that's sort of the totality of the sort of options, I guess.\nSaul Martinez\nOkay, great. Thanks a lot.\nOperator\nKen Usdin, Jefferies.\nKen Usdin\nThanks a lot. Good morning, Jeremy. Jeremy, great to see the progress on investment banking fees up sequentially and 50% year over year. And I saw you on the tape earlier, just talking about, still regulatory concerns a little bit in the advisory space, and we clearly didn't see the debt portfolio in place, although your DCM was great again.\nI'm just wondering just where you feel the environment is relative to the potential and just go where the dialogue is across the three main bucket areas in terms of like how does this feel in terms of a current environment versus a potential environment that we could still see ahead? Thanks.\nJeremy Barnum\nYeah, thanks, Ken. It's progress, right. I mean, we're happy to see the progress. People have been talking about the oppressed banking fee wallet for some time, and that's nice to see not only the year-on-year part from a low base, but also a nice sequential improvement. So that's the first thing to say.\nIn terms of dialogue and engagement, it's definitely elevated. So the dialogue on ECM is elevated and the dialogue on M&A is quite robust as well. So all of those are good things that encourage us and make us hopeful that we could be seeing sort of a better trend in this space, but there are some important caveats.\nSo on the DCM side, yes, we made pull forward comments in the first quarter, but we still feel that the second quarter still reflects a bunch of pull forward and therefore, we're reasonably cautious about the second half of the year.\nImportantly, a lot of the activities, refinancing activity as opposed to, for example, acquisition finance, so the fact that M&A remains still relatively muted in terms of actual deals has knock-on effects on DCM as well and when a higher percentage of the wallet is refi and the pull forward risk becomes a little bit higher.\nOn ECM, if you look at it kind of how to remove, you might ask the question, given the performance of the overall indices, you would think it would be a really booming environment for IPOs, for example. And while it's improving, it's not quite as good as you would otherwise expect.\nAnd that's driven by a variety of factors, including the fact that this has been widely discussed that extent to which the performance of the large indices as proven by like a few stocks, the sort of mid-cap tech growth space and other spaces that would typically be driving IPOs have had much more muted performance.\nAlso, a lot of the private capital that was raised a couple of years ago was raised at pretty high valuations. And so in some cases, people looking at IPOs could be looking at down rounds. That's an issue. And while secondary market performance of IPOs has improved meaningfully, in some cases people still have concerns about that.\nSo those are a little bit of overhang on that space. I think we can hope that over time that fades away and the trend gets a bit more robust. And yeah, on the advisory side, you know the regulatory overhang is there, remains there, and so we'll just have to see how that plays out.\nKen Usdin\nGreat. Thank you for all that, Jeremy. And just one on the consumer side, just anything you're noticing in terms of people just have been waiting for this delinquency stabilization on the credit card side. Obviously, your loss rates are coming in as you expected, and we did see 30 days of pretty flat, 90 days, come down a little bit. Is that seasonal? Is it just a good rate of change trend? Any thoughts there? Thanks.\nJeremy Barnum\nYeah, I still feel like when it comes to card, charge-offs, and delinquencies, there's just not much to see there. It's still -- it's normalization, not deterioration, it's in line with expectations. You know, as I say, we always look quite closely inside the cohort, inside the income cohorts.\nAnd, you know, when you look in there, specifically, for example, on spend patterns, you can see a little bit of evidence of behavior that's consistent with a little bit of weakness in the lower income segments where you see a little bit of rotation of the spend out of discretionary and non-discretionary.\nBut the effects are really quite subtle and in my mind, definitely, entirely consistent with the type of economic environment that we're seeing, which while very strong and certainly a lot stronger than anyone would have thought, given the tightness of monetary conditions, say like they had been predicting a couple of years ago or whatever, you are seeing slightly higher unemployment, you are seeing moderating GDP growth. And so it's not entirely surprising that you're seeing a tiny bit of weakness in some pockets of spend. So it all kind of hangs together in what is sometimes actually not a very interesting story.\nKen Usdin\nThank you.\nOperator\nGlenn Schorr, Evercore ISI.\nGlenn Schorr\nHi, thanks very much. So Jeremy, the discussions so far around private credit and you all, your recent comments have been the ability to add on balance sheet and compete when you need to compete on the private credit front. I do think that most of the discussion has been about the direct-lending component.\nSo I'm curious if you are showing more progress and activity on that front. And then very importantly, do you see the same trend happening on the asset-backed finance side because that's a bigger part of the world, and it is a bigger part of your business? So I'd appreciate your thoughts there. Thanks.\nJeremy Barnum\nYeah. Thanks, Glenn. So on private credit, so nothing really new to say there. I think, I guess one way the environment is evolving a little bit is that as you know, a lot of money has been raised in private credit funds looking for deals. And sort of a little bit to my prior comment, in a relatively muted acquisition finance environment, at this point you've got a lot of money chasing kind of like not that many deals. So the space is a little bit quieter than it was at the margin.\nAnother interesting thing to note is some of this discussion about kind of lender protections that were typical in the syndicated lender finance market making their way into the private market as well, is sort of people realize that even in the private market, you probably need some of those protections in some cases, which is sort of supportive of the theme that we've been talking about, about convergence between the direct lending space and the syndicated lending space, which is kind of our core thesis here, which is that we can offer best-in-class service across the entire continuum, including secondary market trading and so on.\nSo we feel optimistic about our offering there. I think the current environment is maybe a little bit quieter than it was. So it's maybe not a great moment to like kind of test whether we are doing a lot more or less in the space, so to speak.\nAnd then on asset-backed financing, you actually asked me that question before. And at the time, my answer was that I haven't heard much about that trend, and that continues to be the case. But clearly, there must be something I'm missing. So I can follow-up on that and maybe we can have a chat about it.\nGlenn Schorr\nThat's great for you if you are not hearing much about it, so we can leave it at that. Maybe just one quick follow-up in terms of your just overall posturing on -- you were patient and smart when rates were low, waited to deploy, worked out great. We know that story. Now it seems like you have tons of excess liquidity and you are being patient and rates are high. And I'm curious on how you think about what kind of triggers, what kind of things you're looking for in the market to know if and when you would extend duration?\nJeremy Barnum\nRight. I mean on duration, in truth we have actually added a little bit of duration over the last couple of quarters. So that's one thing to say, that was more last quarter than this quarter. But I guess I would just caution you from -- a little bit away from looking at kind of our reported cash balances and our balance sheet, and concluding that when you look at the duration concept holistically, that there is a lot to be done differently on the duration front.\nSo clearly, it's true that empirically, we've behaved like very asset sensitively in this rate hiking cycle, and that has resulted in a lot of excess NII generation sort of on the way up in the near-term.\nBut when we look at the fund's overall sensitivity to rates, we look at it through both like the EAR type lens or short-term NIR sensitivity, but also a variety of other lenses, including various types of scenario analysis, including impacts on capital from higher rates.\nAnd as I think Jamie has said a couple of times, we actually aim to be relatively balanced on that front. Also, given like the inverted yield curve, it's not as if extending duration from these levels means that you're walking in 5.5% rate. In fact, the forwards are not sort of that compelling, given our views about some sort of structural upward pressures on inflation and so on. So I think when you put that all together, I don't think that kind of a big change in duration posture is a thing that's front in mind for us.\nGlenn Schorr\nSuper, helpful. Thanks so much for that.\nOperator\nMatt O'Connor, Deutsche Bank.\nMatt O'Connor\nGood morning. I was just wondering if you can elaborate on essentially the math behind the ROTCE being too high at 20% and more normalized at 17%. Obviously, you've pointed to over-earning NII. And I guess the question is, is that all of it to go from 20% to 17%? And if so, is that all consumer deposit costs? Or are there a few other components that you could help frame for us?\nJeremy Barnum\nSure. Good question, Matt. I mean, I guess the way I think about it is a couple of things. Like our returns tend to be a bit seasonal, right. So if you kind of build yourself out a full year forecast and make reasonable space on your own, or analyst consensus or whatever, and you think about the fourth quarter, better look at this on a full year basis when you think about the returns than the quarterly numbers, and you obviously have to strip out kind of the one-time items. And so if you do that, like whatever you get for this year is still clearly a number that's higher than 17%.\nSo yeah, one source of headwinds is normalization of the NII, primarily as a result of the expected higher deposit costs, we've talked about that. Part of it is also the yield curve effects. Some cuts will come into the curve at some point.\nAnd in the normal course, if you kind of do a very, very, very supplemental model of the company, you would have like expenses grow -- revenue is growing at some organic GDP like rate, maybe higher, and expenses growing at a similar or slightly lower rate, producing a sort of relatively stable overhead ratio.\nBut even if the amount of NII normalization winds up being less than we might have thought at some prior point, you still have some background, you still have some normalization of the overhead ratio that needs to happen.\nSo as much as our discipline on expense management is, as tight as it always has been, the inflation is still non-zero. There's still investments that we're executing. There is still higher expense to come in a slightly flatter revenue environment as a result of in part, the normalization of NII.\nAnd then the final point is that whatever winds up being the answer on Basel III Endgame and all the other pieces, you have to assume some amount of expansion of the denominator, at least based on what we know so far.\nSo of course, any of those pieces could be wrong, but that's kind of how we get to our 17%. And if you look at the various scenarios that we showed on the last page of my Investor Day presentation, it illustrates those dynamics and also how much the range could actually vary as a function of the economic environment and other factors.\nMatt O'Connor\nYeah. That was a really helpful chart. Just one follow-up. On the yield curve effects, I guess, what do you mean by that? Because right now, the yield curve is inverted, maybe you're still leaving any impact of that. But kind of longer-term, you'd expect a little bit of steepness of the curve, which I would think would help. But what do you mean by that? Thank you.\nJeremy Barnum\nYeah. I mean you're not talking about this before. I guess I don't really agree fundamentally with the notion that the way to think about things is that sort of yield curve steepness above and beyond what's priced in by the forwards is a source of structural NII or NIM for banks, if you know what I mean. Like I mean people have different views about the so-called term premium. And obviously, in a moment of inverted curve and different types of treasury supply dynamics, people thinking on that may be changing.\nBut I think we saw, when rates were at zero and the 10-year note was below 2%, everyone sort of -- many people were kind of tempted to try to get extra NIM and extra NII by extending duration a lot. But when the steepness of the curve implies -- it is driven by the expectation of actually aggressive Fed tightening, it's just a timing issue and you can wind up kind of pretty offside from the capital and other perspectives.\nSo there are some interesting questions about whether fiscal dynamics might result in a structurally steeper yield curve down the road and whether that could be sort of earning the term premium, so to speak, could be a source of NII, but that feels a bit speculative to me at this point.\nMatt O'Connor\nGot it. Okay, thank you for the details.\nOperator\nMike Mayo, Wells Fargo Securities.\nMike Mayo\nHi. Jeremy, you said it's too early to end the over earning narrative, and you highlighted higher deposit costs and the impact of lower rates and lower NII and DCM pull-forward and credit cost going higher. Anything I'm missing on that list? And what would cause you to end the over earning narrative?\nJeremy Barnum\nNo. Actually, I think that is the right list Mike. I mean, frankly, I think one thing that would end to be over earning narrative is if our annual returns were closer to 17%. I mean to the extent that, that is the through-the-cycle number that we believe and that we are currently producing more than that, that's one very simple way to look at that.\nBut the pieces of that or the pieces that you talked about and the single most important piece is the deposit margin. Our deposit margins are well above historical norms, and that is a big part of the reason that we still are emphasizing the over-earning narrative.\nMike Mayo\nYou're 17% through-the-cycle ROTCE kind of expectation, what is the CET1 ratio that you assumed for that?\nJeremy Barnum\nI mean we would generally assume requirements plus a reasonable buffer, which depending on the shape of rules, could be a little bit smaller or a little bit bigger. And the small part as a function of the volatility of those pools, which goes back to my prior comments on SCB and CCAR.\nBut obviously, as you well know, what actually matters is less the ratio and more of the dollars. And at this point, the dollars are very much a function of where rules land and where the RWA lands, and obviously things like GSIB recalibration and so on.\nSo we've done a bunch of scenario analysis along the lines of what I did at Investor Day that informs those numbers, but that is obviously one big element of uncertainty behind that 17%, which is why at Investor Day, when we talked about it, both Daniel and I were quite specific about saying that we thought 17% was still achievable, assuming a reasonable outcome on the Basel III Endgame.\nMike Mayo\nLet me just zoom out for one more question on the return target. I mean when I asked Jamie at the [2013] Investor Day, would it make sense to have 13.5% capital, he was basically telling you take a hike, right? And now you have 15.3% capital and you're saying, well, we might want to have a lot more capital here.\nI mean at some point, if you're spending $17 billion a year to improve the company, if you're gaining share with digital banking, if you're automating the back office, if you're moving ahead with AI, if you're doing all these things that I think you say others aren't doing, why wouldn't those returns go higher over time? Or do you just assume you'll be competing those benefits away? Thanks.\nJeremy Barnum\nYeah, I mean, I think in short, Mike, and we've talked about this a lot and Jamie has talked about this a lot, it's a very, very, very competitive market. And we are very happy with our performance. We are very happy with the share we've taken. And 17% is like an amazing number actually. And like to be able to do that, given how robust the competition is from banks, from non-banks, from US banks, from foreign banks, and all of the different businesses that we compete in, is something that we're really proud of.\nSo the number has a range around it, obviously. So it's not a promise, it's not a guarantee and it can fluctuate. But we are very proud to be in the ballpark of being able to think that we can deliver it, again assuming a reasonable outcome on Basel III Endgame. But it's a very, very, very competitive market across all of our products and services and regions and line segments.\nMike Mayo\nAll right. Thank you.\nOperator\nBetsy Graseck, Morgan Stanley.\nBetsy Graseck\nHi, Jeremy. So I did want to ask one drill-down question on 2Q, and it's related to the dollar amount of buybacks that you did do. I think in the press release, right and the slide deck, it's $4.9 billion common stock net repurchases. So the question here is what's the governor for you on how much to do every quarter?\nAnd I mean I understand it is a function of okay, how much do we organically grow? But even with that, so you get the organic growth which you had some nice movement there. But you do the organic growth and then is it how much do we earn and we want to buy back our earnings?\nOr how should we be thinking about what that repurchase volume should be looking like over time? And I remember at Investor Day, the whole debate around I don't want to buy back my stock, but we are, right. So I get this question from investors quite a bit of how should we be thinking about, how you think about what the right amount is to be doing here?\nJeremy Barnum\nYeah. That's a very good and fair question, Betsy. So let me try to unpack it to the best of my abilities. So in no particular order. One thing that we've really tried to emphasize in a number of different settings, including in our recent 10-Qs actually, is that we don't want to get into the business of guiding on buybacks.\nSo we're going to buy back whatever we think makes sense in the current moment sort of -- and we prefer the right to sort of change that at any time. So I recognize that not everyone loves that, but that is kind of a philosophical belief. And so I might as well say it explicitly. It was pretty clear in the Q also, but I'm just going to say that again. So that's point one.\nBut having said that, let me nonetheless try to address your point on framework and governors. So generally speaking, we think it doesn't make sense to sort of exit the market entirely unless the conditions are much more unusual than they are right now, let's say.\nObviously, when for whatever reason, if we ever need to build capital in a hurry, we've done it before and we are always comfortable suspending buybacks entirely. But I think some modest amount of buybacks, is a reasonable thing to do when you are generating your kind of capital. And so we were talking before about this $2 billion pace, we're kind of trying to move away from this notion of a pace, but that's where that idea comes from, let's put it that way.\nYou talked about the $4.9 billion, which I recognize may seem like a little bit of a random number. But where that actually comes from is the other statement that we made, that we have these significant item gains from Visa. And if you think about what that means, it means that we have, post the acceptance of the exchange offer, a meaningful long position and liquid large cap financial stock, i.e., Visa, which realistically is highly correlated to our own stock. And so in some sense, why carry that instead of just buying back JPMorgan stock.\nSo we talked about, Jamie talked about as we liquidate the Visa, deploying those proceeds into JPM, and that's what we did this quarter. So that is why the $4.9 billion is a little higher. And it's consistent with my comments at our Investor Day around having slightly increased the amount of buybacks.\nAnd beyond that what you are left with is answer to Steve's question, which is that, to your point about buying back earnings or whatever, when we are generating these types of earnings and there is this much organic capital being generated, in the absence of opportunities to deploy it organically or inorganically and while continuing to maintain our healthy but sustainable dividend, if we don't return the capital, we are going to keep growing the CET1 ratio, the levels of which -- if you think about the long strategic outlook of the company, are not reasonable. They're just artificially high and unnecessary.\nSo one way or the other, that will need to be addressed at some point. It's just that we don't feel now is the right time.\nBetsy Graseck\nGreat. Thank you, Jeremy. Appreciate it.\nOperator\nGerard Cassidy, RBC Capital Markets.\nGerard Cassidy\nJeremy, I know you touched on deposits earlier in the call in response to a question. I noticed on the average balances, the non-interest bearing deposits were relatively stable quarter to quarter versus prior quarters when they have steadily declined.\nAnd this is one of the areas, of course investors are focused on in terms of the future of the net interest margin for you and your peers. Can you elaborate if you can, what you're seeing in that non-interest-bearing deposit account? I know this is average and not period end, the period end number may actually be lower. But what are you guys seeing here?\nJeremy Barnum\nYeah. Good question, Gerard. I have to be honest, I haven't focused on that particular sequential explain i.e., quarter-on-quarter change and average non-interest-bearing deposits. But I think the more important question is the big picture question, which is what do we expect? I mean how are we thinking about ongoing migration of non-interest-bearing into interest-bearing in the current environment, and how that affects our NII outlook and our expectation for weighted average rate paid on deposits.\nAnd the answer to that question is that we do continue to expect that migration to happen. So if you think about it in the wholesale space, you have a bunch of clients with some balances in non-interest-bearing accounts, and over time for a variety of reasons, we do see them moving those balances into interest-bearing.\nSo we do continue to expect that migration to happen, and therefore, that will be a source of headwinds. And that migration sometimes happens internally, i.e., out of non-interest-bearing into interest-bearing or into CDs. Sometimes it goes into money markets or into investments, which is what we see happening in our wealth management business.\nAnd some of it does leave the company, but one of the things that we are encouraged by is the extent to which we are actually capturing a large portion of that yield-seeking flow through CDs and money market offerings, et cetera, across our various franchises.\nSo big picture, I do think that migration out of non-interest-bearing into interest-bearing will continue to be a thing, and that is a contributor to the modest headwinds that we expect for NII right now. But yeah, I'll leave it at that, I guess.\nGerard Cassidy\nVery good. And as a follow-up, you've been very clear about the consumer credit card charge-offs and delinquency levels. And we all know about the commercial real estate office, and you always talk about over-earning on net interest income of course. One of the great credit quality stories for everyone, including yourselves, is the C&I portfolio, how strong it's been for in this elevated rate environment.\nAnd I know your numbers are still quite low, but there in the Corporate and Investment Bank, you had about a $500 million pickup in non-accrual loans. Can you share with us what are you seeing in C&I? Are there any early signs of cracks or anything? And again, I know your numbers are still good, but I'm just trying to look forward to see if there's something here over the next 12 months or so.\nJeremy Barnum\nYeah, it's a good question. I think the short answer is no, we are not really seeing early signs of cracks in C&I. I mean, yeah, so I agree with you, like the C&I charge-off rate has been very, very low for a long time. I think we emphasized that at last year's Investor Day if I remember correctly. I think the C&I charge-off rate we are seeing 10 years was something like literally zero.\nSo that is clearly very low by historical standards. And while we take a lot of pride in that number, I think it reflects the discipline in our underwriting process and the strength of our credit culture across bankers and the risk team, that's not -- we don't actually run that franchise to like a zero loss expectation.\nSo you have to assume there will be some upward pressure on that. But in any given quarter, the C&I numbers tend to be quite lumpy and quite idiosyncratic. So I don't think that anything in the current quarter results is indicative of anything broader, and I haven't heard anyone internally talk that way, I would say.\nGerard Cassidy\nGreat, appreciate the insights as always. Thank you.\nOperator\nErika Najarian, UBS.\nErika Najarian\nHi, good morning. I just had one cleanup question, Jeremy. The consensus provision for 2024 is $10.7 billion. Could you maybe clarify for once and for all sort of Jamie's comments at an industry conference earlier and try to sort of triangulate if that $10.7 billion provision is appropriate for the growth level that you are planning for in card?\nJeremy Barnum\nYeah, happy to clarify that. So Jamie's comments were that the allowance to build and the card allowance, so we are talking about card specifically, we expected something like $2 billion for the full year. As I sit here today, our expectation for that number is actually slightly higher, but it's in the ballpark.\nAnd I think in terms of what that means for the consensus on the overall allowance change for the year, last time I checked, it still looked a little low on that front. So who knows what it will actually wind up being, but that remains our view.\nOne question that we've got is how to reconcile that build to the 12% growth in OS that we've talked about because it seems like a little bit high relative to what you would have otherwise assumed if you apply some sort of a standard coverage ratio to that growth.\nBut the reason that's the case is essentially a combination of higher revolving mix as we continue to see some normalization revolve in that 12%, as well as seasoning of earlier vintages, which comes with slightly higher allowance per unit of OS growth.\nErika Najarian\nGreat. Thank you.\nOperator\nJim Mitchell, Seaport Global Securities.\nJim Mitchell\nHey, good morning. Maybe just one last question on sort of deploying excess capital. It seems like the two primary ways to do that organically would be through the trading book or the loan book. So maybe two questions there. One, trading assets were up 20% year over year, is that you leaning into it or just a function of demand? And is there further opportunities to grow that?\nAnd then secondly, outside of cards, loan demand has been quite weak. And any thoughts from you on if you're seeing any change in demand or how you're thinking about loan demand going forward? Thanks.\nJeremy Barnum\nThanks, Jim. Good question. So yeah, trading assets have been up. That is basically client activity primarily secured financing related sort of matchbook repo type stuff and similar things that grows up the balance sheet quite a bit, but are quite low risk and therefore quite low RWA intensity.\nSo while our ability the supply that financing to clients is something that we're happy about and it's very much represents us leaning into the franchise to serve our clients. It's not really particularly RWA, and therefore capital intensive, and therefore doesn't really reflect an aggressive choice on our part to deploy capital, so to speak.\nOn the loan demand front, yeah, I mean, unfortunately, I just don't have much new to say there on loan demand. Meaning, to your point, loan demand remains quite muted everywhere except card. Our card business is, of course, in no way capital constrained.\nSo whatever growth makes sense there in terms of our customer franchise and our ability to acquire accounts and retain accounts, and what fits inside our credit risk appetite is growth that's going to make sense. And so we're very happy to deploy capital to that. But it's not constrained by our willingness or ability to deploy capital to that.\nAnd of course, for the rest of the loan space, the last thing that we are going to do is have the excess capital mean that we lean in to lending that is not inside our risk appetite or inside our credit box, especially in a world where spreads are quite compressed and terms are under pressure. So there is always a balance between capital deployment and assessing economic risk rationally.\nAnd frankly, that is in some sense, a microcosm of the larger challenge that we have right now. When I talked about if there was ever a moment where the opportunity cost of not deploying the capital relative to how attractive the opportunities outside the walls of the company are, now would be it in terms of being patient. That's a little bit one example of what I was referring to.\nJim Mitchell\nAll right. Okay, great. Thanks.\nOperator\nAnd we have no further questions.\nJeremy Barnum\nVery good. Thank you, everyone. See you next quarter.\nOperator\nThank you all for participating in today's conference. You may disconnect your line and enjoy the rest of your day.", "Link": "Https://Finance.Yahoo.Com/News/Q2-2024-Jpmorgan-Chase-Co-054100428.Html", "Sentiment_Score": -0.2007835656, "Sentiment_Category": "bearish"}, {"Ticker": "JPM", "Time": "2024-07-12T22:15:00.000Z", "Headline": "Q2 Earnings Growth Expected to Reach Two-Year High", "Summary": "The market isn’t particularly impressed with what it saw in the quarterly releases from JPMorgan JPM, Citigroup C, and Wells Fargo WFC, even though all three beat top- and bottom-line expectations.\nPart of the issue appears to be underwhelming guidance and management commentary, reflecting moderating economic activities on the back of elevated interest rates.\nThe stocks' outperformance entering this reporting cycle also contributed to the market’s tentative initial reaction to these results.\nYou can see this in the chart below, which shows the three-month performance of JPMorgan, Citigroup, and Wells Fargo relative to the S&P 500 index. The chart shows the performance of these three stocks relative to the market through Thursday, July 11th, the day before the quarterly results.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nWhile all three stocks have outperformed the market in this period, Citigroup's outperformance is more a function of market confidence in the company’s restructuring efforts than any near-term profitability outlook.\nWe see the Q2 results from these three major banks as good enough–not great, but definitely not bad either. There were no major surprises from either of the three banks, with management’s commentary about financial stress at the lower end of the income distribution no longer a new development following results from several consumer-facing companies.\nIn the core banking business, profitability remains constrained by margin pressures, cyclically soft demand for credit, and some deterioration in credit quality, albeit from a very low level. On the capital markets side, trading revenues remain strong, and the investment banking business has started showing signs of growth but still remains below the strong level of two years ago. There has been talk of ‘green shoots’ concerning deal pipelines, but the catalyst for that is expected to be the coming Fed easing cycle.\nLooking at the Q2 earnings season scorecard for the Finance sector, we now have results from 16.4% of the sector’s market capitalization in the S&P 500 index. Total earnings for these Finance companies are up +0.2% from the same period last year on +11.5% higher revenues, with 100% EPS and revenue beats percentages at this stage.\nLooking at the Finance sector as a whole, total Q2 earnings for the sector are expected to be up +10.8% on +6.6% higher revenues.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nQ2 Earnings Season Scorecard\nIncluding the aforementioned reports from JPMorgan, Citi, and Wells Fargo, we now have Q2 results from 27 S&P 500 members. Total earnings for these 27 index members are up +8.8% from the same period last year on +4.4% higher revenues, with 81.5% beating EPS estimates and only 44.4% able to beat revenue estimates.\nThe Q2 reporting cycle really ramps up this week, with 45 S&P 500 members on deck to report results. This week’s line-up is heavily weighted toward the Finance sector, but we do have several bellwethers from other sectors reporting results, including Johnson & Johnson, UnitedHealth, Netflix, Schlumberger, and others.\nThis is too small a sample of results to draw any conclusions from, but the comparisons charts below put the earnings and revenue beats percentages for these companies in a historical context.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nThis is by no means a representative sample of results at this early stage, but we will be keenly looking at how the revenue beats percentage evolves in the days ahead, as we are off to a rough start on that count.\nThe comparison charts below put the Q2 earnings and revenue growth rates for these 27 companies in a historical context.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nThe Earnings Big Picture\nLooking at Q2 as a whole, combining the actual results that have come out already with estimates for the still-to-come companies, total S&P 500 earnings are expected to be up +8.5% from the same period last year on +4.7% higher revenues. This will be the highest quarterly growth pace since the +10% earnings growth rate in the 2022 Q1 period.\nThe chart below that shows the year-over-year earnings and revenue growth for 2024 Q2 in the context of what we saw in the preceding four periods and what is currently expected for the following three periods.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nAs we have been flagging all along in this space, we experienced a notably favorable revisions trend ahead of the start of the Q2 earnings season, with estimates for Q2 holding up far better than other recent periods. In the three-month period since the start of the quarter through June 30th, Q2 estimates for the S&P 500 index fell the least relative to the comparable periods of other recent quarters.\nNot only is the Q2 earnings growth the highest since the first quarter of 2022, but the absolute level of aggregate earnings for the period is on track to be a new all-time quarterly record.\nYou can see in the chart below that the $513 billion in aggregate S&P 500 earnings for Q2 are above the $512.3 billion earned by the index in 2023 Q3.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nLooking at earnings expectations on an annual basis, total 2024 S&P 500 earnings are expected to be up +8.9% on +1.6% revenue growth.\nThe expected revenue growth pace improves to +3.8% once Finance is excluded from the aggregate data, with the index-level aggregate earnings growth for the year remaining unchanged on an ex-Finance basis.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nFor a detailed look at the overall earnings picture, including expectations for the coming periods, please check out our weekly Earnings Trends report >>>>Earnings Season Gets Underway: Bank Earnings in Focus \nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nWells Fargo & Company (WFC) : Free Stock Analysis Report\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\nCitigroup Inc. (C) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Q2-Earnings-Growth-Expected-Reach-221500585.Html", "Sentiment_Score": 0.9257500768, "Sentiment_Category": "bullish"}, {"Ticker": "JPM", "Time": "2024-07-12T21:46:09.000Z", "Headline": "Goldman's year of the stock picker, bank earnings reaction : Market Domination", "Summary": "The trading day is just about over, but the market action never ends. Julie Hyman and Josh Lipton take investors through the finally trading hour of Friday, July 12, on this episode of Market Domination.\nBarclays analyst Jason Goldberg joins the program to talk about banking industry trends potentially outlined in this morning's second quarter earnings out from JPMorgan Chase & Co. (JPM), Citigroup (C), and Wells Fargo (WFC).\nF/m Investments CEO Alex Morris discusses his winners and losers for REITS, or real estate investment trusts, in today's segment of Good Buy or Goodbye.\nOther top trending tickers on the Yahoo Finance platform include Deckers Outdoor (DECK), EVgo (EVGO), Tesla (TSLA), Royal Caribbean Cruises (RCL), and AT&T (T) and Snowflake (SNOW) after the telecom company divulged the details of major data breach from April.\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Goldmans-Stock-Picker-Bank-Earnings-214609240.Html", "Sentiment_Score": 0.0083087198, "Sentiment_Category": "neutral"}, {"Ticker": "JPM", "Time": "2024-07-12T20:26:00.000Z", "Headline": "Big Banks and Customers Continue to Feel Pressure From Higher Rates", "Summary": "JPMorgan and Wells Fargo both reported a drop in quarterly profit, while Citigroup’s profit rose, driven in part by the bank’s cost-cutting measures.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/B0B3Cd5F-D420-3F8F-Bc33-252A81Ebac65/Big-Banks-And-Customers.Html", "Sentiment_Score": -0.9176486135, "Sentiment_Category": "bearish"}, {"Ticker": "JPM", "Time": "2024-07-12T20:25:33.000Z", "Headline": "Slowed loan growth will impact regional banks: Analyst", "Summary": "The banking sector is under pressure despite strong second-quarter earnings results from major players JPMorgan Chase & Co. (JPM), Citigroup (C), and Wells Fargo (WFC), all of which beat analyst estimates. To dissect the financial sector, Barclays analyst Jason Goldberg joins Market Domination.\nAs far as the consumer impact on bank earnings, Goldberg notes that while lower-end consumers continue to face financial pressures, this demographic's struggles may not significantly impact overall bank earnings. \"It's just not a huge contributor to revenues,\" Goldberg explains, though he adds that \"it's certainly something to be mindful of.\"\nA trend Goldberg identifies in the bank earnings is a strong performance in their trading and investment banking divisions. He predicts that institutions with a focus in these areas, such as Goldman Sachs (GS) and Morgan Stanley (MS), may benefit from this trend in upcoming earnings releases next week.\nHowever, Goldberg also points out a potential area of concern: \"loan growth continues to be subdued.\" This trend, he believes, will impact regional banks earnings.\nFor more expert insight and the latest market action, click here to watch this full episode of Market Domination.\nThis post was written by Angel Smith", "Link": "Https://Finance.Yahoo.Com/Video/Slowed-Loan-Growth-Impact-Regional-202533571.Html", "Sentiment_Score": -0.920265913, "Sentiment_Category": "bearish"}, {"Ticker": "JPM", "Time": "2024-07-12T20:20:01.000Z", "Headline": "JPMorgan Beats Views, Wells Fargo Falls On Forecast, Citi Eases", "Summary": "Dow giant JPMorgan rolled out bank earnings Friday, along with Wells Fargo and Citigroup. JPM stock, Citi fall from buy zones.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/143E51B4-9538-327F-98D9-D934826Ab0C8/Jpmorgan-Beats-Views-Wells.Html", "Sentiment_Score": -0.8555886149, "Sentiment_Category": "bearish"}, {"Ticker": "JPM", "Time": "2024-07-12T19:00:34.000Z", "Headline": "Banks Dissapointed Wall Street With Net Interest Income", "Summary": "Banks Dissapointed Wall Street With Net Interest Income\nThe earnings season has been offically kicked off by JP Morgan Chase (NYSE: JPM) that reported earnings and revenue well beyond Wall Street estimates. But other big banks also joined in with their second quarter reports. Wells Fargo & Company (NYSE: WFC) and Citigroup Inc (NYSE: C) also posted better-than-expected earnings and revenue. But, net interest income fell short of implications and banks showed they are expecting macroeconomic conditions to worsen.\nWells Fargo & Company\nFor the second quarter, Wells Fargo reported its revenue rose to $20.69 billion, suprassing LSEG’s estimate of 20.29 billion. Net income diped to $4.91 billion, but its earnings per share of $1.33 also surpassed LSEG’s estimate of $1.29 cents. Wells Fargo recorded $11.92 billion in net interest income that fell by 9% YoY.\nCitigroup\nCitigroup reported its second quarter revenue rose 4% YoY to $20.14 billion.\nDue to the revival of Wall Street activites like IPOs and mergers, Citigroup reported investment banking revenue expanded by as much as 60% to $853 million. Equities trading revenue also rose 37% to $1.5 billion. Fixed income revenue dipped 3% to $3.6 billion. Net income jumped 10% YoY to $3.22 billion.\nCitigroup CEO Jane Fraser emphasized that the latest results show progress in executing the strategy and reflect the benefits of the bank’s diversified business model. But, this week Citigroup was rebuked for failing to fix as many as six of its regulatory shortfalls which will require additional explanations.\nJPMorgan Chase\nFueled by better-than-expected investment banking fees and equities trading results, JPMorgan Chase reported revenue grew by 20%YoY to $50.99 billion. Investment banking fees alone surged 52% YoY to  $2.3 billion. Equities trading revenue jumped 21% to $3 billion\nEarnings rose 25% YoY to $18.15 billion and excluding items related to the its stake in Visa, adjusted profit amounted $4.26 per share.\nHowever, CEO Jamie Dimon warned of the complex geopolitical situation that is potentially the most dangerous since World War II, with its outcome and effect on the global economy still being unknown.\nBy reporting a $3.05 billion provision for credit losses, JPMorgan clearly showed it expects more defaults and therefore, rough times ahead for the US economy. But its latest quarter has reflected quite a healthy consumer, despite some weakness in the lower-income segment.\nRecap\nWall Street deal making continued coming back to life following a two-year-long sleep. All three banks reported trading revenue went up. But stocks of all three fell as higher interest rates and elevated deposit costs shrinked consumer banking margins. Altogether, banks warned of stress among the lower income consumer segment. Banks clearly showed they are expecting worsening credit conditions by setting aside more finds for future loan losses. But the sequential drop of a key measure that is net interest income, a central driver of profit for any bank, is what really concerned investors as customers continued shifting towards higher-yielding deposit products.\nDISCLAIMER: This content is for informational purposes only. It is not intended as investing advice.\nThis article is from an unpaid external contributor. It does not represent Benzinga's reporting and has not been edited for content or accuracy.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Banks Dissapointed Wall Street With Net Interest Income originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "Link": "Https://Finance.Yahoo.Com/News/Banks-Dissapointed-Wall-Street-Net-190034624.Html", "Sentiment_Score": -0.8039638996, "Sentiment_Category": "bearish"}, {"Ticker": "JPM", "Time": "2024-07-12T18:02:33.000Z", "Headline": "Why JP Morgan Chase Stock Is Down Today", "Summary": "JPMorgan Chase (NYSE: JPM) reported decent quarterly results but hinted that investors who are waiting for the operating environment to improve need to continue to be patient.\nInvestors largely shrugged at the news, sending JP Morgan shares down as much as 3% on the day and down 1% as of 1:30 p.m. EDT.\nSolid quarter, subdued outlook\nJPMorgan is among the largest U.S. banks and there are few companies that investors follow more closely to gauge the overall health of the economy. The bank earned $4.40 per share in the second quarter on revenue of $51 billion, topping Wall Street expectations for $4.28 per share in earnings on sales of $50.2 billion.\nThe results got a $7.9 billion -- or about $2.04 per share -- boost thanks to a share exchange deal with Visa. Investment banking fees climbed 50% year over year, and equity trading revenue grew by 21%.\nCEO Jamie Dimon praised the bank's performance, but said he remains cautious about the quarters to come.\n\"While market valuations and credit spreads seem to reflect a rather benign economic outlook, we continue to be vigilant about potential tail risks,\" Dimon said. \"These tail risks are the same ones that we have mentioned before.\"\nThe CEO listed fiscal deficits, inflation, and \"potentially the most dangerous\" geopolitical situation since World War II as concerns.\nIs JPMorgan Chase stock a buy?\nDimon might be worried about the future, but there are few CEOs better equipped to handle whatever lies ahead. JPMorgan is a massive, well-diversified institution with significant capital reserves and exposure to all aspects of the U.S. economy.\nInvestors buying in today are unlikely to see technology-like stock returns, but this is a stock that should allow you to sleep well at night and deliver slow, reliable growth along with a dividend that currently yields more than 2%. For income-oriented investors and those looking for ballast, JP Morgan remains a solid choice.\nShould you invest $1,000 in JPMorgan Chase right now?\nBefore you buy stock in JPMorgan Chase, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and JPMorgan Chase wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $780,654!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nJPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. Lou Whiteman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends JPMorgan Chase and Visa. The Motley Fool has a disclosure policy.\nWhy JP Morgan Chase Stock Is Down Today was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/Why-Jp-Morgan-Chase-Stock-180233982.Html", "Sentiment_Score": -0.8549377918, "Sentiment_Category": "bearish"}, {"Ticker": "JPM", "Time": "2024-07-12T17:45:18.000Z", "Headline": "JPMorgan Chase (JPM) Q2 2024 Earnings Call Transcript", "Summary": "Image source: The Motley Fool.\nJPMorgan Chase (NYSE: JPM)\nQ2 2024 Earnings Call\nJul 12, 2024, 8:30 a.m. ET\nContents:\nPrepared Remarks\nQuestions and Answers\nCall Participants\nPrepared Remarks:\n\nOperator\nGood morning, ladies and gentlemen. Welcome to JPMorgan Chase's second quarter 2024 earnings call. This call is being recorded. Your line will be muted for the duration of the call.\nWe will now go live to the presentation. The presentation is available on JPMorgan Chase's website, and please refer to the disclaimer in the back concerning forward-looking statements. Please stand by. At this time, I would like to turn the call over to JPMorgan Chase's chief financial officer, Jeremy Barnum.\nMr. Barnum, please go ahead.\nJeremy Barnum -- Chief Financial Officer\nThank you, and good morning, everyone. Starting on Page 1. The firm reported net income of $18.1 billion, EPS of $6.12 on revenue of 51 billion, with an ROTCE of 28%. These results included the $7.9 billion net gain related to Visa shares and the $1 billion foundation contribution of the appreciated Visa stock.\nAlso included is 546 million of net investment securities losses in corporate. Excluding these items, the firm had net income of 13.1 billion, EPS of $4.40, and an ROTCE of 20%. Touching on a couple of highlights. In the CIB, IB fees were up 50% year on year and 17% quarter on quarter and markets revenue was up 10% year on year.\nShould you invest $1,000 in JPMorgan Chase right now?\nBefore you buy stock in JPMorgan Chase, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and JPMorgan Chase wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $780,654!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nIn CCB, we had a record number of first-time investors and strong customer acquisition across checking accounts and card, and we've continued to see strong net inflows across AWM. Now, before I give more detail on the results, I just want to mention that starting this quarter, we are no longer explicitly calling out the First Republic contribution in the presentation. Going forward, we'll only specifically call it out if it is a meaningful driver in the year-on-year comparison. As a reminder, we acquired First Republic in May of last year, so the prior-year quarter only has two months of First Republic results compared to the full three months this quarter.\nAlso, in the prior-year quarter, most of the expenses were in corporate, whereas now, they are primarily in the relevant line of business. Now, turning to Page 2 for the firmwide results. The firm reported revenue of 51 billion, up 8.6 billion or 20% year on year. Excluding both the Visa gain that I mentioned earlier, as well as last year's First Republic bargain purchase gain of 2.7 billion, revenue of 43.1 billion was up 3.4 billion or 9%.\nNII ex markets was up 568 million or 3%, driven by the impact of balance sheet mix and higher rates, higher revolving balances in card, and the additional month of First Republic-related NII, partially offset by deposit margin compression and lower deposit balances. NIR ex markets was up 7.3 billion or 56%. Excluding the items I just mentioned, it was up 2.1 billion or 21%, largely driven by higher investment banking revenue and asset management fees. Both periods included net investment securities losses.\nAnd markets revenue was up 731 million or 10% year on year. Expenses of 23.7 billion were up 2.9 billion or 14% year on year. Excluding the foundation contribution I previously mentioned, expenses were up 9%, primarily driven by compensation, including revenue-related compensation and growth in employees. And credit costs were 3.1 billion, reflecting net charge-offs of 2.2 billion and a net reserve build of 821 million.\nNet charge-offs were up 820 million year on year, predominantly driven by card. The net reserve build included 609 million in consumer and 189 million in wholesale. Onto balance sheet and capital on Page 3. We ended the quarter with a CET1 ratio of 15.3%, up 30 basis points versus the prior quarter, primarily driven by net income, largely offset by capital distributions and higher RWA.\nAs you know, we completed CCAR a couple of weeks ago and have already disclosed a number of the key points. Let me summarize them again here. Our preliminary SCB is 3.3%, although the final SCB could be higher. The preliminary SCB, which is up from the current requirement of 2.9%, results in a 12.3% standardized CET1 ratio requirement, which goes into effect in the fourth quarter of 2024.\nAnd finally, the firm announced that the board intends to increase the quarterly common stock dividend from $1.15 to $1.25 per share in the third quarter of 2024. Now, let's go to our businesses, starting with CCB on Page 4. CCB reported net income of 4.2 billion on revenue of 17.7 billion, which was up 3% year on year. In banking and wealth management, revenue was down 5% year on year, reflecting lower deposits and deposit margin compression, partially offset by growth in wealth management revenue.\nAverage deposits were down 7% year on year and 1% quarter on quarter. Client investment assets were up 14% year on year, predominantly driven by market performance. In home lending, revenue of 1.3 billion was up 31% year on year, predominantly driven by higher NII, including one additional month of the First Republic portfolio. Turning to card services and auto.\nRevenue was up 14% year on year, predominantly driven by higher card NII on higher revolving balances. Card outstandings were up 12% due to strong account acquisition and the continued normalization of revolve. And in auto, originations were 10.8 billion, down 10%, coming off strong originations from a year ago while continuing to maintain healthy margins. Expenses of 9.4 billion were up 13% year on year, predominantly driven by First Republic expenses now reflected in the lines of business, as I mentioned earlier, as well as field compensation and continued growth in technology and marketing.\nIn terms of credit performance this quarter, credit costs were 2.6 billion, reflecting net charge-offs of 2.1 billion, up 813 million year on year, predominantly driven by card as newer vintages season and credit normalization continues. The net reserve build was 579 million, also driven by card due to loan growth and updates to certain macroeconomic variables. Next, the commercial and investment bank on Page 5. Our new commercial and investment bank reported net income of 5.9 billion on revenue of 17.9 billion.\nYou'll note that we are disclosing revenue by business, as well as breaking down the banking and payments revenue by client coverage segment, in order to best highlight the relevant trends in both important dimensions of the wholesale franchise. This quarter, IB fees were up 50% year on year and we ranked No. 1 with year-to-date wallet share of 9.5%. In advisory, fees were up 45%, primarily driven by the closing of a few large deals and a weak prior-year quarter.\nUnderwriting fees were up meaningfully, with equity up 56% and debt up 51%, benefiting from favorable market conditions. In terms of the outlook, we're pleased with both the year-on-year and sequential improvement in the quarter. We remain cautiously optimistic about the pipeline, although many of the same headwinds are still in effect. It's also worth noting that pull-forward refinancing activity was a meaningful contributor to the strong performance in the first half of the year.\nPayments revenue was $4.5 billion, down 4% year on year as deposit margin compression and higher deposit-related client credits were largely offset by fee growth. Moving to markets. Total revenue was 7.8 billion, up 10% year on year. Fixed income was up 5%, with continued strength in securitized products.\nAnd equity markets was up 21%, with equity derivatives up on improved client activity, and we saw record revenue in prime on growth in client balances amid supportive equity market levels. Security services revenue was -- of 1.3 billion was up 3% year on year, driven by higher volumes and market levels, largely offset by deposit margin compression. Expenses of 9.2 billion were up 12% year on year, largely driven by higher revenue-related compensation, legal expense, and volume-related noncompensation expense. In banking and payments, average loans were up 2% year on year due to the impact of the First Republic acquisition and flat sequentially.\nDemand for new loans remains muted as middle market and large corporate clients remain somewhat cautious due to the economic environment and revolver utilization continues to be below pre-pandemic levels. Also, capital markets are open and are providing an alternative to traditional bank lending for these clients. In CRE, higher rates continue to suppress both loan origination and payoff activity. Average client deposits were up 2% year on year and relatively flat sequentially.\nFinally, credit costs were 384 million. The net reserve build of 220 million was primarily driven by incorporating the First Republic portfolio in the firm's modeled approach. Net charge-offs were 164 million, of which about half was in office. Then to complete our lines of business, AWM on Page 6.\nAsset and wealth management reported net income of 1.3 billion, with pre-tax margin of 32%. Revenue of 5.3 billion was up 6% year on year, driven by growth in management fees on higher average market levels and strong net inflows, as well as higher brokerage activity, largely offset by deposit margin compression. Expenses of 3.5 billion were up 12% year on year, largely driven by higher compensation, primarily revenue-related compensation and continued growth in our private banking advisor teams. For the quarter, long-term net inflows were 52 billion, led by equities and fixed income.\nAnd in liquidity, we saw net inflows of 16 billion. AUM of 3.7 trillion was up 15% year on year, and client assets of 5.4 trillion were up 18% year on year, driven by higher market levels and continued net inflows. And finally, loans and deposits were both flat quarter on quarter. Turning to corporate on Page 7.\nCorporate reported net income of 6.8 billion on revenue of 10.1 billion. Excluding this quarter's Visa-related gain and the First Republic bargain purchase gain in the prior year, NIR was up approximately 450 million year on year. NII was up 626 million year on year, driven by the impact of balance sheet mix and higher rates. Expenses of 1.6 billion were up 427 million year on year.\nExcluding foundation contribution, expenses were down 573 million year on year, largely as a result of moving First Republic-related expense out of corporate into the relevant segments. To finish up, we have the outlook on Page 8. Our 2024 guidance, including the drivers, remains unchanged from what we said at Investor Day. We continue to expect NII and NII ex markets of approximately 91 billion; adjusted expense of about 92 billion; and on credit, card net charge-off rate of approximately 3.4%.\nSo, to wrap up, the reported performance for the quarter was exceptional and actually represents record revenue and net income. But more importantly, after excluding the significant items, the underlying performance continues to be quite strong. And as always, we remain focused on continuing to execute with discipline. And with that, let's open the line for Q&A.\nQuestions & Answers:\n\nOperator\nPlease stand by. For our first question, we'll go to the line of Steven Chubak from Wolfe Research. Please go ahead.\nSteven Chubak -- Wolfe Research -- Analyst\nHi. Good morning, Jeremy.\nJeremy Barnum -- Chief Financial Officer\nGood morning, Steve.\nSteven Chubak -- Wolfe Research -- Analyst\nSo, I wanted to start off with a question on capital. Just given some indications that the fed is considering favorable revisions to both Basel III Endgame and the G-SIB surcharge calculations, which I know you've been pushing for for some time, as you evaluate just different capital scenarios, are these revisions material enough where they could support a higher normalized ROTCE at the firm versus the 17% target? And if so, just how that might impact or inform your appetite for buybacks going forward?\nJeremy Barnum -- Chief Financial Officer\nRight. OK, and thanks, Steve. And actually, before answering the question, I just want to remind everyone that Jamie is not able to join because he has a travel conflict overseas. So, it's just going to be me today.\nOK. Good question on the capital and the ROTCE. So, let me start with the ROTCE point first. In short, my answer to that question would be no.\nIt's hard to imagine a scenario coming out of the whole potential range of outcomes on capital that involves an upward revision on ROTCE. If you think about the way we've been talking about this, we've said that, you know, before the Basel III Endgame proposal, we had a 17% through-the-cycle target and that while you can imagine a range of different outcomes, the vast majority of them involve expansions of the denominator. And while we had ideas about changing the perimeter and repricing, all of which are still sort of in effect, you know, most of those would be thought of as mitigants rather than things that would actually like increase the ROTCE, and I don't really think that answer has, you know, particularly changed. So, as of now, that's what I would say, which is a good pivot to the next point, which is, yeah, we've been reading the same press coverage you've been reading, and, you know, it's fun and interesting to speculate about the potential outcomes here.\nBut in reality, we don't know anything you don't know. We don't know how reliable the press coverage is. And so, in that sense, I feel like on the overall capital return and buyback trajectory, not much has actually changed relative to what I laid out at Investor Day, the comment that I made then, the comments that Jamie made then, as well as the comments that Jamie made the subsequent week at an industry conference. So, maybe I'll just briefly summarize for everyone's benefit what we think that is, which is one, we do recognize that our current practice on capital return and buybacks does lead to an ever-expanding CET1 ratio.\nBut obviously, we're going to run the company over the cycle over time at a reasonable CET1 ratio with reasonable buffers relative to our requirements. So, after all the uncertainty is sorted out, the question of the deployment of the capital one way or another is a matter of when, not if. On the capital hierarchy, it's also worth noting that's another thing that remains unchanged. So, I'll review it quickly.\nYou know, growing the business organically and inorganically, sustainable dividend. And in that context, it's worth noting that the board's announced intention to increase it to $1.25 is a 19% increase prior to last year. So, that's a testament to our performance and that is a return of capital. And then finally, buybacks.\nThat hierarchy does not permit us to return 100% of the capital generation in any given quarter. And so, you know, as we sit here today, when you look at the relationship between the opportunity cost of not deploying the capital and the opportunities to deploy the capital outside the firm, it's kind of hard to imagine an environment where that relationship argues more strongly for patience. So, given all that, putting it all together, I'm sorry for the long answer, we remain comfortable with the current amount of excess capital. And as Jamie has said, we really continue to think about it as earnings in store as much as anything else.\nSteven Chubak -- Wolfe Research -- Analyst\nNo need to apologize, Jeremy. That was a really helpful perspective. Maybe just for my follow-up, on NII, you've been very consistent just in flagging the risks related to NII over-earning, especially in light of potential deposit attrition, as well as repricing headwinds. In the second quarter, we did see at least some moderation in repricing pressures.\nDeposit balances were also more resilient in what is a seasonally weak quarter for deposit growth. So, just given the evidence that some deposit pressures appear to be abating, do you see the potential for NII normalizing higher and where do you think that level could ultimately be in terms of stabilization?\nJeremy Barnum -- Chief Financial Officer\nYeah, interesting question, Steve. So, let's talk about deposit balances. So, yeah, I see your point about how balance pressures are slightly abating. You know, when you look at the system as a whole, just to go through it, you know, Q2 is still a bit of a headwind, loan growth is modest and not enough to offset that, and RRP seems to have settled in roughly at its current levels and there are reasons to believe that it might not go down that much more, although that could always change and that could supply extra reserves into the system.\nBut on balance, net across all those various effects, we still think that, you know, there are net headwinds to deposit balances. So, when we think of our balance outlook, we see it as, you know, flat to slightly down maybe, with our sort of market share and growth ambitions offsetting those systemwide headwinds. So, you know, in terms of normalizing higher, I guess it depends on relative to what, but, you know, I think it's definitely too early to be sort of calling the end of the over-earning narrative or the normalization narrative. Clearly, the main difference in our current guidance relative to what we had earlier in the year, which implied a lot more sequential decline, is, you know, just the change in the fed outlook.\nSo, two cuts versus six cuts is the main difference there. But, you know, obviously, based on the latest inflation data and so on, you could easily get back to a situation with a lot more cuts in the yield curve. So, we'll see how it goes. And in the end, we're kind of focused on just running the place, recognizing and trying not to be distracted by what remains some amount of over-earning, whatever it is.\nSteven Chubak -- Wolfe Research -- Analyst\nUnderstood, Jeremy. Thanks so much for taking my questions.\nJeremy Barnum -- Chief Financial Officer\nThanks, Steve.\nOperator\nNext, we'll go to the line of Saul Martinez from HSBC. Please go ahead.\nSaul Martinez -- HSBC -- Analyst\nHi. Good morning. Thanks for taking my question. Jeremy, can you give an update on the stress capital buffer? You noted obviously that you think there is an error in the fed's calculation due to OCI.\nCan you just give us a sense of what the dialogue with the fed looks like? Is there a process to modify the SCB higher, and if you can give us a sense of what that process looks like?\nJeremy Barnum -- Chief Financial Officer\nYeah. So, I'm not going to comment about any conversations with the fed. You know, the -- not to confirm or deny that they even exist. You know, that stuff is private.\nAnd, you know -- so -- and then if you talk about like the timing here, right, so you know that the stress capital buffer that's been released, the 3.3%, is a preliminary number. By rule, the fed has to release that by August 31st. It may come sooner. You know, you talked about an error in the calculation.\nWe haven't used that word. You know, what we know -- what we believe, rather, is that the amount of OCI gain that came through the fed's disclosed results looked not intuitively high to us, and, you know, if you adjust that in ways that we think are reasonable, you know, you would get a slightly higher stress capital buffer. Whether the fed agrees and whether they decide to make that change or not is up to them, and, you know, we'll see what happens. I think the larger point is that if you look at the industry as a whole and if you sort of put us into that with some higher pro forma SCB, whatever it might conceivably be, you actually see once again quite a bit of volatility in the year-on-year change in the stress capital buffer for many firms.\nAnd just sort of reiterating and another example of what we've said a lot over the years that it's volatile, it's untransparent, it makes it very hard to manage the capital of a bank, it leads to excessively high management buffers, and, you know, we think it's really not a great way to do things. So, I'll leave it at that.\nSaul Martinez -- HSBC -- Analyst\nOK. Got it. That's helpful. Just following up on capital returns, you know, on Steve's question, you know, I think you highlighted in response it's a matter of when, not if.\nAnd, you know, obviously, Jamie is not there. You know, you can't speak for Jamie. But it seems to have shown limited enthusiasm for, you know, a special dividend or, you know, buybacks at current valuations. Can you just give us a sense of, you know, how you're thinking about the various options, any updated thoughts on your special -- on a special dividend, and can you do other things like, for example, have a material increase in your dividend payout, sort of a step function increase where, you know -- and keep that flat and grow into that -- grow your earnings into that over time? Can you just maybe give us a sense of how you're thinking about what options you have available to deploy that capital?\nJeremy Barnum -- Chief Financial Officer\nSure. Yeah. I mean, I would direct you to read, I'm sure you have, you know, Jamie's comments at the industry conference where he participated the week after Investor Day because he went into a good amount of detail on this stuff, addressing some of these points. And I think his comment there about the special dividend was that it's not really our preference.\nYou know, we hear from people that many of our investors wouldn't find that particularly appealing. And he said as much that it wouldn't be sort of our first choice. So, I think the larger point is just that, to your -- a little bit to your question, there are a number of tools in the toolkit and they're really the same tools that are part of our capital hierarchy. So, first and foremost, we're, you know, looking to deploy the capital into organic or inorganic growth.\nAnd then, you know, the dividend, I think we're always going to want to keep it in that sort of like sustainable and also sustainable in a stressed environment. So, that continues to be the way we think about that. And then at the end of it, it's buybacks. And, you know, Jamie has been on the record for, you know, over a decade, I think, over many shareholder letters talking about, you know, how he thinks about price and buybacks and valuation, and, you know, price is a factor.\nSo, that's sort of the totality of the set of options, I guess.\nSaul Martinez -- HSBC -- Analyst\nOK. Great. Thanks a lot.\nJeremy Barnum -- Chief Financial Officer\nThanks, Saul.\nOperator\nNext, we'll go to the line of Ken Usdin from Jefferies. Please go ahead.\nKen Usdin -- Jefferies -- Analyst\nThanks a lot. Good morning, Jeremy. Jeremy, you know, great to see the progress on investment banking fees, you know, up sequentially and 50% year over year. And I saw you on the tape earlier, just talking about, you know, still regulatory concerns a little bit in the advisory space, and we clearly didn't see the debt pull-forward play through because your DCM was great again.\nI'm just wondering, you know, just where you feel the environment is, you know, relative to the potential and just, you know, where the dialogue is across the three main bucket areas in terms of like how does this feel in terms of a current environment versus a potential environment that we could still see ahead. Thanks.\nJeremy Barnum -- Chief Financial Officer\nYeah. Thanks, Ken. It's progress, right? I mean, we're happy to see the progress. You know, people have been talking about the depressed banking fee wallet for some time, and it's nice to see not only the year-on-year pop from a low base but also a nice sequential improvement.\nSo, that's the first thing to say. In terms of dialogue and engagement, it's definitely elevated. So, you know, as I -- the dialogue on ECM is elevated, and the dialogue on M&A is quite robust as well. So, all of those are good things that encourage us and make us hopeful that we could be seeing sort of a better trend in this space.\nBut there are some important caveats. So, on the DCM side, yeah, we made pull-forward comments in the first quarter, but we still feel that this second quarter still reflects a bunch of pull-forward; and therefore, we're reasonably cautious about the second half of the year. Importantly, a lot of the activity is refinancing activity, as opposed to, for example, acquisition finance. So, the fact that M&A remains still relatively muted in terms of actual deals has knock-on effects on DCM as well.\nAnd when a higher percentage of the wallet is refi, then the pull-forward risk becomes a little bit higher. You know, on ECM, if you look at it kind of at a remove, you might ask the question, given the performance of the overall indices, you would think it would be a really booming environment for IPOs, for example. And while it's improving, it's not quite as good as you would otherwise expect, and that's driven by a variety of factors, including the fact that, as has been widely discussed, the extent to which the performance of the large industries is driven by a few stocks. The sort of mid-cap tech growth space and other spaces that would typically be driving IPOs have had much more muted performance.\nAlso, a lot of the private capital that was raised a couple of years ago was raised at pretty high valuations. And so, you know, in some cases, people looking at IPOs could be looking at down rounds. That's an issue. You know -- and while secondary market performance of IPOs has improved meaningfully, in some cases, you know, people still have concerns about that.\nSo, those are a little bit of overhang on that space. I think we can hope that, over time, that fades away and the trend gets a bit more robust. And yeah, on the advisory side, you know, the regulatory overhang is there, remains there, and so we'll just have to see how that plays out.\nKen Usdin -- Jefferies -- Analyst\nGreat. Thank you for all that, Jeremy. And just one on the consumer side, just anything you're noticing in terms of people just have been waiting for this delinquency stabilization on the credit card side? Obviously, your loss rates are coming in as you expected, and we did see 30 days, you know, pretty flat and 90 days come down a little bit. Any -- is that seasonal? Is it just a good rate of change trend? Any thoughts there? Thanks.\nJeremy Barnum -- Chief Financial Officer\nYeah. I still feel like when it comes to card charge-offs and delinquencies, there's just not much to see there. It's still -- it's normalization, not deterioration. It's in line with expectations.\nYou know, as I say, we always look quite closely inside the cohorts, inside the income cohorts. And, you know, when you look in there, specifically, for example, on spend patterns, you can see a little bit of evidence of, you know, behavior that's consistent with a little bit of weakness in the lower-income segments where you see a little bit of rotation of the spend out of discretionary into nondiscretionary, but the effects are really quite subtle and, in my mind, definitely entirely consistent with the type of economic environment that we're seeing, which while very strong and certainly a lot stronger than anyone would have thought given the tightness of monetary conditions, say, like they'd been predicting it a couple of years ago or whatever, you know, you are seeing slightly higher unemployment, you are seeing moderating GDP growth. And so, it's not entirely surprising that you're seeing a tiny bit of weakness in some pockets of spend. So, it all kind of hangs together in what is, in some sense, actually, not a very interesting story.\nKen Usdin -- Jefferies -- Analyst\nThank you.\nJeremy Barnum -- Chief Financial Officer\nThanks, Ken.\nOperator\nNext, we'll go to the line of Glenn Schorr from Evercore ISI. Please go ahead.\nGlenn Schorr -- Evercore ISI -- Analyst\nHi. Thanks very much. So, Jeremy, the discussion so far around private credit and you all -- your recent comments have been the ability to add on balance sheet and compete when you need to compete on the private credit front. And I do think that most of that discussion has been about the direct lending component.\nSo, I'm curious if you're showing more progress and activity on that front. And then very importantly, do you see the same trend happening on the asset-backed finance side because that's a bigger part of the world and it's a bigger part of your business, so I'd appreciate your thoughts there? Thanks.\nJeremy Barnum -- Chief Financial Officer\nYeah. Thanks, Glenn. So, on private credit, so nothing really new to say there. I think -- I guess one way the environment is evolving a little bit is that, as you know, a lot of money has been raised, you know, in private credit funds looking for deals.\nAnd sort of a little bit to my prior comment, in a relatively muted acquisition finance environment, you know, at this point, you've got a lot of money chasing kind of like not that many deals. So, the space is a little bit quieter than it was at the margin. Another interesting thing to note is some of this discussion about kind of lender protections that were typical in the syndicated lender finance market making their way into the private market as well as sort of people realize that even in the private market, you probably need some of those protections in some cases, which is sort of supportive of the theme that we've been talking about about convergence between the direct lending space and the syndicated lending space, which is kind of our core thesis here, which is that we can offer, you know, best-in-class service across the entire continuum, including, you know, secondary market trading and so on. So, we feel optimistic about our offering there.\nI think the current environment is maybe a little bit quieter than it was. So, it's maybe not a great moment to like kind of test whether we're doing a lot more or less in this space, so to speak. And then on asset-backed financing, you actually asked me that question before, and at the time, my answer was that I hadn't heard much about that trend, and that continues to be the case. But clearly, there must be something I'm missing, so I can follow up on that and maybe we can have a chat about it.\nGlenn Schorr -- Evercore ISI -- Analyst\nNo, that's great for you if you're not hearing much about it so we can leave it at that. Maybe just one quick follow-up in terms of your just overall posturing on you were patient and smart when rates were low, waited to deploy, worked out great. We know that story. Now, it seems like you have tons of excess liquidity and you're being patient and rates are high.\nAnd I'm curious on how you think about what kind of triggers, what kind of things you're looking for in the market to know if and when you would extend duration.\nJeremy Barnum -- Chief Financial Officer\nRight. I mean, on duration, you know, in truth, we have actually added a little bit of duration over the last couple of quarters. So, you know, that's one thing to say. That was more last quarter than this quarter.\nBut I guess I would just caution you from -- a little bit away from looking at kind of our reported cash balances and our balance sheet and concluding that, you know, when you look at the duration concept holistically, that there is a lot to be done differently on the duration front. So, clearly, it's true that, empirically, we've behaved like very asset-sensitively in this rate hiking cycle, and that has resulted in a lot of excess NII generation sort of on the way up in the near term. But when we look at the firm's overall sensitivity to rates, we look at it through both like the EAIR-type lens, the short-term NII sensitivity, but also a variety of other lenses, including various types of scenario analysis, including impacts on capital from higher rates. And as I think Jamie has said a couple of times, we actually aim to be relatively balanced on that front.\nAlso, given like the inverted yield curve, it's not as if, you know, extending duration from these levels means that you're locking in, you know, 5.5% rates. In fact, you know, the forwards are not sort of that compelling given our views about some sort of structural upward pressures on inflation and so on. So, I think when you put that all together, I don't think that kind of a big change in duration posture is a thing that's front of mind for us.\nGlenn Schorr -- Evercore ISI -- Analyst\nSuper helpful. Thanks so much for that.\nJeremy Barnum -- Chief Financial Officer\nThanks, Glenn.\nOperator\nNext, we'll go to the line of Matt O'Connor from Deutsche Bank. Please go ahead.\nMatt O'Connor -- Deutsche Bank -- Analyst\nGood morning. I was just wondering if you could elaborate on, you know, essentially the math behind the ROTCE being too high at 20 and more normalized at 17. Obviously, you've pointed to over-earning on net NII. And I guess the question is, is that all of it to go from 20 to 17? And if so, is that all consumer deposit costs, or are there a few other components that you could help frame for us?\nJeremy Barnum -- Chief Financial Officer\nSure. Good question, Matt. I mean, I guess the way I think about it is a couple of things. Like, you know, our returns tend to be a bit seasonal, right? So, if you kind of build yourself out a full year forecast and make reasonable, just based on your own or analyst consensus or whatever, and you think about fourth quarter, like better to look at this on a full year basis when you think about the returns and the quarterly numbers.\nAnd you obviously have to strip out kind of the one-time items. And so, if you do that, like whatever you get for this year is still clearly a number that's higher than the 17%. So, yeah, one source of headwinds is normalization of the NII, primarily as a result of expected higher deposit costs. That's -- you know, we've talked about that.\nPart of it is also the yield curve effects. Some cuts will come into the curve at some point. And, you know, in the normal course, if you kind of do a very, very, very simple mental model of the company, you would have like expenses growing -- revenues growing at some organic GDP-like rate may be higher and expenses growing at a similar or slightly lower rate, producing a sort of relatively stable overhead ratio. But even if the amount of NII normalization winds up being less than we might have thought at some prior point, you still have some background -- you know, you still have some normalization of the overhead ratio that needs to happen.\nSo, as much as, you know, our discipline on expense management is, you know, as tight as it always has been, there -- inflation is still non-zero. There are still investments that we're executing. There's still, you know, higher expense to come in a slightly flatter revenue environment as a result of, in part, the normalization of NII. And then, you know, the final point is that whatever winds up being the answer on Basel III Endgame and all the other pieces, you have to assume some amount of expansion of the denominator, at least based on what we know so far.\nSo, of course, any of those pieces could be wrong, but that's kind of how we get to our 17%. And if you look at, you know, the various scenarios that we showed on the last page of my Investor Day presentation, it illustrates those dynamics and also, you know, how much the range could actually vary as a function of the economic environment and other factors.\nMatt O'Connor -- Deutsche Bank -- Analyst\nYeah, that was a really helpful chart. Just the one follow-up, on the yield curve effects, I guess, what do you mean by that because, right now, the yield curve is inverted? Maybe you're still, you know, bleeding in the impact of that. But kind of longer term, you'd expect a little bit of steepness of the curve, which I would think would help. But what do you mean by that? Thank you.\nJeremy Barnum -- Chief Financial Officer\nYeah. I mean, you and I have talked about this before. I guess I sort of -- I guess I don't really agree fundamentally with the notion that the way to think about things is that sort of yield curve steepness above and beyond what's priced in by the forwards is a source of structural NII or NIM for banks, if you know what I mean? Like -- I mean, people have different views about the so-called term premium. And obviously, in a moment of inverted curve and different types of Treasury supply dynamics, you know, people's thinking on that may be changing.\nBut I think we saw when rates were at zero and the 10-year note was below 2%, everyone sort of -- many people were kind of tempted to try to get extra NIM, extra NII by extending duration a lot. But, you know, when the steepness of the curve implies -- is driven by the expectation of actually aggressive fed tightening, you know, it's just a timing issue, and you can wind up kind of pretty offsides from a capital and other perspective. So, there are some interesting questions about whether fiscal dynamics might result in a structurally steeper yield curve down the road and whether that could be, you know, sort of earning the term premium, so to speak, could be a source of NII. But, you know, that feels a bit speculative to me at this point.\nMatt O'Connor -- Deutsche Bank -- Analyst\nGot it. OK. Thank you for the details.\nJeremy Barnum -- Chief Financial Officer\nThanks, Matt.\nOperator\nNext, we'll go to the line of Mike Mayo from Wells Fargo Securities. Please go ahead.\nMike Mayo -- Wells Fargo Securities -- Analyst\nHi. Jeremy, you said it's too early to end the over-earning narrative, and you highlighted higher deposit costs and the impact of lower rates and lower NII and DCM pull-forward and credit costs going higher. Anything I'm missing in that list, and what would cause you to end the over-earning narrative?\nJeremy Barnum -- Chief Financial Officer\nNo, actually, I think that is the right list, Mike. I mean, frankly, I think one thing that would end the over-earning narrative is if our annual returns were closer to 17%. I mean, to the extent that that is this through-the-cycle number that we believe and that we're currently producing more than that, that's one very simple way to look at that. But the pieces of that are the pieces that you've talked about, and the single most important piece is the deposit margin.\nYou know, our deposit margins are well above historical norms, and that is a big part of the reason that we still are emphasizing the over-earning narrative.\nMike Mayo -- Wells Fargo Securities -- Analyst\nYour 17% through-the-cycle ROTCE kind of expectation, what is the CET1 ratio that you assume for that?\nJeremy Barnum -- Chief Financial Officer\nI mean, we would generally assume, you know, requirements plus a reasonable buffer, which, depending on the shape of rules, could be a little bit smaller, a little bit bigger, and no small part is a function of the volatility of those rules, which goes back to my prior comments on, you know, SCB and CCAR. But obviously, as you well know, what actually matters is less the ratio and more the dollars. And at this point, the dollars are very much a function of where rules land and where the RWA lands and, obviously, things like G-SIB recalibration and so on. So, we've done, you know, a bunch of scenario analyses along the lines of what I did in Investor Day that informs those numbers, but that is obviously one big element of uncertainty behind that 17%, which is why, at Investor Day, when we talked about it, you know, both Daniel and I were quite specific about saying that we thought 17% was still achievable, assuming a reasonable outcome on the Basel III Endgame.\nMike Mayo -- Wells Fargo Securities -- Analyst\nLet me just zoom out for one more question on the return target. I mean, when I asked Jamie at the 2013 Investor Day, you know, would it make sense to have 13.5% capital, he was basically telling me to take a hike, right? And now, you have 15.3% capital, and you're saying, well, we might want to have a lot more capital here. I mean, at some point, if you're spending $17 billion a year to improve the company, if you're gaining share with digital banking, if you're automating the back office, if you're moving ahead with AI, if you're doing all these, you know, things that I think you say others aren't doing, why wouldn't those returns go higher over time, or do you just assume you'll be competing those benefits away? Thanks.\nJeremy Barnum -- Chief Financial Officer\nYeah. I mean, I think in short, Mike, you know -- and we've talked about this a lot, and Jamie has talked about this a lot, it's a very, very, very competitive market, and we're very happy with our performance. We're very happy with the share we've taken. And 17% is like an amazing number, actually.\nAnd, you know, like to be able to do that given how robust the competition is from banks, from nonbanks, from U.S. banks, from foreign banks, and all of the different businesses that we compete in is something that we're really proud of. So, you know, the number has a range around it obviously, so it's not a promise, it's not a guarantee, and it can fluctuate. But we're very proud to be in the ballpark of being able to think that we can deliver it, again assuming the reasonable outcome on the Basel III Endgame.\nBut it's a very, very, very competitive market across all of our products and services and regions and client segments.\nMike Mayo -- Wells Fargo Securities -- Analyst\nAll right. Thank you.\nOperator\nNext, we'll go to the line of Betsy Graseck from Morgan Stanley. Please go ahead.\nBetsy Graseck -- Morgan Stanley -- Analyst\nHi, Jeremy. Hi, Jeremy.\nJeremy Barnum -- Chief Financial Officer\nHi, Betsy.\nBetsy Graseck -- Morgan Stanley -- Analyst\nSo, I did want to ask one drill-down question on 2Q, and it's related to the dollar amount of buybacks that you did do. I think in the press release, right, in the slide deck, it's 4.9 billion common stock net repurchases. So, the question here is what's the governor for you on how much to do every quarter? And I mean, I understand it's a function of, OK, how much do we organically grow. You know, but even with that -- so you get the organic growth, which, you know, you had some nice movement there.\nBut you do the organic growth, and then, you know, is it how much do we earn and we want to buy back our earnings, or how should we be thinking about what that repurchase volume should be looking like over time? And, you know, I remember over at Investor Day the whole debate around I don't want to buy back my stock, but, you know, we are, right? So, I get this question from investors quite a bit of how should we be thinking about -- how you think about what the right amount is to be doing here?\nJeremy Barnum -- Chief Financial Officer\nYeah, that's a very good and fair question, Betsy. So, let me try to unpack it to the best of my ability. So, in no particular order. One thing that we've really tried to emphasize in a number of different settings, including in our recent 10-Qs, actually, is that we don't want to get into the business of guiding on buybacks.\nSo, we're going to buy back whatever we think makes sense in the current moment sort of -- and we reserve the right to sort of change that at any time. So, I recognize that not everyone loves that, but that is kind of a philosophical belief, and so I might as well say it explicitly. It was pretty clear in the Q also, but I'm just going to say that again. So, that's point one.\nBut having said that -- I mean, nonetheless, try to address your point on framework and governors. So, generally speaking, we think it doesn't make sense to sort of exit the market entirely, unless, you know, the conditions are much more unusual than they are right now, let's say. Obviously, when, for whatever reason, if we ever need to build capital in a hurry, we've done it before and we're always comfortable suspending buybacks entirely, but I think some modest amount of buybacks is a reasonable thing to do when you're generating your organic capital. And so, you know, we were talking before about this 2 billion pace.\nWe're kind of trying to move away from this notion of a pace, but that's where that idea comes from. Let's put it that way. You talked about the 4.9, which I recognize may seem like a little bit of a random number, but where that actually comes from is the other statement that we made that we have these, you know, significant item gains from Visa. And if you think about what that means, it means that we have, you know, post the acceptance of the exchange offer, a meaningful long position and a liquid large-cap financial stock, i.e., Visa, which realistically is highly correlated to our own stock.\nAnd so, in some sense, why carry that instead of just buying back JPMorgan stock? So, we talked about -- Jamie talked about, as we liquidate the Visa, deploying those proceeds into JPM, and that's what we did this quarter. So, that is why the 4.9 is a little higher, and it's consistent with my comments at Investor Day around having slightly increased the amount of buybacks. And, you know, beyond that, what you're left with is my answer to Steve's question, which is that, to your point about buying back earnings or whatever, you know, when we're generating these types of earnings and there's this much organic capital being generated, in the absence of opportunities to deploy it organically or inorganically and while continuing to maintain our healthy but sustainable dividend, you know, if we don't return the capital, we are going to keep growing the CET1 ratio to levels which, if you think about the long strategic outlook of the company, are not reasonable. They're just artificially high and unnecessary.\nSo, one way or the other, that will need to be addressed at some point. It's just that we don't feel that now is the right time.\nBetsy Graseck -- Morgan Stanley -- Analyst\nAll right. Thank you, Jeremy. Appreciate it.\nJeremy Barnum -- Chief Financial Officer\nThanks, Betsy.\nOperator\nNext, we'll go to the line of Gerard Cassidy from RBC Capital Markets. Please go ahead.\nGerard Cassidy -- RBC Capital Markets -- Analyst\nHi, Jeremy. How are you?\nJeremy Barnum -- Chief Financial Officer\nHi, Gerard.\nGerard Cassidy -- RBC Capital Markets -- Analyst\nJeremy, can you -- I know you touched on deposits earlier in the call in response to a question. I noticed on the average balances, the noninterest-bearing deposits were relatively stable quarter to quarter versus prior quarters when they've steadily declined. And this is one of the areas, of course, investors are focused on in terms of, you know, the future of the net interest margin for you and your peers. Can you elaborate, if you can, what you're seeing in that noninterest-bearing deposit account? I know this is average and not period end.\nThe period-end number may actually be lower. But what are you guys seeing here?\nJeremy Barnum -- Chief Financial Officer\nYeah, good question, Gerard. I have to be honest, I hadn't focused on that particular sequential explain, i.e., you know, quarter-on-quarter change and average noninterest-bearing deposits. But I think the more important question is the big-picture question, which is what do we expect -- I mean, how are we thinking about ongoing migration of noninterest-bearing into interest-bearing in the current environment and as -- and how that affects our NII outlook and our expectation for weighted average rate paid on deposits. And the answer to that question is that we do continue to expect that migration to happen.\nSo, if you think about it, you know, in the wholesale space, you know, you have a bunch of clients with some balances in noninterest-bearing accounts, and over time, for a variety of reasons, we do see them moving those balances into interest-bearing. So, we do continue to expect that migration to happen; and therefore, that will be a source of headwinds. And, you know, that migration sometimes happens internally, i.e., out of noninterest-bearing into interest-bearing or into CDs. Sometimes, it goes into money markets or into investments, which is what we see happening in our wealth management business.\nAnd, you know, some of it does leave the company. But one of the things that we're encouraged by is the extent to which we are actually capturing a large portion of that yield-seeking flow through CDs and money market offerings, etc. across our various franchises. So, big picture, I do think that migration out of noninterest-bearing into interest-bearing will continue to be a thing, and that is a contributor to the modest headwinds that we expect for NII right now.\nBut yeah, I'll leave it at that, I guess.\nGerard Cassidy -- RBC Capital Markets -- Analyst\nVery good. And as a follow-up, you've been very clear about the consumer credit card charge-offs and delinquency levels, and we all know about the commercial real estate office. One -- and you always talk about, you know, over-earning on net interest income. Of course, one of the great credit quality stories for everyone, including yourselves, is the C&I portfolio, how strong it's been for -- in this elevated rate environment.\nAnd I know your numbers are still quite low, but they're -- in the corporate investment bank, you had about a $500 million pickup in nonaccrual loans. Can you share with us what are you seeing in C&I? Are there any early signs of cracks or anything? And again, I know your numbers are still good, but I'm just trying to look forward to see if there's something here over the next 12 months or so.\nJeremy Barnum -- Chief Financial Officer\nYeah, it's a good question. I think the short answer is no, we're not really seeing early signs of cracks in C&I. I mean, yes, I agree with you, like the C&I charge-off rate has been very, very low for a long time. I think we emphasized that at last year's Investor Day.\nIf I remember correctly, I think the C&I charge-off rate over the preceding 10 years was something like literally zero. So, that is clearly very low by historical standards. And while we take a lot of pride in that number and I think it reflects the discipline in our underwriting process and the strength of our credit culture across bankers and the risk team, you know, that's not -- we don't actually run that franchise to like a zero loss expectation. So, you have to assume there will be some upward pressure on that.\nBut, you know, in any given quarter, you know, the C&I numbers tend to be quite lumpy and quite idiosyncratic. So, I don't think that anything in the current quarter's results is indicative of anything broader, and I haven't heard anyone internally talk that way, I will say.\nGerard Cassidy -- RBC Capital Markets -- Analyst\nGreat. Appreciate the insights, as always. Thank you.\nJeremy Barnum -- Chief Financial Officer\nThanks, Gerard.\nOperator\nNext, we'll go to the line of Erika Najarian from UBS. Please go ahead.\nErika Najarian -- UBS -- Analyst\nHi. Good morning. I just had one clean-up question, Jeremy. The consensus provision for 2024 is 10.7 billion.\nCould you maybe clarify for once and for all sort of Jamie's comments at an industry conference earlier and, you know, try to sort of triangulate if that 10.7 billion provision is appropriate for the growth level that you are planning for in card?\nJeremy Barnum -- Chief Financial Officer\nYeah, happy to clarify that. So, Jamie's comments were that the allowance to build and the card allowance, so we're talking about card specifically, we expected something like 2 billion for the full year. As I sit here today, our expectation for that number is actually slightly higher, but, you know, it's in the ballpark. And I think in terms of what that means for the consensus on the overall allowance change for the year, you know, last time I checked, it still looked a little low on that front.\nSo, who knows what it'll actually wind up being, but that remains our view. One question that we've gotten is, you know, how to reconcile that build to the 12%, you know, growth in OS that we've talked about because it seems like a little bit high relative to what you would have otherwise assumed if you apply some sort of a standard coverage ratio to that growth. But the reason that's the case is essentially a combination of higher revolving mix as we continue to see some normalization in revolve in that 12%, as well as seasoning of earlier vintages, which comes with slightly higher allowance per unit of OS growth.\nErika Najarian -- UBS -- Analyst\nGreat. Thank you.\nJeremy Barnum -- Chief Financial Officer\nThanks, Erika.\nOperator\nAnd for our final question, we'll go to the line of Jim Mitchell from Seaport Global Securities. Please go ahead.\nJim Mitchell -- Seaport Global Securities -- Analyst\nHey. Good morning. Maybe just one last question on sort of deploying excess capital. It seems like the two primary ways to do that organically would be through the trading book or the loan book.\nSo, maybe two questions there. One, trading assets were up 20% year over year. Is that you leaning into it or just a function of demand, and is there further opportunities to grow that? And then secondly, outside of cards, loan demand has been quite weak, and any thoughts from you on if you're seeing any change in demand or how you're thinking about loan demand going forward? Thanks.\nJeremy Barnum -- Chief Financial Officer\nThanks, Jim. Good questions. So, yeah, trading assets have been up. That is basically, you know, client activity, primarily secured financing-related, sort of matched book repo-type stuff and similar things that are -- gross up the balance sheet quite a bit but are quite low risk and, therefore, quite low RWA intensity.\nSo, while our ability to supply that financing to clients is something that we're happy about and is very much represents us leaning into the franchise to serve our clients, it's not really particularly RWA and, therefore, capital-intensive and, therefore, doesn't really reflect, you know, an aggressive choice on our part to deploy capital, so to speak. On the loan demand front, yeah, I mean, unfortunately, I just don't have much new to say there on loan demand, meaning, to your point, loan demand remains quite muted, you know, everywhere, except card. Our card business is, of course, in no way capital-constrained. So, whatever growth makes sense there in terms of our customer franchise and our ability to acquire accounts and retain accounts and what fits inside our credit risk appetite is growth that's going to make sense.\nAnd so, we're very happy to deploy capital to that, but it's not constrained by our willingness or ability to deploy capital to that. And of course, you know, for the rest of the loan space, the last thing that we're going to do is have the excess capital, meaning that we lean into, you know, lending that is not inside our risk appetite or inside our credit box, you know, especially in a world where spreads are quite compressed and terms are under pressure. So, there's always a balance between capital deployment and, you know, assessing economic risk rationally. And frankly, that is, in some sense, a microcosm of the larger challenge that we have right now.\nWhen I talked about if there was ever a moment where the opportunity cost of not deploying the capital relative to how attractive the opportunities outside the walls of the company are, now would be it in terms of being patient, that's a little bit one example of what I was referring to.\nJim Mitchell -- Seaport Global Securities -- Analyst\nRight. OK. Great. Thanks.\nJeremy Barnum -- Chief Financial Officer\nThanks, Jim.\nOperator\nAnd we have no further questions.\nJeremy Barnum -- Chief Financial Officer\nVery good. Thank you, everyone. See you next quarter.\nOperator\n[Operator signoff]\nDuration: 0 minutes\nCall participants:\nJeremy Barnum -- Chief Financial Officer\nSteven Chubak -- Wolfe Research -- Analyst\nSaul Martinez -- HSBC -- Analyst\nKen Usdin -- Jefferies -- Analyst\nGlenn Schorr -- Evercore ISI -- Analyst\nMatt O'Connor -- Deutsche Bank -- Analyst\nMike Mayo -- Wells Fargo Securities -- Analyst\nBetsy Graseck -- Morgan Stanley -- Analyst\nGerard Cassidy -- RBC Capital Markets -- Analyst\nErika Najarian -- UBS -- Analyst\nJim Mitchell -- Seaport Global Securities -- Analyst\nMore JPM analysis\nAll earnings call transcripts\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability.\nJPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. The Motley Fool has positions in and recommends JPMorgan Chase. The Motley Fool has a disclosure policy.\nJPMorgan Chase (JPM) Q2 2024 Earnings Call Transcript was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/Jpmorgan-Chase-Jpm-Q2-2024-174518621.Html", "Sentiment_Score": -0.0005051494, "Sentiment_Category": "neutral"}, {"Ticker": "JPM", "Time": "2024-07-12T17:21:38.000Z", "Headline": "Big Banks report Q2 earnings, Biden's NATO speech: Morning Brief", "Summary": "Stocks (^DJI, ^IXIC, ^GSPC) are in summer mode this session, hoping to end the second trading week of July on a high note and get to the weekend. Seana Smith and Brad Smith guide investors through the hustle-and-bustle of this busy Friday morning, bringing on top analysts and experts to discuss the biggest market themes and political stories.\nIn this episode of The Morning Brief, major banks JPMorgan Chase & Co. (JPM), Wells Fargo (WFC), and Citigroup (C) report their second quarter earnings results, officially kicking off earnings season. HSBC head of US financials research Paul Martinez joins the show to discuss the Big Banks' results and what each of their net interest income (NII) is signaling about the industry as a whole.\nMore and more Democratic donors and lawmakers are calling for President Biden to step aside as the assumed party nominee in the 2024 election. Brookings Institution senior fellow in governance studies and Washington Post columnist EJ Dionne Jr. comes onto the program to talk on Biden's foreign policy strengths in his NATO summit speech, which did all but quiet his critics.\nOther top trending tickers on the Yahoo Finance platform include Tesla (TSLA); Bank of New York Mellon (BK) as it topped second-quarter earnings estimates; and AT&T (T) and Snowflake (SNOW) after the former revealed the scope of its 2022 customer data breach.\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Big-Banks-Report-Q2-Earnings-172138280.Html", "Sentiment_Score": 0.0369550735, "Sentiment_Category": "neutral"}]}