{"timestamp": "20240719_134604", "data": [{"Ticker": "GS", "Time": "2024-07-19T11:15:11.000Z", "Headline": "Goldman Sachs welcomes partners in M&A", "Summary": "Haidee Lee and Carsten Woehrn have been appointed as partners and global co-heads of sponsor M&A and co-head of M&A in EMEA, by Goldman Sachs Group.\nPrior to joining JP Morgan, Woehrn and Lee held the position of global co-heads of the M&A franchise for the Strategic Investor Group. Additionally, Woehrn led EMEA M&A as co-head.\nLee, who is based in New York, will work with David Kamo as the global co-head of Sponsor M&A. She left Goldman Sachs to work as a managing director in the M&A division before returning. Her last position at Credit Suisse was Head of the Sellside M&A Group.\nLee has dedicated the last 25 years to the creation and completion of M&A deals for private equity clients as well as family, founder-owned, and privately held companies in a variety of industries.\nMoreover, Woehrn will work with Nimesh Khiroya as co-head of M&A in EMEA, with a base in London. Together with regional leadership, he will aim to expand and enhance the European franchise.\nWoehrn oversaw the group's Infrastructure M&A franchise in Europe before taking on his most recent positions at JP Morgan. He has over ten years of experience in the New York-based North American M&A Group of JP Morgan, where he concentrated on deals in the energy, transportation, and healthcare sectors.\nMoreover, earlier this month, Canoe Intelligence completed its Series C funding round of $36m, led by Growth Equity at Goldman Sachs Alternatives with aid from existing investors.\nThis latest round for Canoe represents a 3x increase in company value since its Series B funding in 2023.\nWith the additional investment, Canoe will continue its investment in building proprietary AI and machine learning technology.\nThrough its automated infrastructure, Canoe drives improvements in data accuracy and access, team efficiency, and client satisfaction for investors.\n\"Goldman Sachs welcomes partners in M&A\" was originally created and published by Private Banker International, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Sachs-Welcomes-Partners-M-111511297.Html", "Sentiment_Score": 0.280195117, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-19T11:00:00.000Z", "Headline": "3 Goldman Sachs Mutual Funds to Lend Solidity to Your Portfolio", "Summary": "Goldman Sachs Asset Management (GSAM) is a world-renowned company that has been providing investment management, portfolio design and advisory services to individual and institutional investors worldwide since 1988. Its strategies span asset classes, industries and geographies. As of Dec 31, 2023, GSAM had $2.81 trillion in assets under supervision worldwide.\nThe fund has more than 2,000 professionals across 31 offices worldwide. The company has a team of more than 800 investment professionals who capitalize on Goldman Sachs technology, risk-management skills and market insights. It offers investment solutions, including fixed income, money markets, public equity, commodities, hedge funds, private equity and real estate through proprietary strategies, strategic partnerships and open architecture programs.\nBelow, we share with you three top-ranked Goldman Sachs mutual funds, namely Goldman Sachs MLP Energy Infrastructure Fund GMNPX, Goldman Sachs Focused Value GGYPX and Goldman Sachs Large Cap Value GMYPX. Each has earned a Zacks Mutual Fund Rank #1 (Strong Buy) and is expected to outperform its peers in the future. Investors can click here to see the complete list of funds.\nGoldman Sachs MLP Energy Infrastructure Fund invests most of its assets, along with borrowings, if any, in domestic and foreign equity or fixed-income securities issued by energy infrastructure companies. GMNPX advisors may also invest a small portion of its assets in non-energy infrastructure investments.\nGoldman Sachs MLP Energy Infrastructure Fund has three-year annualized returns of 21%. As of February 2024, GMNPX held 34 issues, with 12.6% of its assets invested in Energy Transfer.\nGoldman Sachs Focused Value invests most of its assets, along with borrowings, if any, in a portfolio of equity securities, including common stocks, preferred stocks, and other securities and instruments having equity characteristics. GGYPX advisors generally invest in companies that they believe have competitive advantages and sustainable growth potential, and whose intrinsic value is not reflected in the stock price.\nGoldman Sachs Focused Value fund has three-year annualized returns of 8.4%. GGYPX has an expense ratio of 0.68%.\nGoldman Sachs Large Cap Value invests most of its assets, along with borrowings, if any, in a portfolio of publicly traded domestic equity securities of large-cap companies. GMYPX advisors may also invest in foreign issues, including emerging markets securities quoted in foreign currencies.\nGoldman Sachs Large Cap Value Fund has three-year annualized returns of 7.8%. Kevin Martens has been one of the fund managers of GMYPX since December 2019.\nTo view the Zacks Rank and the past performance of all Goldman Sachs mutual funds, investors can click here to see the complete list of Goldman Sachs mutual funds.\nWant key mutual fund info delivered straight to your inbox?\nZacks’ free Fund Newsletter will brief you on top news and analysis, as well as top-performing mutual funds, each week. Get it free >>\n\nView All Zacks #1 Ranked Mutual Funds\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nGet Your Free (GMNPX): Fund Analysis Report\nGet Your Free (GGYPX): Fund Analysis Report\nGet Your Free (GMYPX): Fund Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/3-Goldman-Sachs-Mutual-Funds-110000428.Html", "Sentiment_Score": 0.2193564773, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-18T22:59:11.000Z", "Headline": "Are Analysts Bullish on The Goldman Sachs Group, Inc. (GS) Right Now?", "Summary": "We recently compiled a list of the 10 Best Financial Stocks To Buy According to Hedge Funds. In this article, we are going to take a look at where The Goldman Sachs Group, Inc. (NYSE:GS) stands against the other financial stocks.\nThe financial services industry in the US is poised for a dynamic and challenging year ahead, shaped by a confluence of economic, technological, and regulatory factors. The global economy is anticipated to grow modestly, with advanced economies like the US expecting around 1.4% growth. This is influenced by ongoing geopolitical tensions, climate-related disruptions, and persistently high inflation rates. These macroeconomic conditions are expected to significantly impact the operations and profitability of financial institutions. High interest rates have been a double-edged sword for the industry. While they have led to substantial increases in net interest income, particularly for larger banks, they have also driven up funding costs, especially for smaller and regional banks, squeezing their margins. According to Deloitte, the Federal Reserve's monetary policy will be crucial, with expectations that rates will remain elevated initially but may decrease later in the year. This will necessitate careful management of the balance between deposit rates and lending rates to sustain profitability. Economic uncertainty and the potential for slower growth have prompted banks to increase their loan loss provisions as a precautionary measure to cover potential defaults. This trend is expected to persist, reflecting a cautious approach to managing credit risk amidst economic volatility and increased regulatory scrutiny.\nConcurrently, the financial services sector is experiencing significant technological shifts. Advances in AI and generative AI are set to transform various aspects of the industry, from retail investing and fraud detection to insurance offerings. However, these advancements also introduce new risks, such as heightened fraud potential and the need for robust cybersecurity measures. On the regulatory front, changes are becoming more stringent, particularly around climate-related disclosures and sustainability. Financial institutions are required to adapt to these new regulations aimed at enhancing transparency and effectively managing climate risks. These regulatory changes, coupled with technological advancements, are forcing financial institutions to innovate and evolve their business models and strategies. Overall, banks and financial institutions must remain agile and proactive, navigating these multifaceted challenges to maintain profitability and drive growth in 2024. This will involve balancing the benefits and risks of high interest rates, managing loan loss provisions prudently, leveraging technological advancements, and complying with evolving regulatory requirements.\nIn a recent development, major U.S. banks withstood a hypothetical 40% decline in commercial real estate values in the U.S. Federal Reserve's annual health test, which alleviated concerns about the banking sector amid rising interest rates. With increasing risks in the commercial real estate (CRE) sector, investors were keenly observing the Fed's stress tests to gauge the exposure of American lenders at a time when pandemic-era work patterns have left office towers largely vacant, pushing vacancy rates to a historic high of 20%. Chris Marinac, head of research at Janney Montgomery Scott, commented, “In many ways, there should be a sense of relief that banks can endure a severe crisis. However, this doesn’t mean the Fed believes commercial real estate is in the clear. We are still in the early stages of this credit cycle”. The Fed's stress tests evaluate banks' balance sheets against a hypothetical severe economic downturn, including a 36% drop in U.S. home prices, a 55% plunge in equity prices, and an unemployment rate of 10%, reported Reuters.\nResults of the stress test released recently showed that banks could continue lending to households and businesses in the event of a severe global recession and indicated the capital needed to be deemed healthy and to determine how much they can return to shareholders through dividends and buybacks. The 31 large banks tested demonstrated they had enough capital to absorb nearly $685 billion in losses. This test comes over a year after the collapse of mid-sized lenders like Silicon Valley Bank, Signature Bank, and First Republic, which sparked criticism that the Fed had underestimated banks' vulnerabilities to rising interest rates, previously assuming rates would fall during a severe recession. Commercial office space is a significant concern, with $929 billion of the $4.7 trillion in outstanding commercial mortgages maturing in 2024, according to the Mortgage Bankers Association. This approaching maturity wall occurs amid declining property values and reduced rental income. Analysts foresee a challenging period for CRE, with banks still having \"considerable concentration risks,\" according to Moody's Ratings. Of the banks tested, Goldman Sachs had the highest projected loan loss for commercial real estate at 15.9%, followed by RBC USA (15.8%), Capital One (14.6%), and Northern Trust (13%). One critique from analysts is that the Fed's stress test did not include regional banks, which hold most of the CRE loans and are less regulated than their larger counterparts.\nOver the coming months, senior leaders in the financial services industry anticipate a challenging landscape marked by high interest rates, increased regulatory scrutiny, and persistent inflation concerns. While these trends are familiar to industry veterans, many younger employees have not encountered such conditions before. According to Deloitte, leaders will need to guide their teams through uncertainty, focusing on navigating near-term challenges and identifying potential opportunities. Looking ahead, rapid technological advancements—including generative AI, cloud migration, heightened fraud and cyber risks, and the convergence of industries through embedded finance—will demand unprecedented agility from financial services leaders. Adapting to these changes will require creating new strategic pathways to align with evolving market dynamics. Throughout history, the financial services sector has often driven progress by helping organizations and individuals navigate economic and societal shifts. By the end of this decade, 2024 may be recognized as a pivotal year when the future began to materialize in tangible ways. Investing now in innovative products and services that foster positive outcomes could position firms for sustained competitive advantage in the years ahead.\nOur Methodology\nWe leveraged Insider Monkey’s comprehensive database of 920 prominent hedge funds to identify the top 10 financial stocks with the highest level of hedge fund investment as of Q1 2024. These stocks are listed in order of increasing hedge fund ownership, providing insight into the most popular financial stocks among elite investors.\nA close-up of a financial advisor giving advice to a customer, demonstrating the importance of consumer and wealth management.\nThe Goldman Sachs Group, Inc. (NYSE:GS)\nNumber of Hedge Fund Holders: 72\nThe Goldman Sachs Group, Inc. (NYSE:GS) announced on May 29 that it raised over $20 billion for private credit investments, reflecting growing interest in the asset class. This includes closing West Street Loan Partners V at $13.1 billion and securing $7 billion from senior direct lending accounts, along with $550 million from co-investment vehicles. Institutional investors like pension plans, insurance companies, and sovereign wealth funds, alongside clients from Goldman Sachs Private Wealth Management and third-party channels, participated. James Reynolds, global head of Direct Lending at Goldman Sachs Alternatives, highlighted strong demand from financial sponsors in the senior direct lending market. In the first quarter of 2024, there were 72 hedge funds holding positions in The Goldman Sachs Group, Inc. (NYSE:GS), as compared to 69 in the previous quarter according to Insider Monkey’s database. The total value of these holdings is approximately $6.87 billion. Ken Fisher's Fisher Asset Management held the largest stake among these hedge funds during this period.\nAriel Focus Fund stated the following regarding The Goldman Sachs Group, Inc. (NYSE:GS) in its fourth quarter 2023 investor letter:\n“Global investment bank, The Goldman Sachs Group, Inc. (NYSE:GS), also increased in the period on solid earnings results. The top-line came in strong led by elevated financing activity and an improvement in advisory revenues, despite weak transaction volumes within the investment banking segment. Should conditions remain conducive, management remains cautiously optimistic the business will experience continued recovery in both capital markets and strategy activity. Meanwhile, GS continues to successfully execute on its strategic initiatives to improve the overall return of the company. It is right sizing headcount and narrowing its ambitions in consumer strategy through divestitures and an enhanced focus on driving profitability in Platform Solutions by 2025. With potential regulatory capital constraints from B3E, GS noted it will reign in buybacks over the short-term but maintain its dividend. Looking ahead, we continue to view the near and long-term outlook for Goldman as attractive at current levels, given favorable business trends, continued positive momentum on strategic initiatives and active expense/capital management programs.”\nOverall GS ranks 9th on our list of the best financial stocks to buy. You can visit 10 Best Financial Stocks To Buy According to Hedge Funds to see the other financial stocks that are on hedge funds’ radar. While we acknowledge the potential of GS as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than GS but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n READ NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These 10 Stocks in June.\n Disclosure: None. This article is originally published at Insider Monkey.", "Link": "Https://Finance.Yahoo.Com/News/Analysts-Bullish-Goldman-Sachs-Group-225911103.Html", "Sentiment_Score": -0.072699599, "Sentiment_Category": "bearish"}, {"Ticker": "GS", "Time": "2024-07-18T20:31:00.000Z", "Headline": "Betterment Brings Goldman’s Tax-Efficient Bond Portfolios to Main Street", "Summary": "The new fixed-income portfolios offering is available to the robo advisor’s retail investors and will soon be available to financial advisors who custody client assets at Betterment.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/9B7E2A31-8Aaf-34D8-Af28-651Ce41135A5/Betterment-Brings-Goldman%E2%80%99S.Html", "Sentiment_Score": 0.8744979501, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-18T17:33:44.000Z", "Headline": "Goldman Sachs names senior dealmakers in reshuffle, memo says", "Summary": "(Refiles to fix typographical error in paragraph 1)\nLONDON (Reuters) - Goldman Sachs has made a handful of senior leadership appointments within its investment banking team, according to an internal memo seen by Reuters.\nThe company named former JPMorgan banker Carsten Woehrn as joint co-head of M&A in Europe, the Middle East and Africa (EMEA) to \"grow and develop our European franchise,\" the memo said.\nWoehrn led JPMorgan's Infrastructure M&A franchise in Europe and has focused on transactions in healthcare, energy and transportation.\nGoldman Sachs has also appointed Nimesh Khiroya as co-head of M&A in EMEA. Khiroya, previously head of activism and shareholder advisory in EMEA and Nordic M&A, will continue his role as co-head of UK Investment Banking.\nThe memo also confirmed Haidee Lee is returning to Goldman Sachs as global co-head of Sponsor M&A, having left the bank for JPMorgan in 2021. Lee served as co-head of strategic investor group mergers & acquisitions at JPMorgan.\nLee will work alongside David Kamo, global co-head of Sponsor M&A, and will be based in New York.\nThe leadership changes were announced as M&A activity is starting to pick up. M&A volumes hit $1.6 trillion globally in the first half of the year, up 20% from a year earlier, Reuters previously reported.\nEquity capital market volumes climbed 10% during the same period. Wall Street banks reported a healthier pipeline for deals and a jump in investment banking activity in quarterly earnings last week.\n(Reporting by Amy-Jo Crowley; Editing by Paul Simao)", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Sachs-Names-Senior-Dealmakers-173344705.Html", "Sentiment_Score": -0.0459862426, "Sentiment_Category": "neutral"}, {"Ticker": "GS", "Time": "2024-07-18T14:30:00.000Z", "Headline": "Betterment and Goldman Sachs Launch Industry-First Tax-Smart Bonds Portfolio", "Summary": "Betterment to Personalize Strategies for Investors Seeking After-Tax Yield\nNEW YORK, July 18, 2024 /PRNewswire/ -- Betterment and Goldman Sachs Asset Management are excited to announce the launch of the Goldman Sachs Tax-Smart Bonds portfolio. This industry-first portfolio leverages Goldman Sachs' expertise in bond markets and Betterment's automation. The portfolio seeks to generate after-tax yield.\nBetterment\nThe Goldman Sachs Tax-Smart Bonds portfolio is designed for Betterment clients in higher tax brackets, who want to access a tax-smart bond strategy which is potentially lower risk than equity investing. While high-interest cash savings products can be beneficial for shorter-term needs, taxes can reduce yields over time. This new portfolio offers short-duration bond exchange-traded funds (ETFs), with holdings that Betterment will personalize for its customers based on their tax situation.\nBy combining short-duration US Treasury bonds, high-quality corporate bonds and municipal bond ETFs, Goldman Sachs designed this innovative strategy to marry longer-term trends with current bond market conditions, rather than maintaining static allocations over time. This approach can adjust the strategy for events that might create volatility such as the COVID-19 pandemic and US debt ceiling debates. The portfolio strategy considers market conditions and taxable equivalent yields monthly, and Betterment may make adjustments, based on individual tax brackets, as appropriate. Betterment then personalizes portfolio allocations for its clients' individual tax situations to seek to generate higher after-tax yield.\n\"We are thrilled to collaborate with Goldman Sachs to bring an innovative bond portfolio to Betterment customers,\" said Sarah Levy, CEO of Betterment. \"We continue to work tirelessly to provide investment products that support our customers in their long-term wealth-building journey.\"\n\"It is important for investors seeking to create and safeguard long-term wealth to consider after-tax returns in their portfolios,\" said Padideh Raphael, Global Head of Third Party Wealth at Goldman Sachs Asset Management. \"This latest collaboration, combining Goldman Sachs's investment capabilities with Betterment's innovative technology platform and customer-first approach, will allow us to work together on behalf of clients who seek attractive after-tax bond yields.\"\nFor more information about the Goldman Sachs Tax-Smart Bonds portfolio, please visit Betterment's website.\nAbout Betterment\nBetterment LLC (\"Betterment\") is the largest independent digital financial advisor, using automated technology powered by human expertise to fulfill a singular mission: making people's lives better. With easy-to-use saving, investing, and retirement solutions, Betterment is built to help people optimize their money, no matter their level of experience or how the market is doing. Launched in 2010, Betterment helps more than 850,000 customers manage over $45 billion with curated selections of low-cost, expert-built investing portfolios; personalized guidance; and tax-smart tools. The company has received multiple awards for its investing app, including Buy Side from WSJ (2024) and Bankrate (2024). Learn more and for additional disclosure on these awards, visit https://www.betterment.com/#award-disclosure.\nAbout Goldman Sachs Asset Management\nGoldman Sachs Asset Management is the primary investing area within Goldman Sachs (NYSE: GS), delivering investment and advisory services across public and private markets for the world's leading institutions, financial advisors and individuals. The business is driven by a focus on partnership and shared success with its clients, seeking to deliver long-term investment performance drawing on its global network and deep expertise across industries and markets. Goldman Sachs Asset Management is a leading investor across fixed income, liquidity, equity, alternatives and multi-asset solutions. Goldman Sachs oversees more than $2.9 trillion in assets under supervision as of June 30, 2024. Follow us on LinkedIn.\nContact info: Media@betterment.com\nEach service provider mentioned is solely responsible for the information provided on its services and fees, and for its performance of its services. Information provided by Betterment is not verified by GSAM. Inclusion of Goldman Sachs' or GSAM's name or logo on Betterment's website, advertisements, or any other communications does not indicate that the information contained therein is provided or approved by Goldman Sachs.\nBetterment, not Goldman Sachs, is responsible for its advisory relationships with clients.\nAssets Under Supervision includes assets under management and other client assets for which Goldman Sachs does not have full discretion.\nGoldman Sachs does not provide legal, tax or accounting advice. Goldman Sachs clients should obtain independent tax advice based on their particular situation.\nBetterment, not GSAM, is responsible for monitoring wash sales and any other potential loss disallowance as a result of disposition of a security in the portfolio.\nInvestment returns may vary. Not a guarantee of future performance; investing involves risk, including loss of principal. To review historical performance, please visit https://www.betterment.com/goldman-sachs-tax-smart-bonds-portfolio.\nGoldman Sachs\nCision\nView original content to download multimedia:https://www.prnewswire.com/news-releases/betterment-and-goldman-sachs-launch-industry-first-tax-smart-bonds-portfolio-302199880.html\nSOURCE Betterment", "Link": "Https://Finance.Yahoo.Com/News/Betterment-Goldman-Sachs-Launch-Industry-143000666.Html", "Sentiment_Score": 0.152320683, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-18T10:50:54.000Z", "Headline": "Goldman Sachs Group (NYSE:GS) Is Paying Out A Larger Dividend Than Last Year", "Summary": "The board of The Goldman Sachs Group, Inc. (NYSE:GS) has announced that it will be paying its dividend of $3.00 on the 27th of September, an increased payment from last year's comparable dividend. This takes the annual payment to 2.4% of the current stock price, which is about average for the industry.\nView our latest analysis for Goldman Sachs Group\nGoldman Sachs Group's Dividend Is Well Covered By Earnings\nUnless the payments are sustainable, the dividend yield doesn't mean too much. Goldman Sachs Group is quite easily earning enough to cover the dividend, however it is being let down by weak cash flows. With the company not bringing in any cash, paying out to shareholders is bound to become difficult at some point.\nThe next year is set to see EPS grow by 27.2%. Assuming the dividend continues along recent trends, we think the payout ratio could be 34% by next year, which is in a pretty sustainable range.\nhistoric-dividend\nGoldman Sachs Group Has A Solid Track Record\nThe company has an extended history of paying stable dividends. Since 2014, the dividend has gone from $2.00 total annually to $12.00. This means that it has been growing its distributions at 20% per annum over that time. It is good to see that there has been strong dividend growth, and that there haven't been any cuts for a long time.\nThe Dividend Has Growth Potential\nSome investors will be chomping at the bit to buy some of the company's stock based on its dividend history. It's encouraging to see that Goldman Sachs Group has been growing its earnings per share at 5.2% a year over the past five years. With a decent amount of growth and a low payout ratio, we think this bodes well for Goldman Sachs Group's prospects of growing its dividend payments in the future.\nOur Thoughts On Goldman Sachs Group's Dividend\nOverall, we always like to see the dividend being raised, but we don't think Goldman Sachs Group will make a great income stock. While the low payout ratio is a redeeming feature, this is offset by the minimal cash to cover the payments. We don't think Goldman Sachs Group is a great stock to add to your portfolio if income is your focus.\nIt's important to note that companies having a consistent dividend policy will generate greater investor confidence than those having an erratic one. Still, investors need to consider a host of other factors, apart from dividend payments, when analysing a company. As an example, we've identified 2 warning signs for Goldman Sachs Group that you should be aware of before investing. Looking for more high-yielding dividend ideas? Try our collection of strong dividend payers.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Sachs-Group-Nyse-Gs-105054302.Html", "Sentiment_Score": 0.8560347557, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-18T10:20:05.000Z", "Headline": "Should Goldman Sachs MarketBeta U.S. 1000 Equity ETF (GUSA) Be on Your Investing Radar?", "Summary": "Designed to provide broad exposure to the Large Cap Blend segment of the US equity market, the Goldman Sachs MarketBeta U.S. 1000 Equity ETF (GUSA) is a passively managed exchange traded fund launched on 04/05/2022.\nThe fund is sponsored by Goldman Sachs Funds. It has amassed assets over $1.73 billion, making it one of the larger ETFs attempting to match the Large Cap Blend segment of the US equity market.\nWhy Large Cap Blend\nCompanies that find themselves in the large cap category typically have a market capitalization above $10 billion. Overall, they are usually a stable option, with less risk and more sure-fire cash flows than mid and small cap companies.\nBlend ETFs are aptly named, since they tend to hold a mix of growth and value stocks, as well as show characteristics of both kinds of equities.\nCosts\nInvestors should also pay attention to an ETF's expense ratio. Lower cost products will produce better results than those with a higher cost, assuming all other metrics remain the same.\nAnnual operating expenses for this ETF are 0.11%, making it one of the least expensive products in the space.\nIt has a 12-month trailing dividend yield of 1.20%.\nSector Exposure and Top Holdings\nEven though ETFs offer diversified exposure that minimizes single stock risk, investors should also look at the actual holdings inside the fund. Luckily, most ETFs are very transparent products that disclose their holdings on a daily basis.\nThis ETF has heaviest allocation to the Information Technology sector--about 26.70% of the portfolio. Financials and Healthcare round out the top three.\nLooking at individual holdings, Microsoft Corp (MSFT) accounts for about 6.32% of total assets, followed by Apple Inc (AAPL) and Nvidia Corp (NVDA).\nThe top 10 holdings account for about 30.98% of total assets under management.\nPerformance and Risk\nGUSA seeks to match the performance of the SOLACTIVE GBS US 1000 INDEX before fees and expenses. The Solactive GBS United States 1000 Index measures the performance of equity securities of large and mid-capitalization equity issuers covering approximately the largest 1,000 of the free-float market capitalization in the United States.\nThe ETF has gained about 17.14% so far this year and is up about 24.32% in the last one year (as of 07/18/2024). In the past 52-week period, it has traded between $35.52 and $48.82.\nThe ETF has a beta of 1.01 and standard deviation of 17.83% for the trailing three-year period. With about 1013 holdings, it effectively diversifies company-specific risk.\nAlternatives\nGoldman Sachs MarketBeta U.S. 1000 Equity ETF carries a Zacks ETF Rank of 3 (Hold), which is based on expected asset class return, expense ratio, and momentum, among other factors. Thus, GUSA is a good option for those seeking exposure to the Style Box - Large Cap Blend area of the market. Investors might also want to consider some other ETF options in the space.\nThe iShares Core S&P 500 ETF (IVV) and the SPDR S&P 500 ETF (SPY) track a similar index. While iShares Core S&P 500 ETF has $504.65 billion in assets, SPDR S&P 500 ETF has $556.35 billion. IVV has an expense ratio of 0.03% and SPY charges 0.09%.\nBottom-Line\nWhile an excellent vehicle for long term investors, passively managed ETFs are a popular choice among institutional and retail investors due to their low costs, transparency, flexibility, and tax efficiency.\nTo learn more about this product and other ETFs, screen for products that match your investment objectives and read articles on latest developments in the ETF investing universe, please visit Zacks ETF Center.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nGoldman Sachs MarketBeta U.S. 1000 Equity ETF (GUSA): ETF Research Reports\nApple Inc. (AAPL) : Free Stock Analysis Report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nSPDR S&P 500 ETF (SPY): ETF Research Reports\niShares Core S&P 500 ETF (IVV): ETF Research Reports\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Sachs-Marketbeta-U-1000-102005944.Html", "Sentiment_Score": 0.0643806383, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-18T09:30:00.000Z", "Headline": "Goldman Sachs Opens Up an Investment Strategy Once Reserved for the Wealthy", "Summary": "Bank plans to offer everyday customers of the robo-adviser Betterment investment portfolios designed to help them save money on taxes.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/7C5C741E-9E4C-3278-B38B-6165Fc943634/Goldman-Sachs-Opens-Up-An.Html", "Sentiment_Score": 0.1424191594, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-18T07:30:00.000Z", "Headline": "Bank Stocks Rallied on Earnings. The Results Held a Warning About the Health of the Consumer.", "Summary": "Shares of JPMorgan and others have been rallying, but the struggles faced by everyday Americans were visible in their earnings.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/10592939-D84F-3646-84Ff-4F8037D3220C/Bank-Stocks-Rallied-On.Html", "Sentiment_Score": -0.7140046954, "Sentiment_Category": "bearish"}, {"Ticker": "GS", "Time": "2024-07-18T04:50:08.000Z", "Headline": "This indicator foresaw Goldman Sachs's 56% jump from the lows", "Summary": "Investing.com — Knowing the true value of an asset before making a move into it is one of the main attributes that separates the pros from the amateurs when it comes to making money in the markets.\nWhile some invest blindly, guided subjective factors such as investor sentiment and FOMO, the big boys will make sure to have all the latest tools at their disposal before making a decision.\nBut what if you could have all the top indicators in the market combined into one, simple price target metric?\nThat's the case for our premium subscribers, who have been receiving top-tier, fundamentally sound stock picks for less than $8 a month using this link.\nCheck out this real-life case to get a better grasp of what we're talking about:\n15 months ago, on 03-18-2023, Goldman Sachs Group (NYSE:GS) traded at $303.54. Using the best-in-breed combination of fundamental and technical metrics, including 17+ industry-recognized evaluation models, our Fair Value estimated the stock was undervalued by as much as 63%.\n\nSince then, the stock has climbed by 56% to $472.83 on 07-10-2024.\n\nWho would have guessed that a value stock such as Goldman Sachs would gain 56% in just over a year?\n\nWell, our Fair Value tool did.\n\nPowered by state-of-the-art fundamental analysis models, it flashed a buy on Goldman Sachs just as the stock was about to explode higher.\n\nFast-forward to now, and Goldman Sachs rode the bull market with above-average returns, outperforming the S&P 500 by a wide margin.\nBut how do you make sure you don’t miss the next GS?\n\nHere are just a few of the undervalued stocks to consider right now*\nSubscribe here for less than $8 a month using this link as part of our summer sale to see all the picks today!\n\nConversely, using Fair Value also helps you find overvalued stocks to avoid right now*\n\nSubscribing to InvestingPro gives you unlimited access to the most reliable Fair Value tool available online—the kind that hedge funds use.\n\nThink of it as bullet-proofing your watchlist or portfolio to see which stocks may be over- or undervalued!\nLearn more in our comprehensive Fair Value tool blog post\nTake advantage of our exclusive summer sale and get an insight into the winners now for less than $8 a month!\n\n*And since you made it all the way to the bottom of this article, we'll give you a special 10% extra discount on all our plans with the coupon code PROPICKS2024!\nRelated Articles\nThis indicator foresaw Goldman Sachs's 56% jump from the lows\nCognac executives, EU officials attend Beijing hearing on brandy dumping\nEnergy leads European shares higher; ECB rate verdict on tap", "Link": "Https://Finance.Yahoo.Com/News/Indicator-Foresaw-Goldman-Sachss-56-045008899.Html", "Sentiment_Score": 0.5307046175, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-17T19:23:58.000Z", "Headline": "Morgan Stanley Sells $8 Billion of Bonds as Demand Soars", "Summary": "(Bloomberg) -- Morgan Stanley became the latest big Wall Street bank to tap the US investment-grade market Wednesday after reporting earnings, as strong investor demand helps lenders borrow at lower yields than would have been possible at the start of the month.\nMost Read from Bloomberg\nCanada’s Immigration Minister Has a Message for Foreign Students: You Can’t All Stay\nUS Floats Tougher Trade Rules to Rein In China Chip Industry\nHigh-Flying Chipmakers See Worst Plunge Since 2020: Markets Wrap\nBrookfield Lines Up a 36-Year-Old Rising Star as Next Billionaire CEO\nBiden Faces Intensified Calls to Step Aside While Ill With Covid\nThe lender sold $8 billion of bonds in four parts, according to a person with knowledge of the matter. The longest portion of the offering, an 11-year security, yields 1.17 percentage point above Treasuries after initial discussions of around 1.4 percentage point, said the person, who asked not to be identified as the details are private.\nProceeds from the offering will be used for general purposes and Morgan Stanley was the sole underwriter of the deal, added the person. A representative for Morgan Stanley declined to comment.\nThe sale came a day after the bank’s trading business posted the biggest increase among its peers in the second quarter. Morgan Stanley, like its rivals Goldman Sachs Group Inc. and JPMorgan Chase & Co., beat expectations, solidifying the markets business as a hot spot across the industry.\nJPMorgan, Wells Fargo & Co. and Goldman have raised a combined $16.5 billion after reporting second-quarter earnings. Wednesday’s deal by Morgan Stanley turbocharged volume from the six biggest banks past the 10-year July average of roughly $17 billion.\nBlue-chip bond yields have fallen to the lowest in five months as Federal Reserve officials step up signals that they are moving closer to cutting interest rates. The average US high-grade yield-to-worst, a measure of borrowing costs, hit 5.21% on Tuesday, the lowest since Feb. 6.\nFalling yields and strong investor demand have created an attractive playing field for the big banks. Goldman’s $5.5 billion, two-tranche deal on Tuesday garnered $23 billion in peak investor demand, wrote Bloomberg’s Brian Smith.\nThat enabled Goldman to tighten pricing 28 basis points on both tranches, offering investors just 2 basis points to 3 basis point in new issue premium, or the extra yield that high-grade borrowers have to offer to sell new investment-grade debt, wrote Smith.\nWells Fargo’s $2 billion perpetual securities offering, the first preferred stock series by one of the so-called Big Six lenders in the US in almost two months, received more than $8 billion in orders, according to Smith. That enabled the bank to tighten pricing an eye-popping 52.5 basis points from the initial price talk.\nRead more in the IG ANALYSIS: Goldman, Wells Achieve Attractive Funding Levels\n(Updates with pricing details in headline, second paragraph)\nMost Read from Bloomberg Businessweek\nTop Takeaways From Businessweek’s Donald Trump Interview\nWhy the Nobel-Laureate Pioneer of Microfinance Risks Life in Jail\nHow Trader Joe’s Mini Cooler Bags Became a Viral Hit\nInterviewing Trump on His Plans for the US Economy\nWhat Americans Invest In Now\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanley-Selling-Bonds-Investors-135056826.Html", "Sentiment_Score": 0.3452345133, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-17T18:29:35.000Z", "Headline": "Former Goldman, Blackstone analyst gets 28-month prison sentence for insider trading", "Summary": "By Jonathan Stempel\nNEW YORK (Reuters) - A former Goldman Sachs and Blackstone analyst was sentenced to 28 months in prison on Wednesday for insider trading, after admitting that his conduct was \"catastrophically stupid.\"\nAnthony Viggiano, 27, of Baldwin, New York, was sentenced by U.S. District Judge Valerie Caproni in Manhattan, after pleading guilty in January to securities fraud.\nViggiano was accused of passing tips on eight planned corporate mergers and partnerships between 2021 and 2023 to college friend Stephen Forlano and construction sales representative Christopher Salamone, a childhood neighbor.\nProsecutors said the scheme resulted in more than $400,000 of illegal profits for Salamone and Forlano, both of whom have also pleaded guilty, with Viggiano receiving $35,000 from Salamone in a bag of cash.\nForlano passed some tips to a U.S. Army captain he was friends with, prosecutors added.\nThe eight transactions included American International Group's sale of part of a business to Blackstone, and the purchase of satellite operator Maxar Technologies by private equity firm Advent International, a Goldman client.\nProsecutors had sought 30 months in prison, calling Viggiano \"far more financially sophsticated\" than his friends and \"the most culpable.\"\nViggiano's lawyers sought one year in prison, saying the case involved not \"staggering greed\" but \"seemingly overgrown frat boys.\"\nThey also said Viggiano hopes to reenlist in the U.S. Marine Corps, where he served in 2019 before fracturing his hip.\nIn a letter to the judge, Viggiano said he believed his actions would help his friends address financial hardships, but that in hindsight \"this was a catastrophically stupid decision.\"\nViggiano's lawyer Steven Brill said in a statement after his client's sentencing: \"His inherent values and work ethic will lead him back to the right path.\"\nForlano was sentenced to 13 months in prison in May. Salamone's sentencing is on Aug. 20. The Army captain was not criminally charged.\n(Reporting by Jonathan Stempel in New York; Editing by Cynthia Osterman)", "Link": "Https://Finance.Yahoo.Com/News/Former-Goldman-Blackstone-Analyst-Gets-182935220.Html", "Sentiment_Score": -0.7324026823, "Sentiment_Category": "bearish"}, {"Ticker": "GS", "Time": "2024-07-17T10:28:09.000Z", "Headline": "The Goldman Sachs Group, Inc. (NYSE:GS) Released Earnings Last Week And Analysts Lifted Their Price Target To US$493", "Summary": "A week ago, The Goldman Sachs Group, Inc. (NYSE:GS) came out with a strong set of quarterly numbers that could potentially lead to a re-rate of the stock. The company beat expectations with revenues of US$13b arriving 2.9% ahead of forecasts. Statutory earnings per share (EPS) were US$8.62, 2.4% ahead of estimates. Following the result, the analysts have updated their earnings model, and it would be good to know whether they think there's been a strong change in the company's prospects, or if it's business as usual. We've gathered the most recent statutory forecasts to see whether the analysts have changed their earnings models, following these results.\nSee our latest analysis for Goldman Sachs Group\nearnings-and-revenue-growth\nTaking into account the latest results, the current consensus from Goldman Sachs Group's 19 analysts is for revenues of US$51.2b in 2024. This would reflect a modest 4.6% increase on its revenue over the past 12 months. Statutory earnings per share are predicted to ascend 17% to US$36.32. In the lead-up to this report, the analysts had been modelling revenues of US$50.8b and earnings per share (EPS) of US$36.48 in 2024. The consensus analysts don't seem to have seen anything in these results that would have changed their view on the business, given there's been no major change to their estimates.\nWith the analysts reconfirming their revenue and earnings forecasts, it's surprising to see that the price target rose 5.7% to US$493. It looks as though they previously had some doubts over whether the business would live up to their expectations. That's not the only conclusion we can draw from this data however, as some investors also like to consider the spread in estimates when evaluating analyst price targets. There are some variant perceptions on Goldman Sachs Group, with the most bullish analyst valuing it at US$571 and the most bearish at US$373 per share. Analysts definitely have varying views on the business, but the spread of estimates is not wide enough in our view to suggest that extreme outcomes could await Goldman Sachs Group shareholders.\nOne way to get more context on these forecasts is to look at how they compare to both past performance, and how other companies in the same industry are performing. The analysts are definitely expecting Goldman Sachs Group's growth to accelerate, with the forecast 9.4% annualised growth to the end of 2024 ranking favourably alongside historical growth of 5.2% per annum over the past five years. By contrast, our data suggests that other companies (with analyst coverage) in a similar industry are forecast to grow their revenue at 5.6% per year. Factoring in the forecast acceleration in revenue, it's pretty clear that Goldman Sachs Group is expected to grow much faster than its industry.\nThe Bottom Line\nThe most important thing to take away is that there's been no major change in sentiment, with the analysts reconfirming that the business is performing in line with their previous earnings per share estimates. Happily, there were no major changes to revenue forecasts, with the business still expected to grow faster than the wider industry. There was also a nice increase in the price target, with the analysts clearly feeling that the intrinsic value of the business is improving.\nWith that in mind, we wouldn't be too quick to come to a conclusion on Goldman Sachs Group. Long-term earnings power is much more important than next year's profits. We have forecasts for Goldman Sachs Group going out to 2026, and you can see them free on our platform here.\nHowever, before you get too enthused, we've discovered 2 warning signs for Goldman Sachs Group that you should be aware of.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Sachs-Group-Inc-Nyse-102809220.Html", "Sentiment_Score": 0.8800839186, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-17T09:42:20.000Z", "Headline": "Sticky UK Services Inflation Adds to August Rate Cut Doubts", "Summary": "(Bloomberg) -- Britain recorded stronger-than-expected inflation in its services sector in June, prompting traders to walk back bets on an interest-rate cut by the Bank of England next month.\nMost Read from Bloomberg\nUS Floats Tougher Trade Rules to Rein In China Chip Industry\nNasdaq 100 Set for Worst Day Since December 2022: Markets Wrap\nBlackRock Says Gunman From Trump Rally Appeared in Firm’s Ad\nTrump Security Tightened on Iran Plot Intel; No Link to Shooting\nAmazon Sold a Used Diaper. It Tanked a Mom-and-Pop Business\nServices inflation, which policymakers have been watching for signs of continued domestic price pressures, held steady at 5.7% for the second straight month. That compares with the 5.6% rate expected by economists immediately before the data’s release and the 5.1% level that the central bank’s most recent forecasts had anticipated by now.\nThe increase was largely driven by hotel and restaurant prices as the effects of an almost 10% rise in the minimum wage and the arrival of Taylor Swift’s The Eras Tour filtered through the economy. Persistence in services inflation will further complicate calculations before Governor Andrew Bailey announces the BOE’s next decision on Aug. 1, even with headline inflation holding steady at the official 2% target.\n“The data today challenge the idea of a cut in August,” said Tomasz Wieladek, chief European economist at T Rowe Price. “Inflation is not yet coming down in a sustainable fashion.”\nTraders pushed back bets on a rate cut next month, pricing in a roughly 30% chance of an August move, down from almost 50% on Tuesday. The pound erased losses to trade 0.4% stronger at about $1.30 for the first time in a year, as traders priced in the prospect that the Federal Reserve may cut rates before the BOE.\nGilt yields rose across the curve, with the two-year rate rising as much as seven basis points to 4.06%, although that’s still around the lowest level this year.\nWhile the UK’s newly elected prime minister, Keir Starmer, will welcome a stronger pound, his government won’t want to see Britain’s mortgage holders wait much longer for a rate cut. Starmer and his chancellor of the exchequer, Rachel Reeves, have blamed the Conservative government that left power on July 5 for weakening the currency and pushing up mortgage costs.\nThe figures come days after the economy recorded growth of 0.4% in May, double the pace that had been expected. It points to another solid quarter of expansion, continuing a recovery from last year’s mild recession.\n“Today’s data should close the door on an August rate cut,” said Zara Nokes, global market analyst at J.P. Morgan Asset Management. “This inflation print, coupled with ongoing resilience in economic activity is likely stronger than the data the bank is looking for to start cutting rates.”\nPrices for restaurants and hotels rose by 6.3% in the year to June, up from 5.8% in May, according to Office for National Statistics data. The increase in the annual rate was almost entirely down to hotel room prices, which saw a monthly rise of 8.8%.\nA tight labor market and the minimum wage increase that took effect in April are forcing companies to pay more to attract staff. Tomorrow’s jobs data will provide a further reading of underlying inflationary pressure in the labor market.\nBOE officials, notably Chief Economist Huw Pill, have expressed concern about lingering inflationary forces in the labor market and services sector.\nEconomists said there were also some signs that Swift’s UK tour in June, which included events in Edinburgh, Liverpool, Cardiff and London, may have also provided a temporary boost to the services inflation figure. The ONS collected data for hotel prices between concerts in Edinburgh and Liverpool, while the figures showed Swift is likely to have also boosted live music ticket prices. The effect may continue in August, when Swift returns for more dates in London.\nWhat Bloomberg Economics Says ...\n“The stickiness of both headline and services inflation in June’s CPI print has lowered the chances of the Bank of England easing at its August meeting. On balance we’re sticking to our call that rates will fall next month — the central bank has shown some tolerance for upside data surprises.”\n—Dan Hanson and Ana Andrade, Bloomberg Economics. Click for the REACT.\n“Hotel prices rose strongly while second-hand car costs fell, but by less than this time last year,” said Grant Fitzner, chief economist at the ONS. He added that these were offset by falling clothing prices after “widespread sales.”\nPrices of food and non-alcoholic beverages also continued to ease, rising by 1.5% in the year to June 2024, the lowest rate since October 2021. The rate has eased for 15 months running now from a high of 19.2% in March 2023, the highest annual rate seen for over 45 years.\nFactory gate prices, paid by retailers, rose 1.4% on an annual basis, down from 1.7% in the year to May. Growth in input prices, paid by producers, dropped to 0.4% from 0.7% as fuel costs continued to decline.\n“It is welcome that inflation is at target, but we know that for families across Britain prices remain high,” said Darren Jones, chief secretary to the Treasury under Reeves.\nThis month’s figures will help shape debate at the BOE on when to lower the benchmark lending rate, which officials left at a 16-year high for almost a year in order to curtail price pressures. Pill and others have signaled they want to see more concrete evidence that price pressures are subsiding before loosening policy.\nThe nine-member Monetary Policy Committee suggested in June that more officials were on the verge of backing a reduction, although some of its more hawkish members have voiced their opposition in recent weeks. Pill along with rate-setters Catherine Mann and Jonathan Haskel all raised concerns over how quickly underlying pressures are cooling after a communications blackout during the election campaign.\n“Inflation stays on target, but honeymoon period may not last,” said Yael Selfin, chief economist at KPMG UK. “Our latest analysis sees UK inflation potentially rising to a high of 3% before the end of the year.”\n--With assistance from Andrew Atkinson, Harumi Ichikura and Isabella Ward.\nMost Read from Bloomberg Businessweek\nTop Takeaways From Businessweek’s Donald Trump Interview\nWhy the Nobel-Laureate Pioneer of Microfinance Risks Life in Jail\nInterviewing Trump on His Plans for the US Economy\nHow Trader Joe’s Mini Cooler Bags Became a Viral Hit\nHere’s How to Create a Social Safety Net With Bipartisan Support\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Uk-Inflation-Holds-Boe-2-060311047.Html", "Sentiment_Score": -0.6711431146, "Sentiment_Category": "bearish"}, {"Ticker": "GS", "Time": "2024-07-16T21:24:00.000Z", "Headline": "Goldman Sells $5.5 Billion of Bonds in Post-Earnings Binge", "Summary": "(Bloomberg) -- Goldman Sachs Group Inc. and Wells Fargo & Co. joined rival JPMorgan Chase & Co. in the tapping the US investment-grade market after reporting second-quarter earnings.\nMost Read from Bloomberg\nBlackRock Says Gunman From Trump Rally Appeared in Firm’s Ad\nTrump Security Tightened on Iran Plot Intel; No Link to Shooting\nUS Floats Tougher Trade Curbs in Chip Crackdown on China\nAmazon Sold a Used Diaper. It Tanked a Mom-and-Pop Business\nHSBC Names Elhedery CEO, Picking Insider for Top Job\nGoldman sold $5.5 billion of bonds in two parts, according to a person with knowledge of the matter. The longest portion of the offering, an 11-year security, yields 1.17 percentage point above Treasuries, after initial discussions of around 1.45 percentage point, said the person, who asked not to be identified as the details are private.\nProceeds from offering will be used for general corporate purposes and Goldman is the sole underwriter of the deal, added the person.\nGoldman’s trading unit powered a surge in earnings in the second quarter. Both fixed-income and equity traders outpaced analysts’ estimates, while a rebounding capital-markets business helped drive better-than-expected results across much of the company’s Wall Street operations.\nWells Fargo, meanwhile, tapped the US high-grade market with a $2 billion perpetual securities offering a day after it raised €2.75 billion ($3 billion) in the European debt market.\nThis is the first sale of a preferred stock series by one of the so-called Big Six lenders in the US in almost two months, following a spurt of deals earlier this year when hopes of rate cuts by the Federal Reserve were fading. It’s also Wells Fargo’s first since last summer, when it effectively reopened a market that had remained shut since the regional banking crisis.\nThe new issue “looks like a net AT1 addition (no refinancing),” CreditSights Inc. analysts Jesse Rosenthal and George Milonopoulos wrote in a Tuesday client note. This refers to the role of preferred shares as a source of Additional Tier 1 capital for US banks, played by contingent convertible bonds in other parts of the world.\nRepresentatives for Goldman didn’t respond to a request for comment. Wells Fargo declined to comment.\nJPMorgan kicked off the issuance spree from the big banks on Monday, borrowing $9 billion in a four-part offering that garnered over $28 billion in investor demand. The longest portion of the deal, an 11-year tranche, drew upwards of $12 billion in orders. That allowed the lender to pay just low single-digit concessions to sell the debt, Bloomberg’s Brian Smith wrote in a note.\nMore on the Way\nThe top banks are expected to borrow more than they usually do after they post earnings as they take advantage of falling yields and get ahead of upcoming US elections that could potentially bring market turmoil. The big banks are some of the largest issuers of investment grade corporate debt and their funding decisions help set the tone for the rest of that market.\nJPMorgan credit analyst Kabir Caprihan expects $21 billion to $24 billion of issuance from the six biggest domestic banks, more than the 10-year July average of roughly $17 billion. Barclays analysts including Peter Troisi are calling for about $30 billion in the third quarter, with most of that expected this month.\nBank of America Corp. reported trading and investment-banking results that topped analysts’ estimates while Morgan Stanley’s trading business posted the biggest increase among its peers in the second quarter. The two lenders, alongside Citigroup Inc. are also candidates to sell debt this month.\n‘Unwarranted’ Angst\nGlobal systemically important banks have borrowed an average of $21 billion in the US high-grade market in the four weeks following earnings every year since 2014, JPMorgan analysts Eric Beinstein and Nathaniel Rosenbaum wrote in a research note on Tuesday.\n“Many investors tend to be cautious on bank spreads heading into these heavy supply weeks but the historical data suggests this is unwarranted,” wrote the analysts.\nBank bond spreads — and in some cases bank stocks — have outperformed during the heavy supply weeks, according to the note. The average spread on a financial institution bond is just 4 basis points wider than the broader high-grade index.\n“This suggests that it is the strength of bank earnings that have, over the past 10 years, contributed to the outperformance of both bank stocks and bonds,” they wrote.\n--With assistance from Brian Smith and Tasos Vossos.\n(Updates to show the deals have priced.)\nMost Read from Bloomberg Businessweek\nTop Takeaways From Businessweek’s Donald Trump Interview\nWhy the Nobel-Laureate Pioneer of Microfinance Risks Life in Jail\nInterviewing Trump on His Plans for the US Economy\nHere’s How to Create a Social Safety Net With Bipartisan Support\nHow Rivian Became the Anti-Tesla\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Wells-Fargo-Join-Big-133041138.Html", "Sentiment_Score": -0.0098775942, "Sentiment_Category": "neutral"}, {"Ticker": "GS", "Time": "2024-07-16T20:52:00.000Z", "Headline": "Former Goldman Banker Pleads Not Guilty to Charges of Bribing Ghanaian Officials", "Summary": "Asante Berko’s arraignment comes three years after the Goldman banker settled a related civil case with U.S. securities regulators.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/Be2D1872-263F-32B5-B63D-252Ef357E356/Former-Goldman-Banker-Pleads.Html", "Sentiment_Score": -0.5374256372, "Sentiment_Category": "bearish"}, {"Ticker": "GS", "Time": "2024-07-16T20:33:45.000Z", "Headline": "Gold Jumps to Record as Traders Ramp Up Bets on Fed Rate Pivot", "Summary": "(Bloomberg) -- Gold hit a record high as hopes for Federal Reserve rate cuts grow and some traders ramped up bets on a second Donald Trump presidency.\nMost Read from Bloomberg\nBlackRock Says Gunman From Trump Rally Appeared in Firm’s Ad\nTrump Security Tightened on Iran Plot Intel; No Link to Shooting\nUS Floats Tougher Trade Curbs in Chip Crackdown on China\nAmazon Sold a Used Diaper. It Tanked a Mom-and-Pop Business\nFrom Elon Musk to David Sacks, Silicon Valley’s Trump Backers Cheer Vance as VP Pick\nSpot bullion rose as high as $2,469.66 an ounce, moving past the previous all-time peak set in May. The rally comes as signs of slowing inflation in the US fuel speculation the central bank will soon start lowering interest rates. High rates tend to be negative for gold, which bears no interest.\nEven so, the metal has still soared nearly 20% this year, supported by large purchases from central banks, strong consumer appetite in China and demand for haven assets amid geopolitical tensions. A recent uptick in holdings by exchange-traded funds is also aiding upward momentum.\n“Optimism about US interest rate cuts as more economic data supports the case for a Fed pivot is supporting gold,” Ewa Manthey, a commodities strategist at ING Bank NV, said earlier on Tuesday. “Gold is poised to keep its positive momentum going amid the current global geopolitical and macroeconomic landscape, while central bank demand is expected to grow.”\nOn Monday, Fed Chair Jerome Powell said recent data had given policymakers greater confidence that inflation is heading down to the central bank’s 2% goal, and traders now see two quarter-point rate reductions this year.\nTraders have been adding bets there will be three cuts this year after Goldman Sachs Group Inc. said conditions were ripe for easing, with “a solid rationale” for officials to lower rates as soon as July.\nGold’s latest rally isn’t necessarily unexpected. In June, consultancy Metals Focus predicted a fresh record this year, while earlier this month Citigroup Inc. said its base case for gold in 2025 was $2,700-$3,000 an ounce.\nTrump momentum\nInvestors across markets are also weighing the likelihood that Trump will return to the White House, as his candidacy gains momentum following a failed assassination attempt over the weekend and the dismissal of a criminal case against him.\nGold could draw some support from a Trump presidency, said David Higgins, head of trading at Merrion Gold.\n“He’ll cause lots of people to buy when he’s elected,” because retail customers — mainly smaller buyers — associate him with instability, Higgins said.\nSpot gold was up 1.9% at $2,467.58 an ounce as of 4:31 p.m. in New York. The Bloomberg Dollar Spot Index was little changed, while US 10-year Treasury yields fell. Silver, palladium and platinum rose.\n--With assistance from Sana Pashankar.\nMost Read from Bloomberg Businessweek\nTop Takeaways From Businessweek’s Donald Trump Interview\nWhy the Nobel-Laureate Pioneer of Microfinance Risks Life in Jail\nInterviewing Trump on His Plans for the US Economy\nHere’s How to Create a Social Safety Net With Bipartisan Support\nHow Rivian Became the Anti-Tesla\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Gold-Jumps-Record-Traders-Ramp-145828709.Html", "Sentiment_Score": 0.6121046543, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-16T20:18:14.000Z", "Headline": "Ex-Goldman Banker Extradited to NY in Ghana Bribery Case", "Summary": "(Bloomberg) -- Former Goldman Sachs Group Inc. banker Asante Berko was extradited to New York from the UK to face federal charges that he orchestrated bribes to Ghanaian officials while employed at the investment bank.\nMost Read from Bloomberg\nBlackRock Says Gunman From Trump Rally Appeared in Firm’s Ad\nTrump Security Tightened on Iran Plot Intel; No Link to Shooting\nAmazon Sold a Used Diaper. It Tanked a Mom-and-Pop Business\nUS Floats Tougher Trade Curbs in Chip Crackdown on China\nFrom Elon Musk to David Sacks, Silicon Valley’s Trump Backers Cheer Vance as VP Pick\nBerko pleaded not guilty Tuesday afternoon in federal court in Brooklyn, New York, after arriving in the US the night before. US Magistrate Judge Vera Scanlon agreed to release Berko on $600,000 bond, though he will remain under house arrest with electronic monitoring at the Manhattan home of his sister-in-law.\nHe is due back in court for a conference on August 14.\nBerko’s extradition comes four years after the onetime Goldman vice president was charged in a 2020 indictment filed by federal prosecutors in Brooklyn, New York. They accused him of conspiring with at least two officials of the West African nation and four others in a bribery scheme they say benefited Goldman, himself and a Turkish energy company that sought to build a power plant in Ghana.\nBerko has been in British custody since since his 2022 arrest at London’s Heathrow Airport. In May his lawyers argued that a court order to extradite him should be dismissed, contending the charges weren’t extradition offenses and that most of the alleged acts took place in London, but they failed to stop his transfer.\nPay to Play\nBerko was a member of the Goldman team responsible for securing and managing financing for the power plant project, according to the indictment. The US alleges that Berko paid bribes to obtain approvals for the Turkish company, in which Goldman held a 16% stake. Prosecutors also claim he laundered the bribe money through US financial institutions.\nBoyd Johnson, a lawyer for Berko, didn’t respond to an email seeking comment on the extradition.\nGoldman, which wasn’t accused of wrongdoing in the matter, has been entangled in foreign bribery cases before, most famously the looting of Malaysian state investment fund 1MDB. In that case, it agreed to pay more than $5 billion, including a $2.3 billion fine in the US, and its Malaysia unit entered a guilty plea, a first for the firm. It was the largest penalty in US history for a violation of the Foreign Corrupt Practices Act.\nBerko was sued by the US Securities and Exchange Commission in 2020 over the same basic alleged conduct. He resolved that lawsuit by agreeing to pay more than $329,000 to regulators without admittting or denying the allegations, court records show.\nHidden From Goldman\nAccording to the SEC, Berko was a vice president in Goldman’s natural resources group before he resigned in December 2016. He went on to serve as managing director of Ghana’s state-owned Tema Oil Refinery Ltd. but stepped down after the SEC suit was filed.\nUS authorities say Berko hid the alleged scheme from Goldman’s compliance department. The bank has said it cooperated fully with the SEC’s investigation.\nThe case is US v. Berko, 20-cr-0238, US District Court, Eastern District of New York (Brooklyn).\n(Updates with Berko entering not guilty plea)\nMost Read from Bloomberg Businessweek\nTop Takeaways From Businessweek’s Donald Trump Interview\nWhy the Nobel-Laureate Pioneer of Microfinance Risks Life in Jail\nInterviewing Trump on His Plans for the US Economy\nHere’s How to Create a Social Safety Net With Bipartisan Support\nHow Rivian Became the Anti-Tesla\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Ex-Goldman-Banker-Extradited-York-144005721.Html", "Sentiment_Score": -0.2298158109, "Sentiment_Category": "bearish"}, {"Ticker": "GS", "Time": "2024-07-16T17:45:00.000Z", "Headline": "Three Major Takeaways From Big Banks’ Earnings", "Summary": "Investment-banking and trading revenue rose at major U.S. banks including Goldman Sachs and JPMorgan Chase More stable economic conditions gave corporate-banking clients the confidence to use bread-and-butter banking services such as deal advisory and debt offerings. A clearer outlook on interest rates is giving bankers hope that dealmaking is emerging from a two-year slowdown.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/6F788B05-0Db6-36Cb-A339-63Dbc2D2744D/Three-Major-Takeaways-From.Html", "Sentiment_Score": -0.068347156, "Sentiment_Category": "bearish"}, {"Ticker": "GS", "Time": "2024-07-16T15:18:25.000Z", "Headline": "Goldman Joins Rivals in Setting Up New Mideast-Focused Fund", "Summary": "(Bloomberg) -- Goldman Sachs Group Inc. is working on raising a Middle East-focused fund and hired a longtime JPMorgan Chase & Co. banker to run it, according to people familiar with the matter.\nMost Read from Bloomberg\nBlackRock Says Gunman From Trump Rally Appeared in Firm’s Ad\nAmazon Sold a Used Diaper. It Tanked a Mom-and-Pop Business\nTrump Security Tightened on Iran Plot Intel; No Link to Shooting\nFrom Elon Musk to David Sacks, Silicon Valley’s Trump Backers Cheer Vance as VP Pick\nTrump Shooting Changes Biden’s Plan to Revive 2024 Campaign\nThe Wall Street bank has held talks with investors in the region about raising money for the open-ended fund, the people said, asking not to be named as the information isn’t public. Talks are ongoing and the fund’s final size hasn’t been decided yet, they said.\nA Goldman spokesperson declined to comment on the fund.\nWith the move, Goldman joins a raft of rivals across the industry in raising Middle East-focused funds. That marks a shift for the giants of the asset management industry, who’ve long flocked to the region to court sovereign wealth funds and raise money that they would then use to invest around the world.\nNow, under pressure from the sovereign funds, they’re increasingly looking to raise that same money and deploy it within the region.\nNew from Bloomberg: Get the Mideast Money newsletter, a weekly look at the intersection of wealth and power in the region.\nBrookfield Asset Management Ltd., for instance, has explored raising separate pools of capital to invest in the Middle East, while Investcorp Holdings, the region’s biggest alternative asset manager, has announced it will set up a $1 billion investment vehicle backed by Beijing’s sovereign wealth fund that is meant to invest in companies across the Persian Gulf as well as China. BlackRock Inc. is seeking to invest in the Middle East, backed by $5 billion from Saudi Arabia’s sovereign wealth fund.\nHabib Saikaly is joining Goldman in Riyadh as head of the bank’s fundamental equity business across the Middle East and North Africa and is expected to oversee the fund’s development, people familiar with the matter said. A 13-year veteran of JPMorgan, Saikaly will report to Basak Yavuz and Hiren Dasani, the co-heads of Goldman’s emerging market equity division, for the new role, the people said.\n“We are continuing to expand our presence in Saudi Arabia across divisions,” Fadi Abuali, co-chief executive officer of the firm’s Middle East and North Africa business, said in a statement. “This reflects our ambition to provide a dedicated local service and bring investment opportunities to our global client base, capitalizing on the growth and dynamism across the MENA region.”\nGoldman’s fresh push in the Middle East comes only months after becoming the first Wall Street bank to secure a license in Saudi Arabia to set up its regional headquarters there. Other major banks are also stepping up efforts to expand in the kingdom which is in the middle of an ambitious economic reform program.\n(Updates with additional Goldman response in eighth paragraph.)\nMost Read from Bloomberg Businessweek\nTop Takeaways From Businessweek’s Donald Trump Interview\nWhy the Nobel-Laureate Pioneer of Microfinance Risks Life in Jail\nHere’s How to Create a Social Safety Net With Bipartisan Support\nInterviewing Trump on His Plans for the US Economy\nHow Rivian Became the Anti-Tesla\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Joins-Rivals-Setting-Mideast-105201204.Html", "Sentiment_Score": 0.2546593249, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-16T14:38:35.000Z", "Headline": "Morgan Stanley's investment banking surge solidifies Wall Street dealmaking revival", "Summary": "An investment banking surge at Morgan Stanley (MS) solidified a dealmaking revival across Wall Street, but the company’s wealth management unit fell short of analyst expectations.\nFees from investment banking jumped 51% from a year ago, the second-largest leap among big banks after Citigroup (C).\nInvestment banking fees also jumped at JPMorgan Chase (JPM), Wells Fargo (WFC), Goldman Sachs (GS), and Bank of America (BAC) as dealmaking showed new signs of life following a two-year drought.\nWhen asked Tuesday about the investment banking rebound, Morgan Stanley CEO Ted Pick told analysts \"a number of folks have been calling for this.\"\nHe referenced earlier industry talk of \"green shoots\" that failed to show up after some false starts in 2023.\n\"It has been sort of a delayed shoots, if you will,\" he said.\nThe pick-up in investment banking and an increase in trading helped Morgan Stanley push its net profit up by 41% from a year earlier, to $3.07 billion. Its total net revenue of $15.02 billion rose 12%.\nBoth figures exceeded what analysts expected.\nMorgan Stanley CEO Ted Pick. (REUTERS/Jeenah Moon) (REUTERS / Reuters)\nThe stock rose nearly 1% Tuesday. As of late Monday, the stock was up nearly 13% since the beginning of January, trailing rises for some of its other big-bank rivals.\nOne challenge that emerged Tuesday was Morgan Stanley’s recent performance in wealth management, the business of providing financial advice to higher-net-worth individuals.\nNet new assets in that division fell 59% from a year ago and 62% from the last quarter, to $36.4 billion. Revenues were $6.79 billion, a 2% increase from a year ago but a 1.28% decrease from the last quarter.\nBoth measures were weaker than analysts expected.\n\"The firm delivered another strong quarter in an improving capital markets environment,\" Pick said in a press release.\n\"We continue to execute on our strategy and remain well positioned to deliver growth and long-term value for our shareholders.\"\nCorrection: A previous version of this article misstated Morgan Stanley's second quarter revenue. We regret the error.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanleys-Investment-Banking-Surge-Solidifies-Wall-Street-Dealmaking-Revival-143835560.Html", "Sentiment_Score": 0.9071925282, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-16T13:33:00.000Z", "Headline": "Company News for Jul 16, 2024", "Summary": "Shares of The Goldman Sachs Group, Inc. (GS) gained 2.6% after the company reported second-quarter 2024 earnings per share of $8.62, surpassing the Zacks Consensus Estimate of $8.52 per share.\nMacy's, Inc.’s (M) shares tumbled 11.7% after the company scrapped takeover talks with Arkhouse Management and Brigade Capital. \nShares of CleanSpark, Inc. (CLSK) surged 15.5% after Bitcoin and Ethereum prices rose more than 4% each.\nSolarEdge Technologies, Inc.’s (SEDG) shares plummeted 15.4% after the company said that it plans to lay off 400 employees, about 9% of the workforce, in its bid to restore profitability.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\nMacy's, Inc. (M) : Free Stock Analysis Report\nSolarEdge Technologies, Inc. (SEDG) : Free Stock Analysis Report\nCleanspark, Inc. (CLSK) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Company-News-Jul-16-2024-133300807.Html", "Sentiment_Score": -0.0443954691, "Sentiment_Category": "neutral"}, {"Ticker": "GS", "Time": "2024-07-16T20:44:31.000Z", "Headline": "Bank of America leans on Wall Street as high rates pose challenges to Main Street operations", "Summary": "Second quarter profits at Bank of America (BAC) fell 7% from a year ago as its consumer operations wrestled with higher interest rates, but it was able to churn out more investment banking fees and trading revenue.\nThe divergence between the businesses at Bank of America that serve Main Street and Wall Street reinforced a dominant trend this earnings season for the nation’s biggest financial institutions.\nHigher interest rates and elevated deposit costs are eating away at more traditional consumer banking margins, forcing giant banks to lean more heavily on their trading and investment banking as dealmaking shows new signs of life.\n\"The strength and earnings power of our leading consumer banking business is complemented by the growth and profitability of our global Markets, global banking, and wealth management businesses,\" said Bank of America CEO Brian Moynihan.\nBank of America Chairman and CEO Brian Moynihan. (REUTERS/Elizabeth Frantz) (REUTERS / Reuters)\nBank of America’s net income fell to $6.89 billion, which was slightly better than expectations, while rising 3% from the first quarter. Its total revenue of $25.37 billion rose slightly from a year ago.\nA key measure of lending revenue known as net interest income fell more than 3% from a year ago and more than 2% from the previous quarter, to $13.70 billion.\nThis margin — which measures the difference a bank earns by making loans and paying out depositors — has been tightening at many big banks due to higher rates and elevated funding costs.\nThis same measure also fell sequentially at JPMorgan Chase (JPM), Wells Fargo (WFC), and Citigroup (C) as their customers continued migrating to higher-yielding deposit products like CDs.\nThere were other signs of challenges for Bank of America and its consumer borrowers. It set aside more money for future loan losses when compared with a year ago, a sign that it expects credit conditions to worsen.\nIts credit card charge-offs more than doubled from a year earlier and more than 6% from the last quarter, another signal that more of its customers are having trouble paying down their bills. However, the pace of delinquencies slowed.\n\"Delinquencies have plateaued for the second consecutive quarter. This should lead to stabilized net credit losses in credit card in the second half of the year,\" Moynihan told analysts.\nBut there were some bright spots. Bank of America expects net interest income to rise later this year as the Federal Reserve starts to lower interest rates and the bank replaces under-earning bonds and fixed-rate loans with higher-yielding assets.\nIt said it expected fourth quarter net interest income to be $600 million higher than its second quarter figure.\nAnd its Wall Street operations really stood out. Investment banking fees jumped 28% from a year ago while its equities trading rose nearly 20%.\n\"The fundamental trends have been strong capital markets and weak net interest income,\" Portales Partners founder Charlie Peabody told Yahoo Finance Monday, referring to the trends of bank earnings season thus far.\n\"The question is if that spread income is going to reflect positively in the second half of the year.\"\nInvestment banking fees and trading revenue also jumped at JPMorgan Chase, Citigroup, Wells Fargo, and Goldman Sachs.\nBank of America's stock rose more than 5% Tuesday. As of Monday night it was up 20% so far this year.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance", "Link": "Https://Finance.Yahoo.Com/News/Bank-Of-America-Leans-On-Wall-Street-As-High-Rates-Pose-Challenges-To-Main-Street-Operations-122457107.Html", "Sentiment_Score": 0.5517465472, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-16T05:22:08.000Z", "Headline": "Q2 2024 Goldman Sachs Group Inc Earnings Call", "Summary": "Participants\nDavid Solomon; Chairman of the Board, Chief Executive Officer; Goldman Sachs Group Inc\nDenis Coleman; Chief Financial Officer; Goldman Sachs Group Inc\nGlenn Schorr; Analyst; Evercore ISI\nEbrahim Poonawala; Analyst; BofA Securities\nBetsy Graseck; Analyst; Morgan Stanley\nBrennan Hawken; Analyst; UBS Investment Bank\nMike Mayo; Analyst; Wells Fargo Securities, LLC\nSteven Chubak; Analyst; Wolfe Research, LLC\nDevin Ryan; Analyst; JMP Securities LLC\nDan Fannon; Analyst; Jefferies LLC\nMatt O'Connor; Analyst; Deutsche Bank AG\nGerard Cassidy; Analyst; RBC Capital Markets\nSaul Martinez; Analyst; HSBC\nPresentation\nOperator\nGood morning. My name is Katie, and I will be your conference facilitator today. I would like to welcome everyone to the Goldman Sachs second quarter 2024 earnings conference call. On behalf of Goldman Sachs, I will begin the call with the following disclaimer.\nThe earnings presentation can be found on the Investor Relations page of the Goldman Sachs website and contains information on forward-looking statements and non-GAAP measures. This audio cast is copyrighted material of The Goldman Sachs Group Inc., and may not be duplicated, reproduced or rebroadcast without consent.\nThis call is being recorded today, July 15, 2024. I will now turn the call over to the Chairman and Chief Executive Officer, David Solomon, and Chief Financial Officer, Dennis Coleman. Thank you, Mr. Solomon, you may begin your conference.\nDavid Solomon\nThank you, operator, and good morning, everyone. Thank you all for joining us. I want to begin by addressing the horrible act of violence that occurred over the weekend, the attempted assassination of former President Trump. We are grateful that he is safe. I also want to extend my sincere condolences to the families of those who were tragically killed and severely injured.\nIt is a sad moment for our country. There's no place in our politics for violence. I urge people to come together and to treat one another with respect, civility, dignity, especially when we disagree. We cannot afford division and distrust to get the better of us. I truly hope this is a moment that will spur reflection and action that celebrate what unites us as citizens and as a society.\nTurning to our performance. Our second quarter results were solid. We delivered strong year-on-year growth in both global banking and markets and asset wealth management. I am pleased with our performance where we produced a 10.9% ROE for the second quarter and a 12.8% ROE for the first half of the year.\nWe continue to harness our One Goldman Sachs operating approach to execute on our strategy and serve our clients in dynamic environments. Global banking and markets, we maintained our long-standing number one rank in announced and completed M&A and ranked number two in equity underwriting.\nOur investment banking backlog is up significantly this quarter. From what we're seeing, we are in the early innings of a capital markets and M&A recovery. And while certain transaction volumes are still well below their 10-year averages, we remain very well-positioned to benefit from a continued resurgence in activity. We saw solid year-over-year revenue growth across both FICC and equities as our global broad and deep franchise remained active in supporting clients' risk intermediation and financing needs.\nWe continue to be focused on maximizing our wallet share. And we have improved our standing to be in the top three with 118 of our top 150 clients. In asset wealth management, we are growing more durable management and other fees and private banking and lending revenues, which together were a record $3.2 billion for this quarter.\nOur assets under supervision hit a record of $2.9 trillion and total wealth management client assets rose to roughly $1.5 trillion. We delivered a 23% margin for the first half of the year and are making progress on improving the return profile of AWM.\nIn alternatives, we raised $36 billion year to date. We completed a number of notable fund closings during the quarter, including $20 billion of total capital for private credit strategies and approximately $10 billion across real estate investing strategies.\nGiven the stronger than anticipated fundraising in the first half of the year as well as our current pipeline, we expect to exceed $50 billion in alternatives fundraising this year. This is a testament to our investment performance track record and intense focus on client experience. We are excited about the additional growth opportunities for our asset wealth management platform.\nLet me turn to the operating environment, which remains top of mind for clients. On the one hand, there's a high level of geopolitical instability. Elections across the globe could have significant implications for forward policies and inflation has proven to be stickier than many had anticipated.\nOn the other hand, the environment in the US remains relatively constructive. Markets continue to forecast a soft landing as the expected economic growth trajectory improves and equity markets remain near all-time highs.\nI am particularly encouraged by the ongoing advancements in artificial intelligence. Recently, our Board of Directors spent a week in Silicon Valley where we spoke with the CEOs of many of the leading institutions at the cutting-edge of technology and AI.\nWe all left with a sense of optimism about the application of AI tools and the accelerating innovations and technology more broadly. The proliferation of AI in the corporate world will bring with it significant demand related infrastructure and financing needs, which should fuel activity across our broad franchise.\nBefore I turn it over to Dennis, I want to cover a couple of additional topics that are top of mind for me. First, our recent stress test results, the year-over-year increase in our stress capital buffer does not seem to reflect the strategic evolution of our business and the continuous progress we've made to reduce our stress loss intensity, which the Federal Reserve had recognized in our last three tests.\nGiven this discrepancy, we are engaging with our regulators to better understand its determinations. Despite the increase in requirements, we remain very well-positioned to serve our clients and we'll continue to be nimble with our capital.\nIn the second quarter, we repurchased $3.5 billion of shares, which illustrates our ability to dynamically manage our resources and opportunistically return capital to the shareholders. Despite the increase in our repurchase activity, our common equity Tier 1 ratio ended the quarter at 14.8% under the standardized approach, 90 basis points above our new regulatory minimum and above our ratio in the first quarter. We also announced a 9% increase in our quarterly dividend, which underscores our confidence in the durability of our franchise.\nSince the beginning of 2019, we have more than tripled our quarterly dividend current level of $3 a share. I'd also like to reflect on the significant milestone we hit the second quarter, our 25th anniversary as a public company.\nWe went public in 1999, which is also the year I joined the firm and it's been an eventful 25 years. Since then. We have persevered through a number of significant global events, including through the dot-com bubble, Nasdaq crash, September 11, a financial crisis, and the pandemic.\nWhen I look back at how we overcame these challenges, I immediately think of our culture, one that has evolved, no doubt, but always stay true to our core values. I know that the preservation of our culture is paramount to serving our clients with excellence, maintaining our leading market positions, growing our businesses, and continuing to attract and retain the most talented people.\nIn closing, I am very confident about the state of our client franchise. We are delivering on our strategy by leaning into our core strengths, effectively serving clients in what remains a complicated operating environment. Now let me turn it over to Denis to cover our financial results in more detail.\nDenis Coleman\nThank you, David, and good morning. Let's start with our results on page 1 of the presentation. In the second quarter, we generated net revenues of $12.7 billion and net earnings of $3 billion, resulting in earnings per share of $8.62, an ROE of 10.9%, and an ROTE of 11.6%.\nNow turning to performance by segment, starting on page 4. Global banking and markets produced revenues of $8.2 billion in the second quarter, up 14% versus last year. Advisory revenues of $688 million were up 7% versus the prior year period.\nEquity underwriting revenues rose 25% year over year to $423 million as equity capital markets have continued to reopen. Low volumes remain well below longer-term averages. Debt underwriting revenues rose 39% to $622 million amid strong leveraged finance activity. We are seeing a material increase in client demand for committed acquisition financing, which we expect to continue on the back of increasing M&A activity.\nOur backlog rose significantly quarter on quarter, driven by both advisory and debt underwriting. FICC net revenues were $3.2 billion in the quarter, up 17% year over year. Intermediation results rose on better performance in rates and currencies. FICC financing revenues were $850 million, a near record and up 37% year over year.\nEquities net revenues were $3.2 billion in the quarter, up 7% year on year as higher intermediation results were helped by better performance in derivatives. Equities financing revenues were $1.4 billion, down modestly from a record performance last year, but up 5% sequentially.\nTaken together, financing revenues were a record $2.2 billion for the second quarter and a record $4.4 billion for the first half of the year. Our strategic priority to grow financing across both FICC and equities continues to yield results as these activities increase the durability of our revenue base.\nI'm moving to asset wealth management on page 5. Revenues of $3.9 billion were up 27% year over year. As David mentioned, our more durable management and other fees and private banking and lending revenues reached a new record this quarter of $3.2 billion.\nManagement and other fees increased 3% sequentially to a record $2.5 billion, largely driven by higher average assets under supervision. Private banking and lending revenues rose 4% sequentially to $707 million.\nOur premier ultra-high-net-worth wealth management franchise has roughly $1.5 trillion in client assets. This business has been a key contributor to our success in increasing more durable revenues and provides us with a strong source of demand for our suite of alternative products, a great example of the power of this unique platform.\nWe expect continued momentum in this business as we also deepen our lending penetration with clients and grow our advisor footprint. Our pre-tax margin for the first half was 23%, demonstrating substantial improvement versus last year and approaching our mid-20s medium-term target.\nNow moving to page 6. Total assets under supervision ended the quarter at a record of $2.9 trillion, supported by $31 billion of long-term net inflows, largely from our OCIO business, representing our 26th consecutive quarter of long-term fee-based inflows.\nTurning to page 7 on alternatives. Alternative AUS totaled $314 billion at the end of the second quarter, driving $548 million in management and other fees. Gross third party fundraising was $22 billion for the quarter and $36 billion for the first half of the year. In the second quarter, we further reduced our historical principal investment portfolio by $2.2 billion to $12.6 billion.\nOn page 9, firm-wide net interest income was $2.2 billion in the quarter, up sequentially from an increase in higher yielding assets and a shift towards non-interest bearing liabilities. Our total loan portfolio at quarter end was $184 billion, flat versus the prior quarter. For the second quarter, our provision for credit losses was $282 million, primarily driven by net charge-offs in our credit card portfolio and partially offset by a release of roughly $115 million related to our wholesale portfolio.\nTurning to expenses on page 10. Total quarterly operating expenses were $8.5 billion. Our year-to-date compensation ratio of net of provisions is 33.5%. Quarterly non-compensation expenses were $4.3 billion and included approximately $100 million of CIE impairments. Our effective tax rate for the first half of 2024 was 21.6%. For the full year, we continue to expect a tax rate of approximately 22%.\nNext capital on slide 11. In the quarter, we returned $4.4 billion to shareholders, including common stock dividends of $929 million and common stock repurchases of $3.5 billion. Given our higher than expected SCB requirements, we plan to moderate buybacks versus the levels of the second quarter.\nWe will dynamically deploy capital to support our client franchise, while targeting a prudent buffer above our new requirement. Our Board also approved a 9% increase in our quarterly dividend to $3 per share beginning in the third quarter, a reflection of our priority to pay our shareholders a sustainable growing dividend and our confidence in the increasing durability of our franchise.\nIn conclusion, we generated solid returns for the first half of 2024, which reflects the strength of our interconnected businesses and the ongoing execution of our strategy. We made strong progress in growing our more durable revenue streams, including record first half revenues across FICC and equities financing, management and other fees, and private banking in lending, we remain confident in our ability to drive strong returns for shareholders, while continuing to support our clients. With that, we'll now open up the line for questions.\nQuestion and Answer Session\nOperator\n(Operator Instructions) Glenn Schorr, Evercore.\nGlenn Schorr\nHi there. Thanks very much. So I liked your forward-leaning comments on the IB fee pipeline. And I think I heard you say the demand for committed acquisition financing is high. Does that infer anything about us being any closer to an inflection point in private equity related M&A, sponsor-related M&A? And then how much of an event do you think you have as being maybe the only big bank that has a full-on private credit platform, and obviously, DCM platform, and lending platform? Thank you.\nDavid Solomon\nSure. Good morning, Glenn, and thanks for the question. We're forward leaning on our comments because we definitely see momentum pickup. But I just again want to highlight something that was definitely my part of the script. But I think Denis amplified, which we're still despite the pickup, we're still operating at levels that are still significantly below 10-year averages.\nAnd so for example, I think we've got kind of another 20% to go to get to 10-year averages on M&A. One of the reasons that M&A activity -- one of the reasons, not the only reason, but one of the reasons why M&A activity is running below those averages is because sponsor activity is just starting to accelerate. And so I think, especially given the environment that we're in, that you're going to see over the next few quarters into 2025, kind of a reacceleration of that sponsor activity.\nWe're seeing it in our dialogue with sponsors. And obviously, it's been way, way below the overall M&A activity has kind of another 20% to get to high 10-year averages, but sponsor has been running below that, and we're starting to see that increase.\nNow as that increases, I just think the firm is incredibly well-positioned, given the breadth of both our leading position. We've been top kind of one, two, three, and what I'll call leveraged finance activity from a league table perspective and with the sponsor community, but we combine it with a very, very powerful direct lending private credit platform.\nAnd so I just think we're in a very, very interesting position. The size and the scope of the companies that are out there, that have to be refinanced, recapitalized, sold, changed hands, the sponsors continue to look, distribute proceeds, you know, to their limited partners, I think bodes well over the course of the next three to five years. Different environments, but the general trend will be more activity than we've seen in the last 2, 2.5 years.\nGlenn Schorr\nI appreciate that. Maybe one quickie follow-up on, you mentioned in the prepared remarks, in your printed prepared remarks, that real estate gains helped drive the equity investment gains in the quarter? Can you talk about how material it was and what drove real estate gains during the quarter? Thanks.\nDenis Coleman\nSure, Glenn. It's Dennis. I think the important to take away from the year-over-year performance in the equity investment line is that in the prior year period, we actually had significant markdowns as we were sort of an early mover in addressing some of the commercial real estate risk across our balance sheet. And the results that reflect in this most recent quarter do not have the same degree of markdowns as in the prior period. So that is, I think, a large explain of the delta.\nOperator\nEbrahim Poonawala, Bank of America.\nEbrahim Poonawala\nHey, good morning. I just wanted to spend some time on capital, post the SCB increase, one, maybe just from a business standpoint. If you could update us whether the capital requirement changes anything in terms of how the firm has been leaning into the financing business. Do you need to moderate the appetite there or business as usual? So one, how does it impact the business?\nAnd second, Denis, your comments on buybacks moderating, should we think more like 1Q levels of buybacks going forward? Thanks.\nDenis Coleman\nSure, Ebrahim. So a couple of comments. I guess first important to observe that the level of capital that we're operating with at the moment is reasonably consistent where we've been over the last several years. So we feel that at that level of capital and with the cushion that we have heading into the third quarter, which at 90 basis points is at the wider end of our historical operating range, we have lots of capacity both to continue to deploy into the client franchise.\nAnd with what we're seeing across the client franchise with backlog up significantly, there could be attractive opportunities for us to deploy into the client franchise, whether that's new acquisition financing as David was referencing, or ongoing support of our clients across the financing businesses. We have the capacity to do that, as well as to continue to invest in return of capital to shareholders.\nGiven the $3.5 billion number in the second quarter, we thought it was advisable to indicate we would be moderating our repurchases, but we still do have capital flexibility. And based on what we see developed from the client franchise, we will make that assessment, we'll manage our capital to an appropriate buffer, but we're still certainly in a position to continue to return capital to shareholders.\nEbrahim Poonawala\nGot it. So assume no change in terms of how we're thinking about the financing business. And just separately in terms of sponsor-led activity, we waited all year for things to pick up. Is it a troubling sign that the sponsors are not able to monetize assets? Does it speak to inflated valuations that they're carrying these assets on? Just would love any context there, David if you could. Thank you.\nDavid Solomon\nSure. I mean, I appreciate that. I don't think it's troubling. I wouldn't use the word troubling. But I do think that there are places where sponsors hold assets and their ability to monetize them at the value that they currently hold them leads them to wait longer and keep the optionality to have that value compound. At the same point, there's pressure from LPs to continue to turn over funds, especially longer-dated funds.\nAnd as they take that optionality to wait, the pressure just builds. And so I think we're starting to see a bit of an unlock and more of a forward perspective to start to move forward, accept the evaluation parameters, and move forward. But I just think this is natural cycle and you're going to see a pickup in that activity for sure. I'm just not smart enough to tell you exactly which quarter and how quickly, but we are going to go back to more normalized levels.\nEbrahim Poonawala\nOkay. Thank you.\nOperator\nBetsy Graseck, Morgan Stanley.\nBetsy Graseck\nHi, good morning. All right. Well, thanks very much. I did just want to lean in on one question regarding how you're managing the expense line as we're going through this environment because we've had this very nice pickup in revenues and comp ratio is going up a little bit, but I'm just wondering is this a signaling to hold for the rest of this year? Or is this just a one-off given that some of the puts and takes you mentioned on deal activity earlier on the call?\nDavid Solomon\nSure, Betsy. So if you look at year-to-date change in our reviews net of provision, that is tracking ahead of the year-to-date change in our compensation and benefit expense. We are sort of following the same protocol that we always do, which is making our best estimate for what you know we expect to pay for on a full-year basis and doing that in a manner that reflects the performance of the firm as well as the overall competitive market for talent. So based on what we see we think this is the appropriate place to accrue compensation, but we'll obviously monitor that closely as the balance of the year evolves.\nBetsy Graseck\nOkay. And as we anticipate a continued pick up here in M&A, given everything you mentioned earlier, I would think that, that's positive operating leverage that should be coming your way. Would you agree with that or do I have something wrong there? Thanks.\nDenis Coleman\nNo, so we are certainly hopeful that the business will continue to perform and that we will grow our revenues in line with what the current expectation is based on backlog. And we would love to generate incremental operating leverage if we perform in line with our expectations.\nBetsy Graseck\nAll right. Thank you.\nOperator\nBrennan Hawken, UBS.\nBrennan Hawken\nHi, good morning. Thanks for taking my questions. You flagged, Denis, the record financing revenue, which clearly shows momentum behind the business. And it would be my assumption that given rates have been more stable for quite some time now, it seems to reflect balance growth. So one, I want to confirm that that's fair? And could you help us understand how we should be thinking about rate sensitivity as it seems as though maybe a few rate cuts might be on the horizon?\nDenis Coleman\nSure. Thank you, Brennan. So we have been on a journey for several quarters and years in terms of committing ourselves to the growth of the more durable revenue streams within global banking and markets. We have our human capital and underwriting infrastructure set up in place. We have relationships with a large suite of clients that are frequent users of these products.\nThe business is very diversified by sub-asset class, and it's a business that we are looking to grow on a disciplined basis. We've had an opportunity to deploy capital in a manner that is generating attractive, risk-adjusted returns. That's something that we're going to remain mindful of. But we believe, given the breadth of that franchise, that we should be able to continue to support the secular growth that our clients are witnessing, even as various rate environments should moderate.\nBrennan Hawken\nOkay. And then next question is really sort of a follow-on from Betsy's line of questioning. So year-to-date you've got a 64% efficiency ratio. You know, when we take a step back and think about your targets and aspirations for that metric and an environment -- consider an environment that seems to be improving steadily, you know, how should we be thinking about margins on incremental revenue? You know, could you help us understand how revenue growth will continue to drive improvement in that efficiency ratio?\nDenis Coleman\nSure. So thank you for that question and thank you for observing the improvement that we're seeing. Obviously, our year-to-date efficiency ratio at 63.8% is nearly 10 points better on a year-over-year basis. Still not at our target of 60%, but we are making progress. As we continue to grow our revenues, we should be able to deliver better and better efficiency.\nBut ultimately, the type of revenues that we grow and the extent to which they attract variable or volume-based expenses is a contributing factor. But we do have visibility, for example, as we continue to move out of some of our CIE exposures that we should be able to reduce some of the operating expenses associated with that.\nAnd we do have a very granular process internally, looking at each of our expense categories on a granular basis and trying to make structural improvements to drive efficiencies over time, while we at the same time look to drive top-line revenues.\nOperator\nMike Mayo, Wells Fargo Securities.\nMike Mayo\nHi. I'm just trying to reconcile all the positive comments with returns that are still quite below your target. I mean, you highlight revenue growth in global banking markets and wealth and asset management. You have record financing for equities and FICC combined. You're number one in M&A. You have record management fees. You have record assets under supervision.\nYour efficiency has gone from 74% to 64%, increased your dividend by 9% to signal your confidence, your CET1 ratios, 90 basis points above even the higher Fed requirements. David, you started off the call saying the results are solid, but then you look at the returns and you say 11% ROE in the second quarter, that's not quite the 15% where you wanted to be. So where's the disconnect from what you're generating in terms of returns and where you'd like to be? Thanks.\nDavid Solomon\nYeah, thanks Mike. Appreciate the question. Look, we're on a journey. And, you know, the way I look at it, our returns for the first-half of the year at 12.8%. There are, you know, I think there are a couple of things gets in that. One, for sure, we still have a little bit of drag from the enterprise platforms which we're working through, and so that will come out. And at some point as we work through that, over the next 12 to 24 months, we'll continue to make progress on that for the returns in the first-half of the year would be a little higher exit.\nAnd then on top of that, as we've said repeatedly on the call and have given a bunch of information, we're still operating meaningfully below 10-year averages in terms of investment banking activity. And I think that'll come back. I obviously can't predict. But if you look at the returns of the firm, we have materially uplifted the returns of the firm. And we're going to continue to focus on that.\nNow the next step to the puzzle is our continued progress in AWM. So you know and you can see the performance over the course of the last few years of global banking and markets, but we've said the AWM ROE is not where it needs to be. You heard our comments about the fact that we've got the margin up to 23%, but the ROE is still around 10%.\nWe think we can continue to grow the business. As we've said, high-single-digits, we can continue to improve the margin and ultimately bring up that AWM ROE. And then you look across the firm and you have a stronger return profile. So I think we're making good progress. We didn't say and have not work to do for sure. But we feel good about the progress.\nMike Mayo\nAnd I assume part of your expectation is a sort of multiplier effect when mergers really kick in. Can you just describe what that multiplier effect could potentially look like based on past cycles?\nDavid Solomon\nWhat I would say is one of the things that should be a tailwind for further momentum in our business is a return to average levels. I'm not sitting here saying we're going to go back to periods of time where we went well above 10-year averages, but there's obviously, if we did get back to that period, and there will be some point in the future where we run above average too, and not just below average, we have a tailwind for that.\nBut as a general matter, when there are more M&A transactions, whether with financial sponsors or big corporates, there is more financing attached to that. People need to raise capital to finance those transactions. They need to reposition balance sheets. They need to manage risks through structured transactions. And so there's a multiplier effect as those activities increase. We don't put a multiplier on it, but our whole ecosystem gets more active as transaction volumes increase on the M&A side.\nMike Mayo\nAnd then lastly, for your returns, the denominator is a big factor. So how does that work with the Fed? I know you can't say too much and reasonable people can disagree, but your whole point is that you've de-risked the balance sheet and the company and then here we have the Fed saying that maybe you haven't done so. So how does this process work from here? Will we hear results about the SCB ahead, or is this something that's just behind closed doors?\nDavid Solomon\nLook, as a general matter, what I'd say, Mike, as a general matter, we're supporters of stress testing. We believe it's an important component of the Fed's mandate to really ensure the safety and soundness of the banking system.\nHowever, we've maintained for some time that there are elements of this process that may be distracting from these goals of safety and soundness. The stress test process, as you just highlighted, is opaque. It lacks transparency. It contributes to excess volatility and the stress capital buffer requirements, which obviously makes prudent capital management difficult for us and all of our peers. We don't believe that the results reflect the significant changes we've made in our business. They're not in line with our own calculations, despite the fact that the scenarios are consistent year over year.\nNow, despite all that, you know, we've got the capital flexibility to serve our clients. We'll continue to work with that capital flexibility and we'll also continue to engage around this process to ensure that over time we can drive the level of capital that we have to hold in our business mix down. But obviously we have more work to do, given this result.\nMike Mayo\nAll right, thank you.\nOperator\nSteven Chubak, Wolfe Research.\nSteven Chubak\nHi, Good morning. So I wanted to start off with a question. Just want to start with a question on the consumer platform fees. They were down only modestly despite the absence of the Green Sky contribution. Just wanted to better understand what drove the resiliency in consumer revenues, whether the quarterly run rate of $600 million is a reasonable jumping off point as we look at the next quarter?\nDenis Coleman\nSo, Steve, thank you for the question. I mean on a sequential basis, they're down, but that's because we have the absence of the Green Sky contribution. There actually is growth across the card portfolio. I think you've seen that the level of growth has slowed as we have sort of implemented several rounds of underwriting adjustments to the card originations and so our expectation is that on the forward you know the period-over-period growth should be more muted.\nSteven Chubak\nUnderstood and maybe just one more clarifying question. I know there's been a lot asked about the SCB. Really just wanted to better understand, Denis, since you noted that you're running with 90 bps of cushion, which is actually above normal.\nJust how you're handicapping the additional uncertainty related to Basel III Endgame. There's certainly been some favorable momentum as per the press reports and even some public comments from regulators? But just want to better understand, given the uncertainty around both the SCB and Basel III Endgame, where you're comfortable running on a CET1 basis over the near to medium term?\nDenis Coleman\nSure, thanks, and I appreciate that question. I think obviously there's been a lot of changes, there's been some changes and expectations. And I think in highlighting that we are operating at the wider end of our range, it is to signal flexibility. And certainly, embedded in that is to address some of the uncertainty which does remain with respect to Basel III Endgame, both the quantum and timing of its resolution.\nIt sounds from some of Powell's latest comments that, that may not be something that comes into effect until perhaps into 2025, but we are sort of maintaining a level of cushion that I think is appropriate in light of what we know and we don't know about the future opportunity set for Goldman Sachs, but that buffer is designed to support clients, return capital to shareholders, while maintaining a prudent buffer with some of the lingering uncertainty with respect to future regulatory input.\nSteven Chubak\nHelpful color. Thanks for taking my questions.\nOperator\nDevin Ryan, Citizens JMP.\nDevin Ryan\nAll right, great. Good morning, David and Denis. A couple questions on AWM progress. So the first one is on the alts business specifically, and you're tracking obviously well ahead of the fundraising targets relative to when you set the $1 billion medium-term target for annual incentive fees? And now with over $500 billion in alts AUM and obviously growing, that would seem pretty conservative.\nSo I appreciate there's a lot of work to do to generate the returns ahead here, but how should we think about the underlying assumptions for incentive fees in a more normal harvesting environment, just given the mixed shift and the growth that you're seeing in AUM there?\nDenis Coleman\nSo Devin, I think it's a good question, and I think we share your expectation that, that's going to be a more meaningful contributor on the forward. We laid it out as one of the building blocks at our Investor Day. The contribution coming through that line since then has been not as high as we have modeled from an internal medium to longer term perspective.\nWe do give good disclosure that the balance of unrealized incentive fees at the end of the last quarter were $3.8 billion, so you can make you know various assumptions as to what the timing of the recognition of those fees are they can obviously bounce around from time-to-time. It is a granular you know vehicle-by-vehicle build-up, but you know given the current outlook and status of those funds that our best expectation of what level of fees could be coming through that line over the next several years.\nSo I think it is an important incremental contributor and should be, you know, should help the return profile of asset wealth management on the forward, couple that with the success that we're having with ongoing alts fundraising and that will help to feed future investments and funds, which in turn will generate some backlog of potential incentive fees above and beyond what's already in the unrealized disclosures.\nDevin Ryan\nYeah, okay, thanks, Denis. And then follow-up, this is also kind of connected, but at a recent conference, you highlighted the margin profile of all the standalone businesses and asset and wealth management of public peers, so kind of as a comparison and highlighted 35%-plus for alts and some of the public firms we know are obviously well above that.\nSo I appreciate you're running the AWM segment is kind of one segment, but if alts does accelerate and we're looking at 60% of alts AUM isn't even the fee earning yet, what does that mean for segment margins relative to kind of that mid-20% target, because you're already at 23% thus far in '24. So just trying to think about the incremental margins coming from the acceleration in growth, particularly from the alts segment as well?\nDenis Coleman\nSo that's a good question, Devin. I mean, it should be a significant unlock for us because despite the breadth and the longevity with which we've been running our alts businesses, there is significant opportunity for us to actually improve the margin profile of the alts activities in particular relative to the overall AWM margin, particularly as we develop incremental scale by strategy.\nAnd so in addition to just overall growth in the segment, which should unlock margin improvements, actually within our portfolio of activities, the alts business, again, despite its current scale, presents a big opportunity for incremental margin contribution.\nDevin Ryan\nGreat. Thank you.\nOperator\nDan Fannon, Jefferies.\nDan Fannon\nThanks, good morning. In terms of your on-balance sheet investments, you continue to make progress in reducing that this quarter. Can you talk about the outlook for this year or any line of sight in terms of exits that we can think about?\nDenis Coleman\nSure. Thank you. Obviously, an ongoing commitment of ours to move down those on balance sheet exposures, also part of the equity and capital story and returns in the segment at $2.2 billion for the quarter, that was a decent reduction. We obviously have a target out there to sell down the vast majority of that balance, which is now at $12.6 billion by the end of next year.\nBut our expectation is that we will continue to chip away at it across both the third and the fourth quarter of this year and then on into 2025. There's really no change on our commitment to sell down the vast majority of that by the end of next year.\nDan Fannon\nUnderstood. And as a follow-up, just within asset and wealth, particularly on the alts side, the fundraising target raised for the full-year given the success you've had. The private credit fund closing here in the first-half was big.\nCan you talk to some of the other strategies that have the potential to scale as you mentioned earlier and/or maybe are a little bit smaller that have really large or increasing momentum as you think about second-half, but also as we even into next year?\nDenis Coleman\nSure. So you know, obviously taking a step back, you're talking about the targets that we set, you know, once upon a time it was $150 billion, we moved it to $225 billion. It's now at $287 billion and with $36 billion raised through the first-half and us expecting to surpass $50 billion, that means we should be north of $300 billion by the end of this year.\nAnd I think one of the things that we find attractive about our platform is that we have opportunities to scale across multiple asset classes within alternatives, equity, credit, real estate, infrastructure. We had notable fundraisings in private credit and real estate this quarter, but you can see contribution from other strategies like equity on the forward and a number of different strategies, both by asset class and by region. So we think we have a diversified opportunity set to continue to scale the alts platform.\nOperator\nMatt O'Connor, Deutsche Bank.\nMatt O'Connor\nGood morning. I was wondering if you could just elaborate a bit on the competitive landscape specifically in banking and markets. I know it's always competitive, but some of the really big bank peers, you know, are leaning in who haven't been a few years ago.\nAnd all these regional banks that I cover are also realizing that they need broader cap and market capabilities. So you're obviously an industry leader in a lot of the areas across banking and markets. And I'm just wondering how you're seeing the competition impact you at this point?\nDavid Solomon\nSure, Matt, and I appreciate the question. I just say, you know, investment banking and the markets business, the trading business, they've always been competitive businesses. I think our integrated One GS approach is a very, very competitive offering. I mean, we can have debates, but it's, I think, one of the top two offerings out there, depending on how you look at it what you look at.\nThere's always going to be competition, there are always going to be people that come in and make investments in niche areas, but broadly speaking you know we've had leading M&A share for 25-years. We have leading share in capital raising for an equivalent period of time. We've continued to invest in our debt franchises over the last more than decade. An then our trading businesses and our ability to intermediate risk I think have been second to none or viewed as second to none for a long, long time.\nAnd so the combination of our focus on serving our clients, making sure we're giving them the right resources, both human capital and financial capital, to accomplish what they need to accomplish, the fact that we have global scale positions us very well. They'll always be competitors, but I like where our franchise sits. And I don't see any reason why we shouldn't be able to continue to invest in it, strengthen it, and continue to have it operating as a leader in what's always been and will continue to be a very competitive business.\nMatt O'Connor\nOkay helpful and agreed. And then just separately, I hate to ask you about activity levels and stuff like that since the debate three, four weeks ago, but maybe I'll frame it. From your experience in presidential election periods like this, where there's maybe just more uncertainty than normal, like how do both institutional and corporate clients react? Do they kind of say, well, let's wait and see the other side? Is it just noise, because we've been going through it for some time here, but what are your thoughts on that? Thank you.\nDavid Solomon\nThere are always exogenous factors that affect corporate activity and institutional client activity. I don't have a crystal ball, so I can't see what the next 100 days leading up to our election will bring, but I think we're well-positioned to serve our clients. Regardless of the environment, the clients are very active at the moment, and I think they're probably going to continue to be active.\nMatt O'Connor\nThank you.\nOperator\nGerard Cassidy, RBC.\nGerard Cassidy\nThank you. Good morning, David. Good morning, Denis. David, you said in your opening comments that you took the Board out to Silicon Valley and you were impressed with the artificial intelligence and what we could expect in the future and the opportunities for Goldman to be able to finance some of the infrastructure needs that may come of that.\nCan you share with us the artificial intelligence that you guys are implementing within Goldman and how it's making you more productive, generating maybe greater revenues or even making it more efficient?\nDavid Solomon\nSure, I mean, at a high level, Gerard, we as most companies around the world are focused on how you can create use cases that increase your productivity. And if you think about our business as a professional service firm and a people business, where we have lots of very, very highly productive people creating tools that allow them to focus their productivity on things that advance their ability to serve clients or interact in markets is a very, very powerful tool.\nSo if you look and you think across the scale of our business, I think you can think of lots of places where the capacity to use these tools to take work that's always been done on a more manual basis and allow the very smart people to do that work to focus their attention on clients are quite obvious.\nYou can look at it in an area like the equity research area as every quarter you're all analysts on the phone. There's lots of ways that these tools can leverage your capacity to spend more time with clients. You think about our investment banking business and the ability in our investment banking business to have what I'll call the factory of the business prepare information, thoughtful information for clients, the revolution's there.\nWhen you look at the data sets we have across the firm and our ability to get data and information to clients, so that they can make better decisions around the way they position in markets, that's another obvious use case. For our engineering stack and we have close to 11,000 engineers inside the firm, the ability to increase their coding productivity is meaningful.\nSo those are a handful, there are others. We have a broad group of people that are very focused on this. But again, I'd step back. Well, this will increase our productivity. The thing that we're most excited about is all businesses are looking at these things and are looking at ways that it adapts and changes their business. And that will create more activity in a tailwind broadly for our businesses. People will need to make investment, they'll need financing, they'll need to scale. And so we're excited about that broad opportunity.\nGerard Cassidy\nVery good. And then as a follow-up, Denis, you talked about credit, and it was impressive that you didn't have any charge-offs in the wholesale book. Can you give us some color on what you're seeing there? It seems like there must be some improvement since obviously you didn't have any charge-offs in the wholesale book?\nDenis Coleman\nSure. Thanks, Gerard. As you observe, the charge-off rate for us in the wholesale is approximately 0%. What we did see in this quarter was release, and we've been able to improve some of our models and be able as a consequence to release some of the provisions in the wholesale segment.\nSo while that was a contributing benefit to sort of call it the net PCL of the quarter with consumer charge-offs offset by that wholesale release, that's not necessarily something that we would expect to repeat each quarter in the future.\nAnd although we manage our credit and our wholesale risk very, very diligently and consistently, it is more likely the case that we will have some degree of impairments, given our size and scale and representation in the business. But we're pleased that the overall credit performance in terms of charge-offs is about 0%.\nGerard Cassidy\nThank you.\nOperator\nSaul Martinez, HSBC.\nSaul Martinez\nHi, good morning. Thanks for taking my question. Just a follow-up on capital, I mean, it certainly is encouraging that your CET1 ratio rose 20 bps in a quarter where you bought back $3.5 billion of stock and you did have a -- I think, a [$16 billion] reduction in RWA as your presentation talks about credit RWA is falling this quarter? I guess, can you just give a little bit more color on what drove that reduction? And I guess more importantly, is there a continued room for RWA optimization from here to help manage your capital levels?\nDenis Coleman\nSure, thanks, Saul. I appreciate that question. Capital optimization, RWA optimization, is something that we've been committed to for a very long period of time. On the quarter, there were reductions both in credit and market risk RWAs. Drivers included less derivative exposure, reduced equity investment exposure, and in some places lower levels of volatility.\nWe try to get the right balance between deploying on behalf of client activity, as well as being efficient and rotating out of less productive activities or following through on our strategic plan to narrow focus and reduce balance sheet exposure. So that is something that was contributed to quarter-over-quarter benefit despite the buyback activity we executed. And it's something we'll remain very focused on just given the multiplicity of binding constraints that we operate under.\nSaul Martinez\nThank you, that's helpful. And maybe a follow-up on financing, FICC financing up 37%, equities -- equity financing is now something close to 45% of all of your equity sales and trading revenues. I guess how much more room is there, or how should we think about sort of the size of the opportunity set, you know, to continue to grow from here? How much more space is there, you know, to use finding a thing as a mechanism to help deepen penetration with your top institutional clients?\nDenis Coleman\nThat's a good question, Saul. I think on the FICC financing side, as I indicated, we do think that we are helping clients participate in the overall level of growth that they're seeing in their businesses. And you know, we think based on what we see currently, that we can calibrate the extent of our growth based largely on how we assess the risk return opportunity set across the client portfolio.\nSo we're being disciplined with respect to our growth, but trying also to support clients in their growth and drive a more durable characteristic across the GBM business.\nIn equities, the activity and the balances, et cetera, obviously have benefited from equity market inflation over the course of the year, but it's also an activity that we remain committed to in terms of supporting clients.\nAnd clients look to us on a holistic basis really across both FICC and equities to ensure that across all of the activities they're doing with us that we're finding some balance between helping them through financing activities, helping them with intermediation, helping them with human capital. So both of those activities are part of more interconnected activities with clients and something that we remain very focused on and think we can continue to grow.\nSaul Martinez\nOkay, great, thank you.\nOperator\nThank you. At this time there are no additional questions in queue. Ladies and gentlemen, this concludes the Goldman Sachs' second quarter 2024 earnings conference call. Thank you for your participation. You may now disconnect.", "Link": "Https://Finance.Yahoo.Com/News/Q2-2024-Goldman-Sachs-Group-052208133.Html", "Sentiment_Score": -0.1652242243, "Sentiment_Category": "bearish"}, {"Ticker": "GS", "Time": "2024-07-15T23:30:00.000Z", "Headline": "Time to Buy BlackRock (BLK) or Goldman Sachs (GS) Stock After Q2 Earnings?", "Summary": "This morning, second quarter reports from BlackRock BLK and Goldman Sachs GS provided insight into the prominent investment management banks with both appearing to benefit from easing inflation.\nLet’s review BlackRock and Goldman's Q2 results and see if now is a good time to buy stock in these finance titans.\nBlackRock Q2 Review\nIn what BlackRock stated was one of its strongest performances and highest quarterly growth rates since the pandemic, the company expanded its margin by 160 basis points during Q2.\nBlackRock brought in $80 billion in new assets and generated 3% annualized organic base fee growth which was the highest mark during Q2 in three years. Overall, BlackRock ended the quarter with record AUM (Assets Under Management) of over $10.6 trillion.\nOperating income of $1.9 billion and EPS of $10.36 spiked 12% respectively with Q2 sales of $4.8 billion expanding 8%. This was attributed to the positive organic base fee growth and the impact of market movement on average AUM. BlackRock’s top and bottom line figures for Q2 registered a surprise of -1% and 4% respectively.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nGoldman Sachs Q2 Review\nGoldman Sachs was able to beat both its top and bottom line expectations by 1% with Q2 EPS of $8.62 and sales of $12.73 billion. Year over year, Q2 earnings soared 180% from $3.08 a share in the comparative quarter. Quarterly sales increased 17% while total operating expenses were nicely down to $8.53 billion which fueled Goldman’s increased profitability.\nNotably, Goldman’s AUM increased by $86 billion and is also sitting at record levels of $2.93 trillion. Goldman also ranked as the worldwide leader in announced and completed mergers so far this year seeing strength in its Global Banking and Asset & Wealth Management segments.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nRecent Performance & Valuation Comparison\nYear to date, Goldman’s stock has soared +50% to impressively top the S&P 500’s +25% while BlackRock’s +13% has lagged the broader market. \nZacks Investment Research\n\nImage Source: Zacks Investment Research\nStill, BlackRock's stock trades at 20X forward earnings with Goldman at 13.2X, offering nice discounts to the S&P 500’s 23.6X.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nBottom Line\nBlackrock and Goldman Sachs’ stock currently land a Zacks Rank #3 (Hold). To that point, more upside in these investment management leaders may depend on the trend of earnings estimate revisions following their Q2 results but they remain viable long-term investments, especially with record assets under management.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Time-Buy-Blackrock-Blk-Goldman-233000495.Html", "Sentiment_Score": 0.0067952909, "Sentiment_Category": "neutral"}, {"Ticker": "GS", "Time": "2024-07-15T21:56:46.000Z", "Headline": "Trump picks JD Vance for VP, Big Bank earnings: Market Domination", "Summary": "It's that final trading hour, and stocks (^DJI, ^IXIC, ^GSPC) are still abuzz. Julie Hyman and Josh Lipton walk investors through the last sixty minutes in Monday's session as markets continue to digest the news of an attempted assassination attempt on former President Trump's life over the weekend.\nAt the Republican National Convention (RNC) in Milwaukee, WI, today, Trump announced his vice presidential running mate: Senator JD Vance (R-Oh.) Fletcher School of Law and Diplomacy lecturer and “Picking Presidents” author Gautam Mukunda speaks on what Trump's choice in Vance may signify about past messaging of unity.\nPortales Partners founder and Wall Street Beats partner Charlie Peabody joins the program to discuss what the latest slew of Big Bank earnings may signify about the industry.\nOther trending tickers on the Yahoo Finance platform include bitcoin (BTC-USD), Apple (AAPL), and Macy's (M).\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Trump-Picks-Jd-Vance-Vp-215646628.Html", "Sentiment_Score": 0.0462526754, "Sentiment_Category": "neutral"}, {"Ticker": "GS", "Time": "2024-07-15T21:03:59.000Z", "Headline": "Goldman Sachs earnings prove bank still very cyclical", "Summary": "Among the Big Bank stocks, JPMorgan Chase & Co. (JPM), Wells Fargo (WFC), Citigroup (C), Goldman Sachs (GS), and BlackRock (BLK) have been the first to report second-quarter results this earnings season.\nPortales Partners founder and Wall Street Beats partner Charlie Peabody comes on Market Domination to talk about the prevalent themes emerging in bank earnings, such as net interest income figures\n\"Short term, there's momentum in the capital markets. And so Goldman is a good momentum play, but we argue that their earnings stream remains much more cyclical than the market is valuing them at,\" Peabody states. \"And that's the big debate out there in management as they moved away from their failed consumer banking strategy back to their roots as an investment bank, have been trying to convince the street that there is a core underlying earnings power that's sustainable and stable. And I don't believe them.\"\nPeabody also looks ahead to the bank earnings due out this week, such as Morgan Stanley (MS): \"I think it's going to be more of the same — strong, investment banking with an eye towards a pick up in M&A and IPOs in the second half of the year. And then trading will be driven more by equity trading and less so by fixed income trading.\"\nFor more expert insight and the latest market action, click here to watch this full episode of Market Domination.\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Goldman-Sachs-Earnings-Prove-Bank-210359849.Html", "Sentiment_Score": -0.9227243662, "Sentiment_Category": "bearish"}, {"Ticker": "GS", "Time": "2024-07-15T19:36:33.000Z", "Headline": "Goldman-Led Group Backs Databricks, Plaid Through NEA Vehicle", "Summary": "(Bloomberg) -- Goldman Sachs Group Inc.’s alternatives unit is leading a consortium investing in a $540 million continuation vehicle created by venture capital firm NEA, according to people familiar with the matter.\nMost Read from Bloomberg\nBlackRock Says Gunman From Trump Rally Appeared in Firm’s Ad\nTrump Shooting Changes Biden’s Plan to Revive 2024 Campaign\nTrump Taps Vance as Running Mate, Picking Populist Protege\nAmazon Sold a Used Diaper. It Tanked a Mom-and-Pop Business\nTrump Classified Documents Case Dismissed by Florida Judge\nThe VC firm contributed stakes in 11 of its companies — including startups Databricks, Plaid and Tempus AI Inc. — to the vehicle.\nThe transaction, which enables NEA to give its limited partners some liquidity, also features investors including Industry Ventures, Pathway Capital Management and Goanna Capital, the people said. Jefferies Financial Group Inc.’s private capital group advised on the transaction, they said.\nDatabricks and Plaid comprise about 38% and 10% of the vehicle, respectively, the people said.\nOther companies in the vehicle are Strive Health, Built Robotics, Automation Anywhere, Instabase, Collective Health, National Resilience, Echodyne and Everside Health.\nAll in, the deal was priced at a roughly 19% discount to NEA’s internal marks, some of the people said. The firm’s internal marks include Databricks and Plaid at $46 billion and $8 billion, respectively.\nRepresentatives for NEA, Jefferies, Goldman, Industry Ventures, Pathway Capital Management and Goanna Capital either declined to comment or didn’t immediately respond to a request for comment.\nAmid a lull in exit activity, alternative-asset managers — especially those focused on venture and private equity — have faced heightened pressure to distribute cash to institutional investors such as pension funds and endowments.\nMost Read from Bloomberg Businessweek\nHow Rivian Became the Anti-Tesla\nLooser Visa Rules for Indian Travelers Stoke a Tourism Boom\nUkraine Is Fighting Russia With Toy Drones and Duct-Taped Bombs\nAsia Is The New Hot Destination for Luxury Travel\nFrench Elections Result Is Least Worst Outcome for Business\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Led-Group-Backs-Databricks-193633518.Html", "Sentiment_Score": 0.0341152586, "Sentiment_Category": "neutral"}, {"Ticker": "GS", "Time": "2024-07-15T18:38:47.000Z", "Headline": "Goldman Sachs wealth bounces back with record management fee revenue and assets", "Summary": "Adobe Stock/Andreas Prott\nGoldman Sachs reported an increase in earnings, record assets under supervision and record revenue from management fees in its asset and wealth management division.\nThe division reported net earnings of $700 million, signaling that the firm is bouncing back from its subpar performance last year when it reported $208 million in losses at the end of the second quarter. Overall, Goldman Sachs saw profits of $3.04 billion in the second quarter.\nREAD MORE: Goldman's wealth management unit shows dip amid tough quarter\nIn a Monday call with analysts, Chief Financial Officer Denis Coleman noted the success of the company's wealth management franchise.\n\"This business has been a key contributor to our success in increasing more durable revenues and provides us with a strong source of demand for our suite of alternative products, a great example of the power of this unique platform,\" Coleman said. \"We expect continued momentum in this business as we also deepen our lending penetration with clients and grow our advisor footprint.\"\nREAD MORE: Goldman Sachs wants to hire in wealth and asset management units\nColeman's remarks expressed confidence in the firm's direction, which is driven more by its wealth and asset management services than in the past and turns away from providing retail advisory services. The firm sold its Personal Finance Management service to Creative Planning last year, which brought in $394 million.\nManagement fees\nThe firm again saw record revenues from asset and wealth management fees, posting $2.54 billion in income, which is an 8% increase from the same time last year. Fees from alternative investments increased by 5% from last year to $548 million.\nThe growth in revenue from fees mainly comes from greater assets under supervision.\nREAD MORE: Stepping away from retail advice, Goldman reports record for wealth management\nNotably, Goldman Sachs saw an 84% increase in incentive fees to $46 million, indicating strong performance from the company's fund managers.\nGoldman Sachs does not report advisor headcount for its asset and wealth management division.\nAssets under supervision\n\nGoldman reported a record $2.93 trillion of assets under supervision across the board, with the bank seeing net inflows across all asset classes and net market appreciation in equity assets.\nGrowth in assets under supervision was driven by alternative assets under supervision, which rose 17.6% from the second quarter of last year to $314 million, and equities, which rose 17.2% to $735 million. Fixed income under supervision grew 8.6% to $1.15 billion.\nThe company raised $36 billion in alternatives, year to date, which was \"stronger than anticipated\" according to Solomon. As a result, the company expects to surpass $50 billion in alternatives fundraising by the end of the year.\n\"This is a testament to our investment performance, track record and intense focus on client experience,\" Solomon said. \"We are excited about the additional growth opportunities for our Asset & Wealth Management platform.\"\nRevenue\n\nNet revenues in asset and wealth management increased by 27% from the same time last year, reaching $3.88 billion.\nLower revenue in private banking and lending was partly a result of the company's sale of its Marcus loans portfolio last year, which netted the company $100 million and raised revenues above their normal level.\nEquity investments brought the company $292 million, up from losses of $403 million from the same time last year. These gains were propelled by gains from real estate investments.\nExpenses\n\nGoldman Sachs reported lower expenses compared to the same time last year, spending $3.04 billion within its asset and wealth management unit.\nCompany operating expenses overall totaled $8.53 billion for the second quarter.\nRemark\n\nSolomon started off the call condemning the attempted assassination of former president Donald Trump.\n\"We are grateful that he is safe and also want to extend my sincere condolences to the families of those who were tragically killed and severely injured. It is a sad moment for our country,\" he said.\nSolomon highlighted the prevalence of geopolitical instability, implications of upcoming global elections and stickier-than-expected inflation as areas of concern. However, he called the operating environment in the United States \"relatively constructive.\"\nThe CEO reaffirmed his confidence that AI will have positive implications for the financial sector, noting that the company's board of directors recently traveled to Silicon Valley to discuss the technology with CEOs of AI-related companies.\n\"We all left with a sense of optimism about the application of AI tools and the accelerating innovation in technology more broadly,\" Solomon said. \"The proliferation of AI in the corporate world will bring with it significant demand-related infrastructure and financing needs which should fuel activity across our broad franchise.\"\nSolomon also noted the company's 25th anniversary as a public company, commending the bank's perseverance through financial turmoil.\n\"When I look back at how we overcame these challenges, I immediately think of our culture,\" Solomon said. \"One that has evolved, no doubt, but always stayed true to our core values. I know that the preservation of our culture is paramount to serving our clients with excellence, maintaining our leading market positions, growing our businesses and continuing to attract and retrain the most talented people.\"", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Sachs-Wealth-Bounces-Back-183847265.Html", "Sentiment_Score": 0.921308279, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T18:28:34.000Z", "Headline": "Dow Jones Leader Goldman Sachs, GE Stock In Or Near Buy Zones Today", "Summary": "Dow Jones leader Goldman Sachs, along with GE stock, are in or near buy zones Monday. Goldman reported earnings early Monday.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/0345Ef86-0707-3F0F-B11A-63754311329A/Dow-Jones-Leader-Goldman.Html", "Sentiment_Score": 0.0215743929, "Sentiment_Category": "neutral"}, {"Ticker": "GS", "Time": "2024-07-15T18:25:00.000Z", "Headline": "These Stocks Are Moving the Most Today: Trump Media, Tesla, Goldman Sachs, Apple, SolarEdge, First Solar, Macy’s, and More", "Summary": "Trump Media stock surges following an assassination attempt on former President Donald Trump, Tesla jumps after CEO Elon Musk endorses Trump for president, and Goldman Sachs tops earnings expectations.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/32539C94-02A1-3Baa-A8F5-Fef655C56Aa3/These-Stocks-Are-Moving-The.Html", "Sentiment_Score": 0.0747342408, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T18:08:00.000Z", "Headline": "S&P 500 Climbs to Start the Week; Investors Process Trump Attack", "Summary": "U.S. stocks climbed alongside government bond yields, as investors assessed the implications of Saturday’s assassination attempt on Donald Trump.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/6398Dd5D-880F-3333-9883-7A05B1Dfd5D9/S-P-500-Climbs-To-Start-The.Html", "Sentiment_Score": 0.1128171608, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T17:30:46.000Z", "Headline": "Trump continues to RNC, market reactions, Goldman Sachs: Morning Brief", "Summary": "US stocks (^DJI, ^IXIC, ^GSPC) have been rallying ahead of the market open — and into the trading day — after the assassination attempt on former President Trump's life at a campaign rally in Butler, Pennsylvania, on Saturday. In the wake of this news, Trump Media & Technology Group (DJT) shares and bitcoin (BTC-USD) prices have been surging.\nBrad Smith and Madison Mills discuss these events and more, monitoring the biggest news moving equities in today's episode of The Morning Brief.\nIn a post on Truth Social, Trump announced his plans to continue on the campaign trail and head to Milwaukee, WI, today for this week's Republican National Convention (RNC). The Morning Brief team brings on several political experts and market strategists to discuss the broader implications this past weekend's events will have on the 2024 election and the stock market, including Pangaea Policy founder Terry Haines and BTIG director of policy research Isaac Boltansky.\nGoldman Sachs (GS) topped second-quarter earnings estimates, the bank seeing its revenue jump 17% higher year-over-year. Citizens JMP managing director Devin Ryan joins the show to talk about Goldman Sachs' earnings results and the reoccurring themes seen across other Big Bank earnings reported so far.\nOther top trending tickers on the Yahoo Finance platform include retailer Macy's (M), high-end fashion brand Burberry (BRBY.L), and Coinbase Global (COIN).\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Trump-Continues-Rnc-Market-Reactions-173046348.Html", "Sentiment_Score": 0.0596672557, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T17:21:00.000Z", "Headline": "Goldman Sachs Overhaul Takes Two Steps Forward, One Step Back", "Summary": "Two vital parts of Goldman’s strategy under Chief Executive David Solomon remained well on track in the second quarter, which the bank reported on Monday. The other is to shift assets from the bank’s own balance sheet to funds managed for fee-paying outside investors. It is all part of Goldman’s broader aim to transition its image from Wall Street’s swashbuckling, boom-and-bust investment bank to a more reliable, diversified institution.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/3350Dea6-72F5-3E6A-Bb2B-B0Bf3C60366A/Goldman-Sachs-Overhaul-Takes.Html", "Sentiment_Score": 0.0593587607, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T15:23:00.000Z", "Headline": "Goldman (GS) Q2 Earnings Beat Estimates, IB Revenues Rise Y/Y", "Summary": "The Goldman Sachs Group, Inc.’s GS second-quarter 2024 earnings per share of $8.62 surpassed the Zacks Consensus Estimate of $8.52. This compares favorably with $3.08 reported in the year-earlier quarter.\n\nGoldman’s results have benefited from the strength in Fixed Income, Currency and Commodities Client Execution (FICC) financing revenues, investment banking (IB) and consumer banking business. Further, a decline in expenses and provisions acted as a tailwind.\n\nNet earnings of $3.04 billion increased significantly from $1.22 billion in the prior-year quarter.\nRevenues Increase and Expenses Fall\nNet revenues for the quarter of $12.73 billion increased 16.9% from the year-ago quarter. Also, the top line surpassed the Zacks Consensus Estimate of $12.6 billion.\n\nTotal operating expenses decreased marginally year over year to $8.53 billion. \n\nProvision for credit losses was $282 million, plunging 54.1% year over year.\nQuarterly Segmental Performance Improves\nThe Asset & Wealth Management division generated revenues of $3.88 billion in the reported quarter, up 27.3% year over year. The improvement was driven by higher management and incentive fees, equity investments and higher net revenues in Debt investments, which was partially offset by lower net revenues in Private banking and lending.\n\nFirmwide assets under supervision were a record $2.93 trillion, up 8.1% from the prior-year quarter.\n\nThe Global Banking & Markets division has recorded revenues of $8.18 billion, which increased 13.8% year over year. The improvement was due to an increase in the IB business (up 21.1%), higher revenues in FICC (up 17.3%), along with a rise in equities revenues (up 6.8%).\n\nThe Platform Solutions division’s revenues were $669 million, up 1.5% year over year. The rise was driven by higher revenues from consumer platforms.\nCapital Ratios Improves\nAs of Jun 30, 2024, the standardized Common Equity Tier 1 capital ratio was 14.8%, up 14.6% on a sequential basis. The company’s supplementary leverage ratio was 5.4%, which remained unchanged from the previous quarter.\nCapital Distribution Update\nDuring the reported quarter, Goldman returned $4.43 billion of capital to common shareholders. This included $3.50 billion in share repurchases and common stock dividends of $929 million.\n\nFurther, following the clearance of the 2024 stress test, on Jul 12, GS’ board of directors approved a 9% increase in common stock dividend to $3 per share.\nOur View\nGoldman’s well-diversified business will continue to support its earnings stability in the upcoming period. Strong performance in IB, FICC financing revenues and consumer banking business acted as a tailwind. Active client engagement and a solid position in announced and completed mergers and acquisitions globally are likely to act as tailwinds. However, a potential economic slowdown is a near-term concern. \nThe Goldman Sachs Group, Inc. Price, Consensus and EPS Surprise\nThe Goldman Sachs Group, Inc. Price, Consensus and EPS Surprise\nThe Goldman Sachs Group, Inc. price-consensus-eps-surprise-chart | The Goldman Sachs Group, Inc. Quote\nCurrently, Goldman carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nPerformance of Other Big Banks\nWells Fargo & Company's WFC second-quarter 2024 earnings per share of $1.33 surpassed the Zacks Consensus Estimate of $1.27. In the prior-year quarter, the company reported earnings per share of $1.25.\n\nWFC's results benefited from higher non-interest income. An improvement in capital ratios and a decline in provisions were other positives. However, the decrease in net interest income, as well as loan and deposit balances, and an increase in expenses were the undermining factors.\n\nThe Bank of New York Mellon Corporation’s BK second-quarter 2024 adjusted earnings of $1.51 per share surpassed the Zacks Consensus Estimate of $1.43. Also, the bottom line reflects a rise of 9.4% from the prior-year quarter.\n\nBK's results have been primarily aided by a rise in fee revenues and lower expenses. The assets under custody and/or administration and assets under management balances grew on a solid market rally. However, a decline in net interest revenues hurt the results to some extent.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\nWells Fargo & Company (WFC) : Free Stock Analysis Report\nThe Bank of New York Mellon Corporation (BK) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Gs-Q2-Earnings-Beat-152300730.Html", "Sentiment_Score": 0.9203423858, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T15:03:08.000Z", "Headline": "Jamie Dimon, Larry Fink among Wall Street leaders calling for unity following attempted Trump assassination", "Summary": "Some of the biggest names on Wall Street urged unity and calm following Saturday's assassination attempt on Donald Trump, using new memos to employees and conference calls with analysts to condemn the violence and call for civil discourse.\n\"I truly hope this is a moment that will spur reflection and action that celebrates what unites us as citizens and as a society,\" Goldman Sachs CEO David Solomon said Monday morning as he led off his firm's quarterly earnings call.\nSolomon was joined by CEOs from JPMorgan Chase (JPM), Citigroup (C), BlackRock (BLK), and Bank of America (BAC).\nJPMorgan Chase CEO Jamie Dimon, center, testifies before Congress alongside other bank CEOs during a 2023 oversight hearing. (Tom Williams/CQ-Roll Call, Inc via Getty Images) (Tom Williams via Getty Images)\nJPMorgan Chase CEO Jamie Dimon weighed in over the weekend in a memo to his employees after his bank, the largest in the US, reported its earnings on Friday.\n\"We are deeply saddened by the political violence and the assassination attempt on former President Trump last evening,\" he wrote on Sunday morning in a memo shared with Yahoo Finance. \"It is only through constructive dialogue that we can tackle our nation's toughest challenges.\"\nBank of America CEO Brian Moynihan also penned a letter to his employees over the weekend, saying, \"Any form of violence in action or speech has no place in political discourse or engagement\" and adding, \"This is the longstanding position of our company.\"\nIn her own letter Monday morning, Citigroup CEO Jane Fraser wrote to her employees that \"I hope these events will cause everyone to think about the words we use and tone down the rhetoric so we can have a more civil discourse.\"\n\"There is so much riding on it,\" she added.\nOne firm with an inadvertent connection to the shooter\nAnother call for calm came from BlackRock CEO Larry Fink, who said, \"We must condemn political violence of any kind, period\" during his own firm's quarterly earnings call Monday morning.\nWhile the vast majority of the call was devoted to the firm's results, Fink began and ended that call with allusions to the political climate.\nBlackRock, the world's largest asset manager, also confronted an inadvertent connection to the shooter when it surfaced online that an old BlackRock ad focused on a Pennsylvania teacher had briefly shown then-student Thomas Matthew Crooks.\nCrooks is the 20-year-old who the FBI has identified as the alleged shooter who wounded Trump and was then quickly killed by Secret Service agents.\nThomas Matthew Crooks is briefly seen in a screen grab of an BlackRock ad where he appeared for less than a second. (BlackRock)\nIn a statement over the weekend, BlackRock confirmed that the footage was authentic and underlined that Crooks, who was briefly shown sitting at a desk and never speaks in the video, was unpaid.\n\"We will make all video footage available to the appropriate authorities, and we have removed the video from circulation out of respect for the victims,\" the statement added.\nWill the calls be heeded?\nThe wave of financial commentary mirrored a business world outpouring over the weekend from many CEOs, including many in the technology sector.\n\"I pray for President Trump's rapid recovery,\" wrote Apple (AAPL) CEO Tim Cook in just one example, adding, \"I strongly condemn this violence.\"\nWhat remains to be seen if the calls for calm coming from business and world leaders will be heeded. There are signs that US political leaders in both parties are going to at least try to tone down the rhetoric.\n\"The political rhetoric in this country has gotten very heated,\" Joe Biden said in an address to the nation Sunday night. \"It's time to cool it down.\"\nAnd Donald Trump, who saw the bullet pass inches from his skull and injure his ear as he began his speech in Pennsylvania, said in an interview with the Washington Examiner that he'd changed his convention speech in order to help \"bring the country together.\"\n\"UNITE AMERICA!\" he added on social media.\nDonald Trump supporters demonstrate in front of Trump Tower after the former U.S. President was injured during shooting at campaign rally at the Butler Farm Show in Pennsylvania. (Beata Zawrzel/NurPhoto via Getty Images) (NurPhoto via Getty Images)\nBut the aftermath has already been marked by heated — and many say irresponsible — rhetoric from partisans on both sides. Some either looked to downplay the violence or even claimed it was staged with no evidence.\nAlso, in the case of some Republicans, some tried to blame President Biden for the actions of Thomas Crooks.\nBiden's \"rhetoric led directly to President Trump's attempted assassination\" read one highly criticized missive from Sen. J.D. Vance, who is a finalist to become Trump's vice presidential nominee this week.\nTrump is already in Milwaukee preparing for this week's Republican National Convention and is expected to make an appearance this evening when proceedings get underway.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance. Ben Werschkul is Washington correspondent for Yahoo Finance.\nClick here for politics news related to business and money\nRead the latest financial and business news from Yahoo Finance", "Link": "Https://Finance.Yahoo.Com/News/Jamie-Dimon-Larry-Fink-Among-Wall-Street-Leaders-Calling-For-Unity-Following-Attempted-Trump-Assassination-150307322.Html", "Sentiment_Score": 0.0588535964, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T14:49:42.000Z", "Headline": "Goldman Sachs tops Q2 estimates, revenue jumps 17% YoY", "Summary": "Goldman Sachs (GS) reported second quarter earnings that beat expectations on both revenue and profit fronts. The major bank posted revenue of $12.73 billion, surpassing estimates of $12.39 billion and marking a 17% year-over-year increase. Adjusted earnings per share came in at $8.62 per share, beating projections of $8.36.\nCitizens JMP Managing Director & Director of Financial Technology Research Devin Ryan joins The Morning Brief to dissect these results.\nRyan highlights a \"common thread\" of strong performance in capital market businesses, with asset and wealth management firms showing particular strength. However, he notes a mixed picture in the overall banking sector regarding net interest income (NII). While acknowledging the positive start in capital markets (^DJI, ^IXIC, ^GSPC), Ryan emphasizes, \"I think we're still in the early days of a recovery in capital markets. So good to see the start, but I think there's a lot more to go here.\"\nAddressing fixed income performance, Ryan observes: \"Fixed income and equities trading have been more resilient than we would've thought heading into the year.\" He further notes that as issuance and M&A activity pick up, this sector still has \"room to grow.\"\nFor more expert insight and the latest market action, click here to watch this full episode of Morning Brief.\nThis post was written by Angel Smith", "Link": "Https://Finance.Yahoo.Com/Video/Goldman-Sachs-Tops-Q2-Estimates-144942911.Html", "Sentiment_Score": 0.9012374878, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T14:47:00.000Z", "Headline": "Big Banks Helped by Wall Street Comeback", "Summary": "The dealmaking that Goldman Sachs and its peers rely on to power earnings is showing signs of life. Goldman joined JPMorgan Chase Citigroup and Wells Fargo in reporting double-digit gains in investment-banking revenue in the second quarter as economic conditions and booming markets turned more favorable. “From what we’re seeing, we are in the early innings of a capital markets and M&A recovery,” Goldman Chief Executive David Solomon said on a call with analysts Monday.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/28Fce43B-2De3-3341-9Fe2-Ccfbda5E12Fc/Big-Banks-Helped-By-Wall.Html", "Sentiment_Score": 0.2868964374, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T14:23:49.000Z", "Headline": "Goldman Sachs' Q2 Profit Jumps 150% on Higher Investment Banking Revenue", "Summary": "Michael M. Santiago / Getty Images\nMore\n\nKey Takeaways\nGoldman Sachs' second-quarter profit more than doubled year-over-year as revenue from investment banking fees and asset management surged.\nThe banking giant's results came in higher than analysts expected, joining other banks like Wells Fargo, JPMorgan Chase, and Citigroup in beating Q2 estimates.\nGoldman also announced plans to raise its dividend to $3 per share, up from $2.75 per share previously.\n\n\nGoldman Sachs' (GS) efforts to refocus on its Wall Street operations is paying off, as second-quarter investment banking revenue jumped over 20% from a year ago, helping profits more than double.\nThe bank reported second-quarter profit of $3.04 billion, 150% higher than last year and just above the $2.99 billion analysts had expected. Goldman reported earnings per share (EPS) of $8.62, above the $8.42-per-share consensus estimate of analysts compiled by Visible Alpha.\nNet interest income (NII) rose 33% from last year to $2.24 billion, well above analysts' expectations of $1.66 billion. The jump in NII helped drive total revenue up 17% to $12.73 billion, above the $12.42 billion estimate.\nInvestment Banking, Higher NII Boost Goldman's Results\nSimilar to the first quarter of 2024, Goldman's results were boosted by higher revenue from investment banking and wealth management operations. Goldman has been focusing on its Wall Street operations after stepping back from its outreach into consumer lending last year.\nUnlike its banking colleagues JPMorgan Chase (JPM), Citigroup (C), and Wells Fargo (WFC), which reported second-quarter earnings last Friday, Goldman recorded higher net interest income than the previous quarter.\nAnalysts have said that banks' NII could fall over the next fiscal year or two if the Federal Reserve cuts interest rates, which it's expected to do at least once later this year.\n“We are pleased with our solid second quarter results and our overall performance in the first half of the year, reflecting strong year-on-year growth in both Global Banking & Markets and Asset & Wealth Management,\" Goldman Chief Executive Officer (CEO) David Solomon said.\nThe company also announced plans to raise its quarterly dividend by 9% to $3.00 per share, up from $2.75 previously.\nGoldman shares rose less than 1% to $483.80 as of 10:15 a.m. ET Monday. They are up about 25% since the start of the year.\nRead the original article on Investopedia.", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Sachs-Q2-Profit-Jumps-142349768.Html", "Sentiment_Score": 0.8950659037, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T16:45:57.000Z", "Headline": "Goldman Sachs Second-Quarter Results Top Views Amid 21% Gain in Investment Banking Fees", "Summary": "Goldman Sachs' (GS) second-quarter earnings more than doubled on a yearly basis, driven by double-digit gains in investment banking fees and asset and wealth management revenue.\n\nPer-share earnings jumped to $8.62 for the June quarter from $3.08 a year earlier, exceeding the Capital IQ-polled consensus of $8.42. Revenue climbed 17% to $12.73 billion, topping the Street's view for $12.37 billion.\n\n\"We are pleased with our solid second quarter results and our overall performance in the first half of the year, reflecting strong year-on-year growth in both global banking and markets and asset and wealth management,\" Chief Executive David Solomon said in a statement.\n\n\nGlobal banking and markets revenue rose 14% to $8.18 billion, buoyed by 21% growth in investment banking fees. \"We are seeing a material increase in client demand for committed acquisition financing, which we expect to continue on the back of increasing (merger and acquisition) activity,\" Chief Financial Officer Denis Coleman said during an earnings call, according to a Capital IQ transcript. Fixed income, currency and commodities net revenue moved 17% higher, while equities increased 7%, according to the investment bank.\n\nAsset and wealth management revenue surged 27% to $3.88 billion, driven by debt and equity investments, as well as higher management and other fees. Total assets under supervision grew to $2.934 trillion from $2.714 trillion the year before. Platform solutions' revenue rose 2% to $669 million, aided by a slight increase in consumer platforms.\n\nOperating expenses ticked down to $8.53 billion from $8.54 billion in the prior-year quarter. The lender's provision for credit losses declined to $282 million from $615 million.\n\nGoldman Sachs' board on Friday increased its quarterly dividend to $3 per share from $2.75. The dividend will be paid Sept. 27 to shareholders of record as of Aug. 30.", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Sachs-Second-Quarter-Results-142036697.Html", "Sentiment_Score": 0.9165667295, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T14:13:59.000Z", "Headline": "Goldman Profit Surges as Traders Top Analysts’ Estimates", "Summary": "(Bloomberg) -- Goldman Sachs Group Inc.’s trading unit powered a surge in earnings in the second quarter.\nMost Read from Bloomberg\nBlackRock Says Gunman From Trump Rally Appeared in Firm’s Ad\nTrump Shooting Changes Biden’s Plan to Revive 2024 Campaign\nTrump Taps Vance as Running Mate, Picking Populist Protege\nTrump Classified Documents Case Dismissed by Florida Judge\nAmazon Sold a Used Diaper. It Tanked a Mom-and-Pop Business\nBoth fixed-income and equity traders outpaced analysts’ estimates, while a rebounding capital-markets business helped drive better-than-expected results across much of the company’s Wall Street operations.\nStill, in a surprise reversal, the company pocketed less in fees from arranging mergers than JPMorgan Chase & Co. Goldman tends to lead the industry in that business and rarely falls behind its rival.\nEven as more businesses are on the prowl for deals, the approaching US elections could further delay a return to the pace of growth in the mergers seen in recent years. The business is especially important for Goldman because the firm has tried to showcase its strong investment bank and growing asset-management operation, after abandoning an expansion into consumer banking.\nEarnings in the second quarter were 2.5 times higher than what Goldman posted a year ago, when it was plagued by losses in real estate investments and the consumer-banking unit in the middle of an industrywide dealmaking slowdown. Net income was $3.04 billion on $12.7 billion in revenue in the three months through June 30, according to a statement Monday.\nShares of the New York-based firm pared earlier gains after the company said it plans to moderate the pace of buybacks because regulators increased Goldman’s capital-buffer requirement. The stock, which reached an all-time high of $479.88 on Friday, advanced 0.6% at 10:06 a.m. in New York.\n“The year-over-year increase in our stress capital buffer does not seem to reflect the strategic evolution of our business and the continuous progress we’ve made to reduce our stress loss intensity, which the Federal Reserve had recognized in our last three tests,” Chief Executive Officer David Solomon said on a conference call with analysts. “Given this discrepancy, we are engaging with our regulators to better understand its determinations.”\nStrategy Shuffle\nLast month, in a surprise move, the bank tapped John Mahoney, a financial-services banker who has been with the firm since 1987, to oversee firmwide strategy. That’s a departure from recent years, when Goldman had been tapping younger, fast-rising executives destined for bigger jobs at the firm for a similar role. The firm is also turning to a merger banker for a strategy role at a time when it has preached caution about the need for acquisitions to grow, especially after pursuing multiple deals to build out a retail-banking business that flopped.\nGoldman has instead tried to pare its focus to expanding its investment bank and money-management business to achieve its mid-teens return-on-equity target. It fell short of that mark in the second quarter, notching 10.9%.\nThe fixed-income trading business posted $3.18 billion in revenue, driven by strength in rates and currencies. The stock-trading unit logged $3.17 billion. Goldman touted its second-best quarter ever across both businesses in financing revenue.\nInvestment-banking revenue of $1.73 billion fell short of analysts’ average estimate of $1.8 billion. Merger-advisory fees were $688 million. That was less than the $785 million that JPMorgan reported last week.\nGoldman’s equity capital markets business generated $423 million in revenue, and debt-underwriting revenue was $622 million.\nThe asset- and wealth-management business posted revenue of $3.88 billion, up 27% from a year earlier. Management fees climbed 8% as the bank seeks to shift growth to those fees instead of windfalls from balance-sheet investments.\nGoldman said last quarter that it raised its biggest war chest yet for private-credit wagers. The firm closed the latest iteration of its direct-lending fund, which along with separately managed accounts for the same strategy amounted to $21 billion. The bank also clinched a $43 billion mandate to invest pension-fund assets of parcel-delivery company UPS, in one of the largest deals of its kind.\nThat progress has helped the bank stay on track to exceed a target is spelled out earlier this year of raising $50 billion in alternative assets.\nIn consumer banking, revenue was up 4% and transaction-banking fees dropped 15% from a year earlier. Those businesses are part of the unit that the bank has been disassembling as it reverses its push into retail banking.\n(Adds buyback commentary starting in sixth paragraph.)\nMost Read from Bloomberg Businessweek\nHow Rivian Became the Anti-Tesla\nLooser Visa Rules for Indian Travelers Stoke a Tourism Boom\nUkraine Is Fighting Russia With Toy Drones and Duct-Taped Bombs\nAsia Is The New Hot Destination for Luxury Travel\nFrench Elections Result Is Least Worst Outcome for Business\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Sachs-Profit-Surges-Traders-112742939.Html", "Sentiment_Score": 0.4125262499, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T14:00:03.000Z", "Headline": "Goldman (GS) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates", "Summary": "Goldman Sachs (GS) reported $12.73 billion in revenue for the quarter ended June 2024, representing a year-over-year increase of 16.9%. EPS of $8.62 for the same period compares to $3.08 a year ago.\nThe reported revenue compares to the Zacks Consensus Estimate of $12.6 billion, representing a surprise of +1.04%. The company delivered an EPS surprise of +1.17%, with the consensus EPS estimate being $8.52.\nWhile investors scrutinize revenue and earnings changes year-over-year and how they compare with Wall Street expectations to determine their next move, some key metrics always offer a more accurate picture of a company's financial health.\nSince these metrics play a crucial role in driving the top- and bottom-line numbers, comparing them with the year-ago numbers and what analysts estimated about them helps investors better project a stock's price performance.\nHere is how Goldman performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\nBook Value Per Share: $327.13 compared to the $328.84 average estimate based on six analysts.\nLeverage ratio: 5.4% versus 5.8% estimated by four analysts on average.\nAssets Under Supervision (AUS) - Total: $2,934 billion versus the four-analyst average estimate of $2,901.43 billion.\nStandardized Capital Rules - Common equity tier 1 capital ratio: 14.8% versus the four-analyst average estimate of 15%.\nNet Revenues- Platform Solutions- Consumer platforms: $599 million versus $623.13 million estimated by six analysts on average. Compared to the year-ago quarter, this number represents a +3.8% change.\nNet Revenues- Asset & Wealth Management- Management and other fees: $2.54 billion versus $2.54 billion estimated by six analysts on average. Compared to the year-ago quarter, this number represents a +7.7% change.\nNet Revenues- Global Banking & Markets- Equities: $3.17 billion versus the six-analyst average estimate of $3.07 billion. The reported number represents a year-over-year change of +6.8%.\nNet Revenues- Asset & Wealth Management- Private banking and lending: $707 million versus $672.29 million estimated by six analysts on average. Compared to the year-ago quarter, this number represents a -19.1% change.\nNet Revenues- Asset & Wealth Management- Equity investments: $292 million versus the six-analyst average estimate of $308.05 million. The reported number represents a year-over-year change of -172.5%.\nNet Revenues- Platform Solutions- Transaction banking and other: $70 million versus the six-analyst average estimate of $91.64 million. The reported number represents a year-over-year change of -14.6%.\nNet Revenues- Global Banking & Markets- FICC: $3.18 billion compared to the $2.97 billion average estimate based on six analysts. The reported number represents a change of +17.3% year over year.\nNet Revenues- Asset & Wealth Management- Debt investments: $297 million versus $339.98 million estimated by six analysts on average. Compared to the year-ago quarter, this number represents a +50.8% change.\nView all Key Company Metrics for Goldman here>>>\n\nShares of Goldman have returned +7.5% over the past month versus the Zacks S&P 500 composite's +3.8% change. The stock currently has a Zacks Rank #3 (Hold), indicating that it could perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Gs-Q2-Earnings-Taking-140003405.Html", "Sentiment_Score": 0.0462953001, "Sentiment_Category": "neutral"}, {"Ticker": "GS", "Time": "2024-07-15T13:20:00.000Z", "Headline": "Goldman Sachs Tops Earnings Expectations, Investment Banking Fees Rise 21%", "Summary": "Goldman Sachs turned in a second-quarter earnings report on Monday that showed what finance executives have hoped would materialize for months: early signs of a sustained return of capital markets work. The bank reported quarterly profit of $3.04 billion, which beat analysts’ expectations, while investment banking fees rose 21% from a year ago to $1.73 billion. New York-based Goldman, which has among the world’s largest investment banking operations, said that increase reflected higher revenue in debt and equity underwriting and slightly higher revenue stemming from advisory activity.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/42Effc7A-Bc3C-3C2C-95Cf-4D95D11B369A/Goldman-Sachs-Tops-Earnings.Html", "Sentiment_Score": 0.8798075318, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T13:08:51.000Z", "Headline": "Goldman’s profit more than doubles, but enthusiasm is muted", "Summary": "Goldman Sachs’s net income more than doubled in the second quarter, to $3.04 billion from $1.2 billion a year earlier, the bank disclosed Monday.\nFrom the numbers, that’s as much a statement on where the bank is now as it is about the obstacles it faced 12 months ago. Goldman took $989 million in impairment charges during 2023’s second quarter — nearly half of that from real estate investments, and the rest connected to home improvement lender GreenSky, which the bank has since sold.\nNet revenue at the bank jumped 17% year over year to $12.7 billion. Trajectory was sharper in particular units: Asset and wealth management, for example, saw revenue pop by 27% to $3.9 billion.\nInvestment banking fees jumped 21%. That percentage may pale in comparison to the likes of JPMorgan Chase, which reported a 46% second-quarter increase, and Citi, whose fees saw a 60% jump.\nGoldman CFO Denis Coleman, on Monday’s earnings call, noted that the bank still had a No. 1 market share for mergers, according to CNBC.\nEven the bank’s losses seemed to fall significantly from this time last year. Goldman reported a $282 million provision for credit losses in the second quarter. That’s 54% less than in April through June last year.\nOn a more molecular level, Goldman took a $58 million charge related to its credit card business with General Motors. GM is reportedly in talks to replace Goldman with Barclays as its partner. Apple also is reportedly looking to end its credit card partnership with Goldman.\nIf enthusiasm seems muted at Goldman, that might be from the top down.\n\"We are pleased with our solid second quarter results and our overall performance in the first half of the year, reflecting strong year-on-year growth in both Global Banking & Markets and Asset & Wealth Management,\" CEO David Solomon said Monday. (Global banking and markets reported a 14% jump in revenue Monday.)\nSome of the tension likely derives from a still-stinging stress test result, in which the Federal Reserve set a 6.4% stress capital buffer for the bank — and a 13.9% common equity tier 1 requirement.\n“The year-over-year increase in our stress capital buffer does not seem to reflect the strategic evolution of our business and the continuous progress we’ve made to reduce our stress loss intensity, which the Federal Reserve had recognized in our last three tests,” Solomon said during Monday’s call, according to Bloomberg. “Given this discrepancy, we are engaging with our regulators to better understand its determinations.”\nIndeed, Goldman challenged its stress test result in a letter to the Fed, the Financial Times reported Sunday, citing people familiar with the matter.\nThe Fed has allowed banks to dispute stress test results since 2020. But although eight, including Goldman once before, have written appeals disagreeing with the outcomes, the Fed has yet to budge on its initial assessments.\nThe Fed is expected to recheck its test of Goldman for any errors and to disclose its verdict on the appeal in August, according to the Financial Times.\nThis story was originally published on Banking Dive. To receive daily news and insights, subscribe to our free daily Banking Dive newsletter.", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Profit-More-Doubles-Enthusiasm-130851403.Html", "Sentiment_Score": 0.8979691863, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T12:45:03.000Z", "Headline": "Goldman Sachs (GS) Q2 Earnings and Revenues Top Estimates", "Summary": "Goldman Sachs (GS) came out with quarterly earnings of $8.62 per share, beating the Zacks Consensus Estimate of $8.52 per share. This compares to earnings of $3.08 per share a year ago. These figures are adjusted for non-recurring items.\nThis quarterly report represents an earnings surprise of 1.17%. A quarter ago, it was expected that this investment bank would post earnings of $8.54 per share when it actually produced earnings of $11.58, delivering a surprise of 35.60%.\nOver the last four quarters, the company has surpassed consensus EPS estimates four times.\nGoldman , which belongs to the Zacks Financial - Investment Bank industry, posted revenues of $12.73 billion for the quarter ended June 2024, surpassing the Zacks Consensus Estimate by 1.04%. This compares to year-ago revenues of $10.9 billion. The company has topped consensus revenue estimates four times over the last four quarters.\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\nGoldman shares have added about 24.4% since the beginning of the year versus the S&P 500's gain of 17.7%.\nWhat's Next for Goldman?\nWhile Goldman has outperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\nAhead of this earnings release, the estimate revisions trend for Goldman: mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\nIt will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $8.36 on $12.67 billion in revenues for the coming quarter and $36.25 on $51.49 billion in revenues for the current fiscal year.\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Financial - Investment Bank is currently in the top 36% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\nOne other stock from the same industry, Evercore (EVR), is yet to report results for the quarter ended June 2024. The results are expected to be released on July 24.\nThis investment bank is expected to post quarterly earnings of $1.66 per share in its upcoming report, which represents a year-over-year change of +72.9%. The consensus EPS estimate for the quarter has been revised 9.5% lower over the last 30 days to the current level.\nEvercore's revenues are expected to be $620.36 million, up 23.2% from the year-ago quarter.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\nEvercore Inc (EVR) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Sachs-Gs-Q2-Earnings-124503113.Html", "Sentiment_Score": -0.0310243517, "Sentiment_Category": "neutral"}, {"Ticker": "GS", "Time": "2024-07-15T22:38:39.000Z", "Headline": "Goldman Sachs profits more than double in second quarter as dealmaking comes back on Wall Street", "Summary": "NEW YORK (AP) — Goldman Sachs is posting a 150% jump in second quarter profits Monday, helped by a resurgence of dealmaking and underwriting that has revived investment banking after the slowdown of the previous couple years.\nThe New York investment bank posted net earnings of $3.04 billion, $8.62 per share, compared with $1.22 billion in the same period a year earlier. For the three months ended June 30, compared with $1.22 billion, or $3.08 per share, a year earlier.\nPart of the surge in profits came from Goldman Sachs booking some one-time items last year as it took charges for the wind-down of its consumer banking business.\nThat said, nearly every aspect of Goldman's businesses saw revenue jump in the quarter, reflecting what has been a broad revival in dealmaking and activity on Wall Street this year in a healthy economy.\nInvestment banking fees rose 21%, helped by a big jump in debt underwriting fees for the bank. Many companies are having to refinance their debts to deal with higher interest rates, and there has been a surge in leveraged financing packages\nGoldman's fixed income, currencies and commodities trading division had revenues up 17% from a year earlier. Equities trading was less robust than other parts of the market, with Goldman saying net revenues were up 7% in that division.\nLastly the bank's asset-management division posted 27% rise in revenues, helped by more fee income and the value of Goldman's own investments.\nShares in Goldman Sachs Group Inc. ended Monday up $12.35, or 2.6%, at $492.23.\n___\nThis story has been updated to read that the company reported net earnings, not net revenues, of $3.04 billion.", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Sachs-2Q-Profits-More-122058834.Html", "Sentiment_Score": 0.8659613729, "Sentiment_Category": "bullish"}, {"Ticker": "GS", "Time": "2024-07-15T12:09:46.000Z", "Headline": "Goldman Sachs Q2 Earnings: Revenue And EPS Beat, Investment Banking Fees Up 21%, Dividend Hike", "Summary": "Goldman Sachs Q2 Earnings: Revenue And EPS Beat, Investment Banking Fees Up 21%, Dividend Hike\nOn Monday, Goldman Sachs Group Inc. (NYSE:GS) reported revenue of $12.730 billion for the second quarter, beating the consensus of $12.456 billion.\nSales increased 17% year over year, reflecting higher net revenues in Global Banking and markets and Asset and wealth Management.\nGlobal Banking & Markets revenues were $8.18 billion, up 14% year over year.\nThis was boosted by a 21% year-over-year increase in investment banking fees to $1.73 billion, led by higher revenues in Debt and Equity underwriting, including leveraged finance and IPOs. Slight gains in advisory revenues contributed significantly to this growth.\nAsset & Wealth Management revenue was $3.88 billion for the second quarter of 2024, 27% higher than last year.\nNet revenues in Fixed Income, Currency, and Commodities (FICC) were $3.18 billion, up 17% Y/Y, primarily reflecting increased net revenues in FICC intermediation on higher net revenues in interest rate products and currencies and mortgages.\nThe U.S. financial services giant reported GAAP EPS of $8.62, beating the consensus of $8.35.\nProvision for credit losses was $282 million for the second quarter, compared with losses of $615 million a year ago, reflecting net provisions related to the credit card portfolio (driven by net charge-offs).\nRead: Goldman Sachs' Bullish Surge Ahead Of Q2 Earnings: How The Stock Maps Against Wall Street Estimates\nOn July 12, 2024, the Board of Directors increased the quarterly dividend to $3.00 per common share from $2.75, payable on September 27, 2024, to shareholders of record on August 30, 2024.\nThe company returned common share repurchases worth $3.50 billion in the quarter.\nDavid Solomon, Chairman and CEO, said, \"We are pleased with our solid second-quarter results and our overall performance in the first half of the year, reflecting strong year-on-year growth in both Global Banking & Markets and Asset & Wealth Management.\"\n\"Our One Goldman Sachs operating approach is allowing us to bring the whole firm to our clients, deepening our relationships and serving them in an improving, but complex environment.\"\nAlso Read: Goldman Sachs To Launch Three Tokenization Projects By Year-End: ‘It'll Change The Nature Of How Clients Can Invest'\nPrice Action: GS shares were down by 0.14% at $479.20 premarket at the last check on Monday.\nPhoto via Shutterstock.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Goldman Sachs Q2 Earnings: Revenue And EPS Beat, Investment Banking Fees Up 21%, Dividend Hike originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Sachs-Q2-Earnings-Revenue-120953479.Html", "Sentiment_Score": 0.9262823462, "Sentiment_Category": "bullish"}]}