{"timestamp": "20240719_155537", "data": [{"Ticker": "SHEL", "Time": "2024-07-18T16:06:00.000Z", "Headline": "Transaction in Own Shares", "Summary": "Transaction in Own Shares\n18 July, 2024\n• • • • • • • • • • • • • • • •\nShell plc (the ‘Company’) announces that on 18 July, 2024 it purchased the following number of Shares for cancellation.\nAggregated information on Shares purchased according to trading venue:\nDate of purchase\nNumber of Shares purchased\nHighest price paid\n\nLowest price paid\n\nVolume weighted average price paid per share\nVenue\nCurrency\n18/07/2024\n511,985\n£28.4300\n£28.2600\n£28.3438\nLSE\nGBP\n18/07/2024\n170,975\n£28.4200\n£28.2650\n£28.3308\nChi-X (CXE)\nGBP\n18/07/2024\n123,040\n£28.4250\n£28.2600\n£28.3173\nBATS (BXE)\nGBP\n18/07/2024\n1,000\n€33.9000\n€33.7200\n€33.7715\nXAMS\nEUR\nThese share purchases form part of the on- and off-market limbs of the Company's existing share buy-back programme previously announced on 2 May 2024.\nIn respect of this programme, BNP PARIBAS Financial Markets SNC will make trading decisions in relation to the securities independently of the Company for a period from 2 May 2024 up to and including 26 July 2024.\nThe on-market limb will be effected within certain pre-set parameters and in accordance with the Company’s general authority to repurchase shares on-market. The off-market limb will be effected in accordance with the Company’s general authority to repurchase shares off-market pursuant to the off-market buyback contract approved by its shareholders and the pre-set parameters set out therein. The programme will be conducted in accordance with Chapter 12 of the Listing Rules and Article 5 of the Market Abuse Regulation 596/2014/EU dealing with buy-back programmes (“EU MAR”) and EU MAR as “onshored” into UK law from the end of the Brexit transition period (at 11:00 pm on 31 December 2020) through the European Union (Withdrawal) Act 2018 (as amended by the European Union (Withdrawal Agreement) Act 2020), and as amended, supplemented, restated, novated, substituted or replaced by the Financial Services Act, 2021 and relevant statutory instruments (including, The Market Abuse (Amendment) (EU Exit) Regulations (SI 2019/310)), from time to time (“UK MAR”) and the Commission Delegated Regulation (EU) 2016/1052 (the “EU MAR Delegated Regulation”) and the EU MAR Delegated Regulation as “onshored” into UK law from the end of the Brexit transition period (at 11:00 pm on 31 December 2020) through the European Union (Withdrawal) Act 2018 (as amended by the European Union (Withdrawal Agreement) Act 2020), and as amended, supplemented, restated, novated, substituted or replaced by the Financial Services Act, 2021 and relevant statutory instruments (including, The Market Abuse (Amendment) (EU Exit) Regulations (SI 2019/310)), from time to time.\nIn accordance with EU MAR and UK MAR, a breakdown of the individual trades made by BNP PARIBAS Financial Markets SNC on behalf of the Company as a part of the buy-back programme is detailed below.\nEnquiries\nMedia International: +44 (0) 207 934 5550\nMedia Americas: +1 832 337 4335\nLEI number of Shell plc: 21380068P1DRHMJ8KU70\nClassification: Acquisition or disposal of the issuer’s own shares\nAttachment\nRNS Report SHELL 2024 07 18", "Link": "Https://Finance.Yahoo.Com/News/Transaction-Own-Shares-160600371.Html", "Sentiment_Score": -0.0022389498, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-07-12T15:45:07.000Z", "Headline": "Why Shell (SHEL) is a Top Dividend Stock for Your Portfolio", "Summary": "Getting big returns from financial portfolios, whether through stocks, bonds, ETFs, other securities, or a combination of all, is an investor's dream. But for income investors, generating consistent cash flow from each of your liquid investments is your primary focus.\nWhile cash flow can come from bond interest or interest from other types of investments, income investors hone in on dividends. A dividend is the distribution of a company's earnings paid out to shareholders; it's often viewed by its dividend yield, a metric that measures a dividend as a percent of the current stock price. Many academic studies show that dividends make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.\nShell in Focus\nHeadquartered in London, Shell (SHEL) is an Oils-Energy stock that has seen a price change of 10.9% so far this year. The oil and gas company is paying out a dividend of $0.69 per share at the moment, with a dividend yield of 3.77% compared to the Oil and Gas - Integrated - International industry's yield of 2.15% and the S&P 500's yield of 1.57%.\nTaking a look at the company's dividend growth, its current annualized dividend of $2.75 is up 11.2% from last year. Shell has increased its dividend 4 times on a year-over-year basis over the last 5 years for an average annual increase of 7.45%. Looking ahead, future dividend growth will be dependent on earnings growth and payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. Shell's current payout ratio is 35%. This means it paid out 35% of its trailing 12-month EPS as dividend.\nLooking at this fiscal year, SHEL expects solid earnings growth. The Zacks Consensus Estimate for 2024 is $8.55 per share, which represents a year-over-year growth rate of 1.79%.\nBottom Line\nInvestors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. But, not every company offers a quarterly payout.\nFor instance, it's a rare occurrence when a tech start-up or big growth business offers their shareholders a dividend. It's more common to see larger companies with more established profits give out dividends. Income investors must be conscious of the fact that high-yielding stocks tend to struggle during periods of rising interest rates. With that in mind, SHEL is a compelling investment opportunity. Not only is it a strong dividend play, but the stock currently sits at a Zacks Rank of 3 (Hold).\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Why-Shell-Shel-Top-Dividend-154507468.Html", "Sentiment_Score": 0.0442841798, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-07-11T12:22:00.000Z", "Headline": "Oil & Gas Stock Roundup: ExxonMobil & Shell's Q2 Updates in Focus", "Summary": "It was a week when oil prices moved up, but natural gas futures posted a loss.\n\nThe headlines revolved around energy biggies ExxonMobil XOM and Shell’s SHEL Q2 earnings update. Developments associated with Kosmos Energy KOS, Eni SpA E and Pembina Pipeline Corporation PBA also grabbed attention.\n\nOverall, it was a mixed seven-day period for the sector. West Texas Intermediate (WTI) crude futures rose around 2% to close at $83.16 per barrel, but natural gas prices fell 10.8% to end at $2.32 per million British thermal units (MMBtu).\n\nOil prices extended gains for the fourth straight week after a report from the Energy Information Administration (\"EIA\") showed drawdowns in crude and fuel stockpiles.\n\nMeanwhile, natural gas settled with a heavy loss following bearish inventory numbers, together with signs of production gains.\nRecap of the Week’s Most Important Stories\n1.    American energy major ExxonMobil recently disclosed in a Form 8-K that soft natural gas prices due to lower demand and excess inventories will sequentially hurt its second-quarter 2024 earnings.\n\nOwing to changes in prices of the commodity, the leading integrated energy player expects its second-quarter earnings to decline sequentially by $300 million to $700 million. However, XOM projects that a favorable crude pricing scenario in the June quarter will completely offset this negative impact.\n\nExxonMobil added that unfavorable changes in industry margins will affect its earnings from refining activities by $1.1 billion to $1.5 billion. These estimates exclude the impact of the acquisition of Pioneer Natural Resources, which was closed on May 3 and strengthened the company’s footprint in the Permian Basin, the most prolific basin in the United States. (ExxonMobil Expects Soft Gas Prices to Hurt Q2 Earnings)\n\n2.    Shell expects a $2 billion impairment in the second quarter of 2024 after pausing its Rotterdam biofuels facility and divesting its Singapore refinery. Rotterdam's construction halt leads to a $600 million to $1 billion non-cash charge, while Singapore sees $600 million to $800 million in charges.\n\nAccording to the London-based energy biggie’s latest update, Shell’s upstream production fell 5.4% on a sequential basis in the second quarter of 2024 at the midpoint of the guidance. The Zacks Rank #3 (Hold) supermajor is estimating its output in the range of 1,720-1,820 (thousand barrels of oil equivalent per day) MBOE/d compared to 1,872 MBOE/d in the first quarter of 2024. Tax charges are expected to hurt earnings in the range of $1.8-$2.6 billion.\n\nYou can see the complete list of today’s Zacks #1 Rank stocks here.\n\nMeanwhile, Shell’s LNG liquefaction volumes in its Integrated Gas unit are expected in the range of 6.8-7.2 million tons, translating into a decrease of around 7.7% sequentially. Shell’s integrated gas production is expected in the range of 940,000-9800,000 barrels of oil equivalent per day (BOE/d) or 960,000 BOE/d at the midpoint. It was 992,000 BOE/d in the January-March period. (Shell Provides Q2 Guidance: Warns of Up to $2B Hit)\n\n3.    Kosmos Energy, a deepwater exploration and production firm, has announced the initiation of oil production from the Winterfell development in the U.S. Gulf of Mexico. The Winterfell development in the Green Canyon area of the U.S. Gulf of Mexico is operated by Beacon Offshore Energy, with Kosmos holding a 25.04% working interest in the field.\n\nWinterfell is a phased development. For the first phase, two production wells are currently online and working to increase the production from the development. Alongside, a third well is being drilled, expected to be operational by the end of the third quarter of 2024. The three wells are anticipated to produce 20,000 barrels of oil equivalent per day (boe/d).\n\nThe first phase includes five wells in total, which are projected to produce 100 million boe, with significant upside potential in subsequent phases. The Miocene-aged Winterfell field is situated in water depths of approximately 5,400 feet. It was developed using a 13-mile subsea tieback to a host platform operated by Occidental Petroleum. Discovered in 2021, the final investment decision for Winterfell was made in January 2024. (Kosmos Energy Hits Production Milestone With Winterfell)\n\n4.    Eni, an Italian energy giant, has announced a major new oil discovery in the Yopaat-1 EXP exploration well in Block 9, located approximately 63 kilometers off the coast in the mid-deep waters of the Cuenca Salina in the Sureste Basin, offshore Mexico. The preliminary estimates suggest that the discovery holds around 300-400 million barrels of oil equivalents (Mboe) and associated gas in place.\n\nThe Yopaat-1 EXP well was drilled in a water depth of 525 meters and reached a total depth of 2,931 meters, encountering approximately 200 meters of net pay of hydrocarbon-bearing sands in the Pliocene and Miocene sequences. The drilling operation was accompanied by an extensive subsurface data acquisition campaign, ensuring a comprehensive understanding of the geological formation.\n\nEni's presence in Mexico dates back to 2006. In 2015, the company established its wholly-owned subsidiary, Eni Mexico S. de R. L. de C.V. Today, Eni stands as the leading foreign operator in the country, holding rights in eight exploration and production blocks in the Sureste Basin, of which the company operates seven. (Eni Strikes Big With New Discovery in Sureste Basin).\n\n5.    Pembina Pipeline, an energy transportation and midstream services provider, has entered into a purchase and sale agreement through its joint venture entity, Pembina Gas Infrastructure Inc. (\"PGI\"), with Whitecap Resources Inc., a Calgary-based oil and gas exploration and production company.\n\nThis strategic collaboration will see PGI acquiring a 50% working interest in Whitecap’s 15-07 Kaybob Complex in Alberta and supporting the infrastructure development of the company’s Lator growth area. The gross proceeds related to this transaction amount to C$420 million, with C$252 million net to Pembina.\n\nDespite the acquisition, Whitecap will retain operatorship of the assets. A long-term take-or-pay agreement for PGI’s capacity in the Kaybob Complex has been secured with Whitecap, which will be a dedicated area for all volumes produced by the company in the region.\nPrice Performance\nThe following table shows the price movement of some major oil and gas players over the past week and during the last six months.\n\nCompany    Last Week    Last 6 Months\nXOM               -1.5%                +14.9%\nCVX                -1.3%                +8.2%\nCOP               -1.6%                +1.9%\nOXY                -2%                   +7.7%\nSLB                -2.2%                -7.1%\nRIG                 -4.7%                -11.3%\nVLO                -2.5%                +15.3%\nMPC               -1.6%                +5.1%\n\nStocks had a mostly bearish week, indicative of the uncertain trading in oil and gas. The Energy Select Sector SPDR — a popular way to track energy companies — fell 1.2% last week. However, the sector tracker has increased 10.6% over the past six months.\nWhat’s Next in the Energy World?\nAs usual, market participants will closely track the regular releases to look for guidance on the direction of the commodities. In this context, the U.S. government’s statistics on oil and natural gas — one of the few solid indicators that come out regularly — will be on energy traders' radar. Fuel demand and the rate of stock drawdowns in the coming weeks will determine the trend in commodity prices. Data on rig count from the oilfield service firm Baker Hughes, which is a pointer to the trends in U.S. crude/natural gas production, is closely followed, too.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nEni SpA (E) : Free Stock Analysis Report\nKosmos Energy Ltd. (KOS) : Free Stock Analysis Report\nPembina Pipeline Corp. (PBA) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Oil-Gas-Stock-Roundup-Exxonmobil-122200601.Html", "Sentiment_Score": 0.0008513555, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-07-11T11:36:34.000Z", "Headline": "Trading houses lure top talent from BP, Shell", "Summary": "By Dmitry Zhdannikov and Julia Payne\nLONDON (Reuters) - Several high-profile energy traders have in recent weeks quit oil majors for trading houses, multiple sources told Reuters on Thursday, as talent follows assets swapping hands and as trading houses ramp up bonuses.\nTrading houses such as Vitol and Trafigura have acquired tens of billions of dollars worth of assets from oil majors over the past decade, using profits which jumped since 2022 due to energy markets' volatility caused by Russia's war in Ukraine.\nPrivately-owned commodities trading houses have snapped up refineries and terminals as oil majors come under increased pressure from shareholders to invest in greener energy.\n\"We build our asset base while majors have less and less assets to trade around. Naturally, traders leave to join us,\" said a top executive at a major trading house.\nThe world's largest and most profitable oil trader Vitol has hired Shell's head of LNG marketing Mehdi Chennoufi, crude trader Lionel Ader from French oil major TotalEnergies and Shell's West African crude trader Michas Barry, three sources familiar with the developments said.\nVitol also hired one of Trafigura's key crude traders Jordan Dowle, who specialised in North Sea and Mediterranean markets, the sources said.\nTrafigura has hired at least six traders from oil majors, according to three separate sources, including BP's London-based crude originators Jason Breslaw and Tamoor Ali.\nThe hiring follows recent high profile departures from BP and Shell.\nBP's head of trading Sven Boss-Walker left the firm after 25 years, Reuters reported last month. BP staff were told he is joining an independent start-up, according to a trading source.\nTrading house Mercuria earlier this year hired Shell's head of LNG Steve Hill. Last year, Mercuria hired Bill McGrath from Shell as managing director for low carbon.\nJohn Lo, who was previously manager at Shell LNG trading and refined products, has left to specialise in carbon credit, two separate sources said.\nVitol, Trafigura, Mercuria, BP and Shell declined to comment.\nThe hiring spree by trading houses continues a trend which started a decade ago when top commodities traders jumped ship from banks such as Goldman Sachs, Morgan Stanley and JP Morgan after the U.S. imposed caps on proprietary trading following the Lehman Brothers and Bear Stearns collapses.\nMost traders at Vitol, Trafigura and others get their pay as a percentage of profit of their book, according to at least a dozen trading sources. It is not unusual for a top trader to earn millions of dollars during a successful year, according to sources close to the firms.\nVitol, which makes many of its senior traders partners in the company, paid $5 billion in dividends last year and rival Trafigura paid $5.9 billion. That resulted in payments of dozens of millions of dollars to some partner-shareholders, according to the sources.\nVitol and Trafigura declined to comment.\nBP, Shell and other majors struggle to match such bonuses, the sources said, because as publicly listed companies they face bigger scrutiny by shareholders. BP's and Shell's CEOs Murray Auchincloss and Wael Sawan took home just slightly over $10 million each in salary and bonuses last year.\n(Additional reporting by Robert Harvey and Ron Bousso;Editing by Elaine Hardcastle)", "Link": "Https://Finance.Yahoo.Com/News/Trading-Houses-Lure-Top-Talent-113634490.Html", "Sentiment_Score": 0.2650125027, "Sentiment_Category": "bullish"}, {"Ticker": "SHEL", "Time": "2024-07-10T13:00:00.000Z", "Headline": "Shell, BP and TotalEnergies Invest in Major Abu Dhabi LNG Project", "Summary": "European energy giants Shell, BP and TotalEnergies have signed deals to invest in Abu Dhabi’s Ruwais liquefied natural-gas project, set to boost the Gulf nation’s export capacity significantly as it pushes into global LNG markets.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/8A265901-38D1-3F44-81Ae-E77Fec17784F/Shell-Bp-And-Totalenergies.Html", "Sentiment_Score": 0.1671319753, "Sentiment_Category": "bullish"}, {"Ticker": "SHEL", "Time": "2024-07-10T10:37:10.000Z", "Headline": "Shell announces FID for Manatee gas project offshore Trinidad and Tobago", "Summary": "Shell Trinidad and Tobago, a subsidiary of British energy major Shell, has taken the final investment decision (FID) on the Manatee gas field.\nIt is located in the ECMA of Trinidad and Tobago.\nAs the operator with a 100% working interest under the sub-Block 6D Production Sharing Contract, Shell aims to enhance its Integrated Gas business through this initiative.\nDiscovered in 1983, the Loran-Manatee field has been appraised with four wells.\nThe Manatee portion lies within Trinidad and Tobago's waters, while Loran is situated in Venezuelan waters.\nShell's ECMA fields including Dolphin, Starfish, Bounty and Endeavour are among the most productive in Trinidad and Tobago.\nThe development plan for Manatee involves a normally unattended installation platform in the ECMA, connected by a 110km, 32in pipeline to the onshore Beachfield gas processing facility.\nThis infrastructure will facilitate gas exports to the Atlantic liquified natural gas (LNG) facility and supply the National Gas Company of Trinidad and Tobago for domestic use.\nThe production of Manatee is scheduled to commence in 2027.\nUpon becoming operational, Manatee is expected to achieve a maximum production level of around 104,000 barrels of oil equivalent per day, or 604 million standard cubic feet per day.\nShell integrated gas and upstream director Zoë Yujnovich said: “This project will help meet the increasing demand for natural gas globally while also addressing the energy needs of our customers domestically in Trinidad and Tobago.\n“The investment bolsters our world-leading LNG portfolio in line with our commitment to invest in competitive projects that deliver more value with less emissions.”\nSeparately, Shell has engaged Wood for a six-year contract to deliver brownfield engineering, procurement and construction management solutions at its Prelude floating LNG facility in Western Australia.\nSource:\nhttps://www.shell.com/news-and-insights/newsroom/news-and-media-releases/2024/shell-boosts-lng-business-with-manatee-fid-in-trinidad-and-tobago.html\nhttps://www.woodplc.com/news/latest-press-releases/2024/shell-awards-wood-major-engineering-contract-for-worlds-largest-floating-offshore-gas-facility\n\"Shell announces FID for Manatee gas project offshore Trinidad and Tobago \" was originally created and published by Offshore Technology, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/Shell-Announces-Fid-Manatee-Gas-103710039.Html", "Sentiment_Score": 0.1386590749, "Sentiment_Category": "bullish"}, {"Ticker": "SHEL", "Time": "2024-07-10T09:51:00.000Z", "Headline": "Shell (SHEL) to Grow LNG Output Capabilities With Manatee FID", "Summary": "Shell plc SHEL, a multinational oil and gas company based in London, recently announced its final investment decision (FID) on the Manatee project through the company’s subsidiary, Shell Trinidad and Tobago Ltd. This decision will play a significant role in the development of the East Coast Marine Area (ECMA) in Trinidad and Tobago. The project aims to develop the Manatee natural gas field, strategically situated in one of the country's most prolific gas-producing regions.\nImportance of the ECMA for Shell\nThe ECMA hosts Shell's largest gas-producing fields in Trinidad and Tobago, which include Dolphin, Starfish, Bounty and Endeavour. The addition of the Manatee field is expected to boost Shell’s Integrated Gas business by providing essential backfill for the country’s Atlantic LNG facility. This move aligns with Shell’s broader strategy to enhance LNG production capabilities and capitalize on existing infrastructure in the region.\nProject Scope and Timeline\nProduction and Growth Plans: Scheduled to commence production in 2027, the Manatee project is anticipated to reach peak production levels of 104,000 barrels of oil equivalent per day (boed). Shell aims to expand its LNG business 20-30% by 2030 compared to 2022 levels, with liquefaction volumes projected to increase by 25-30% in the same period, as outlined in the company’s Capital Markets Day in 2023.\nDevelopment Details: As the operator with a 100% working interest under the sub-Block 6D Production Sharing Contract, Shell plans to implement a Normally Unattended Installation platform within the ECMA. This platform will support eight development wells connected via a 110 km 32-inch pipeline to the onshore Beachfield gas processing facility operated by SHEL. The gas will be exported to the Atlantic LNG facility and the National Gas Company of Trinidad and Tobago for domestic consumption.\nHistorical Context and Legal Framework\nDiscovery and International Agreements: The Loran-Manatee field, where the Manatee portion lies within Trinidad and Tobago waters, was initially discovered in 1983. Subsequent appraisals through four wells have confirmed its substantial reserves. The field also extends into Venezuelan waters, known as Loran, with the entire cross-border field covered by a historical Framework Treaty signed between the Governments of Trinidad and Tobago (“GORTT”) and Venezuela (“GOVEN”).\nRecent Developments: In 2019, the Unitization Agreement between GORTT and GOVEN was terminated, leading to a new government-to-government arrangement enabling independent development of each country's share of the Loran-Manatee field. This shift reflects evolving geopolitical dynamics while ensuring efficient resource management and development.\nEconomic and Environmental Impacts\nGlobal LNG Demand Outlook: Amid increasing global demand for LNG, which is projected to rise more than 50% by 2040, Shell’s investment in the Manatee project highlights its commitment to meeting regional and international energy needs. The project’s strategic location and anticipated production volumes are well-positioned to support industrial coal-to-gas transitions, particularly in growing markets like China, South Asia and Southeast Asia.\nSustainability and Emissions Reduction: Zoë Yujnovich, Shell’s Integrated Gas and Upstream director, highlights the project’s dual benefits of meeting rising natural gas demand globally and addressing local energy requirements in Trinidad and Tobago. SHEL’s investment in advanced LNG technologies aims to minimize environmental impact while enhancing operational efficiency, aligning with global efforts to reduce carbon emissions.\nConclusion\nShell’s decision to proceed with the Manatee project represents a significant advancement in Trinidad and Tobago’s energy sector. By leveraging the company’s extensive experience and infrastructure in the ECMA, SHEL aims to not only strengthen its position in the LNG market but also contribute to sustainable economic growth and energy security in the region. As global energy demands evolve, projects like Manatee are crucial in meeting these challenges while driving forward innovations in clean energy technologies.\nZacks Rank and Key Picks\nCurrently, SHEL carries a Zacks Rank #3 (Hold).\nInvestors interested in the energy sector might look at some better-ranked stocks like Sunoco LP SUN and SM Energy Company SM, each sporting a Zacks Rank #1 (Strong Buy) and Coterra Energy Inc. CTRA,  carrying a Zacks Rank #2 (Buy), at present. You can see the complete list of today’s Zacks #1 Rank stocks here.\nSunoco is valued at $5.67 billion. It is a major wholesale motor fuel distributor in the United States, distributing over 10 fuel brands through long-term contracts with more than 10,000 convenience stores, ensuring consistent cash flow.\nSUN’s extensive distribution network across 40 states provides a robust and reliable source of income and the Brownsville terminal expansion should add to its revenue diversification.\nDenver, CO-based SM Energyis valued at $5.09 billion. The company currently pays a dividend of 72 cents per share, or 1.63%, on an annual basis.\nSM, an independent energy company, engages in the acquisition, exploration, development and production of oil, gas and natural gas liquids in the state of Texas.\nCoterra Energy is valued at $19.77 billion. The company currently pays a dividend of 84 cents per share, or 3.16%, on an annual basis.\nCTRA is an independent upstream operator engaged in the exploration, development and production of natural gas, crude oil and natural gas liquids.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nSunoco LP (SUN) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nCoterra Energy Inc. (CTRA) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Shell-Shel-Grow-Lng-Output-095100664.Html", "Sentiment_Score": 0.8851348758, "Sentiment_Category": "bullish"}, {"Ticker": "SHEL", "Time": "2024-07-09T12:00:00.000Z", "Headline": "Shell boosts LNG business with Manatee FID in Trinidad and Tobago", "Summary": "PORT-OF-SPAIN, Trinidad and Tobago, July 9, 2024 /PRNewswire/ -- Shell Trinidad and Tobago Ltd. (Shell), a subsidiary of Shell plc, today announced that it has taken Final Investment Decision (FID) on the Manatee project, an undeveloped gas field in the East Coast Marine Area (ECMA) in Trinidad and Tobago.\nManatee Gas Field location in ECMA (courtesy of Shell)\nManatee will allow Shell to competitively grow its Integrated Gas business by building on development efforts in the ECMA, one of the country's most prolific gas-producing areas. The ECMA is currently home to Shell's largest gas-producing fields in the country including Dolphin, Starfish, Bounty and Endeavour.\nThe Manatee gas field will provide backfill for the country's Atlantic LNG facility. Increasing utilization at existing LNG plants is an important lever to maximize potential from Shell's existing assets.\n\"This project will help meet the increasing demand for natural gas globally while also addressing the energy needs of our customers domestically in Trinidad and Tobago,\" said Zoë Yujnovich, Shell's Integrated Gas and Upstream Director. \"The investment bolsters our world-leading LNG portfolio in line with our commitment to invest in competitive projects that deliver more value with less emissions,\" she added.\nShell plans to grow its LNG business by 20-30% by 2030, compared with 2022, and LNG liquefaction volumes are planned to grow by 25-30%, relative to 2022, as outlined at Shell's Capital Markets Day in 2023.\nManatee is slated to start production in 2027. Once online, Manatee is expected to reach peak production of approximately 104,000 barrels of oil equivalent per day (boe/d) (604 MMscf/d).\nNotes to editors\nShell is the operator of Manatee with a 100% working interest under the sub-Block 6D Production Sharing Contract.\nThe Loran-Manatee field was discovered in 1983 and subsequently appraised via four wells. Loran represents the portion of the field in Venezuelan waters and Manatee represents the portion of the field in Trinidad and Tobago waters.\nIn 2007 the Government of Trinidad and Tobago (GORTT) and the Government of Venezuela (GOVEN) signed a Framework Treaty covering all cross-border fields and in 2010 signed a Unitization Agreement specifically covering Loran-Manatee.\nIn 2019, GORTT and GOVEN terminated the Unitization Agreement and entered into another government-to-government agreement, allowing each country to independently develop its respective share of the Loran-Manatee field.\nThe project will involve a Normally Unattended Installation platform located in the ECMA acreage with eight development wells via a 110 km 32\" pipeline to the Shell-operated onshore Beachfield gas processing facility, for onward export to the Atlantic LNG facility, and to the National Gas Company of Trinidad and Tobago for the domestic gas market.\nShell believes LNG will play a critical role in the energy transition, replacing coal in heavy industry. It also has a continued role in displacing coal in power generation, helping to reduce local air pollution and carbon emissions. LNG helps to provide the flexibility the power system needs, at a time when renewable generation is growing rapidly. Find out more in Shell's Energy Transition Strategy 2024.\nGlobal demand for LNG is estimated to rise by more than 50% by 2040, as industrial coal-to-gas switching gathers pace in China, South Asian and South-east Asian countries. These countries are expected to use more LNG to support their economic growth, according to Shell's LNG Outlook 2024.\nCautionary note\nThe companies in which Shell plc directly and indirectly owns investments are separate legal entities. In this media release \"Shell\", \"Shell Group\" and \"Group\" are sometimes used for convenience where references are made to Shell plc and its subsidiaries in general. Likewise, the words \"we\", \"us\" and \"our\" are also used to refer to Shell plc and its subsidiaries in general or to those who work for them. These terms are also used where no useful purpose is served by identifying the particular entity or entities. ''Subsidiaries'', \"Shell subsidiaries\" and \"Shell companies\" as used in this media release refer to entities over which Shell plc either directly or indirectly has control. The term \"joint venture\", \"joint operations\", \"joint arrangements\", and \"associates\" may also be used to refer to a commercial arrangement in which Shell has a direct or indirect ownership interest with one or more parties.  The term \"Shell interest\" is used for convenience to indicate the direct and/or indirect ownership interest held by Shell in an entity or unincorporated joint arrangement, after exclusion of all third-party interest.\nForward-Looking Statements\nThis media release contains forward-looking statements (within the meaning of the U.S. Private Securities Litigation Reform Act of 1995) concerning the financial condition, results of operations and businesses of Shell. All statements other than statements of historical fact are, or may be deemed to be, forward-looking statements. Forward-looking statements are statements of future expectations that are based on management's current expectations and assumptions and involve known and unknown risks and uncertainties that could cause actual results, performance or events to differ materially from those expressed or implied in these statements. Forward-looking statements include, among other things, statements concerning the potential exposure of Shell to market risks and statements expressing management's expectations, beliefs, estimates, forecasts, projections and assumptions. These forward-looking statements are identified by their use of terms and phrases such as \"aim\"; \"ambition\"; ''anticipate''; ''believe''; \"commit\"; \"commitment\"; ''could''; ''estimate''; ''expect''; ''goals''; ''intend''; ''may''; \"milestones\"; ''objectives''; ''outlook''; ''plan''; ''probably''; ''project''; ''risks''; \"schedule\"; ''seek''; ''should''; ''target''; ''will''; \"would\" and similar terms and phrases. There are a number of factors that could affect the future operations of Shell and could cause those results to differ materially from those expressed in the forward-looking statements included in this media release, including (without limitation): (a) price fluctuations in crude oil and natural gas; (b) changes in demand for Shell's products; (c) currency fluctuations; (d) drilling and production results; (e) reserves estimates; (f) loss of market share and industry competition; (g) environmental and physical risks; (h) risks associated with the identification of suitable potential acquisition properties and targets, and successful negotiation and completion of such transactions; (i) the risk of doing business in developing countries and countries subject to international sanctions; (j) legislative, judicial, fiscal and regulatory developments including regulatory measures addressing climate change; (k) economic and financial market conditions in various countries and regions; (l) political risks, including the risks of expropriation and renegotiation of the terms of contracts with governmental entities, delays or advancements in the approval of projects and delays in the reimbursement for shared costs; (m) risks associated with the impact of pandemics, such as the COVID-19 (coronavirus) outbreak, regional conflicts, such as the Russia-Ukraine war, and a significant cybersecurity breach; and (n) changes in trading conditions. No assurance is provided that future dividend payments will match or exceed previous dividend payments. All forward-looking statements contained in this media release are expressly qualified in their entirety by the cautionary statements contained or referred to in this section. Readers should not place undue reliance on forward-looking statements. Additional risk factors that may affect future results are contained in Shell plc's Form 20-F for the year ended December 31, 2023 (available at www.shell.com/investors/news-and-filings/sec-filings.html and www.sec.gov). These risk factors also expressly qualify all forward-looking statements contained in this media release and should be considered by the reader.  Each forward-looking statement speaks only as of the date of this media release, July 9, 2024. Neither Shell plc nor any of its subsidiaries undertake any obligation to publicly update or revise any forward-looking statement as a result of new information, future events or other information. In light of these risks, results could differ materially from those stated, implied or inferred from the forward-looking statements contained in this media release.\nShell's Net Carbon Intensity\nAlso, in this media release we may refer to Shell's \"Net Carbon Intensity\" (NCI), which includes Shell's carbon emissions from the production of our energy products, our suppliers' carbon emissions in supplying energy for that production and our customers' carbon emissions associated with their use of the energy products we sell. Shell's NCI also includes the emissions associated with the production and use of energy products produced by others which Shell purchases for resale. Shell only controls its own emissions. The use of the terms Shell's \"Net Carbon Intensity\" or NCI are for convenience only and not intended to suggest these emissions are those of Shell plc or its subsidiaries.\nShell's net-zero emissions target\nShell's operating plan, outlook and budgets are forecasted for a ten-year period and are updated every year. They reflect the current economic environment and what we can reasonably expect to see over the next ten years. Accordingly, they reflect our Scope 1, Scope 2 and NCI targets over the next ten years. However, Shell's operating plans cannot reflect our 2050 net-zero emissions target, as this target is currently outside our planning period. In the future, as society moves towards net-zero emissions, we expect Shell's operating plans to reflect this movement. However, if society is not net zero in 2050, as of today, there would be significant risk that Shell may not meet this target.\nForward-Looking non-GAAP measures\nThis media release may contain certain forward-looking non-GAAP measures such as cash capital expenditure and divestments. We are unable to provide a reconciliation of these forward-looking non-GAAP measures to the most comparable GAAP financial measures because certain information needed to reconcile those non-GAAP measures to the most comparable GAAP financial measures is dependent on future events some of which are outside the control of Shell, such as oil and gas prices, interest rates and exchange rates. Moreover, estimating such GAAP measures with the required precision necessary to provide a meaningful reconciliation is extremely difficult and could not be accomplished without unreasonable effort. Non-GAAP measures in respect of future periods which cannot be reconciled to the most comparable GAAP financial measure are calculated in a manner which is consistent with the accounting policies applied in Shell plc's consolidated financial statements.\nThe contents of websites referred to in this media release do not form part of this media release.\nWe may have used certain terms, such as resources, in this media release that the United States Securities and Exchange Commission (SEC) strictly prohibits us from including in our filings with the SEC.  Investors are urged to consider closely the disclosure in our Form 20-F, File No 1-32575, available on the SEC website www.sec.gov.\nShell Oil Company Logo. (PRNewsFoto/Shell Oil Company)\nCision\nView original content to download multimedia:https://www.prnewswire.com/news-releases/shell-boosts-lng-business-with-manatee-fid-in-trinidad-and-tobago-302191392.html\nSOURCE Shell", "Link": "Https://Finance.Yahoo.Com/News/Shell-Boosts-Lng-Business-Manatee-120000119.Html", "Sentiment_Score": 0.9294490218, "Sentiment_Category": "bullish"}, {"Ticker": "SHEL", "Time": "2024-07-09T08:31:21.000Z", "Headline": "Trending tickers: Intel, Chipotle, BP and Wizz Air", "Summary": "Intel (INTC)\nIntel was the number one trending stock in pre-market trading on Tuesday after Melius Research listed the company as among the top contenders for the AI \"catch-up\" trade in the second half of 2024.\nShares climbed more than 6% to a two-month high on Monday and were up by 2.4% in pre-market trading after Melius Research noted that Advanced Micro Devices (AMD), Apple (AAPL) and Intel could start catching up with AI winners such as Nvidia (NVDA) in the second half of the year.\n\"We are believers in a 'catch-up' trade for some in semis, hardware and even software — those with lower expectations,\" said Melius' analyst Ben Reitzes.\nSeparately, Mizuho Securities' analyst Jordan Klein noted that there was '\"a clear short cover trade underway” in chipmakers like Intel.\nHowever, the analyst noted that no long-only investors like or want to buy Intel, adding that, \"so a true rebound beyond mid $30s is unlikely in my view in coming months.\"\nRead more: LIVE: FTSE 100 muted and European markets lower as traders look to Powell speech\nThe chipmaker's share price also got a boost due to excitement surrounding upcoming processors that could strengthen the company's position in the AI space and gaming hardware market.\nIntel is gearing up to launch a new graphics processing unit (GPU) that is set to be fabricated by Taiwan Semiconductor Manufacturing (TSM).\nChipotle (CMG)\nInvestor excitement over the Mexican fast-food chain’s 50-for-1 stock split appears to be fading as the company fell over 5% in Monday’s session and made only shy gains in pre-market trading.\nChipotle Mexican Grill’s first-ever stock split is one of the largest in the history of the New York Stock Exchange. Before the split, one share of CMG stock cost more than $3,200. Now, investors can buy shares for $59 each.\nIn a hit to the share price, Wedbush recently downgraded the stock to \"neutral\" with a new price target of $3,200, while TD Cowen and Baird maintained their positive ratings with targets of $3,600 and $3,500, respectively.\nRead more: Stocks that are trending today\nChipotle and other companies have lately been accused of “shrinkflation” — the idea of getting less for the same price.\nA study by Wells Fargo analyst Zachary Fadem brought to light substantial inconsistencies in Chipotle’s portion sizes. Fadem’s team ordered the same burrito bowl 75 times from various locations in New York City, revealing significant variation in weights, with some bowls weighing under 15 ounces and others over 21 ounces.\nBP (BP.L)\nBP expects to book an impairment of up to $2bn (£1.6bn) for the second quarter, and warned that its oil-trading earnings will take a hit of up to $700m from lower refining margins.\nIn a trading statement, the oil giant said its second quarter results would show “post-tax adverse reporting items” relating to its ageing refining operations in Germany.\n“The second quarter results are expected to include post tax adverse adjusting items relating to asset impairments and associated onerous contract provisions in the range of $1bn to $2bn.\n“This includes charges relating to the ongoing review of our Gelsenkirchen refinery in Germany,” BP said.\nRead more: Is the Bank of England expected to cut interest rates in August?\nThe company said it anticipates weak refining margins and oil trading performance will weigh on its second-quarter results, due out on 30 July. The hit is estimated between $500m to $700m.\nLast week, rival energy giant Shell (SHEL.L) similarly announced that it expects to record a post-tax impairment hit of up to $2bn, mainly linked to its Singapore and Rotterdam plants.\nWizz Air (WIZZ.L)\nWizz Air expects further delays in deliveries of Airbus (AIR.PA) planes, but the budget carrier remains confident it can increase its capacity over the next few years, its chief executive Jozsef Varadi told Reuters.\nJozsef Varadi said the Hungarian carrier insisted the delays will not impact capacity, even as it is already grappling with 45 of its planes being grounded for inspections amid concerns over their Pratt and Whitney engines. Another 35 planes will be grounded next summer.\nRead more: Top five pensions priorities for the new Labour government\n\"We are making assumptions that Airbus will have delivery delays, but they already have six-month delivery delays,\" he told Reuters. \"The real impact will be fairly limited,\" Varadi added.\nThe European plane maker cut its targets last month as it faces ongoing supply disruptions.\nVaradi said the airline is still expecting continuous deliveries of about three aircraft a month, with 20% growth in capacity next year and 20% to 25% the following year.\nDownload the Yahoo Finance app, available for Apple and Android.", "Link": "Https://Finance.Yahoo.Com/News/Intel-Chipotle-Bp-Wizz-Air-Trending-Tickers-083121206.Html", "Sentiment_Score": 0.007119406, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-07-09T03:53:53.000Z", "Headline": "Why Is Shell plc (SHEL) the Best FTSE Dividend Stock to Buy Now?", "Summary": "We recently compiled a list of the 10 Best FTSE Dividend Stocks To Buy Now. In this article, we are going to take a look at where Shell plc (NYSE:SHEL) stands against the other FTSE dividend stocks.\nThe first half of 2024 has been notable for the UK equity market, as the FTSE 100, the benchmark index for UK company shares, hit a record high. However, stocks tumbled in the first week of June as financial shares mirrored broader losses in European markets. That was mainly due to the political uncertainty that unsettled investors and a slump in industrial mining stocks further dragged down the market. That said, with some time remaining in the general elections, there is still some potential for additional developments and surprises within the UK market. The index is up by nearly 6% this year so far, compared with a 14.3% return of the broader US market\nThe Bank of England (BoE) was one of the first central banks to begin increasing interest rates after the peak of the COVID pandemic. From December 2021 to August 2023, it raised the bank rate by 515 basis points to a 16-year high of 5.25% in order to address rising inflationary pressures in the economy. According to a Reuters poll of economists, the BoE is expected to begin cutting interest rates in August. Most economists also anticipate at least one more rate reduction this year, despite ongoing high inflation in wages and services. Yael Selfin, chief UK economist at KPMG, made the following comment on the situation:\n\"While we are seeing some tentative signs of cooling in the labor market, service sector inflation remains persistently high and it is likely the MPC would want to wait until the next set of forecasts and a few more data points before it embarks on its first rate cut.\"\nOverall, UK inflation is expected to remain slightly above the BoE’s target of 2.0% in every quarter until at least the end of 2025, according to the poll. Median forecasts indicated that inflation would average 2.5% this year and 2.2% next year.\nAfter reaching new highs in 2024, the FTSE 100 may attract more investors, particularly those focused on income accumulation. The projected dividend yield of 3.8% for 2024 and 4.1% for 2025 is appealing, especially since these yields surpass the current inflation rate. Analysts predict that the ten largest dividend-paying companies in the UK will return £43.9 billion to shareholders, accounting for 55% of the total dividends from the FTSE 100. The top 20 companies are expected to contribute £57.4 billion, making up 72% of the total dividends.\nIn 2023, UK dividend growth of 5.4% aligned with the global average, according to a report by Janus Henderson. This increase was driven by substantial dividend increases from banks and oil producers, although it was tempered by lower payouts from mining companies. The report further mentioned that annual dividends in the UK grew to $86 billion in 2023 from over $63 billion in 2020.\nWhile investors gravitate toward American dividend stocks, some of the best FTSE dividend stocks also offer similar investment opportunities.\nOur Methodology:\nFor this article, we scanned through the list of FTSE stocks and picked dividend stocks from the list. From the resultant dataset, we picked the 10 best FTSE dividend stocks with the highest number of hedge fund investors tracked by Insider Monkey as of Q1 2024. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points. (see more details here).\nA gas refinery lit up against the night sky, showing the scale of the company's petrochemical operations.\nShell plc (NYSE:SHEL)\nNumber of Hedge Fund Holders: 50\nShell plc (NYSE:SHEL) tops our list of the best FTSE dividend stocks. The London-based oil and gas company currently offers a quarterly dividend of $0.688 per ADS and its stock has dividend yield of 3.90%. In February, the company raised its payout seventh time after slashing its dividend in 2020 in the face of the pandemic, which plummeted oil prices. Moreover, it has paid regular dividends to shareholders since 1985.\nFor the first quarter, Shell plc (NYSE:SHEL) reported a nearly 17% year-over-year decline in revenue at $72.5 billion. However, its cash position remains strong, offering reassurance to investors. The company's operating cash flow for the quarter came in at $13.3 billion and it returned $5 billion to shareholders through dividends and share repurchases. Moreover, it completed $3.5 billion of share buybacks that were announced in the fourth quarter of 2023.\nDespite fluctuations in oil prices. Shell plc (NYSE:SHEL)'s production remained intact. In the first quarter, its total oil and gas production rose by 10% compared to the previous quarter, driven by reduced maintenance at Prelude and Pearl GTL facilities. LNG liquefaction volumes also increased by 7%, largely due to decreased maintenance at Prelude.\nShell plc (NYSE:SHEL) is dedicated to achieving a 100% reduction in carbon emissions by 2050. Until 2030, it plans to maintain oil production at 1.4 million barrels per day. Moreover, the company aims to expand its liquefied natural gas business, expecting a demand increase of over 50% by 2040. The company's balanced strategy appears somewhat successful, as seen in its latest quarterly adjusted earnings of $7.7 billion, exceeding both analysts' forecasts and the previous quarter's earnings of $7.3 billion.\nThe number of hedge funds tracked by Insider Monkey holding stakes in Shell plc (NYSE:SHEL) grew to 50 in at the end of March, from 46 a quarter earlier. The total value of these stakes is more than $5.5 billion.\nOverall SHEL ranks 1st on our list of the best FTSE dividend stocks to buy. You can visit 10 Best FTSE Dividend Stocks To Buy Now to see the other FTSE dividend stocks that are on hedge funds’ radar. While we acknowledge the potential of SHEL as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than SHEL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n READ NEXT: Michael Burry Is Selling These Stocks and Jim Cramer is Recommending These Stocks.\n Disclosure: None. This article is originally published at Insider Monkey.", "Link": "Https://Finance.Yahoo.Com/News/Why-Shell-Plc-Shel-Best-035353884.Html", "Sentiment_Score": 0.0395203084, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-07-08T12:26:00.000Z", "Headline": "Shell (SHEL) Provides Q2 Guidance: Warns of Up to $2B Hit", "Summary": "Shell plc SHEL expects a $2 billion impairment in the second quarter of 2024 after pausing its Rotterdam biofuels facility and divesting its Singapore refinery. Rotterdam's construction halt leads to a $600 million to $1 billion non-cash charge, while Singapore sees $600 million to $800 million in charges.\n\nNow, let’s dig into some other segment-wise selected items from the London-based supermajor’s release on Friday.\nUpstream\nAccording to the latest update, Shell’s upstream production fell 5.4% on a sequential basis in the second quarter of 2024 at the midpoint of the guidance. The supermajor is estimating its output in the range of 1,720-1,820 (thousand barrels of oil equivalent per day) MBOE/d compared to 1,872 MBOE/d in the first quarter of 2024. Tax charges are expected to hurt earnings in the range of $1.8-$2.6 billion.\nMeanwhile, Shell expects the share of profit of joint ventures and associates to be around $200 million. The segment’s results are also likely to include well write-offs to the tune of $200 million. Finally, operating expense for the segment is projected at around $2.4 billion.\nIntegrated Gas\nShell’s LNG liquefaction volumes are expected in the range of 6.8-7.2 million tons, translating into a decrease of around 7.7% sequentialy. Shell’s integrated gas production is expected in the range of 940,000-9800,000 barrels of oil equivalent per day (BOE/d) or 960,000 BOE/d at the midpoint. It was 992,000 BOE/d in the January-March period.\nPer the company, second-quarter trading and optimization results in its integrated gas unit will be “in line” with the second quarter of 2023 but won’t measure up to the previous quarter due to seasonality. Segment operating cost is expected between $1 billion and $1.2 billion.\nMarketing\nThe midpoint of management’s marketing sales volume guidance is 2.900 million barrels per day, higher than the 2.763 million barrels achieved in the first quarter of 2024. Overall, segment profits are expected to be in line with the quarter-ago levels, while operating expenses would be between $2.5 billion and $2.9 billion.\nChemicals & Products\nThe company expects a sequentially flat trajectory in its Trading & Optimisation results for the second quarter of 2024. As projected by Shell, the refining margin may have weakened in the same period, with the metric deteriorating 34.6% sequentially. But with chemical margins moving up 3%, realized chemicals sub-segment numbers are expected to be better than in the first quarter. Shell also forecast refinery utilization of 91-95%, operating expense of $1.9-$2.3 billion and chemicals manufacturing plant utilization of 78-82%.\nRenewables and Energy Solutions\nThe adjusted bottom line of this segment is expected to hover between a loss of $500 million and a profit of $100 million.\nQ2 Estimates\nThe company is slated to release second-quarter 2024 results on Aug 1. The current Zacks Consensus Estimate for Shell’s to-be-reported quarter is a profit of $1.96 per share on revenues of $88.7 billion.\nZacks Rank & Stock Picks\nShell carries a Zacks Rank #3 (Hold) at present. Meanwhile, investors interested in the energy sector might consider operators like SM Energy Company SM, Sunoco LP SUN and Tullow Oil TUWOY. Sunoco currently sports a Zacks Rank #1 (Strong Buy), while SM Energy and Tullow carry a Zacks Rank #2 (Buy) each.\n\nYou can see the complete list of today’s Zacks #1 Rank stocks here.\n\nSM Energy Company: SM beat the Zacks Consensus Estimate for earnings in each of the trailing four quarters. SM Energy has a trailing four-quarter earnings surprise of 13.8% on average.\n\nSM is valued at around $5 billion. SM Energy has seen its shares increase 47% in a year.\n\nSunoco LP: The Zacks Consensus Estimate for 2024 earnings of Sunoco indicates 99.7% growth.\n\nSUN is valued at around $5.6 billion. Sunoco has seen its stock rise 36.3% in a year.\n\nTullow Oil: TUWOY is valued at some $573.7 million. Over the past 60 days, the Zacks Consensus Estimate for 2024 earnings has increased 20%.\n\nTullow Oil enjoys a Value, Growth and Momentum Score of A, B and B, respectively, each helping it round out with a VGM Score of A. TUWOY shares have gained 24.4% in a year.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nSunoco LP (SUN) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nTullow Oil PLC (TUWOY) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Shell-Shel-Provides-Q2-Guidance-122600582.Html", "Sentiment_Score": 0.8295572996, "Sentiment_Category": "bullish"}, {"Ticker": "SHEL", "Time": "2024-07-05T12:29:00.000Z", "Headline": "Shell Takes $2 Billion Hit Amid Green Energy Setback. It Fears Competition From U.S.", "Summary": "The company is concerned about a possible glut of biofuels made in America after the Inflation Reduction Act.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/52B51844-6E41-34Fa-B5Bb-D349D06888F2/Shell-Takes-2-Billion-Hit.Html", "Sentiment_Score": -0.9289318323, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-07-05T12:11:54.000Z", "Headline": "Shell dealt $1bn blow from halting construction of green fuel factory", "Summary": "The decision is the latest in a series of steps taken by Wael Sawan to refocus Shell - Amr Alfiky/Reuters\nShell has suffered a $1bn (£780m) hit from its decision to halt construction on a giant European green fuel factory.\nThe oil and gas giant unveiled the impairment on Friday morning, just days after it paused activity at a site in Rotterdam that was designed to supply European airlines and hauliers with sustainable fuels.\nThe decision has dealt a blow to airlines’ hopes of offering passengers low-carbon flights, with the company blaming the decision on rising costs and weak pricing.\nThe facility would have had the capacity to produce 820,000 tonnes of biofuels a year, half of which was to be used for sustainable aviation fuel (SAF) made from waste cooking oil and animal fat.\nSustainable jet fuel has been at the forefront of airlines’ plans to sell flights as “low carbon”, as they strive to reduce the industry’s impact on the environment.\nShell had been touted as a key SAF supplier after its Dutch subsidiary announced the biofuel project in 2021. Operations had been expected to start in 2025.\nThe announcement was one of a series of setbacks for low-carbon projects by big energy companies.\nIt follows BP’s announcement last week that it was putting all new offshore wind projects on pause, with new chief Murray Auchincloss deciding to focus increasingly on fossil fuels.\nHe also halted two biofuel projects in Germany and the United States.\nElsewhere, Shell also announced a writedown of $600m and $800m related to the sale of its refining and chemicals hub in Singapore.\nSince taking over as Shell chief executive in January 2023, Wael Sawan has sought to refocus the company’s strategy on oil and gas in a bid to boost profits.\nThis led to the company last summer dropping a pledge to cut oil production each year for the rest of the decade.\nAt the time, he said: “The projects which came onstream this past year at their peak will add over 200,000 barrels of oil equivalent a day. They are part of our larger funnel set for start-up by 2025.\n“Together at their peak, all projects will add more than half a million barrels of oil equivalent a day to our production.”\nBroaden your horizons with award-winning British journalism. Try The Telegraph free for 3 months with unlimited access to our award-winning website, exclusive app, money-saving offers and more.", "Link": "Https://Finance.Yahoo.Com/News/Shell-Dealt-1Bn-Blow-Halting-121154074.Html", "Sentiment_Score": -0.8698090911, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-07-05T10:16:58.000Z", "Headline": "Shell anticipates up to $2bn impairment charge in Q2 2024", "Summary": "British energy major Shell has announced that its expects to report up to $2bn (£1.56bn) in impairments in its upcoming Q2 earnings.\nThese impairments are associated with a delayed biofuels plant in the Netherlands and a chemicals facility in Singapore.\nShell CEO Wael Sawan, who has been in his role since January last year, has committed to a \"ruthless\" approach in enhancing the company's performance and increasing returns for investors.\nThis strategy has involved job cuts, asset sales and a revised approach to reducing carbon emissions.\nThis week, the company announced a halt to the construction of a biofuels plant in Rotterdam as it reassesses the project's direction.\nThis decision is expected to lead to a non-cash post-tax impairment of between $600m and $1bn, Shell said in its Q2 2024 update note.\nThe Rotterdam biofuels facility, which had its final investment decision announced in September 2021, is expected to have an annual capacity of 820,000 tonnes and produce sustainable aviation fuel and renewable diesel from waste.\nInitially set to start production in 2025, the biofuels plant's operational commencement is now delayed until the end of the decade.\nAnnouncing the pause, Shell downstream, renewables and energy solutions director Huibert Vigeveno said: “We are committed to our target of achieving net-zero emissions by 2050, with low-carbon fuels as a key part of Shell’s strategy to help us and our customers profitably decarbonise.”\nFurthermore, Shell is preparing for an additional write-down of $600m–800m related to the Singapore chemicals and products facility, which is in the process of being sold to a joint venture between Glencore and Indonesia's PT Chandra Asri Pacific.\nThe Energy and Chemicals Park Singapore, which includes the Pulau Bukom and Jurong Island sites, features a refinery with a capacity of 237,000 barrels per day and an ethylene cracker with an annual production capability of 1.1 million tonnes.\nShell also forecasts that gas trading results for Q2 will be lower due to seasonal market fluctuations.\n\"Shell anticipates up to $2bn impairment charge in Q2 2024 \" was originally created and published by Offshore Technology, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/Shell-Anticipates-2Bn-Impairment-Charge-101658818.Html", "Sentiment_Score": -0.5053178072, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-07-05T07:33:00.000Z", "Headline": "Shell to Take Up to $2 Billion Impairment Hit, Expects Weaker Gas Trading", "Summary": "Shell expects to book up to $2 billion in post-tax impairments after delaying construction of a major biofuels plant as European energy majors grapple with weak market conditions, while trading in its core gas division is set to fall on quarter.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/8E74D5A3-25F5-3Dac-B84D-73E0A7659Ef7/Shell-To-Take-Up-To-2.Html", "Sentiment_Score": 0.0132009685, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-07-05T06:00:00.000Z", "Headline": "Shell second quarter 2024 update note", "Summary": "The following is an update to the second quarter 2024 outlook and gives an overview of our current expectations for the second quarter. Outlooks presented may vary from the actual second quarter 2024 results and are subject to finalisation of those results, which are scheduled to be published on August 1, 2024. Unless otherwise indicated, all outlook statements exclude identified items.\nSee appendix for previous quarter historical data.\nIntegrated Gas\n$ billions\nQ2’24 Outlook\nComment\nAdjusted EBITDA:\nProduction (kboe/d)\n940 - 980\n  LNG liquefaction volumes (MT)\n6.8 - 7.2\n  Underlying opex\n1.0 - 1.2\n  Adjusted Earnings:\nPre-tax depreciation\n1.2 - 1.6\n  Taxation charge\n0.8 - 1.1\n  Other Considerations:\nTrading & Optimisation results are expected to be in line with Q2’23, but lower compared to Q1’24 due to seasonality.\n Upstream\n$ billions\nQ2’24 Outlook\nComment\nAdjusted EBITDA:\nProduction (kboe/d)\n1,720 - 1,820\n  Underlying opex\n2.1 - 2.7\n  Adjusted Earnings:\nPre-tax depreciation\n2.5 - 2.9\n  Taxation charge\n1.8 - 2.6\n  Other Considerations:\nThe share of profit / (loss) of joint ventures and associates in Q2’24 is expected to be ~$0.2 billion. Q2’24 exploration well write-offs are expected to be ~$0.2 billion.\nMarketing\n$ billions\nQ2’24 Outlook\nComment\nAdjusted EBITDA:\nSales volumes (kb/d)\n2,700 - 3,100\n  Underlying opex\n2.5 - 2.9\n  Adjusted Earnings:\nPre-tax depreciation\n0.3 - 0.7\n  Taxation charge\n0.2 - 0.5\n  Other Considerations:\nMarketing results are expected to be in line with Q1’24.\nChemicals & Products\n$ billions\nQ2’24 Outlook\nComment\nAdjusted EBITDA:\nIndicative refining margin\n$8/bbl\n  Indicative chemicals margin\n$155/tonne\nChemicals sub segment Adjusted Earnings are expected to be close to break-even in Q2’24.\nRefinery utilisation\n91% - 95%\n  Chemicals utilisation\n78% - 82%\n  Underlying opex\n1.9 - 2.3\n  Adjusted Earnings:\nPre-tax depreciation\n0.7 - 0.9\n  Taxation charge\n0.1 - 0.5\n  Other Considerations:\nTrading & Optimisation is expected to be in line with Q1’24.\nRenewables and Energy Solutions\n$ billions\nQ2’24 Outlook\nComment\nAdjusted Earnings\n(0.5) - 0.1\n  Corporate\n$ billions\nQ2’24 Outlook\nComment\nAdjusted Earnings\n(0.7) - (0.5)\n  Shell Group\n$ billions\nQ2’24 Outlook\nComment\nCFFO:\nTax paid\n3.1 - 3.9\n  Derivative movements\n(2) - 2\nDerivative movements and working capital estimations inherently have a broad range of uncertainty.\nWorking capital\n(2) - 2\nOther Shell Group Considerations:\nNon-cash post tax impairments of $1.5 - $2 billion are expected, and mainly include the Singapore Chemicals & Products assets ($0.6 - $0.8 billion) as well as Rotterdam HEFA ($0.6 - $1.0 billion), which is reported in the Marketing segment. These items are reported as identified items.\nGuidance\nThe ‘Quarterly Databook’ contains guidance on Indicative Refining Margin, Indicative Chemicals Margin and full-year price and margin sensitivities (Link).\nConsensus\nThe consensus collection for quarterly Adjusted Earnings, Adjusted EBITDA is per the reporting segments and CFFO at a Shell group level, managed by Vara Research, is expected to be published on July 25, 2024.\nAppendix\nIndicative Margins\nFor Integrated Gas Q1’24 realised prices have been restated. There is no impact of this revision on previously\nreported segment financials and other key performance indicators.\nIntegrated Gas Realised Prices\nQ1’24\nQ1’24 Restated\nLiquids ($/bbl)\n72.72\n67.29\nGas ($/thousand scf)\n8.86\n7.84\n\nChemicals & Products\nQ1’24\nQ2’24 Updated Outlook\nIndicative refining margin\n$12/bbl\n$8/bbl\nIndicative chemicals margin\n$150/tonne\n$155/tonne\nVolume Data\n  Q1’24 Adjusted\nQ2’24 QPR Outlook\nQ2’24 Updated Outlook\nIntegrated Gas\n      Production (kboe/d)\n992\n920 - 980\n940 - 980\nLNG liquefaction volumes (MT)\n7.6\n6.8 - 7.4\n6.8 - 7.2\nUpstream\n      Production (kboe/d)\n1,872\n1,630 - 1,830\n1,720 - 1,820\nMarketing\n      Sales volumes (kb/d)\n2,763\n2,700 - 3,200\n2,700 - 3,100\nChemicals & Products\n      Refinery utilisation\n91%\n87% - 95%\n91% - 95%\nChemicals utilisation\n73%\n72% - 80%\n78% - 82%\nUnderlying Opex\n$ billions\nQ1’24\nQ1’24 Adjusted\nQ2’24 Updated Outlook\nProduction and manufacturing expenses\n5.8\n    Selling, distribution and administrative expenses\n3.0\n    Research and development\n0.2\n    Operating Expenses (Opex)\n9.0\n9.0\n  Less: Identified Items\n  (0.1)\n  Underlying Opex\n  9.1\n  of which:\n          Integrated Gas\n1.0\n1.0\n1.0 - 1.2\n    Upstream\n2.4\n2.4\n2.1 - 2.7\n    Marketing\n2.6\n2.6\n2.5 - 2.9\n    Chemicals & Products\n2.1\n2.1\n1.9 - 2.3\n    Renewables and Energy Solutions\n0.7\n0.8\n  Depreciation, depletion and amortisation\n$ billions\nQ1’24\nQ1’24 Adjusted\nQ2’24 Updated Outlook\nDepreciation, Depletion & Amortisation\n5.9\n5.9\n  Less: Identified Items\n  0.2\n  Pre-tax depreciation (as Adjusted)\n  5.7\n  of which:\n          Integrated Gas\n1.4\n1.4\n1.2 - 1.6\n    Upstream\n2.8\n2.7\n2.5 - 2.9\n    Marketing\n0.5\n0.5\n0.3 - 0.7\n    Chemicals & Products\n1.0\n0.9\n0.7 - 0.9\n    Renewables and Energy Solutions\n—\n0.1\n  Tax Charge\n$ billions\nQ1’24\nQ1’24 Adjusted\nQ2’24 Updated Outlook\nTaxation Charge\n3.6\n3.6\n  Less: Identified Items and Cost of supplies adjustment\n  (0.5)\n  Taxation Charge (as Adjusted)\n  4.1\n  of which:\n          Integrated Gas\n0.8\n1.0\n0.8 - 1.1\n    Upstream\n2.1\n2.5\n1.8 - 2.6\n    Marketing\n0.4\n0.4\n0.2 - 0.5\n    Chemicals & Products\n0.2\n0.3\n0.1 - 0.5\n    Renewables and Energy Solutions\n0.1\n—\n  Adjusted Earnings\nThe “Adjusted Earnings” measure aims to facilitate a comparative understanding of Shell’s financial performance from period to period by removing the effects of oil price changes on inventory carrying amounts and removing the effects of identified items. These items are in some cases driven by external factors and may, either individually or collectively, hinder the comparative understanding of Shell’s financial results from period to period. This measure excludes earnings attributable to non-controlling interest. For further details see the 1st Quarter 2024 unaudited results (Link).\n$ billions\nQ1’24\nQ1’24 Adjusted\nQ2’24 Updated Outlook\nIncome/(loss) attributable to Shell plc shareholders\n7.4\n7.4\n  Add: Current cost of supplies adjustment attributable to Shell plc shareholders\n  (0.3)\n  Less: Identified items attributable to Shell plc shareholders\n  (0.6)\n  Adjusted Earnings\n  7.7\n  of which:\n          Renewables and Energy Solutions\n0.6\n0.2\n(0.5) - 0.1\n    Corporate\n(0.4)\n(0.5)\n(0.7) - (0.5)\nEnquiries\nMedia International: +44 (0) 207 934 5550\nMedia Americas: +1 832 337 4355\nCautionary Note\nThe companies in which Shell plc directly and indirectly owns investments are separate legal entities. In this announcement “Shell”, “Shell Group” and “Group” are sometimes used for convenience where references are made to Shell plc and its subsidiaries in general. Likewise, the words “we”, “us” and “our” are also used to refer to Shell plc and its subsidiaries in general or to those who work for them. These terms are also used where no useful purpose is served by identifying the particular entity or entities. ‘‘Subsidiaries’’, “Shell subsidiaries” and “Shell companies” as used in this announcement refer to entities over which Shell plc either directly or indirectly has control. The term “joint venture”, “joint operations”, “joint arrangements”, and “associates” may also be used to refer to a commercial arrangement in which Shell has a direct or indirect ownership interest with one or more parties.  The term “Shell interest” is used for convenience to indicate the direct and/or indirect ownership interest held by Shell in an entity or unincorporated joint arrangement, after exclusion of all third-party interest.\nThe numbers presented in this announcement may not sum precisely to the totals provided and percentages may not precisely reflect the absolute figures due to rounding.\nForward-Looking Statements\nThis announcement contains forward-looking statements (within the meaning of the U.S. Private Securities Litigation Reform Act of 1995) concerning the financial condition, results of operations and businesses of Shell. All statements other than statements of historical fact are, or may be deemed to be, forward-looking statements. Forward-looking statements are statements of future expectations that are based on management’s current expectations and assumptions and involve known and unknown risks and uncertainties that could cause actual results, performance or events to differ materially from those expressed or implied in these statements. Forward-looking statements include, among other things, statements concerning the potential exposure of Shell to market risks and statements expressing management’s expectations, beliefs, estimates, forecasts, projections and assumptions. These forward-looking statements are identified by their use of terms and phrases such as “aim”; “ambition”; ‘‘anticipate’’; ‘‘believe’’; “commit”; “commitment”; ‘‘could’’; ‘‘estimate’’; ‘‘expect’’; ‘‘goals’’; ‘‘intend’’; ‘‘may’’; “milestones”; ‘‘objectives’’; ‘‘outlook’’; ‘‘plan’’; ‘‘probably’’; ‘‘project’’; ‘‘risks’’; “schedule”; ‘‘seek’’; ‘‘should’’; ‘‘target’’; ‘‘will’’; “would” and similar terms and phrases. There are a number of factors that could affect the future operations of Shell and could cause those results to differ materially from those expressed in the forward-looking statements included in this announcement, including (without limitation): (a) price fluctuations in crude oil and natural gas; (b) changes in demand for Shell’s products; (c) currency fluctuations; (d) drilling and production results; (e) reserves estimates; (f) loss of market share and industry competition; (g) environmental and physical risks; (h) risks associated with the identification of suitable potential acquisition properties and targets, and successful negotiation and completion of such transactions; (i) the risk of doing business in developing countries and countries subject to international sanctions; (j) legislative, judicial, fiscal and regulatory developments including regulatory measures addressing climate change; (k) economic and financial market conditions in various countries and regions; (l) political risks, including the risks of expropriation and renegotiation of the terms of contracts with governmental entities, delays or advancements in the approval of projects and delays in the reimbursement for shared costs; (m) risks associated with the impact of pandemics, such as the COVID-19 (coronavirus) outbreak, regional conflicts, such as the Russia-Ukraine war, and a significant cybersecurity breach; and (n) changes in trading conditions. No assurance is provided that future dividend payments will match or exceed previous dividend payments. All forward-looking statements contained in this announcement are expressly qualified in their entirety by the cautionary statements contained or referred to in this section. Readers should not place undue reliance on forward-looking statements. Additional risk factors that may affect future results are contained in Shell plc’s Form 20-F for the year ended December 31, 2023 (available at www.shell.com/investors/news-and-filings/sec-filings.html and www.sec.gov). These risk factors also expressly qualify all forward-looking statements contained in this announcement and should be considered by the reader. Each forward-looking statement speaks only as of the date of this announcement, July 5, 2024. Neither Shell plc nor any of its subsidiaries undertake any obligation to publicly update or revise any forward-looking statement as a result of new information, future events or other information. In light of these risks, results could differ materially from those stated, implied or inferred from the forward-looking statements contained in this announcement.\nShell’s Net Carbon Intensity\nAlso, in this announcement we may refer to Shell’s “Net Carbon Intensity” (NCI), which includes Shell’s carbon emissions from the production of our energy products, our suppliers’ carbon emissions in supplying energy for that production and our customers’ carbon emissions associated with their use of the energy products we sell. Shell’s NCI also includes the emissions associated with the production and use of energy products produced by others which Shell purchases for resale. Shell only controls its own emissions. The use of the terms Shell’s “Net Carbon Intensity” or NCI are for convenience only and not intended to suggest these emissions are those of Shell plc or its subsidiaries.\nShell’s net-zero emissions target\nShell’s operating plan, outlook and budgets are forecasted for a ten-year period and are updated every year.  They reflect the current economic environment and what we can reasonably expect to see over the next ten years. Accordingly, they reflect our Scope 1, Scope 2 and NCI targets over the next ten years.  However, Shell’s operating plans cannot reflect our 2050 net-zero emissions target, as this target is currently outside our planning period. In the future, as society moves towards net-zero emissions, we expect Shell’s operating plans to reflect this movement. However, if society is not net zero in 2050, as of today, there would be significant risk that Shell may not meet this target.\nForward-Looking Non-GAAP measures\nThis announcement may contain certain forward-looking non-GAAP measures such as  IFRS, including Adjusted Earnings, “Adjusted EBITDA”, Cash flow from operating activities excluding working capital movements, Cash capital expenditure, Net debt and Underlying opex.\nAdjusted Earnings and Adjusted EBITDA are measures used to evaluate Shell’s performance in the period and over time.\nThe “Adjusted Earnings” and Adjusted EBITDA are measures which aim to facilitate a comparative understanding of Shell’s financial performance from period to period by removing the effects of oil price changes on inventory carrying amounts and removing the effects of identified items.\nAdjusted Earnings is defined as income/(loss) attributable to shareholders adjusted for the current cost of supplies and excluding identified items. “Adjusted EBITDA (CCS basis)” is defined as “Income/(loss) for the period” adjusted for current cost of supplies; identified items; tax charge/(credit); depreciation, amortisation and depletion; exploration well write-offs and net interest expense. All items include the non-controlling interest component.\nCash flow from operating activities excluding working capital movements is a measure used by Shell to analyse its operating cash generation over time excluding the timing effects of changes in inventories and operating receivables and payables from period to period. Working capital movements are defined as the sum of the following items in the Consolidated Statement of Cash Flows: (i) (increase)/decrease in inventories, (ii) (increase)/decrease in current receivables, and (iii) increase/(decrease) in current payables. Cash capital expenditure is the sum of the following lines from the Consolidated Statement of Cash flows: Capital expenditure, Investments in joint ventures and associates and Investments in equity securities. Net debt is defined as the sum of current and non-current debt, less cash and cash equivalents, adjusted for the fair value of derivative financial instruments used to hedge foreign exchange and interest rate risks relating to debt, and associated collateral balances. Underlying operating expenses is a measure of Shell’s cost management performance and aimed at facilitating a comparative understanding of performance from period to period by removing the effects of identified items, which, either individually or collectively, can cause volatility, in some cases driven by external factors. Underlying operating expenses comprises the following items from the Consolidated statement of Income: production and manufacturing expenses; selling, distribution and administrative expenses; and research and development expenses and removes the effects of identified items such as redundancy and restructuring charges or reversals, provisions or reversals and others.\nWe are unable to provide a reconciliation of these forward-looking Non-GAAP measures to the most comparable GAAP financial measures because certain information needed to reconcile those Non-GAAP measures to the most comparable GAAP financial measures is dependent on future events some of which are outside the control of Shell, such as oil and gas prices, interest rates and exchange rates. Moreover, estimating such GAAP measures with the required precision necessary to provide a meaningful reconciliation is extremely difficult and could not be accomplished without unreasonable effort. Non-GAAP measures in respect of future periods which cannot be reconciled to the most comparable GAAP financial measure are calculated in a manner which is consistent with the accounting policies applied in Shell plc’s consolidated financial statements.\nThe contents of websites referred to in this announcement do not form part of this announcement.\nWe may have used certain terms, such as resources, in this announcement that the United States Securities and Exchange Commission (SEC) strictly prohibits us from including in our filings with the SEC.  Investors are urged to consider closely the disclosure in our Form 20-F, File No 1-32575, available on the SEC website www.sec.gov.\nLEI number of Shell plc: 21380068P1DRHMJ8KU70", "Link": "Https://Finance.Yahoo.Com/News/Shell-Second-Quarter-2024-Note-060000837.Html", "Sentiment_Score": -0.036653541, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-07-04T11:30:56.000Z", "Headline": "Investors Met With Slowing Returns on Capital At Shell (LON:SHEL)", "Summary": "If we want to find a stock that could multiply over the long term, what are the underlying trends we should look for? In a perfect world, we'd like to see a company investing more capital into its business and ideally the returns earned from that capital are also increasing. Ultimately, this demonstrates that it's a business that is reinvesting profits at increasing rates of return. However, after investigating Shell (LON:SHEL), we don't think it's current trends fit the mold of a multi-bagger.\nWhat Is Return On Capital Employed (ROCE)?\nIf you haven't worked with ROCE before, it measures the 'return' (pre-tax profit) a company generates from capital employed in its business. To calculate this metric for Shell, this is the formula:\nReturn on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities)\n0.10 = US$32b ÷ (US$402b - US$94b) (Based on the trailing twelve months to March 2024).\nSo, Shell has an ROCE of 10%. That's a pretty standard return and it's in line with the industry average of 10%.\nCheck out our latest analysis for Shell\nroce\nIn the above chart we have measured Shell's prior ROCE against its prior performance, but the future is arguably more important. If you'd like, you can check out the forecasts from the analysts covering Shell for free.\nThe Trend Of ROCE\nThere hasn't been much to report for Shell's returns and its level of capital employed because both metrics have been steady for the past five years. This tells us the company isn't reinvesting in itself, so it's plausible that it's past the growth phase. So unless we see a substantial change at Shell in terms of ROCE and additional investments being made, we wouldn't hold our breath on it being a multi-bagger. This probably explains why Shell is paying out 36% of its income to shareholders in the form of dividends. Unless businesses have highly compelling growth opportunities, they'll typically return some money to shareholders.\nIn Conclusion...\nIn a nutshell, Shell has been trudging along with the same returns from the same amount of capital over the last five years. And investors may be recognizing these trends since the stock has only returned a total of 36% to shareholders over the last five years. Therefore, if you're looking for a multi-bagger, we'd propose looking at other options.\nIf you want to continue researching Shell, you might be interested to know about the 2 warning signs that our analysis has discovered.\nFor those who like to invest in solid companies, check out this free list of companies with solid balance sheets and high returns on equity.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com", "Link": "Https://Finance.Yahoo.Com/News/Investors-Met-Slowing-Returns-Capital-113056907.Html", "Sentiment_Score": -0.957829237, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-07-04T11:28:00.000Z", "Headline": "Shell (SHEL) Hits Pause on Major Biofuels Plant in Europe", "Summary": "Shell plc SHEL, the British energy giant, has halted construction activities for one of Europe's largest biofuel plants amid weaker biofuel prices. Under CEO Wael Sawan, Shell has scrapped several renewable projects to focus on its more profitable ventures, primarily associated with fossil fuels. In recent months, Shell has abandoned many renewable and hydrogen projects, withdrew from European and Chinese power markets, and sold off its refineries. It did so to concentrate on oil and gas operations to boost profits.\nIn September 2021, Shell proceeded with the development of the biofuel plant, with a capacity of 820 thousand tons a year. The biofuel plant at Shell's chemicals park in Rotterdam, the Netherlands, was slated to start operations by 2025. However, due to the pause, it is expected to come online toward the end of the decade. The facility was intended to produce renewable diesel and sustainable aviation fuel.\nWhile the energy giant’s decision to halt the construction work midway may seem odd, it is an indication that the advanced biofuels market is in a slump. Oil major BP also halted the progress of two biofuel facilities in Germany and the United States. This reflects the wider set of challenges faced by oil majors in the advanced biofuels market. Biofuel prices have recently taken a hit due to decreasing demand, especially in Europe, and rising supply in the United States. The market is expected to witness an increase in supply in the future with more production coming online.\nFollowing the pause in construction, Shell mentioned that the number of contractors on-site will decrease alongside a slowdown in activities. The move is anticipated to help the company control costs and improve project sequencing. Shell believes that ceasing construction activities for the time being will enable it to determine a commercially viable way to proceed with the project. The company has also stated that it will consider impairment charges for the project, with more details to be released in its quarterly trading update.\nThe energy giant remains committed to achieving its net-zero emissions target by 2050. Shell has also added that low-carbon fuels will be a significant part of its overall strategy to reach the goal.\nZacks Rank and Key Picks\nCurrently, SHEL carries a Zacks Rank #3 (Hold).\nSome better-ranked stocks in the energy sector are Sunoco LP SUN, SM Energy SM and Hess Midstream Partners LP HESM. Sunoco presently sports a Zacks Rank #1 (Strong Buy), while SM Energy and Hess Midstream carry a Zacks Rank #2 (Buy) each. You can see the complete list of today’s Zacks #1 Rank stocks here.\nSunoco LP is one of the largest distributors of motor fuel in the United States. The partnership distributes fuel to independent dealers, commercial customers, convenience stores as well as distributors. Its current distribution yield is greater than the composite stocks in the industry, providing unitholders with consistent returns.\nSM Energy is an upstream energy firm operating in the prolific Midland Basin region and the South Texas region. For 2024, the company expects its production to increase from the prior-year reported figure, signaling a bright production outlook.\nHess Midstream owns, operates, develops, and acquires a wide range of midstream assets, providing services to Hess Corporation and other third-party customers. The partnership has a stable fee-based revenue model secured via long-term commercial contracts. Since Hess Midstream operates through 100% fee-based contracts, it is exposed to minimal commodity price risks.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nSunoco LP (SUN): Free Stock Analysis Report\nSM Energy Company (SM): Free Stock Analysis Report\nHess Midstream Partners LP (HESM): Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL): Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Shell-Shel-Hits-Pause-Major-112800224.Html", "Sentiment_Score": -0.2463826686, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-07-03T21:02:00.000Z", "Headline": "Energy & Utilities Roundup: Market Talk", "Summary": "Read about Shell, Suncor Energy, BP and more in the latest Market Talks covering the Energy & Utilities sector.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/4Bd51Fba-2Dc6-33Df-9B50-D1Fdea6C0D3C/Energy-Utilities-Roundup-.Html", "Sentiment_Score": 0.0227847844, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-07-02T16:55:48.000Z", "Headline": "Shell to halt construction at Rotterdam biofuels facility", "Summary": "Shell Nederland Raffinaderij, part of Shell, has decided to temporarily pause the construction of its biofuels facility at Shell Energy and Chemicals Park Rotterdam, citing weak market conditions.\nThe UK energy major stated that the decision is aimed at reassessing project delivery and ensure competitiveness in the current economic landscape.\nThe move will result in a reduction of contractors and a slowdown in activities, allowing for better cost control and optimised project sequencing, it added.\nWith a planned annual capacity of 820,000tpa, the biofuels facility is designed to produce SAF and renewable diesel from waste.\nShell announced the FID for the facility in September 2021.\nInitially expected to commence production in 2025, the facility's start date has now been pushed back towards the end of the decade, according to Reuters.\nShell CEO Wael Sawan, who assumed his role in January 2023, has been steering the company to prioritise its most profitable ventures, particularly in oil and gas, by divesting from less lucrative renewable and hydrogen projects and exiting certain power markets.\nShell's strategic shift has also led to an impairment review for the Rotterdam biofuels project.\nShell downstream, renewables and energy solutions director Huibert Vigeveno said: “Temporarily pausing on-site construction now will allow us to assess the most commercial way forward for the project.\n“We are committed to our target of achieving net-zero emissions by 2050, with low-carbon fuels as a key part of Shell’s strategy to help us and our customers profitably decarbonise. And we will continue to use shareholder capital in a measured and disciplined way, delivering more value with less emissions.”\nMeanwhile, late last month Shell Canada achieved the FID for carbon capture and storage initiatives.\nThese include the Polaris project and the Atlas Carbon Storage Hub, which will be developed in partnership with ATCO EnPower.\nThese projects are part of Shell's efforts to reduce CO₂ emissions at its Scotford refinery and chemicals complex, with operations expected to start by the end of 2028.\n\"Shell to halt construction at Rotterdam biofuels facility \" was originally created and published by Energy Monitor, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/Shell-Halt-Construction-Rotterdam-Biofuels-165548409.Html", "Sentiment_Score": -0.8068109155, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-07-02T12:13:00.000Z", "Headline": "Shell Pauses Construction at Major Biofuels Facility as European Market Falters", "Summary": "The company said Tuesday that the pause will reduce the number of contractors on site and activity will slow. - Peter Boer/Bloomberg News\nShell will pause the construction of its Rotterdam biofuels facility, one of Europe’s largest, as it seeks to rein in project costs amid weak global demand for the fuel.\nThe British energy major said its Dutch subsidiary will conduct an impairment review of the Shell Energy and Chemicals Park project in the Netherlands and will provide further details in its second-quarter update, due to be published Friday.\nMost Read from The Wall Street Journal\nSkydance Media’s Deal to Buy Shari Redstone’s Family Company Is Back On\nPowell Talks Up Progress, Putting Rate Cuts Back Into View\nApproval of Newest Alzheimer’s Drug Will Accelerate New Era of Treatment\nRaids Find Luxury Handbags Being Made by Exploited Workers in Italy\nTesla Deliveries Slump but Not as Much as Feared\nThe company said Tuesday that the pause will reduce the number of contractors on site and activity will slow, helping to control costs.\n“Temporarily pausing on-site construction now will allow us to assess the most commercial way forward for the project,” Shell downstream, renewables and energy solutions director Huibert Vigeveno said.\nThe call to halt construction comes as the European biofuels market has weakened significantly since the second half of last year. Profit margins have been squeezed by a large drop in the price of renewable fuel credits in the U.S.\nShares in biofuels market leader Neste have shed nearly half their value this year, with the Finnish company in May cutting its renewable-fuel margin forecast. Shell’s rival BP similarly paused biofuels investment at U.S. and German oil refineries recently.\n“[Shell’s] decision is likely related to a weaker outlook for renewable diesel and sustainable aviation fuel profit margins,” OPIS principal middle distillates reporter Jaime Llinares Taboada said.\nOPIS is an energy-data and analytics provider part of Dow Jones, publisher of Dow Jones Newswires.\nBiofuels are made from organic sources like plants, algae or animal waste, and are considered an efficient solution to reduce global emissions.\nShell Chief Executive Wael Sawan recently loosened the company’s target for carbon-emission cuts from its operations in a push to increase investor returns.\nUnder Sawan—who became CEO in January last year—Shell has set a course to focus on its profitable oil-and-gas assets, pivoting from its prior energy-transition pledges.\nSince then, the company has sold its stake in a wind-energy project and scrapped hydrogen projects in the U.S., divested European power-retail units and sold its Singaporean refining and petrochemical assets, while boosting its position in oil and liquefied natural-gas.\nThe Rotterdam facility was set to produce 820,000 metric tons of biofuels a year, including sustainable aviation fuel and renewable diesel made from waste such as cooking oil.\nThe facility could produce enough renewable diesel to avoid 2.8 million tons of carbon-dioxide emissions a year, the equivalent of taking at least 1 million cars off the roads, Shell said when it announced its final investment decision in 2021.\nShell said it remains committed to the target of achieving net-zero emissions by 2050, with low-carbon fuels being part of its strategy.\nWrite to Michael Susin at michael.susin@wsj.com and Christian Moess Laursen at christian.moess@wsj.com\nMost Read from The Wall Street Journal\nChina and U.S. Both Eye Breakthrough EV Technology\nA Bucket List for Our Retirement? No Thanks\nTesla Helps Nasdaq Log 22nd Record of the Year\nBoeing Calls Time on the Great American Outsourcing\nInvestors Give Lifeline to Texas Bank Confronting Real-Estate Risks", "Link": "Https://Finance.Yahoo.Com/News/Shell-Pauses-Construction-Major-Biofuels-121300969.Html", "Sentiment_Score": -0.937436223, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-07-02T11:51:20.000Z", "Headline": "Shell pauses construction on major biofuels plant in Netherlands", "Summary": "Shell is to pause building work on one of Europe’s largest biofuel plants following a slowdown in demand growth for the low-carbon fuelling method.\nThe site in Rotterdam in the Netherlands is due to produce 820,000 tonnes of biofuels per year when it is complete.\nIt is the latest low-carbon energy project to be shelved by an energy giant in recent times as firms increasingly pivot back towards their most lucrative operations – oil and gas – to boost profits.\nLast week, BP said it would pause two biofuel projects in Germany and the US.\nWael Sawan, Shell’s chief executive since January 2023, has overseen a raft of rollbacks in such operations, scrapping parts of its hydrogen business and selling down stakes in several renewables projects.\nThe company’s share price has risen 12% this year.\nBiofuels are typically made of plant waste or animal fats and are sometimes blended with traditional fuels like petrol or diesel to power planes, trains and cars.\nAirlines have leaned heavily on jet biofuel, or sustainable aviation fuel (SAF), as a way to market flights as being low carbon.\nVirgin Atlantic described a flight from Heathrow to New York last year as “the world’s first net zero transatlantic flight” while the UK’s Department for Transport, which helped fund the project, described it as “guilt-free flying”.\nShell started work on its plant in the Netherlands in September 2021 and it was meant to start producing sustainable aviation fuel and renewable diesel by 2025.\nThe July 2 announcement indicates that it is less confident about the biofuels market than before, citing “current market conditions” as the reason for pausing work on the Dutch site.\nShell said in a statement that “contractor numbers will reduce on site and activity will slow down, helping to control costs and optimise project sequencing”.\n“Temporarily pausing on-site construction now will allow us to assess the most commercial way forward for the project,” said Huibert Vigeveno, a director in Shell’s downstream, renewables and energy solutions arm.\n“We are committed to our target of achieving net-zero emissions by 2050, with low-carbon fuels as a key part of Shell’s strategy to help us and our customers profitably decarbonise,” added Mr Vigeveno.\n“We will continue to use shareholder capital in a measured and disciplined way, delivering more value with less emissions.”", "Link": "Https://Finance.Yahoo.Com/News/Shell-Pauses-Construction-Major-Biofuels-115120673.Html", "Sentiment_Score": 0.4853517711, "Sentiment_Category": "bullish"}, {"Ticker": "SHEL", "Time": "2024-07-02T10:49:02.000Z", "Headline": "Shell halts construction of giant biofuel factory", "Summary": "Wael Sawan, Shell's chief executive, has scrapped and sold renewable and hydrogen projects - Ryan Lim/AFP\nShell has halted construction work at one of Europe’s largest biofuel plants, dealing a blow to airlines’ hopes of offering passengers low-carbon flights.\nThe decision to pause activity at the site in Rotterdam, which was designed to convert waste into jet fuel, was announced by the oil and gas giant on Tuesday.\nThe facility was designed to produce 820,000 tonnes of biofuels a year, half of which was to be used for sustainable aviation fuel (SAF) made from waste cooking oil and animal fat.\nSustainable jet fuel has been at the forefront of airlines’ plans to sell flights as “low carbon”, as they strive to reduce the industry’s impact on the environment.\nShell had been touted as a key SAF supplier after its Dutch subsidiary announced the biofuel project in 2021. Operations had been expected to start in 2025.\nHowever, Shell Nederland Raffinaderij confirmed on Tuesday that it was carrying out an “impairment review” of the project, casting doubts on its long-term viability.\nThe announcement is one of a series of setbacks for low-carbon projects by big energy companies.\nIt follows BP’s announcement last week that it was putting all new offshore wind projects on pause, with new chief Murray Auchincloss deciding to focus increasingly on fossil fuels.\nHe also halted two biofuel projects in Germany and the United States.\n‘Committed to achieving net-zero target’\nWael Sawan, Shell’s chief executive, has adopted a similar approach to increase returns.\nFollowing the Rotterdam decision, Huibert Vigeveno, Shell’s downstream, renewables and energy solutions director, said: “Temporarily pausing on-site construction now will allow us to assess the most commercial way forward for the project.\n“We are committed to our target of achieving net-zero emissions by 2050, with low-carbon fuels as a key part of Shell’s strategy to help us and our customers profitably decarbonise.”\nIt is rare for companies to suspend the development of projects that are already under way.\nHowever, under Mr Sawan – who took office in January 2023 – Shell has scrapped and sold renewable and hydrogen projects, retreated from European and Chinese power markets and sold refineries to focus on the most profitable operations, primarily in oil and gas.\nThis has led to Shell’s share price rising by 11pc so far this year.\nAfter announcing investment in the Rotterdam biofuel plant in 2021, Marjan van Loon, president director of Shell Netherlands, said the refinery would help meet growing demand from transport, including hard-to-decarbonise sectors such as aviation.\nAt the time, she said: “Shell’s investment will help increase SAF production, which is vital if aviation is to cut carbon emissions. Shell has been on the road to a lower-carbon future for some time.”\nJoshua Stone, a UBS analyst, told Reuters that the pause was consistent with Shell’s strategy to focus on returns.\nHe said: “The delays further highlight that the advanced biofuels market is not an easy one. The oil majors have dipped their toes and found it challenging.”\nShell said it would provide further details in its quarterly trading update on Friday.\nBroaden your horizons with award-winning British journalism. Try The Telegraph free for 3 months with unlimited access to our award-winning website, exclusive app, money-saving offers and more.", "Link": "Https://Finance.Yahoo.Com/News/Shell-Halts-Construction-Giant-Biofuel-104902179.Html", "Sentiment_Score": -0.7837327123, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-07-01T15:17:00.000Z", "Headline": "Director/PDMR Shareholding", "Summary": "NOTIFICATION AND PUBLIC DISCLOSURE OF TRANSACTIONS BY PERSONS DISCHARGING MANAGERIAL RESPONSIBILITIES IN ACCORDANCE WITH THE REQUIREMENTS OF THE EU AND UK MARKET ABUSE REGIMES\n          July 1, 2024\n                  Shell plc (the \"Company\") has been notified that following the payment of the interim dividend on June 24, 2024 in respect of the first quarter of 2024, the following Persons Discharging Managerial Responsibilities (\"PDMRs\") acquired dividend shares in respect of shares previously delivered to them under the annual bonus and/or shares previously vested under employee share plans and held in a Share Plan Account. Further information can be found in the Shell plc Annual Report and Form 20-F for the year ended December 31, 2023 (www.shell.com/annualreport).\n          PDMR\nDate Acquired\nShare Type\nNumber of dividend shares acquired\nPurchase price per Share\nWael Sawan\n27 June 2024\nSHELL (AMS)\n2,157.67\nEUR 33.41\nWael Sawan\n27 June 2024\nSHEL (LSE)\n347.05\nGBP 28.18\nSinead Gorman\n27 June 2024\nSHEL (LSE)\n978.19\nGBP 28.18\nPhilippa Bounds\n27 June 2024\nSHELL (AMS)\n0.01\nEUR 33.41\nPhilippa Bounds\n27 June 2024\nSHEL (LSE)\n41.81\nGBP 28.18\nRobertus Mooldijk\n27 June 2024\nSHELL (AMS)\n642.06\nEUR 33.41\nRachel Solway\n27 June 2024\nSHEL (LSE)\n4.01\nGBP 28.18\nHuibert Vigeveno\n27 June 2024\nSHELL (AMS)\n1,056.25\nEUR 33.41\nZoe Yujnovich\n27 June 2024\nSHELL (AMS)\n1,043.29\nEUR 33.41\n          The Notification of Dealing Form for each PDMR can be found below.\n                      Sean Ashley\n        Company Secretary\n                ENQUIRIES\n                  Shell Media Relations\n        International, UK, European Press: +44 20 7934 5550\n                                            LEI number of Shell plc: 21380068P1DRHMJ8KU70\n    Classification: Additional regulated information required to be disclosed under the laws of a Member State.\n                   \n\n1. Details of the person discharging managerial responsibilities/person closely associated\nFirst Name(s)\nWael\nLast Name(s)\nSawan\n2. Reason for the notification\nPosition/status\nChief Executive Officer\nInitial notification/ amendment\nInitial notification\n3. Details of the issuer, emission allowance market participant, auction platform, auctioneer or auction monitor\nFull name of the entity\nShell plc\nLegal Entity Identifier code\n21380068P1DRHMJ8KU70\n4. Details of the transaction(s): section to be repeated for (i) each type of instrument; (ii) each type of transaction; (iii) each date; (iv) each place where transactions have been conducted\nDescription of the financial instrument\nOrdinary shares of €0.07 each\nIdentification Code\nGB00BP6MXD84\nNature of the transaction\nDividend shares in respect of shares previously delivered under the annual bonus and/or shares previously vested under employee share plans and held in a Share Plan Account.\nCurrency\nEUR\nPrice\n33.41\nVolume\n2,157.67\nTotal\n72,087.75\nAggregated information\n  Volume\n2,157.67\nPrice\n33.41\nTotal\n72,087.75\nDate of transaction\n27/06/2024\nPlace of transaction\nAmsterdam\n\n1. Details of the person discharging managerial responsibilities/person closely associated\nFirst Name(s)\nWael\nLast Name(s)\nSawan\n2. Reason for the notification\nPosition/status\nChief Executive Officer\nInitial notification/ amendment\nInitial notification\n3. Details of the issuer, emission allowance market participant, auction platform, auctioneer or auction monitor\nFull name of the entity\nShell plc\nLegal Entity Identifier code\n21380068P1DRHMJ8KU70\n4. Details of the transaction(s): section to be repeated for (i) each type of instrument; (ii) each type of transaction; (iii) each date; (iv) each place where transactions have been conducted\nDescription of the financial instrument\nOrdinary shares of €0.07 each\nIdentification Code\nGB00BP6MXD84\nNature of the transaction\nDividend shares in respect of shares previously delivered under the annual bonus and/or shares previously vested under employee share plans and held in a Share Plan Account.\nCurrency\nGBP\nPrice\n28.18\nVolume\n347.05\nTotal\n9,779.87\nAggregated information\n  Volume\n347.05\nPrice\n28.18\nTotal\n9,779.87\nDate of transaction\n27/06/2024\nPlace of transaction\nLondon\n\n1. Details of the person discharging managerial responsibilities/person closely associated\nFirst Name(s)\nSinead\nLast Name(s)\nGorman\n2. Reason for the notification\nPosition/status\nChief Financial Officer\nInitial notification/ amendment\nInitial notification\n3. Details of the issuer, emission allowance market participant, auction platform, auctioneer or auction monitor\nFull name of the entity\nShell plc\nLegal Entity Identifier code\n21380068P1DRHMJ8KU70\n4. Details of the transaction(s): section to be repeated for (i) each type of instrument; (ii) each type of transaction; (iii) each date; (iv) each place where transactions have been conducted\nDescription of the financial instrument\nOrdinary shares of €0.07 each\nIdentification Code\nGB00BP6MXD84\nNature of the transaction\nDividend shares in respect of shares previously delivered under the annual bonus and/or shares previously vested under employee share plans and held in a Share Plan Account.\nCurrency\nGBP\nPrice\n28.18\nVolume\n978.19\nTotal\n27,565.39\nAggregated information\n  Volume\n978.19\nPrice\n28.18\nTotal\n27,565.39\nDate of transaction\n27/06/2024\nPlace of transaction\nLondon\n\n1. Details of the person discharging managerial responsibilities/person closely associated\nFirst Name(s)\nPhilippa\nLast Name(s)\nBounds\n2. Reason for the notification\nPosition/status\nLegal Director\nInitial notification/ amendment\nInitial notification\n3. Details of the issuer, emission allowance market participant, auction platform, auctioneer or auction monitor\nFull name of the entity\nShell plc\nLegal Entity Identifier code\n21380068P1DRHMJ8KU70\n4. Details of the transaction(s): section to be repeated for (i) each type of instrument; (ii) each type of transaction; (iii) each date; (iv) each place where transactions have been conducted\nDescription of the financial instrument\nOrdinary shares of €0.07 each\nIdentification Code\nGB00BP6MXD84\nNature of the transaction\nDividend shares in respect of shares previously delivered under the annual bonus and/or shares previously vested under employee share plans and held in a Share Plan Account.\nCurrency\nEUR\nPrice\n33.41\nVolume\n0.01\nTotal\n0.33\nAggregated information\n  Volume\n0.01\nPrice\n33.41\nTotal\n0.33\nDate of transaction\n27/06/2024\nPlace of transaction\nAmsterdam\n\n1. Details of the person discharging managerial responsibilities/person closely associated\nFirst Name(s)\nPhilippa\nLast Name(s)\nBounds\n2. Reason for the notification\nPosition/status\nLegal Director\nInitial notification/ amendment\nInitial notification\n3. Details of the issuer, emission allowance market participant, auction platform, auctioneer or auction monitor\nFull name of the entity\nShell plc\nLegal Entity Identifier code\n21380068P1DRHMJ8KU70\n4. Details of the transaction(s): section to be repeated for (i) each type of instrument; (ii) each type of transaction; (iii) each date; (iv) each place where transactions have been conducted\nDescription of the financial instrument\nOrdinary shares of €0.07 each\nIdentification Code\nGB00BP6MXD84\nNature of the transaction\nDividend shares in respect of shares previously delivered under the annual bonus and/or shares previously vested under employee share plans and held in a Share Plan Account.\nCurrency\nGBP\nPrice\n28.18\nVolume\n41.81\nTotal\n1,178.21\nAggregated information\n  Volume\n41.81\nPrice\n28.18\nTotal\n1,178.21\nDate of transaction\n27/06/2024\nPlace of transaction\nLondon\n\n1. Details of the person discharging managerial responsibilities/person closely associated\nFirst Name(s)\nRobertus\nLast Name(s)\nMooldijk\n2. Reason for the notification\nPosition/status\nProjects & Technology Director\nInitial notification/ amendment\nInitial notification\n3. Details of the issuer, emission allowance market participant, auction platform, auctioneer or auction monitor\nFull name of the entity\nShell plc\nLegal Entity Identifier code\n21380068P1DRHMJ8KU70\n4. Details of the transaction(s): section to be repeated for (i) each type of instrument; (ii) each type of transaction; (iii) each date; (iv) each place where transactions have been conducted\nDescription of the financial instrument\nOrdinary shares of €0.07 each\nIdentification Code\nGB00BP6MXD84\nNature of the transaction\nDividend shares in respect of shares previously delivered under the annual bonus and/or shares previously vested under employee share plans and held in a Share Plan Account.\nCurrency\nEUR\nPrice\n33.41\nVolume\n642.06\nTotal\n21,451.22\nAggregated information\n  Volume\n642.06\nPrice\n33.41\nTotal\n21,451.22\nDate of transaction\n27/06/2024\nPlace of transaction\nAmsterdam\n\n1. Details of the person discharging managerial responsibilities/person closely associated\nFirst Name(s)\nRachel\nLast Name(s)\nSolway\n2. Reason for the notification\nPosition/status\nChief Human Resources & Corporate Officer\nInitial notification/ amendment\nInitial notification\n3. Details of the issuer, emission allowance market participant, auction platform, auctioneer or auction monitor\nFull name of the entity\nShell plc\nLegal Entity Identifier code\n21380068P1DRHMJ8KU70\n4. Details of the transaction(s): section to be repeated for (i) each type of instrument; (ii) each type of transaction; (iii) each date; (iv) each place where transactions have been conducted\nDescription of the financial instrument\nOrdinary shares of €0.07 each\nIdentification Code\nGB00BP6MXD84\nNature of the transaction\nDividend shares in respect of shares previously delivered under the annual bonus and/or shares previously vested under employee share plans and held in a Share Plan Account.\nCurrency\nGBP\nPrice\n28.18\nVolume\n4.01\nTotal\n113.00\nAggregated information\n  Volume\n4.01\nPrice\n28.18\nTotal\n113.00\nDate of transaction\n27/06/2024\nPlace of transaction\nLondon\n\n1. Details of the person discharging managerial responsibilities/person closely associated\nFirst Name(s)\nHuibert\nLast Name(s)\nVigeveno\n2. Reason for the notification\nPosition/status\nDownstream, Renewables & Energy Solutions Director\nInitial notification/ amendment\nInitial notification\n3. Details of the issuer, emission allowance market participant, auction platform, auctioneer or auction monitor\nFull name of the entity\nShell plc\nLegal Entity Identifier code\n21380068P1DRHMJ8KU70\n4. Details of the transaction(s): section to be repeated for (i) each type of instrument; (ii) each type of transaction; (iii) each date; (iv) each place where transactions have been conducted\nDescription of the financial instrument\nOrdinary shares of €0.07 each\nIdentification Code\nGB00BP6MXD84\nNature of the transaction\nDividend shares in respect of shares previously delivered under the annual bonus and/or shares previously vested under employee share plans and held in a Share Plan Account.\nCurrency\nEUR\nPrice\n33.41\nVolume\n1,056.25\nTotal\n35,289.31\nAggregated information\n  Volume\n1,056.25\nPrice\n33.41\nTotal\n35,289.31\nDate of transaction\n27/06/2024\nPlace of transaction\nAmsterdam\n\n1. Details of the person discharging managerial responsibilities/person closely associated\nFirst Name(s)\nZoe\nLast Name(s)\nYujnovich\n2. Reason for the notification\nPosition/status\nIntegrated Gas and Upstream Director\nInitial notification/ amendment\nInitial notification\n3. Details of the issuer, emission allowance market participant, auction platform, auctioneer or auction monitor\nFull name of the entity\nShell plc\nLegal Entity Identifier code\n21380068P1DRHMJ8KU70\n4. Details of the transaction(s): section to be repeated for (i) each type of instrument; (ii) each type of transaction; (iii) each date; (iv) each place where transactions have been conducted\nDescription of the financial instrument\nOrdinary shares of €0.07 each\nIdentification Code\nGB00BP6MXD84\nNature of the transaction\nDividend shares in respect of shares previously delivered under the annual bonus and/or shares previously vested under employee share plans and held in a Share Plan Account.\nCurrency\nEUR\nPrice\n33.41\nVolume\n1,043.29\nTotal\n34,856.32\nAggregated information\n  Volume\n1,043.29\nPrice\n33.41\nTotal\n34,856.32\nDate of transaction\n27/06/2024\nPlace of transaction\nAmsterdam", "Link": "Https://Finance.Yahoo.Com/News/Director-Pdmr-Shareholding-151700799.Html", "Sentiment_Score": 0.0107986629, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-06-28T15:35:00.000Z", "Headline": "Voting Rights and Capital", "Summary": "Total Voting Rights\nIn conformity with the Disclosure Guidance and Transparency Rules, we hereby notify the market of the following:\nShell plc's capital as at June 28, 2024, consists of 6,324,115,486 ordinary shares of €0.07 each. Shell plc holds no shares in Treasury.\nThe figure 6,324,115,486 may be used by shareholders as the denominator for the calculation by which they will determine if they are required to notify their interest in, or a change to their interest in, Shell plc under the FCA's Disclosure Guidance and Transparency Rules.\nNote: This announcement is made pursuant to Disclosure Guidance and Transparency Rules 5.6.1 and 5.6.1A and as such, the above figure includes shares purchased by Shell plc as part of its share buy-back programme but not yet cancelled.\nEnquiries\nShell Media Relations\nInternational, UK, European Press: +44 (0)20 7934 5550\nLEI number of Shell plc:  21380068P1DRHMJ8KU70\nClassification: Total number of voting rights and capital", "Link": "Https://Finance.Yahoo.Com/News/Voting-Rights-Capital-153500831.Html", "Sentiment_Score": 0.001953477, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-06-28T14:15:50.000Z", "Headline": "The List of Money Managers Axing Oil Stocks Just Got Longer", "Summary": "(Bloomberg) -- There’s a growing list of institutional investors in Europe who are stripping oil and gas stocks out of their portfolios, in a move they say reduces the risk of ending up with stranded assets and financial losses.\nMost Read from Bloomberg\nGavin Newsom Is Ready for the Biden Emergency\nThe Question on Democrats’ Minds: How to Replace Biden?\nBiden’s Disastrous Debate Accelerates Doubts Over Candidacy\nSupreme Court Overturns Chevron Rule in Blow to Agency Power\n‘I Was Afraid of This’: Biden Debate Debacle Rocks US Allies\nThe latest to do so is PFA, Denmark’s largest commercial pension fund with roughly $110 billion of assets under management. The investor has just offloaded its $170 million stake in Shell Plc based on an assessment that the company’s capital expenditure on renewables is worryingly low.\n“There was a cry to them to engage more in the transition,” says Rasmus Bessing, head of ESG investing and co-chief investment officer at PFA. “But especially over the last year or so, a bit more perhaps,” Shell has been signaling it wants to “go in a different direction,” he said.\nA spokesperson for Shell referred to a comment made by Chief Executive Officer Wael Sawan at the company’s annual general meeting on May 21, when he said shareholders “have strongly backed” its strategy. “Our focus on performance, discipline and simplification enables us to invest in providing the energy the world needs today, and in helping to build the low-carbon energy system of the future.”\nClick here to see Bloomberg data on Shell’s net-zero trajectory.\nOther institutional investors also are losing patience with oil and gas holdings. Stichting Pensioenfonds ABP, Europe’s biggest pension fund with about $550 billion of assets under management, said in May that it exited all its liquid assets in oil, gas and coal — a portfolio that was worth about $11 billion. It has said it plans to divest a further $5 billion of less liquid fossil-fuel assets.\nIn France, new sustainable investing requirements mean asset managers using the label will need to purge their portfolios of an estimated $7.5 billion in combined fossil-fuel assets, a development that will hit companies including TotalEnergies SE and Shell.\nIn the UK, both the Church of England Pensions Board and the Church Commissioners for England, which together oversee about $17 billion in assets, said last year that they’ll start blacklisting oil and gas majors.\nSweden’s AP7 fund, which manages more than $100 billion, has exclusion policies targeting a range of oil producers, including Saudi Aramco and India’s Oil and Natural Gas Corp. It blacklisted Exxon Mobil Corp..\nAkademikerPension, a Danish pensions investor, axed the last remaining oil and gas holdings in its $20 billion portfolio at the end of 2023 and is now in the process of offloading companies that provide equipment and services to fossil-fuel producers.\nFor now, the impact on returns of such divestments has been “neutral to slightly positive,” says Troels Børrild, head of responsible investments at AkademikerPension.\nBut looking down the road, there’s a transition risk “and that will materialize for a number of companies,” Børrild said. “It’s not priced in at the moment,” but as regulations take their toll, low-carbon portfolios are poised for “even more positive” risk-adjusted returns, he said.\nAccording to a March study by the Transition Pathway Initiative Centre, a think tank, Shell lags behind other European oil majors in its clean-energy transition. What’s more, oil investors are unlikely to have a clear idea of the risks they face because the industry isn’t generally providing them with the information they need, according to the study’s authors.\nShell’s goal is to invest around $10 billion to $15 billion between 2023 and 2025 “to support the development of low-carbon energy solutions,” a spokesperson for the company said. That includes e-mobility, low-carbon fuels, renewable power generation, hydrogen, and carbon capture and storage. Shell says it invested a total of $5.6 billion in low-carbon solutions in 2023, which was 23% of its capital spending.\nRead the Latest About OPEC:\nA US Senate committee is investigating whether oil producers are illegally coordinating with OPEC to raise prices, following allegations that the former head of Pioneer Natural Resources Co. colluded with the cartel.\nA number of big banks are also cutting their exposure to oil and gas. The European Union’s largest lender, BNP Paribas SA, has stopped underwriting conventional bonds for the fossil-fuel industry as part of a broader crackdown across the group on financing oil and gas. Credit Agricole SA, another major French bank, said in early June that it’s taking similar steps.\nThe development coincides with a particularly tense moment in the finance industry’s relationship with fossil fuels. On Wall Street, banks are increasingly being targeted by angry protesters demanding an immediate retreat from oil, gas and coal financing. Wall Street has responded by warning such a move would be economically irresponsible.\nCEOs including Barclays Plc’s CS Venkatakrishnan, Citigroup Inc.’s Jane Fraser, JPMorgan Chase & Co.’s Jamie Dimon and Goldman Sachs Group Inc.’s David Solomon have insisted that the finance industry can’t turn its back on oil and gas clients.\nJust this week, Venkatakrishnan characterized as unrealistic any calls to go “cold turkey” on fossil fuels. KKR & Co. founder Henry Kravis recently accused climate protesters of not understanding the economics of the energy transition.\nEven within the realm of climate nonprofits, there are now notable proponents of embracing some of the highest-polluting assets. These include Climate Arc, which is backed by hedge fund billionaire Chris Hohn. Other backers include Nicolai Tangen, a former hedge fund manager who now runs Norway’s $1.7 trillion sovereign wealth fund, as well as Generation Foundation, which was set up alongside Al Gore’s Generation Investment Management.\nCritics of exclusion policies argue that fossil-fuel companies can just turn to less scrupulous financiers, with less likelihood of any green engagement. They also note it’s important to distinguish between gas — which even made its way into the EU’s green taxonomy — and coal and oil, which have much higher CO2 emissions.\nMeryam Omi, Climate Arc’s CEO, says too many investors are shying away from the “murky part” of climate finance. In other words, the finance industry needs to move into the highest-emitting sectors to effectively bring about a low-carbon energy transition, she says.\nBessing notes that PFA still holds oil companies whose transition plans it views as credible. That includes TotalEnergies.\nNot everything that TotalEnergies does is perfect, but unlike Shell, the company has set “a 2030 target of raising their capex in clean energy to 33%, which is something that we have requested,” he said.\n“If I had the resources, I would engage with more oil and gas companies in order to push them further into green transition,” Bessing said.\nAs things stand, though, it’s clear that even if PFA exited all its fossil-fuel exposures, “the world will not become any greener,” he said.\n--With assistance from Alastair Marsh.\n(Adds data in 12th paragraph.)\nMost Read from Bloomberg Businessweek\nJapan’s Tiny Kei-Trucks Have a Cult Following in the US, and Some States Are Pushing Back\nThe FBI’s Star Cooperator May Have Been Running New Scams All Along\nRTO Mandates Are Killing the Euphoric Work-Life Balance Some Moms Found\nSurging Returns Lure Private Equity Giants to India\nHow Glossier Turned a Viral Moment for ‘You’ Perfume Into a Lasting Business\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/List-Money-Managers-Dumping-Oil-190000994.Html", "Sentiment_Score": -0.0028285794, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-06-27T08:36:21.000Z", "Headline": "Shell achieves FID for two carbon capture and storage projects in Canada", "Summary": "Shell's Canadian division has achieved the FID for carbon capture and storage (CCS) projects in Canada.\nThe FID will see the development of the Polaris project at the Shell Energy and Chemicals Park in Scotford, Alberta, as well as the Atlas Carbon Storage Hub, a 50-50 joint venture with ATCO EnPower.\nPolaris, which is entirely owned by Shell, is set to capture roughly 650,000tpa of CO₂ from Shell’s Scotford refinery and chemicals complex.\nThis project is expected to slash scope 1 CO₂ emissions by up to 40% at the refinery and by up to 22% at the chemicals complex.\nThe first phase of Atlas will serve as the storage site for CO₂ captured by Polaris.\nThe captured CO₂ from Polaris will be transported via a 22km pipeline to the Atlas Hub, where it will be stored around 2km underground in the Basal Cambrian Sands.\nShell said this geological formation is already utilised by the Quest CCS facility at Scotford, which has securely stored more than nine million tonnes of CO₂ since 2015.\nBoth Polaris and Atlas are set to commence operations by the end of 2028.\nShell downstream, renewable and energy solutions director Huibert Vigeveno said: \"Carbon capture and storage is a key technology to achieve the Paris Agreement climate goals. The Polaris and Atlas projects are important steps in reducing emissions from our own operations.”\nShell said it intends to invest $10bn–$15bn from 2023 to 2025 in low-carbon energy solutions including e-mobility, renewable power, hydrogen and CCS technologies.\nLast week, Shell Eastern Trading, another Shell subsidiary, signed an agreement to acquire Pavilion Energy from Carne Investments, a wholly owned subsidiary of Temasek.\n\"Shell achieves FID for two carbon capture and storage projects in Canada \" was originally created and published by Offshore Technology, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/Shell-Achieves-Fid-Two-Carbon-083621957.Html", "Sentiment_Score": 0.9257049561, "Sentiment_Category": "bullish"}, {"Ticker": "SHEL", "Time": "2024-06-26T15:45:11.000Z", "Headline": "Shell (SHEL) is a Top Dividend Stock Right Now: Should You Buy?", "Summary": "All investors love getting big returns from their portfolio, whether it's through stocks, bonds, ETFs, or other types of securities. But for income investors, generating consistent cash flow from each of your liquid investments is your primary focus.\nCash flow can come from bond interest, interest from other types of investments, and of course, dividends. A dividend is that coveted distribution of a company's earnings paid out to shareholders, and investors often view it by its dividend yield, a metric that measures the dividend as a percent of the current stock price. Many academic studies show that dividends make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.\nShell in Focus\nShell (SHEL) is headquartered in London, and is in the Oils-Energy sector. The stock has seen a price change of 8.74% since the start of the year. The oil and gas company is paying out a dividend of $0.69 per share at the moment, with a dividend yield of 3.85% compared to the Oil and Gas - Integrated - International industry's yield of 2.83% and the S&P 500's yield of 1.6%.\nIn terms of dividend growth, the company's current annualized dividend of $2.75 is up 11.2% from last year. Over the last 5 years, Shell has increased its dividend 3 times on a year-over-year basis for an average annual increase of 2.55%. Looking ahead, future dividend growth will be dependent on earnings growth and payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. Shell's current payout ratio is 35%, meaning it paid out 35% of its trailing 12-month EPS as dividend.\nLooking at this fiscal year, SHEL expects solid earnings growth. The Zacks Consensus Estimate for 2024 is $8.55 per share, representing a year-over-year earnings growth rate of 1.79%.\nBottom Line\nInvestors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. However, not all companies offer a quarterly payout.\nBig, established firms that have more secure profits are often seen as the best dividend options, but it's fairly uncommon to see high-growth businesses or tech start-ups offer their stockholders a dividend. Income investors have to be mindful of the fact that high-yielding stocks tend to struggle during periods of rising interest rates. With that in mind, SHEL is a compelling investment opportunity. Not only is it a strong dividend play, but the stock currently sits at a Zacks Rank of 3 (Hold).\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Shell-Shel-Top-Dividend-Stock-154511480.Html", "Sentiment_Score": 0.0328878313, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-06-25T11:00:00.000Z", "Headline": "Forget Shale: Canada’s Oil Sands Are Having Their Moment", "Summary": "Canada’s oil sands were once the high-cost, dirty and unloved sibling to America’s fast-growing shale. Oil-sands producers have been among the top-performing companies in the energy sector over the past year. Shares of the four largest Canadian oil-sands producers by market capitalization have gained an average of 37% over the past 12 months, outpacing an index of the largest U.S. energy companies by 19 percentage points.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/96F74733-97A2-3009-9303-B600Bfb200E8/Forget-Shale-Canada%E2%80%99S-Oil.Html", "Sentiment_Score": 0.0641780123, "Sentiment_Category": "bullish"}, {"Ticker": "SHEL", "Time": "2024-06-17T17:31:42.000Z", "Headline": "Is Shell plc (SHEL) One of the Best Undervalued Energy Stocks to Buy Now?", "Summary": "We recently compiled a list of the 8 Best Undervalued Energy Stocks To Buy According to Analysts. In this article, we are going to take a look at where Shell plc (NYSE:SHEL) stands against the other undervalued energy stocks.\nFollowing another eventful year for the global energy sector, 2024 continues the trend of disruptions, headwinds, and opportunities. The previous year concluded with a landmark agreement at COP28 to reduce global methane emissions, a significant contributor to worldwide emissions. Despite being one of the world's more mature industries, the international energy sector remains incredibly dynamic, with journalists, governments, investors, and analysts paying special interest to developments within the industry to assess their potential impact on the global business and economic landscapes.\nEnergy stocks experienced negative returns in 2023, but have risen in early 2024 alongside the price of oil. Generally, energy stock prices tend to track changes in energy prices. For instance, when energy prices peaked in 2022 due to Russia's invasion of Ukraine and the lingering effects of the COVID-19 pandemic, many companies in the energy sector saw gains. Global production levels are also crucial to the sector's performance. While U.S. oil production has been relatively high in recent months, many OPEC+ countries have capped production. Although demand for energy products continues to grow, there is uncertainty about whether supply will increase accordingly.\nOn another front, global investment in the energy transition has increased tremendously over the years, hitting the $1.8 trillion mark in 2023, flagging a 17% rise from the previous year, according to BloombergNEF. However, this amount is a fraction of the $1.77 trillion invested globally, with the business case for adopting renewable energy becoming more compelling for companies. Conversely, the oil and gas sector has seen a significant surge in merger and acquisition activity, with over $155 billion in deals in the fourth quarter of 2023. This total surpasses the combined value of deals from the previous five quarters. Facing challenging market and economic conditions, oil and gas companies—especially those in upstream, midstream, and oil field services—are expected to continue this consolidation trend into 2024.\nOil prices bottomed on June 5 due to an unexpected increase in U.S. crude stocks and a larger-than-anticipated rise in fuel inventories, heightening demand concerns amid potential supply growth later this year. At the time data from the U.S. Energy Information Administration showed that the U.S. crude stockpile rose by 1.2 million barrels in the week ending May 31, contrary to analysts' expectations of a 2.3 million barrel draw. However, this build was less than the American Petroleum Institute's report, which indicated an increase of over 4 million barrels. On the other hand, gasoline inventories increased by 2.1 million barrels, exceeding expectations of a 2 million barrel rise. This contributed to demand concerns, as the week reflected fuel usage around the Memorial Day holiday, traditionally seen as the start of the U.S. summer driving season. Oil prices increased by about $5 since then, currently trading above $78 per barrel.\nThe energy industry is not only massive but also holds significant growth potential. According to the United Nations, achieving the goals of the Paris Climate Agreement will require an annual investment of $2.4 trillion in energy systems over the next 11 years. Illustrating this growth, a report states that the global renewable energy market, valued at $899.24 billion in 2022, is expected to grow from $1,050.31 billion in 2023 to $3,637.99 billion by 2031, at a CAGR of 16.80% during the forecast period.\nThe current year promises to be another rollercoaster ride for the energy industry, raising critical questions about the feasibility of achieving the net-zero targets outlined in the Paris Agreement. Commenting on this, Rystad Energy CEO Jarand Rystad remarked:\n\"Last year was a pivotal one for the energy world. Renewable energy capacity expanded rapidly, keeping up with global power demand growth for the first time. Solar PV needed to grow by 220 gigawatts (GW) in 2023 to track the 1.6 DG scenario for global warming. The latest figures now indicate that it could end up at above 400 GW. And there is now supply chain visibility for an annual delivery of 1,500 GW. Global coal demand most likely peaked in 2023, and clean energy technologies are now more affordable than fossil fuel alternatives in most parts of the world. Fossil fuels will, however, remain an important component of the energy mix for the next decades. Countries like Denmark, Finland and Portugal are close to achieving zero carbon power sectors, successfully dealing with the intermittency challenge of renewables. Still, there are also setbacks in renewable deployment, like the cost inflation seen in offshore wind, and governments will need to step up stimulation to get these sectors back on track. This year could see more inflection points in the energy transition, with impacts felt well into the latter half of the decade.\"\nWith this context in mind, we are now talk about Wall Street analysts' best undervalued energy stocks to buy.\nOur Methodology\nTo compile our list of the best undervalued energy stocks to buy according to analysts, we used a stock screener to identify energy stocks with price-to-earnings (P/E) ratios below 25. We then ranked these firms based on their average analyst share price target upside. For each of these energy stocks, we have also included hedge fund sentiment. Why do we track stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA gas refinery lit up against the night sky, showing the scale of the company's petrochemical operations.\nShell plc (NYSE:SHEL)\nAverage Analyst Estimates as of May 28: $90.33\nAverage Analyst Upside as of May 28: 24.75%\nP/E Ratio: 13.39\nShell plc (NYSE:SHEL) is a global leader in the energy and petrochemical sectors, operating across various segments such as Integrated Gas, Upstream, Marketing, Chemicals and Products, and Renewables and Energy Solutions. The company's activities include the exploration and extraction of crude oil, natural gas, and natural gas liquids, as well as the marketing, transportation, and trading of these essential resources.\nOn May 2, Shell plc (NYSE:SHEL) reported a first-quarter profit of $7.7 billion, significantly exceeding expectations due to disruptions in the Red Sea and Russia that boosted oil refining and trading. The company also announced plans to repurchase an additional $3.5 billion of its shares over the next three months, maintaining the same rate as the previous quarter. On the other hand, the company's cash flow increased by 6% from the previous quarter to $13.3 billion, reflecting strong operational performance. This, along with robust trading, helped offset the impact of declining natural gas prices that affected the earnings of its rivals.\nA few weeks after the earnings report, JPMorgan highlighted that first-quarter cash generation for European oil companies met expectations, with the Wall Street firm’s post-reporting forecasts, based on assumptions of $80 per barrel for oil and €35 per megawatt-hour for EU gas, suggesting that earnings per share expectations were well-supported, with predictions aligning for 2024 and rising by 5% for 2025. In that regard, JPMorgan favors companies with exposure to oil and globally advantaged liquefied natural gas (LNG) over spot gas, recommending overweight positions in Shell plc (NYSE:SHEL).\nBy the end of the first quarter of this year, 50 out of the 919 hedge funds tracked by Insider Monkey held stakes in Shell plc (NYSE:SHEL). The largest stakeholder among them was Ken Fisher’s Fisher Asset Management, with a $1.56 billion investment.\nOverall SHEL ranks 4th on our list of the best undervalued energy stocks to buy. You can visit 8 Best Undervalued Energy Stocks To Buy According to Analysts to see the other energy stocks that are on hedge funds’ radar. While we acknowledge the potential of SHEL as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than SHEL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n READ NEXT: Analyst Sees a New $25 Billion \"Opportunity\" for NVIDIA and Jim Cramer is Recommending These 10 Stocks in June.\n Disclosure: None. This article is originally published at Insider Monkey.", "Link": "Https://Finance.Yahoo.Com/News/Shell-Plc-Shel-One-Best-173142526.Html", "Sentiment_Score": 0.1986647099, "Sentiment_Category": "bullish"}, {"Ticker": "SHEL", "Time": "2024-06-10T06:00:00.000Z", "Headline": "Shell plc First Quarter 2024 Euro and GBP Equivalent Dividend Payments", "Summary": "SHELL PLC FIRST QUARTER 2024 EURO AND GBP EQUIVALENT DIVIDEND PAYMENTS\nJune 10, 2024\nThe Board of Shell plc today announced the pounds sterling and euro equivalent dividend payments in respect of the first quarter 2024 interim dividend, which was announced on May 2, 2024 at US$0.344 per ordinary share.\nShareholders have been able to elect to receive their dividends in US dollars, euros or pounds sterling. Holders of ordinary shares who have validly submitted US dollars, euros or pounds sterling currency elections by June 3, 2024 will be entitled to a dividend of US$0.344, €0.3166 or 26.94p per ordinary share, respectively.\nAbsent any valid election to the contrary, persons holding their ordinary shares through Euroclear Nederland will receive their dividends in euros at the euro rate per ordinary share shown above. Absent any valid election to the contrary, shareholders (both holding in certificated and uncertificated form (CREST members)) and persons holding their shares through the Shell Corporate Nominee will receive their dividends in pounds sterling, at the pound sterling rate per ordinary share shown above.\nEuro and pounds sterling dividends payable in cash have been converted from US dollars based on an average of market exchange rates over the three dealing days from June 5 to June 7, 2024. This dividend will be payable on June 24, 2024 to those members whose names were on the Register of Members on May 17, 2024.\nTaxation - cash dividend\nIf you are uncertain as to the tax treatment of any dividends you should consult your tax advisor.\nNote\nA different currency election date may apply to shareholders holding shares in a securities account with a bank or financial institution ultimately holding through Euroclear Nederland. This may also apply to other shareholders who do not hold their shares either directly on the Register of Members or in the corporate sponsored nominee arrangement. Shareholders can contact their broker, financial intermediary, bank or financial institution for the election deadline that applies.\nEnquiries\nShell Media Relations\nInternational         +44 (0) 207 934 5550\nAmericas         +1 832 337 4355\nCAUTIONARY NOTE\nThe companies in which Shell plc directly and indirectly owns investments are separate legal entities. In this announcement “Shell”, “Shell Group” and “Group” are sometimes used for convenience where references are made to Shell plc and its subsidiaries in general. Likewise, the words “we”, “us” and “our” are also used to refer to Shell plc and its subsidiaries in general or to those who work for them. These terms are also used where no useful purpose is served by identifying the particular entity or entities. ‘‘Subsidiaries’’, “Shell subsidiaries” and “Shell companies” as used in this announcement refer to entities over which Shell plc either directly or indirectly has control. The term “joint venture”, “joint operations”, “joint arrangements”, and “associates” may also be used to refer to a commercial arrangement in which Shell has a direct or indirect ownership interest with one or more parties.  The term “Shell interest” is used for convenience to indicate the direct and/or indirect ownership interest held by Shell in an entity or unincorporated joint arrangement, after exclusion of all third-party interest.\nForward-Looking Statements\nThis announcement contains forward-looking statements (within the meaning of the U.S. Private Securities Litigation Reform Act of 1995) concerning the financial condition, results of operations and businesses of Shell. All statements other than statements of historical fact are, or may be deemed to be, forward-looking statements. Forward-looking statements are statements of future expectations that are based on management’s current expectations and assumptions and involve known and unknown risks and uncertainties that could cause actual results, performance or events to differ materially from those expressed or implied in these statements. Forward-looking statements include, among other things, statements concerning the potential exposure of Shell to market risks and statements expressing management’s expectations, beliefs, estimates, forecasts, projections and assumptions. These forward-looking statements are identified by their use of terms and phrases such as “aim”; “ambition”; ‘‘anticipate’’; ‘‘believe’’; “commit”; “commitment”; ‘‘could’’; ‘‘estimate’’; ‘‘expect’’; ‘‘goals’’; ‘‘intend’’; ‘‘may’’; “milestones”; ‘‘objectives’’; ‘‘outlook’’; ‘‘plan’’; ‘‘probably’’; ‘‘project’’; ‘‘risks’’; “schedule”; ‘‘seek’’; ‘‘should’’; ‘‘target’’; ‘‘will’’; “would” and similar terms and phrases. There are a number of factors that could affect the future operations of Shell and could cause those results to differ materially from those expressed in the forward-looking statements included in this announcement, including (withoutlimitation): (a) price fluctuations in crude oil and natural gas; (b) changes in demand for Shell’s products; (c) currency fluctuations; (d) drilling and production results; (e) reserves estimates; (f) loss of market share and industry competition; (g) environmental and physical risks; (h) risks associated with the identification of suitable potential acquisition properties and targets, and successful negotiation and completion of such transactions; (i) the risk of doing business in developing countries and countries subject to international sanctions; (j) legislative, judicial, fiscal and regulatory developments including regulatory measures addressing climate change; (k) economic and financial market conditions in various countries and regions; (l) political risks, including the risks of expropriation and renegotiation of the terms of contracts with governmental entities, delays or advancements in the approval of projects and delays in the reimbursement for shared costs; (m) risks associated with the impact of pandemics, such as the COVID-19 (coronavirus) outbreak, regional conflicts, such as the Russia-Ukraine war, and a significant cybersecurity breach; and (n) changes in trading conditions. No assurance is provided that future dividend payments will match or exceed previous dividend payments. All forward-looking statements contained in this announcement are expressly qualified in their entirety by the cautionary statements contained or referred to in this section. Readers should not place undue reliance on forward-looking statements. Additional risk factors that may affect future results are contained in Shell plc’s Form 20-F for the year ended December 31, 2023 (available at www.shell.com/investors/news-and-filings/sec-filings.html and www.sec.gov).These risk factors also expressly qualify all forward-looking statements contained in this announcement and should be considered by the reader. Each forward-looking statement speaks only as of the date of this announcement, June 10, 2024. Neither Shell plc nor any of its subsidiaries undertake any obligation to publicly update or revise any forward-looking statement as a result of new information, future events or other information. In light of these risks, results could differ materially from those stated, implied or inferred from the forward-looking statements contained in this announcement.\nShell’s Net Carbon Intensity\nAlso, in this announcement we may refer to Shell’s “Net Carbon Intensity” (NCI), which includes Shell’s carbon emissions from the production of our energy products, our suppliers’ carbon emissions in supplying energy for that production and our customers’ carbon emissions associated with their use of the energy products we sell. Shell’s NCI also includes the emissions associated with the production and use of energy products produced by others which Shell purchases for resale. Shell only controls its own emissions. The use of the terms Shell’s “Net Carbon Intensity” or NCI are for convenience only and not intended to suggest these emissions are those of Shell plc or its subsidiaries.\nShell’s net-zero emissions target\nShell’s operating plan, outlook and budgets are forecasted for a ten-year period and are updated every year. They reflect the current economic environment and what we can reasonably expect to see over the next ten years. Accordingly, they reflect our Scope 1, Scope 2 and NCI targets over the next ten years. However, Shell’s operating plans cannot reflect our 2050 net-zero emissions target, as this target is currently outside our planning period. In the future, as society moves towards net-zero emissions, we expect Shell’s operating plans to reflect this movement. However, if society is not net zero in 2050, as of today, there would be significant risk that Shell may not meet this target.\nForward Looking Non-GAAP measures\nThis announcement may contain certain forward-looking non-GAAP measures such as cash capital expenditure and divestments. We are unable to provide a reconciliation of these forward-looking non-GAAP measures to the most comparable GAAP financial measures because certain information needed to reconcile those non-GAAP measures to the most comparable GAAP financial measures is dependent on future events some of which are outside the control of Shell, such as oil and gas prices, interest rates and exchange rates. Moreover, estimating such GAAP measures with the required precision necessary to provide a meaningful reconciliation is extremely difficult and could not be accomplished without unreasonable effort. Non-GAAP measures in respect of future periods which cannot be reconciled to the most comparable GAAP financial measure are calculated in a manner which is consistent with the accounting policies applied in Shell plc’s consolidated financial statements.\nThe contents of websites referred to in this announcement do not form part of this announcement.\nWe may have used certain terms, such as resources, in this announcement that the United States Securities and Exchange Commission (SEC) strictly prohibits us from including in our filings with the SEC. Investors are urged to consider closely the disclosure in our Form 20-F, File No 1-32575, available on the SEC website www.sec.gov.\nLEI number of Shell plc: 21380068P1DRHMJ8KU70\nClassification: Additional regulated information required to be disclosed under the laws of a Member State", "Link": "Https://Finance.Yahoo.Com/News/Shell-Plc-First-Quarter-2024-060000896.Html", "Sentiment_Score": 0.0094093513, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-06-04T13:17:00.000Z", "Headline": "Shell's (SHEL) Offshore Oil Appeal Gets Rejected in South Africa", "Summary": "Shell Plc SHEL faced a legal setback in South Africa. Its appeal to overturn a judgment that blocked an offshore oil exploration had been dismissed by South Africa's Supreme Court of Appeals. This decision came amid strong opposition from environmental groups and local communities concerned about the environmental impact of Shell's oil explorations and its lack of proper public consultation.\nLet’s delve into the intricacies of the case, its implications for Shell and the government and the broader context of oil exploration in the region.\nBackground of the Case\nInitial Ruling and Environmental Concerns: In 2021, environmental groups succeeded in halting Shell's exploration activities along the Wild Coast. The primary concerns raised were the lack of consultation with local communities and the potential adverse effects on the climate, marine life and the livelihood of residents. These issues led to a high court ruling that required a thorough review and possible revocation of the exploration rights and their renewals granted in 2017 and 2021.\nShell's Appeal and Court's Decision: Shell appealed the high court's decision, seeking to reinstate its exploration rights. The Supreme Court of Appeals dismissed Shell's appeal. However, the court suspended its orders to set aside the exploration rights and their renewal, pending the finalization of the third renewal. This nuanced ruling means that while the exploration rights remain valid, they are subject to additional public consultation and renewal applications.\nImplications for Shell and the Oil Industry\nShell's Position and Response: Shell welcomed the court's direction to retain the exploration rights with conditions. A company spokesperson highlighted Shell's commitment to re-evaluating the ruling and determining the next steps. This decision allowed Shell to continue with its exploration activities, subject to further regulatory and community engagement.\nImpact on South Africa's Economic Development: South Africa's government, particularly Mineral Resources and Energy Minister Gwede Mantashe, has been a vocal advocate for oil exploration. The government argues that such activities are key for economic development and energy security.\nThe court's ruling represented a delicate balance between promoting economic growth and addressing environmental and community concerns. The outcome could influence future policies and regulatory frameworks governing natural resource exploration in the country.\nEnvironmental and Community Perspectives\nVictories for Environmental Activists: The court's decision was seen as a partial victory for environmental and community groups. Although the appeal was dismissed, the possibility of renewal under stricter conditions and further consultations was a testament to the effectiveness of advocacy and legal actions. Organizations like Natural Justice, which was instrumental in the initial ruling,  expressed disappointment but remained committed to appealing to higher judicial authorities, including the Constitutional Court.\nBroader Environmental Impact: The concerns about offshore oil exploration are not limited to the immediate vicinity of the Wild Coast. Environmentalists warn about the broader implications of such activities, including potential oil spills, disruption of marine ecosystems and contribution to climate change. The case underscores the growing tension between economic development and environmental preservation, a global issue with local ramifications in South Africa.\nProspects for Oil Exploration in South Africa\nOngoing Legal and Regulatory Challenges: The future of oil exploration in South Africa remains uncertain with continuing legal battles and regulatory reviews. The outcome of Shell's third renewal application and any subsequent appeals will be pivotal. Companies engaged in similar activities, such as TotalEnergies SE TTE, are closely monitoring the situation, as the legal precedents set here could impact their operations and strategic planning.\nPotential for Compromise and Sustainable Development: There is a potential pathway for compromise to balance economic interests with environmental sustainability. Enhanced public consultations, stringent environmental assessments and transparent decision-making processes could pave the way for more socially and environmentally responsible resource exploration. This approach might help to mitigate conflicts and foster a more cooperative relationship between the government, corporations and civil society.\nConclusion\nThe dismissal of Shell's appeal by South Africa's Supreme Court of Appeals marked a significant development in the ongoing debate over offshore oil exploration. The ruling reflected the complex interplay between economic ambitions, legal frameworks and environmental stewardship. As Shell and other stakeholders navigate this challenging landscape, the outcomes of this and future cases could shape the future of energy exploration in South Africa and beyond.\nZacks Rank and Key Picks\nCurrently, SHELL and TTE carry a Zacks Rank #3 (Hold) each.\nInvestors interested in the energy sector might look at some better-ranked stocks like Archrock, Inc. AROC and SM Energy Company SM, each sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.\nArchrock is valued at $3.16 billion. The company currently pays a dividend of 66 cents per share, or 3.26%, on an annual basis.\nAROC, together with its subsidiaries, works as an energy infrastructure company in the United States. The company operates under two segments — Contract Operations and Aftermarket Services.\nDenver, CO-based SM Energy is valued at $5.8 billion. The company currently pays a dividend of 72 cents per share, or 1.43%, on an annual basis.\nSM, an independent energy company, engages in the acquisition, exploration, development and production of oil, gas and natural gas liquids in the state of Texas.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nSM Energy Company (SM) : Free Stock Analysis Report\nArchrock, Inc. (AROC) : Free Stock Analysis Report\nTotalEnergies SE Sponsored ADR (TTE) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Shells-Shel-Offshore-Oil-Appeal-131700533.Html", "Sentiment_Score": -0.8528779149, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-06-04T10:26:27.000Z", "Headline": "South African court throws Shell a lifeline in exploration dispute", "Summary": "Shell has lost a South African court appeal that was attempting to overturn a previous judgment blocking offshore oil exploration on the Wild Coast, in the country’s eastern region.\nHowever, in a partial victory for the British multinational, the ruling also includes the possibility of a renewal of the exploration rights, according to Bloomberg.\nThis allows Shell another chance at a public consultation. In fact, the lack of public consultation was among the key reasons a lower court previously ruled against Shell.\nIn 2021, various environmental groups including Greenpeace managed to stop any exploration activity in the area, a relatively untouched and underdeveloped coastal region.\nThe groups cited concerns that local communities were not properly consulted and around the impact initial exploration surveys would have on the region’s climate, local residents and marine life.\nIn 2022, South Africa’s high court ruled that the decisions to grant the exploration right be reviewed and set aside.\nShell appealed this decision soon after, arguing that the court had erred in various aspects, arguing that climate change and heritage rights should not have been considered by the court.\nHowever, on Monday, South Africa’s Supreme Court of Appeals dismissed the appeal, as per a summary of the judgment seen by the news outlet.\nHowever, in a move that gives Shell a glimmer of hope, the court also suspended several orders setting aside the granting of the exploration right and two renewals, in 2017 and 2021.\nThis suspension is pending the finalisation of a third renewal.\nAccording to news reports, Shell welcomed the court’s assertion that the exploration rights remain valid, subject to further public consultation and the renewal application. The company is considering next steps.\nNatural Justice, which specialises in environmental law and social and environmental justice, and one of the groups involved in the case, said the court’s decision “is a disappointing outcome for the communities and supporting organizations”, as it allows for the potential renewal of the exploration right.\nEnvironmental groups and coastal communities have protested against Shell's plans for seismic surveys on the Wild Coast, arguing that the acoustics are harmful to marine animals. Oil companies have rejected these claims.\nThe groups fighting against the offshore activity are considering an appeal to the country's Constitutional Court.\nWith Shell and TotalEnergies recently making oil discoveries in neighbouring Namibia, oil companies are looking closely at developing South Africa's hydrocarbon sector, something many of the nation's politicians see as a way to stimulate economic development.\nHowever, environmental activists in South Africa have secured multiple victories in court against oil exploration activity in recent years.\n\"South African court throws Shell a lifeline in exploration dispute\" was originally created and published by Offshore Technology, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/South-African-Court-Throws-Shell-102627054.Html", "Sentiment_Score": -0.791893363, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-06-03T13:00:01.000Z", "Headline": "Heard on the Street: Saudi's Oil Giant Is on a Charm Offensive", "Summary": "Saudi Aramco is trying to tempt international investors, as the world's biggest oil producer pursues a $12 billion stock offer. U.S. and European funds mostly steered clear of Aramco's pricey initial public offering back in 2019.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/96Bb4B64-Ae2B-3154-9D06-954A9C673568/Heard-On-The-Street-Saudi-S.Html", "Sentiment_Score": 0.0170993954, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-05-31T13:36:00.000Z", "Headline": "Shell (SHEL) to Cut Offshore Wind Jobs & Renew Focus on Oil & Gas", "Summary": "Shell plc SHEL, the British oil and gas giant, has disclosed its plans to cut jobs in the offshore wind division. The decision, which came after Shell’s CEO Wael Sawan took over, is aimed at focusing on the company’s most profitable ventures (which include fossil fuels) and moving away from the costly renewable sector. The layoffs in the offshore wind division are expected to begin in the next few months and will mostly affect the staff in Europe.\nA Shell representative has stated that the company is poised to concentrate on value over volume, indicating that it will lay emphasis on delivering value to shareholders and customers rather than expanding its business. Due to a shift in its strategy, Shell is likely to focus only on those markets and segments that will maximize value for both its investors and customers. However, Shell has mentioned that it will keep an eye out for offshore wind projects in priority markets, thereby retaining its emphasis on performance, discipline and simplification.\nUnder new management, Shell’s business divisions have been under pressure to improve profitability. In fact, in June 2023, management outlined a plan to decrease structural costs by nearly $3 billion by the end of 2025. The decision to move away from renewables can be primarily attributed to the high cost and the capital-intensive nature of the sector. Shell had invested heavily in the offshore wind business to leverage its prowess in oil and gas extraction at sea. However, rising costs and a renewed focus on driving shareholder returns have led to its retreat from renewables.\nUnder the new leadership, Shell has undergone several changes, including the elimination of certain positions, such as the global head of renewables. The company has backed out of its offshore wind projects in Ireland and France and continues to explore the potential sale of its stakes in its renewable ventures. CEO Wael Sawan has also mentioned that the company may altogether quit the London stock exchange and shift to New York.\nThe layoffs in the offshore wind division follow the job cuts in Shell’s low-carbon solutions unit, where at least 15% of the workforce will be laid off. This comes down to nearly 200 jobs being slashed alongside 130 more under review.\nOn another note, Shell has also backed out of its promise to reduce oil production. The company has, instead, emphasized its commitment to provide energy security to its customers while transitioning to a net zero emission business over time.\nZacks Rank and Key Picks\nCurrently, SHEL carries a Zacks Rank #3 (Hold).\nSome better-ranked stocks in the energy sector are Archrock Inc. AROC, Hess Midstream Partners LP HESM and Sunoco LP SUN.Archrock presently sports a Zacks Rank #1 (Strong Buy), while Hess Midstream and Sunoco carry a Zacks Rank of #2 (Buy) each. You can see the complete list of today’s Zacks #1 Rank stocks here.\nArchrock is an energy infrastructure company based in the United States, with a focus on midstream natural gas compression. It provides natural gas contract compression services and generates stable fee-based revenues.\nHess Midstream LP owns, operates, develops and acquires a wide range of midstream assets, providing services to Hess Corporation and other third-party customers. The partnership has a stable fee-based revenue model secured via long-term commercial contracts. Since Hess Midstream operates through 100% fee-based contracts, it is exposed to minimal commodity price risks.\nSunoco LP is one of the largest distributors of motor fuel in the United States. The partnership distributes fuel to independent dealers, commercial customers, convenience stores as well as distributors. Its current distribution yield is greater than that of the composite stocks in the industry, providing unitholders with consistent returns.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nSunoco LP (SUN) : Free Stock Analysis Report\nArchrock, Inc. (AROC) : Free Stock Analysis Report\nHess Midstream Partners LP (HESM) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Shell-Shel-Cut-Offshore-Wind-133600232.Html", "Sentiment_Score": -0.7393326163, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-05-29T10:26:03.000Z", "Headline": "Shell cuts offshore wind unit to sharpen focus on oil and gas business", "Summary": "British energy giant Shell is poised to reduce its workforce in its offshore wind division as CEO Wael Sawan shifts the company's focus towards oil and gas, Bloomberg has reported.\nThe job cuts, mainly in Europe, are expected to commence within months.\nA Shell spokesperson stated: “We are concentrating on select markets and segments to deliver the most value for our investors and customers.\n“Shell is looking at how it can continue to compete for offshore wind projects in priority markets while maintaining our focus on performance, discipline and simplification.”\nThe company, which had invested significantly in offshore wind to capitalise on its marine oil and gas extraction expertise, is now prioritising shareholder returns.\nThis strategic pivot comes amidst rising costs in the renewable sector and Sawan's emphasis on business performance after becoming CEO.\nIn June 2023, he announced a target of £3bn cuts in structural costs by the end of 2025.\nThe impending layoffs in the offshore wind department are part of these cost-reduction measures, following earlier job cuts in the low-carbon solutions unit.\nShell's offshore wind team, primarily based in the Netherlands, now faces limitations on spending, leaving them with fewer projects than anticipated.\nThe planned staff reductions ‘coincide with the departure of several executives, including Thomas Brostrom and Melissa Read, leaders of the European and UK offshore wind units, respectively.\nIn May 2024 Shell also exited China's power market, ceasing operations in power generation, trading and marketing.\nThe withdrawal aligns with the company's strategy to focus on more lucrative ventures, especially in natural gas and oil.\nIn March 2024, Shell New Energies US sold its 50% interest in SouthCoast Wind Energy to Ocean Winds North America, its joint venture partner.\nSouthCoast Wind was established to develop offshore wind projects in Massachusetts with a potential of 2.4GW.\n\"Shell cuts offshore wind unit to sharpen focus on oil and gas business\" was originally created and published by Power Technology, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/Shell-Cuts-Offshore-Wind-Unit-102603860.Html", "Sentiment_Score": -0.35156703, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-05-28T19:32:31.000Z", "Headline": "Shell plots job cuts in offshore wind division", "Summary": "Shell chief Wael Sawan is pursuing a move away from renewables - Ryan Lim/AFP via Getty Images\nShell is preparing to axe staff in its offshore wind business, as chief executive Wael Sawan pursues a move away from renewables.\nThe FTSE 100 oil giant is reportedly plotting the cuts after being hit by cost increases which have affected the entire offshore wind industry.\nThey are expected to begin “within months” and will affect staff in Europe, according to Bloomberg.\nA Shell spokesman did not dismiss the report when contacted on Tuesday evening, only stating: “In line with our previously announced shift to prioritising value over volume in power, we are concentrating on select markets and segments to deliver the most value for our investors and customers through the energy transition.\n“As a result of this, Shell is looking how it can continue to compete for offshore wind projects in priority markets while maintaining our focus on performance, discipline and simplification.”\nIt is the latest shift from green energy under Mr Sawan, who took over from Ben van Beurden at the start of last year.\nLast summer, the chief executive set out plans to slash “structural costs” by as much as $3bn by the end of 2025 - partly by reducing exposure to renewables projects.\nHe also watered down previous commitments by the company to gradually cut oil production.\nSubsequently, Shell also scrapped the role of global head of renewables, exited offshore wind projects in Ireland and France and announced plans to sell stakes in other renewable schemes.\nThe moves are partly aimed at reducing the valuation gap between Shell and its American rivals by focusing on the most profitable parts of the business - oil and gas production - and returning more cash to shareholders through dividends and share buybacks.\nMr Sawan has also suggested the company could quit the London stock market and move its listing to New York if the situation does not improve.\nThe planned cuts, which follow the departure of top wind executives Thomas Brostrom and Melissa Read, come after layoffs in the separate low-carbon solutions unit were revealed in October.\nAt least 15pc of the unit’s workforce is set to be axed, Reuters said last year.\nThat could lead to 200 jobs being cut in 2024, with another 130 under review. The unit has around 1,300 employees.\nThe shakeup under Mr Sawan has not been universally well-received within the company, however.\nIn September, hundreds of employees supported a letter expressing “deep concern” about Shell’s trajectory.\nMr Sawan insisted the company was focused on providing “affordable and secure energy to people every day... as we transition over time to a net zero emissions business”.\nBroaden your horizons with award-winning British journalism. Try The Telegraph free for 3 months with unlimited access to our award-winning website, exclusive app, money-saving offers and more.", "Link": "Https://Finance.Yahoo.Com/News/Shell-Plots-Job-Cuts-Offshore-193231641.Html", "Sentiment_Score": -0.9366028905, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-05-28T12:09:00.000Z", "Headline": "Shareholders Divided Over Shell's (SHEL) Climate Plan at AGM", "Summary": "Shell plc SHEL shareholders have decisively rejected a climate resolution proposed by the activist group Follow This, during an annual general meeting (“AGM”) marked by protests and intense debate. The resolution, backed by 27 investors managing approximately $4 trillion, sought to align the London-based supermajor’s medium-term carbon reduction targets with the Paris Climate Agreement, focusing on emissions from fuels burned by consumers (Scope 3 emissions). It received 18.6% support, a slight decrease from last year’s 20.2%.\nCompany’s Revised Strategy\nIn contrast, Shell's board's climate strategy received 78.2% support from its shareholders. This plan, introduced in March, aims for a 15-20% reduction in the net carbon intensity of its energy products by 2030 from the 2016 levels. This marked a retreat from the previous 20% target and the abandonment of a 2035 objective. Shell's CEO, Wael Sawan, emphasized that the company's plan focuses on maintaining profitable operations, mainly in oil and gas, citing strong gas demand and energy transition uncertainties.\nActivist Backlash\nThe activist group Follow This criticized Shell’s approach, arguing that it failed to adequately address the urgent need for carbon reductions. Founder Mark van Baal accused Shell’s board of clinging to traditional hydrocarbon-based business models rather than investing in clean energy. Despite the resolution’s lower support compared to last year, van Baal noted that nearly 19% of shareholders backing the climate resolution signifies a minority pushing for stronger climate action.\nProtests and Disruptions\nThe AGM was notably disrupted by climate protesters, both inside and outside the venue. Demonstrators from groups like Extinction Rebellion and Fossil Free London chanted slogans, highlighting their dissatisfaction with Shell’s climate policies and alleged environmental destruction in regions like the Niger Delta. The protests reflected widespread discontent with Shell’s environmental impact and its perceived slow pace in transitioning to renewable energy sources.\nShell’s Defense\nShell’s leadership defended the company’s strategy, stressing the importance of ongoing investment in oil and gas to meet current energy demands. Chairman Andrew Mackenzie and CEO Wael Sawan reiterated the necessity of hydrocarbons in the near term, even as Shell aims to become a net-zero emissions energy business by 2050. They argued that premature divestment from oil and gas could jeopardize global energy security.\nShareholder Dissent\nDespite the majority support for Shell’s revised strategy, there was notable dissent. Over 20% of shareholders voted against Shell’s current climate plan, indicating significant concern about the company's commitment to meaningful climate action. Under UK corporate governance rules, this level of opposition requires Shell to engage with dissenting shareholders and report back within six months on how it plans to address their concerns.\nLooking Forward\nShell’s leadership expressed confidence in its approach, with Sawan asserting that the reduced support for the Follow This resolution indicates growing trust in the company’s ability to navigate the energy transition. However, the company remains under pressure from both activist shareholders and external protest groups to accelerate its decarbonization efforts and align more closely with international climate goals.\nConclusion\nThe AGM underscored the ongoing conflict between Shell’s management and a significant minority of its shareholders over the company’s climate strategy. While Shell's leadership is committed to a gradual transition, focusing on profitability and energy security, activists and a notable portion of investors demand more aggressive action to combat climate change. This dynamic is likely to continue as Shell navigates its path toward a more sustainable future.\n3 Energy Stocks to Buy\nShell carries a Zacks Rank #3 (Hold) at present. Meanwhile, investors interested in the Oil/Energy space could benefit from accumulating stocks like SM Energy Company SM, Marathon Petroleum MPC and ProPetro Holding PUMP. SM Energy and Marathon Petroleum currently sport a Zacks Rank #1 (Strong Buy) each, while ProPetro carries a  Zacks Rank #2 (Buy).\nYou can see the complete list of today’s Zacks #1 Rank stocks here.\nSM Energy Company: SM beat the Zacks Consensus Estimate for earnings in each of the trailing four quarters. SM Energy has a trailing four-quarter earnings surprise of 13.8%, on average.\nSM is valued at around $5.5 billion. SM Energy has seen its shares increase 77.6% in a year.\nMarathon Petroleum: Over the past 60 days, the Zacks Consensus Estimate for 2024 earnings has moved up 23.7%.\nMarathon Petroleum is valued at around $62.6 billion. MPC has seen its stock rise 66.8% in a year.\nProPetro Holding: Over the past 60 days, the Zacks Consensus Estimate for 2024 earnings has moved up 36.7%.\nProPetro Holding is valued at around $1.1 billion. PUMP has seen its stock rise 36.3% in a year.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nSM Energy Company (SM) : Free Stock Analysis Report\nMarathon Petroleum Corporation (MPC) : Free Stock Analysis Report\nProPetro Holding Corp. (PUMP) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Shareholders-Divided-Over-Shells-Shel-120900582.Html", "Sentiment_Score": -0.926525712, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-05-27T10:24:41.000Z", "Headline": "Shell plc (LON:SHEL) is largely controlled by institutional shareholders who own 65% of the company", "Summary": "Key Insights\nInstitutions' substantial holdings in Shell implies that they have significant influence over the company's share price\nThe top 25 shareholders own 38% of the company\nAnalyst forecasts along with ownership data serve to give a strong idea about prospects for a business\nA look at the shareholders of Shell plc (LON:SHEL) can tell us which group is most powerful. And the group that holds the biggest piece of the pie are institutions with 65% ownership. That is, the group stands to benefit the most if the stock rises (or lose the most if there is a downturn).\nSince institutional have access to huge amounts of capital, their market moves tend to receive a lot of scrutiny by retail or individual investors. As a result, a sizeable amount of institutional money invested in a firm is generally viewed as a positive attribute.\nLet's take a closer look to see what the different types of shareholders can tell us about Shell.\nCheck out our latest analysis for Shell\nownership-breakdown\nWhat Does The Institutional Ownership Tell Us About Shell?\nInstitutions typically measure themselves against a benchmark when reporting to their own investors, so they often become more enthusiastic about a stock once it's included in a major index. We would expect most companies to have some institutions on the register, especially if they are growing.\nShell already has institutions on the share registry. Indeed, they own a respectable stake in the company. This suggests some credibility amongst professional investors. But we can't rely on that fact alone since institutions make bad investments sometimes, just like everyone does. If multiple institutions change their view on a stock at the same time, you could see the share price drop fast. It's therefore worth looking at Shell's earnings history below. Of course, the future is what really matters.\nearnings-and-revenue-growth\nInstitutional investors own over 50% of the company, so together than can probably strongly influence board decisions. Shell is not owned by hedge funds. Our data shows that BlackRock, Inc. is the largest shareholder with 8.5% of shares outstanding. In comparison, the second and third largest shareholders hold about 4.8% and 3.0% of the stock.\nA deeper look at our ownership data shows that the top 25 shareholders collectively hold less than half of the register, suggesting a large group of small holders where no single shareholder has a majority.\nResearching institutional ownership is a good way to gauge and filter a stock's expected performance. The same can be achieved by studying analyst sentiments. There are a reasonable number of analysts covering the stock, so it might be useful to find out their aggregate view on the future.\nInsider Ownership Of Shell\nWhile the precise definition of an insider can be subjective, almost everyone considers board members to be insiders. Company management run the business, but the CEO will answer to the board, even if he or she is a member of it.\nInsider ownership is positive when it signals leadership are thinking like the true owners of the company. However, high insider ownership can also give immense power to a small group within the company. This can be negative in some circumstances.\nOur information suggests that Shell plc insiders own under 1% of the company. But they may have an indirect interest through a corporate structure that we haven't picked up on. It is a very large company, so it would be surprising to see insiders own a large proportion of the company. Though their holding amounts to less than 1%, we can see that board members collectively own UK£36m worth of shares (at current prices). It is good to see board members owning shares, but it might be worth checking if those insiders have been buying.\nGeneral Public Ownership\nThe general public, who are usually individual investors, hold a 33% stake in Shell. This size of ownership, while considerable, may not be enough to change company policy if the decision is not in sync with other large shareholders.\nNext Steps:\nIt's always worth thinking about the different groups who own shares in a company. But to understand Shell better, we need to consider many other factors. Be aware that Shell is showing 2 warning signs in our investment analysis , you should know about...\nBut ultimately it is the future, not the past, that will determine how well the owners of this business will do. Therefore we think it advisable to take a look at this free report showing whether analysts are predicting a brighter future.\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.", "Link": "Https://Finance.Yahoo.Com/News/Shell-Plc-Lon-Shel-Largely-102441625.Html", "Sentiment_Score": 0.0122678895, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-05-26T12:41:12.000Z", "Headline": "Is Shell (NYSE:SHEL) the Top Oil Dividend Stock to Buy in 2024?", "Summary": "Shell Plc (NYSE:SHEL ranks 6th in Insider Monkey’s list of the 9 Best Energy Dividend Stocks to Buy Now.\nClick to see the full list of 9 Best Energy Dividend Stocks to Buy Now.\nBefore analyzing Shell Plc (NYSE:SHEL), let’s see what’s happening in the dividend investing space these days.\nVolatility is prevailing in the energy sector amid geopolitical risks, China-related growth worries and overall fear of recession as inflation remains elevated across the globe. Edward Jones in an industry report earlier this month said that it expects oil prices to stay higher than its expectations throughout 2024. Edward Jones said it is looking to own stocks in the integrated oil and storage & transportation subsectors. The firm said its focus is on companies with strong balance sheets that could weather the volatility in commodity prices and pay dividends.\nThe Missouri-based investment banking company said the average dividend yield of the energy sector is more than double the market yield, which makes integrate oil & gas and storage & transportation stocks with Buy ratings a \"compelling combination\" of high yields and dividend growth.\nEdward Jones also believes energy companies are finally starting to practice some capital-spending discipline, after having \"outspent\" their cash flows for \"years.\" The firm, however, lamented over the energy sector's lackluster performance track record, which it believes is the reason why investors are reluctant when it comes to investing in energy stocks. Edward Jones said the sector's overall share of the S&P has fallen from over 14% in 2008 to approximately 3.9% as of May 15. However, the sector is showing signs of a rebound.\nA Franklin Templeton report published earlier this month said that the energy sector has been the best performer within the MSCI All Country World Index, delivering around 10.3% of YTD total return. The report said the Templeton Global Equity Group is preferring to invest in energy stocks that are not dependent on near-term oil prices. Franklin Templeton also praised the sectors FCF generation, saying the free cash flow yield of the MSCI AC World Energy Index came in at 8.8%, compared to the 4% of the MSCI.\nShell Plc (NYSE:SHEL)\nNumber of Hedge Fund Investors: 50\nWith over 3.5% dividend yield and strong cash flow position, Shell Plc (NYSE:SHEL) is one of the best energy dividend stocks to buy according to hedge funds. Shell Plc (NYSE:SHEL) recently posted strong Q1 results, and announced that it will buy back $3.5 billion of its shares over the next three months. Shell has paid dividends consistently since 1985. Dividends are currently distributed on a quarterly basis. As of the end of March, Shell's payout ratio is 48%, which is lower, and shows the company is investing in future growth.\nOf the 919 hedge funds tracked by Insider Monkey, 50 hedge funds reported owning stakes in Shell Plc (NYSE:SHEL). The most notable stake in Shell Plc (NYSE:SHEL) is owned by Fisher Asset Management, worth over $1.6 billion.\nShell Plc (NYSE:SHEL) ranks 6th in Insider Monkey’s list of the 9 Best Energy Dividend Stocks to Buy Now.\nIf you are looking for an AI stock that is as promising as Microsoft but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: Michael Burry Is Selling These Stocks and Opportunities in Uranium Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.", "Link": "Https://Finance.Yahoo.Com/News/Shell-Nyse-Shel-Top-Oil-124112018.Html", "Sentiment_Score": 0.0388083383, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-05-24T14:53:00.000Z", "Headline": "Shell (SHEL) Eyes Rising LNG Demand in Emerging Asian Economies", "Summary": "Shell plc SHEL, the British energy supermajor, believes that its supply of liquefied natural gas (LNG) from its terminals in Australia should support the increasing demand from the emerging market of Asia. Toward the end of the decade, the South and Southeast Asian markets are anticipated to absorb a part of the rising global LNG supplies. Shell believes that Vietnam, Bangladesh, the Philippines and Thailand will experience significant demand growth and be the focus markets in the future.\nIn the previous week, Asian spot LNG prices have risen manifold to reach the highest levels since January. The spur in prices can be attributed to extremely high temperatures and relentless heat in the region, increasing the demand for the “super-chilled” fuel. Moreover, the increased emphasis on decarbonization of the energy sector and a decline in domestic production in Asia should fuel the demand for LNG, Shell noted.\nIn Asia, LNG is expected to contribute significantly to the energy consumption mix in the upcoming years of the decade. A spokesperson from Shell described it as a latent demand, conveying that the demand for natural gas in South Asian markets is bullish, although it is not quite realized yet. An IEEFA article states that Shell had previously released a report, highlighting significant financing barriers in the LNG value chain despite expected demand growth. The increase in natural gas demand in South and Southeast Asia is driven by its use in power generation, but LNG-to-power projects are typically time-consuming due to complex negotiations and development processes.\nHowever, Shell’s strong commitment to the Australian market is due to its internal evaluation of demand prospects in Asia. The British energy major believes that although it is competitively positioned to serve the Asian market, maintaining its supply position is what matters. Shell has highlighted that its highly reliable assets in Australia can help it maintain a competitive position in the supply chain.\nIn Australia, Shell’s flagship floating LNG facility, Prelude, returned online following its statutory shutdown. Despite a staggering cost of $12 billion, the LNG facility has suffered from several outages since it began production in June 2019. However, Prelude returned with much higher reliability and improved performance levels. The energy giant stated that there are no statutory shutdowns in the coming year or two, for Prelude. As a result, production volumes in the current year are anticipated to be higher than the previous year. Shell does not have any statutory shutdowns planned until 2026, for the LNG facility.\nIn conclusion, Shell believes that its LNG portfolio in Australia is well-developed and capable of meeting the growing demand for gas in Asian markets.\nZacks Rank and Key Picks\nCurrently, SHEL carries a Zacks Rank #3 (Hold).\nSome better-ranked stocks in the energysector are Archrock Inc. AROC, Hess Midstream Partners LP HESM and Eni SpA E.Archrock presently sports a Zacks Rank #1 (Strong Buy), while Hess Midstream and Eni presently carry a Zacks Rank of #2(Buy) each. You can see the complete list of today’s Zacks #1 Rank stocks here.\nArchrock is an energy infrastructure company based in the United States, with a focus on midstream natural gas compression. It provides natural gas contract compression services and generates stable fee-based revenues.\nHess Midstream LP owns, operates, develops and acquires a wide range of midstream assets, providing services to Hess Corporation and other third-party customers. The partnership has a stable fee-based revenue model secured via long-term commercial contracts. Since Hess Midstream operates through 100% fee-based contracts, it is exposed to minimal commodity price risks.\nEni is a leading global integrated energy company with a prominent focus on liquefied natural gas businesses. As natural gas has a lesser carbon footprint compared with other fossil fuels, it is likely to play an important role in the global energy transition process. Eni’s participation in the natural gas market should allow it to capitalize on the mounting global demand in the future.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nEni SpA (E) : Free Stock Analysis Report\nArchrock, Inc. (AROC) : Free Stock Analysis Report\nHess Midstream Partners LP (HESM) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Shell-Shel-Eyes-Rising-Lng-145300658.Html", "Sentiment_Score": 0.892172873, "Sentiment_Category": "bullish"}, {"Ticker": "SHEL", "Time": "2024-05-22T08:54:52.000Z", "Headline": "Climate activists led a Shell shareholder rebellion over decarbonization targets, winning 19% of the vote. What difference will it make?", "Summary": "Shell faced a significant shareholder rebellion over its climate strategy, with 19% of shareholder votes backing a resolution calling for more urgent action—against the board’s guidance.\nWhy does it matter?\nThe shareholder resolution may not have passed at Shell’s AGM, but the extent of support for it speaks to the increased tendency of investors generally over recent years to exert pressure on companies to take bolder action against climate change.\nAs the negative long-term consequences of global warming become clearer, many larger institutional investors like pension funds are starting to think about how the decisions they take today could affect the value of their portfolios in 20, 30 or 40 years’ time. Shareholder engagement with polluters such as oil and gas companies is one way they can move the dial.\nThe context\nResolution 23, tabled at the AGM in London yesterday, asserted that Shell “does not sufficiently demonstrate” how it will meet the Paris Climate Agreement goal of limiting the rise in average global temperatures to 1.5C above pre-industrial levels.\nIt was co-filed by 27 institutional investors—including AXA Investment Managers and Amundi—which collectively have $4 trillion assets under management, and co-ordinated by climate activist investor Follow This, which has tabled similar votes before, both at Shell and at rivals including BP, Equinor and ExxonMobil.\nThe vote came after Shell, which insists its climate transition plan is Paris-aligned, recently dropped its 2035 target of reducing the emissions intensity from the use of its products (like driving a car) by 45%.\nThe board advised shareholders that voting in favor of the resolution would have a “material negative financial impact” on the company and its customers. It also called out the governance implications of the resolution, which it said would be binding.\nFollow This founder Mark van Baal disagreed. “Shell is throwing technicalities about governance to divert attention from the fact it is not Paris-aligned,” he wrote in an investor briefing.\nSome major investors, such as Norway’s $1.6 trillion wealth fund, stopped short of supporting the resolution, but asked the company to provide further guidance about how it will meet its own targets, in a sign that a ‘no’ vote wasn’t necessarily a ringing endorsement of the company’s climate strategy.\nWhat’s next?\nThe proportion of investors moving against the board’s recommendation in votes like these would need to be substantially higher to force a change in direction. In fact, in Shell’s case, 75% would need to support a special resolution for it to be binding.\nThe fact that support for Follow This’s resolution this year was slightly below the 20% mark it achieved in 2023 doesn’t suggest we’re anywhere near approaching that point. However, 19% is not a small level of dissent, and it is still substantially higher than the 2.7% Follow This achieved in its first attempt in 2016.\n“Their peers will follow one day,” van Baal said of the resolution’s backers.\nShareholder votes also don’t necessarily need to pass in order to influence what management does. Simply by signaling the level of investor concern about climate change, they can extract concessions. Under former CEO Bernard Looney, for example, BP adopted more ambitious climate targets, engaging with climate-focused shareholders to the point that, for a while, there was even talk of a joint shareholder resolution with Follow This in 2021.  \nThe proof will be in the pudding. In 2023, Shell announced that 23% of its capital investment spending in 2023 was in low carbon solutions, which includes EV charging, biofuels, renewables and hydrogen. It is still therefore investing enormous sums annually into oil and natural gas—and this should surprise no one.\nWhile Shell and other petrochemical companies are diversifying and reducing the emissions intensity of their products somewhat (between 2016 and 2023, there was 6.3% reduction, for example), none of them are proposing exiting their core business.\nVotes like Resolution 23 won’t change that, but they might impact the pace and extent to which oil companies change.\nWhat to watch out for\nFollow This and others will continue to file climate resolutions at AGMs, so keep an eye on whether investor support for them grows, plateaus or recedes.\nThe oil companies’ own targets can be quite telling too—will they get more ambitious or less in the near to medium term?—if you don’t mind reading through 400-page annual reports, footnotes and all.\nFor further reading, Fortune also covers Shell, BP, Total and the oil and gas industry more widely.\nThis story was originally featured on Fortune.com", "Link": "Https://Finance.Yahoo.Com/News/Climate-Activists-Led-Shell-Shareholder-085452240.Html", "Sentiment_Score": -0.3760518432, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-05-21T14:28:22.000Z", "Headline": "Fifth of Shell investors revolt against its climate strategy during tense AGM", "Summary": "More than a fifth of shareholder votes were cast against Shell’s climate strategy at a tense annual general meeting.\nThe board faced heated exchanges with investors and protesters throughout the three-hour event at the InterContinental O2 in London on Tuesday.\nA resolution to approve the current strategy saw 21.8% of shareholder votes going against management, Shell said.\nMeanwhile, nearly a fifth of the votes (18.6%) backed a resolution from Dutch activist group Follow This, which called on the board to align decarbonisation targets with the goals of the Paris Agreement.\nBut despite a record 27 institutional investors co-filing the resolution, the result came as a drop from 20.2% in 2023.\nThe AGM was the first since Shell scaled back several short-term and medium-term climate targets last year.\nThe oil major also dropped plans to reduce oil production by 1-2% each year for the rest of the decade, stating it had already reached that target after it sold off oil fields to others.\nThe changes came as part of new chief executive Wael Sawan’s strategy to focus on higher-margin projects and growth in the production of natural gas to increase shareholder payouts.\nAhead of the meeting, protesters erected large signs outside the building reading “Shell profits kill” and “Your greed is killing humanity”, as a protester made speeches through a megaphone.\nInside, chairman Sir Andrew Mackenzie’s opening remarks were immediately disrupted by protesters delivering a rendition of the song Jolene, singing “Shell Kills, shell kills, shell kills”.\nAs security staff carried protesters out of the meeting room, they chanted: “Who kills the climate? Shell kills the climate.”\nSir Andrew went on to defend the company’s stance on the climate, emphasising the goal to be net zero by 2050 and explaining how it believes the energy system will transition in the decades ahead.\nThe chairman argued Shell believes the world will need more liquefied natural gas (LNG) through the transition and that “oil will play a vital role for a long way to come”.\nHe added: “While it might be tempting to stop using oil and gas before the world is ready, we must not do so at the expense of the energy needs and aspirations of a growing global population.”\nAs the meeting moved on to shareholder questions, Mark van Baal, founder of Follow This, challenged the board about its environmental impact.\nHe said: “Dear shareholders, get a load of this. The world has pledged to halve emissions by 2030 and your company has no plans to further reduce emissions this decade.”\nHe asked the board: “Can you explain how Shell can be Paris-aligned without reducing emissions up to 2030, without using the word ‘believe’?”\nIn response, Mr Sawan argued Shell is “very much aligned with achieving a 2050 net zero outcome” and said the firm is using the most ambitious scenarios under the Intergovernmental Panel on Climate Change assessment report.\nProtesters held banners reading ‘Shell profits kill’ outside the oil giant’s AGM (Rebecca Speare-Cole/PA)\nThe chief executive then urged investors to vote against the resolution, arguing it is “bad for the environment”, “bad for our customers”, “bad for you as shareholders” and “bad for governance”.\nResponding to the 18.6% vote for the resolution after the meeting, Mr van Baal said: “Votes for this climate resolution show which investors are committed to Paris and which investors endorse Big Oil’s refusal to take meaningful climate action.”\nLater in the meeting, a woman addressed the board about Shell’s alleged human rights abuses and environmental destruction in the Niger Delta.\nAfter speaking for a few minutes, Sir Andrew said she had gone over her allotted two minutes and security staff swarmed the woman, asking her to leave.\nSir Andrew intervened, allowing her to continue but she grew tearful as she questioned why security had hassled her and who was going to clear up the pollution in the Niger Delta that has cost lives after Shell sells its majority stake in the local operator.\nA fellow shareholder confronted the board and highlighted that the one shareholder who was surrounded by security for speaking longer than two minutes was a young woman of colour.\n“(It) makes me, as a shareholder, very uncomfortable, and I hope that it makes the board feel uncomfortable and fellow shareholders,” she said.\nIn response, Sir Andrew said there are processes in place to ensure security, adding: “I’m sorry it didn’t occur in the right way.”\nA Shell spokesperson said: “We respect people’s right to express their point of view and welcome any constructive engagement on our strategy and the energy transition.\n“However, these protesters have shown that they are not interested in constructive engagement.\n“We agree that society needs to take action on climate change, and we firmly believe our climate targets are aligned with the more ambitious goal of the Paris Agreement on climate change.”\nFollowing the results, Mr Sawan said: “Shell’s shareholders have strongly backed our strategy to deliver more value with less emissions, as we transform to become a net-zero emissions energy business by 2050.\n“Our focus on performance, discipline and simplification enables us to invest in providing the energy the world needs today, and in helping to build the low-carbon energy system of the future.”", "Link": "Https://Finance.Yahoo.Com/News/Fifth-Shell-Investors-Revolt-Against-140751629.Html", "Sentiment_Score": -0.920653224, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-05-21T14:08:00.000Z", "Headline": "Result of AGM", "Summary": "SHELL PLC\nRESULT OF ANNUAL GENERAL MEETING\nShell plc announces the poll results on the resolutions at its Annual General Meeting held on Tuesday May 21, 2024 at the InterContinental London – The O2, 1 Waterview Drive, Greenwich Peninsula, London SE10 0TW. Resolutions 1-22 were carried and resolution 23 was not carried.\nIn accordance with the Listing Rules, a copy of all resolutions other than resolutions concerning ordinary business at the Annual General Meeting, will be submitted to the National Storage Mechanism and will be available for inspection at: https://data.fca.org.uk/#/nsm/nationalstoragemechanism\n  RESOLUTION\nVOTES\nFOR\n%\nVOTES\nAGAINST\n%\nVOTES\nTOTAL\n% of ISC VOTED\nVOTES\nWITHHELD\n1\nReceipt of Annual Report & Accounts\n4,009,732,721\n99.10\n36,482,712\n0.90\n4,046,215,433\n63.46%\n24,377,242\n2\nApproval of Directors’ Remuneration Report\n3,837,712,517\n94.83\n209,399,986\n5.17\n4,047,112,503\n63.47%\n23,487,236\n3\nReappointment of Dick Boer\n3,942,771,765\n97.41\n104,784,962\n2.59\n4,047,556,727\n63.48%\n22,984,294\n4\nReappointment of Neil Carson\n3,997,581,756\n98.77\n49,763,124\n1.23\n4,047,344,880\n63.47%\n23,190,477\n5\nReappointment of Ann Godbehere\n3,888,176,915\n96.06\n159,316,307\n3.94\n4,047,493,222\n63.48%\n23,046,493\n6\nReappointment of Sinead Gorman\n3,991,395,067\n98.61\n56,394,263\n1.39\n4,047,789,330\n63.48%\n22,747,157\n7\nReappointment of Jane Holl Lute\n3,997,349,786\n98.76\n50,170,807\n1.24\n4,047,520,593\n63.48%\n23,016,821\n8\nReappointment of Catherine Hughes\n3,853,419,013\n95.95\n162,591,533\n4.05\n4,016,010,546\n62.98%\n54,522,444\n9\nReappointment of Sir Andrew Mackenzie\n3,623,716,656\n90.16\n395,506,547\n9.84\n4,019,223,203\n63.03%\n51,311,361\n10\nReappointment of Sir Charles Roxburgh\n3,999,894,421\n98.83\n47,509,826\n1.17\n4,047,404,247\n63.48%\n23,133,424\n11\nReappointment of Wael Sawan\n3,965,223,304\n98.66\n54,053,413\n1.34\n4,019,276,717\n63.03%\n51,249,526\n12\nReappointment of Abraham (Bram) Schot\n3,978,062,767\n98.29\n69,181,183\n1.71\n4,047,243,950\n63.47%\n23,282,924\n13\nReappointment of Leena Srivastava\n3,998,196,209\n98.79\n49,114,863\n1.21\n4,047,311,072\n63.47%\n23,224,097\n14\nReappointment of Cyrus Taraporevala\n3,999,602,499\n98.83\n47,257,645\n1.17\n4,046,860,144\n63.47%\n23,670,224\n15\nReappointment of Auditors\n4,005,238,096\n99.02\n39,591,593\n0.98\n4,044,829,689\n63.43%\n25,721,016\n16\nRemuneration of Auditors\n4,035,800,899\n99.71\n11,770,670\n0.29\n4,047,571,569\n63.48%\n22,973,578\n17\nAuthority to allot shares\n3,959,020,201\n97.81\n88,490,958\n2.19\n4,047,511,159\n63.48%\n23,027,771\n18\nDisapplication of pre-emption rights*\n4,008,888,982\n99.24\n30,790,514\n0.76\n4,039,679,496\n63.35%\n30,899,014\n19\nAuthority to make on-market purchases of own shares*\n4,008,568,712\n99.05\n38,343,081\n0.95\n4,046,911,793\n63.47%\n23,629,957\n20\nAuthority to make off-market purchases of own shares*\n3,990,697,774\n98.62\n55,808,260\n1.38\n4,046,506,034\n63.46%\n24,037,019\n21\nAuthority for certain donations and expenditure\n3,996,889,885\n98.77\n49,679,442\n1.23\n4,046,569,327\n63.46%\n23,981,892\n22\nShell's Energy Transition Strategy 2024 resolution\n2,982,949,868\n78.03\n839,906,774\n21.97\n3,822,856,642\n59.95%\n247,686,231\n23\nShareholder resolution*\n735,224,835\n18.62\n3,213,314,502\n81.38\n3,948,539,337\n61.92%\n122,002,084\n* Special resolution\nPlease note that a ‘vote withheld’ is not a vote under English Law and is not counted in the calculation of the proportion of the votes ‘for’ and ‘against’ a resolution.\nShell Chief Executive Officer Wael Sawan said: “Shell’s shareholders have strongly backed our strategy to deliver more value with less emissions, as we transform to become a net-zero emissions energy business by 2050. Our focus on performance, discipline and simplification enables us to invest in providing the energy the world needs today, and in helping to build the low-carbon energy system of the future.”\nThe level of votes on Resolution 22 requires us to explain what actions we intend to take to consult shareholders in order to understand the reasons behind the result, and report back within six months. We will meet this obligation by continuing to engage with shareholders on why we believe our strategy keeps us on the right path.\nMay 21, 2024\nCaroline J.M. Omloo\nCompany Secretary\nShell plc\nENQUIRIES\nShell Media Relations\nInternational, UK, European Press: +44 20 7934 5550\nLEI number of Shell plc: 21380068P1DRHMJ8KU70\nClassification: Additional regulated information required to be disclosed under the laws of a Member State.\nCautionary Note\nThe companies in which Shell plc directly and indirectly owns investments are separate legal entities. In this announcement “Shell”, “Shell Group” and “Group” are sometimes used for convenience where references are made to Shell plc and its subsidiaries in general. Likewise, the words “we”, “us” and “our” are also used to refer to Shell plc and its subsidiaries in general or to those who work for them. These terms are also used where no useful purpose is served by identifying the particular entity or entities. ‘‘Subsidiaries’’, “Shell subsidiaries” and “Shell companies” as used in this announcement refer to entities over which Shell plc either directly or indirectly has control. The term “joint venture”, “joint operations”, “joint arrangements”, and “associates” may also be used to refer to a commercial arrangement in which Shell has a direct or indirect ownership interest with one or more parties. The term “Shell interest” is used for convenience to indicate the direct and/or indirect ownership interest held by Shell in an entity or unincorporated joint arrangement, after exclusion of all third-party interest.\nForward-Looking Statements\nThis announcement contains forward-looking statements (within the meaning of the U.S. Private Securities Litigation Reform Act of 1995) concerning the financial condition, results of operations and businesses of Shell. All statements other than statements of historical fact are, or may be deemed to be, forward-looking statements. Forward-looking statements are statements of future expectations that are based on management’s current expectations and assumptions and involve known and unknown risks and uncertainties that could cause actual results, performance or events to differ materially from those expressed or implied in these statements. Forward-looking statements include, among other things, statements concerning the potential exposure of Shell to market risks and statements expressing management’s expectations, beliefs, estimates, forecasts, projections and assumptions. These forward-looking statements are identified by their use of terms and phrases such as “aim”; “ambition”; “anticipate”; “believe”;“commit”; “commitment”; ”could”; “estimate”; “expect”; “goals”; “intend”; “may”; “milestones”; “objectives”; “outlook”; “plan”; “probably”; “project”; “risks”; “schedule”; “seek”; “should”; “target”; “will”; “would” and similar terms and phrases. There are a number of factors that could affect the future operations of Shell and could cause those results to differ materially from those expressed in the forward-looking statements included in this announcement, including (without limitation): (a) price fluctuations in crude oil and natural gas; (b) changes in demand for Shell’s products; (c) currency fluctuations; (d) drilling and production results; (e) reserves estimates; (f) loss of market share and industry competition; (g) environmental and physical risks; (h) risks associated with the identification of suitable potential acquisition properties and targets, and successful negotiation and completion of such transactions; (i) the risk of doing business in developing countries and countries subject to international sanctions; (j) legislative, judicial, fiscal and regulatory developments including regulatory measures addressing climate change; (k) economic and financial market conditions in various countries and regions; (l) political risks, including the risks of expropriation and renegotiation of the terms of contracts with governmental entities, delays or advancements in the approval of projects and delays in the reimbursement for shared costs; (m) risks associated with the impact of pandemics, such as the COVID-19 (coronavirus) outbreak, regional conflicts, such as the Russia-Ukraine war, and a significant cybersecurity breach; and (n) changes in trading conditions. No assurance is provided that future dividend payments will match or exceed previous dividend payments. All forward-looking statements contained in this announcement are expressly qualified in their entirety by the cautionary statements contained or referred to in this section. Readers should not place undue reliance on forward-looking statements. Additional risk factors that may affect future results are contained in Shell plc’s Form 20-F for the year ended December 31, 2023 (available at www.shell.com/investors/news-and-filings/sec-filings.html and www.sec.gov). These risk factors also expressly qualify all forward-looking statements contained in this announcement and should be considered by the reader. Each forward-looking statement speaks only as of the date of this announcement, May 21, 2024. Neither Shell plc nor any of its subsidiaries undertake any obligation to publicly update or revise any forward-looking statement as a result of new information, future events or other information. In light of these risks, results could differ materially from those stated, implied or inferred from the forward-looking statements contained in this announcement.\nShell’s Net Carbon Intensity\nAlso, in this announcement we may refer to Shell’s “Net Carbon Intensity” (NCI), which includes Shell’s carbon emissions from the production of our energy products, our suppliers’ carbon emissions in supplying energy for that production and our customers’ carbon emissions associated with their use of the energy products we sell. Shell’s NCI also includes the emissions associated with the production and use of energy products produced by others which Shell purchases for resale. Shell only controls its own emissions. The use of the terms Shell’s “Net Carbon Intensity” or NCI are for convenience only and not intended to suggest these emissions are those of Shell plc or its subsidiaries.\nShell’s net-zero emissions target\nShell’s operating plan, outlook and budgets are forecasted for a ten-year period and are updated every year. They reflect the current economic environment and what we can reasonably expect to see over the next ten years. Accordingly, they reflect our Scope 1, Scope 2 and NCI targets over the next ten years. However, Shell’s operating plans cannot reflect our 2050 net-zero emissions target, as this target is currently outside our planning period. In the future, as society moves towards net-zero emissions, we expect Shell’s operating plans to reflect this movement. However, if society is not net zero in 2050, as of today, there would be significant risk that Shell may not meet this target.\nForward Looking non-GAAP measures\nThis announcement may contain certain forward-looking non-GAAP measures such as cash capital expenditure and divestments. We are unable to provide a reconciliation of these forward-looking non-GAAP measures to the most comparable GAAP financial measures because certain information needed to reconcile those non-GAAP measures to the most comparable GAAP financial measures is dependent on future events some of which are outside the control of Shell, such as oil and gas prices, interest rates and exchange rates. Moreover, estimating such GAAP measures with the required precision necessary to provide a meaningful reconciliation is extremely difficult and could not be accomplished without unreasonable effort. Non-GAAP measures in respect of future periods which cannot be reconciled to the most comparable GAAP financial measure are calculated in a manner which is consistent with the accounting policies applied in Shell plc’s consolidated financial statements.\nThe contents of websites referred to in this announcement do not form part of this announcement.\nWe may have used certain terms, such as resources, in this announcement that the United States Securities and Exchange Commission (SEC) strictly prohibits us from including in our filings with the SEC. Investors are urged to consider closely the disclosure in our Form 20-F, File No 1-32575, available on the SEC website www.sec.gov.", "Link": "Https://Finance.Yahoo.Com/News/Result-Agm-140800606.Html", "Sentiment_Score": 0.0086898282, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-05-21T11:05:53.000Z", "Headline": "Climate protesters accuse Shell chairman of ‘greenwashing’ at AGM", "Summary": "Shell’s chairman was accused of greenwashing as he addressed shareholders at the oil giant’s annual general meeting (AGM).\nSir Andrew MacKenzie was interrupted by protesters as he opened the gathering at the InterContinental London – The O2 hotel on Tuesday.\nDozens of people stood up and began performing a rendition of the Dolly Parton song Jolene, singing “Shell kills, Shell kills, Shell kills, Shell kills”.\nAs security staff carried protesters out of the meeting room, they chanted: “Who kills the climate? Shell kills the climate.”\nFour people could be seen shouting and linking arms to make it harder for security to remove them.\nProtesters outside Shell’s AGM in London (Rebecca Speare-Cole/PA)\nBefore the meeting, a crowd of demonstrators gathered outside the hotel, erecting large signs reading: “Shell profits kill” and “Your greed is killing humanity” as a protester made speeches through a megaphone.\nSir Andrew began his opening remarks by defending the company’s stance on climate, emphasising the goal to be net zero by 2050 and how Shell believes the energy system will transition.\nIt comes after Shell scaled back its short-term and medium-term targets, weakening a 2030 carbon reduction target and ditching a plan to reduce oil production by 1%-2% each year for the rest of the decade.\nThe approach is part of new chief executive Wael Sawan’s strategy to focus on higher-margin projects, steady oil output, and growth in the production of natural gas to increase payouts to shareholders.\nSir Andrew told shareholders: “The speed and shape of change can be huge and people often over-estimate this in the short term but under-estimate what can change in the long term.\n“While it might be tempting to stop using oil and gas before the world is ready, we must not do so at the expense of the energy needs and aspirations of the global populations.”\nAs soon as his speech ended, a protester stood up and shouted: “That’s all greenwash.”\nThe AGM has been dominated by debates around Shell’s climate strategy as shareholders prepare to vote on two resolutions focused on its strategy.\nShell has put forward a management proposal requesting investors’ approval of the updated energy transition strategy, which features the less ambitious emissions reduction targets than its previous strategy.\nA record 27 institutional shareholders have co-filed a resolution, led by Dutch campaign group Follow This, asking for the company to align its Scope 3 emissions with the Paris Climate Agreement goals.\nLast year, the board faced a shareholder rebellion when 20% voted against it on both proposals.\nProxy advisory firms Glass Lewis and ISS have advised investors to vote against the shareholder resolution while Pirc has recommended they support it.\nCampaign group Reclaim Finance is also calling on shareholders to vote against Sir Andrew’s reappointment in protest at the climate strategy.\nA Shell spokesman said: “We respect people’s right to express their point of view and welcome any constructive engagement on our strategy and the energy transition. However, these protesters have shown that they are not interested in constructive engagement.\n“We agree that society needs to take action on climate change, and we firmly believe our climate targets are aligned with the more ambitious goal of the Paris Agreement on climate change.\n“In today’s meeting, you will have heard that Shell is wholly committed to becoming a net-zero emissions energy business by 2050, and taking clear action to be the investment case and partner of choice through the energy transition.”", "Link": "Https://Finance.Yahoo.Com/News/Climate-Protesters-Accuse-Shell-Chairman-110553579.Html", "Sentiment_Score": -0.8460649848, "Sentiment_Category": "bearish"}, {"Ticker": "SHEL", "Time": "2024-05-10T10:50:23.000Z", "Headline": "Passive Income Opportunity Alert: Shell Out Some Money for Shell Stock", "Summary": "If there’s one thing that Shell (NYSE:SHEL) likes to do, it’s return capital to the company’s loyal shareholders. They do this through buybacks and dividends. Every passive-income investor needs to take a look at Shell stock and take advantage of the undeniable buy-and-hold opportunity.\nI sincerely hope that my message reaches as many U.S. investors as possible. Since Shell is based in the United Kingdom, many American stock traders have little or no portfolio exposure to this energy giant. So, today is your lucky day, as you’ll get the need-to-know facts about Shell right now.\nSlow and Steady Wins the Race\nInvestors shouldn’t expect Shell to grow rapidly, as the company is already huge. Among global oil, gas and renewables businesses, Shell is one of the biggest and most famous. It’s a consistently profitable company that has been around for many years and has an expansive energy-market presence.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nTherefore, Shell’s growth should be taken into context and investors ought to be realistic. In 2024’s first quarter, Shell reported adjusted EBITDA of $18.711 billion, up 14.5% compared to $16.335 billion from the prior quarter. During that same time frame, Shell’s adjusted earnings improved 5.9% from $7.306 billion in Q4 2023 to $7.734 billion in Q1 2024.\nIt’s also encouraging to see Shell’s free cash flow increase from $6.9 billion to $9.8 billion, and the company’s net debt diminish from $43.5 billion to $40.5 billion. Clearly, the company is moving in the right direction from a financial standpoint.\nShell Shows Love to Its Shareholders\nHere’s where the passive-income opportunity comes into play. Shell knows how to return value to its shareholders, and one way to do this is by paying a generous dividend.\nOn that topic, Shell just declared an interim quarterly dividend of around 69 cents per American depositary share, which could be considered a common-stock share in the U.S. This is in line with Shell’s track record of growing its quarterly dividend distributions gradually over time.\nIf Shell’s 3.53% forward annual dividend yield isn’t enough to impress you, then check this out. The company also announced a $3.5 billion share-repurchase program. Shell explained, using fancy terminology, that the purpose is to reduce the circulating pool of shares.\nNaturally, a smaller pool of shares should make each existing stock share more valuable. It won’t be a dramatic effect, but more like an enhancement of Shell stock’s long-term value. This is something that respectful companies often do, so it’s another great reason to take a share position in Shell.\nShell Stock: Get Rich, but Do It Slowly\nIf wealthy people are of the get-rich-slow mindset, then you can apply this mindset by investing in Shell. And when the dividends come in, you can reinvest those distributions and leverage the compounding effect.\nJust as importantly, you’ll be invested in a business with firm fundamentals and steady growth. Today is the perfect day to start building your wealth for the long term with a buy-and-hold position in Shell stock.\nDavid Moadel has provided compelling content – and crossed the occasional line – on behalf of Motley Fool, Crush the Street, Market Realist, TalkMarkets, TipRanks, Benzinga, and (of course) InvestorPlace.com. He also serves as the chief analyst and market researcher for Portfolio Wealth Global and hosts the popular financial YouTube channel Looking at the Markets.\nMore From InvestorPlace\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\nIt doesn’t matter if you have $500 or $5 million. Do this now.\nThe post Passive Income Opportunity Alert: Shell Out Some Money for Shell Stock appeared first on InvestorPlace.", "Link": "Https://Finance.Yahoo.Com/News/Passive-Income-Opportunity-Alert-Shell-105023850.Html", "Sentiment_Score": 0.0680753961, "Sentiment_Category": "bullish"}, {"Ticker": "SHEL", "Time": "2024-05-09T16:56:00.000Z", "Headline": "Shell (SHEL) to Sell Off Its Singapore Refinery and Other Assets", "Summary": "Shell plc SHEL, a British energy giant, announced the sale of its refinery and petrochemical assets in Singapore to a joint venture company formed by Indonesia’s Chandra Asri and Glencore. The transaction is anticipated to close by the end of 2024, subject to regulatory approvals. However, the companies have not mentioned a value for the same.\nThe joint venture company CAPGC will own all of Shell’s interest in Shell Energy and Chemicals Park Singapore, following the close of the deal. CAPGC is operated by Chandra Asri who holds a majority stake in the company along with Glencore who holds a minority stake.\nThe assets being sold include a refinery with a processing capacity of 237,000 barrels per day (bpd) of oil and a 1-million-metric-ton-per-year (tpy) ethylene plant located on Bukom Island. In addition, SHEL’s assets also include mono-ethylene glycol producing plant on Jurong Island.\nThe sale can be linked to its plan to lower its overall carbon footprint while also focusing on its most profitable ventures.\nThe buyers of Shell’s assets in the Bukom and Jurong islands in Singapore will gain access to one of the world’s leading oil refining and trading centres. However, the buyers will have to encounter several challenges such as, competition from newer refineries, particularly those in China and other regions. The Bukom facility, is known to be quite old, having opened in 1961. Moreover, it needs to be noted that Singapore’s carbon tax is expected to increase significantly in 2024.\nBy acquiring SHEL’s assets in Singapore Chandra Asri will be able to access naphtha feedstock for its cracker. It will also enable integration of petrochemical production with refining, which is expected to improve its efficiency and contribute to cost reduction for Chandra Asri. Chandra Asri had been looking to expand its portfolio within and beyond Indonesia and the acquisition will position the company as a regional player in Southeast Asia.\nFor Glencore, acquiring the assets would give it a physical foothold for its trading operations in Asia. Currently, Glencore’s only refining asset is a 100,000-bpd facility in Cape Town along with a lubricants plant in Durban.\nA partnership between Glencore and Chandra Asri will allow the latter to leverage the trading giant's expertise in trading and in logistics, enhancing its capabilities in the region.\nZacks Rank and Key Picks\nCurrently, SHEL has a Zacks Rank #3 (Hold).\nSome better-ranked stocks in the energy sector are SM Energy SM, Hess Corporation HES and Eni SpA E. SM Energy and Hess presently sport a Zacks Rank #1 (Strong Buy) each, while Eni carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nSM Energy is an upstream energy firm operating in the prolific Midland Basin region and the South Texas region. For 2024, the company expects its production to increase from the prior-year reported figure, signaling a bright production outlook.\nHess is a leading upstream energy company, with its operations focused on the prolific resources offshore Guyana. The company has made significant oil discoveries in the Stabroek Block, off the coast of Guyana. These discoveries have totaled more than 11 billion barrels of oil equivalent in gross recoverable resources, adding to Hess’ production potential.\nEni is a leading global integrated energy company with a prominent focus on liquefied natural gas businesses. As natural gas has a lesser carbon footprint compared to other fossil fuel, it will play an important role in the global energy transition process. Eni’s participation in the natural gas market will allow it capitalize on the mounting global demand in the future.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nHess Corporation (HES) : Free Stock Analysis Report\nEni SpA (E) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Shell-Shel-Sell-Off-Singapore-165600769.Html", "Sentiment_Score": -0.0278761927, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-05-09T09:19:00.000Z", "Headline": "Shell and Total Talk of Moving to New York. It’s No Cure-All.", "Summary": "European energy companies are getting more serious about shifting their stocks to the U.S. in search of higher valuations.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/Ef444B5B-4196-31C5-Af3B-De96B2Fde96E/Shell-And-Total-Talk-Of.Html", "Sentiment_Score": 0.0093510933, "Sentiment_Category": "neutral"}, {"Ticker": "SHEL", "Time": "2024-05-08T15:45:00.000Z", "Headline": "Shell (SHEL) Exits China's Power Market, Focuses on Fossil Fuels", "Summary": "British oil and gas major Shell plc SHEL has pulled out of the China power markets, which includes power generation, trading and marketing businesses. The withdrawal is related to its strategic shift toward refocusing on its profitable businesses, including those associated with traditional fossil fuels, such as oil and natural gas. Apart from that, the withdrawal can also be linked with intense competition and challenges in achieving profitability within China's electricity retail market.\nManagement has stated that it is being selective when it comes to investing in power, emphasizing that its focus will be on delivering value from its power portfolio. However, this may, at times, require difficult decision making. Its decision to exit the China power markets has been effective since 2023-end. However, it will continue working with partners and customers to support China’s energy transition process.\nSHEL provided the first update of its energy transition strategy in March 2024, since the launch of its ‘Empower Progress’ business strategy in 2021. The update included lowering its carbon emission targets and refining the approach to electricity business development. The updated strategy prioritizes specific markets and segments, with an emphasis on increasing electricity sales to commercial customers while decreasing sales to retail customers.\nHowever, SHEL’s withdrawal from the power business does not include its electric vehicle charging business. The electric vehicle charging business remains a significant growth market for the company, per management.\nIt has implemented broader cost saving measures to save up to $3 billion in annual costs. It exited the retail power sector of Europe and divested several offshore wind and low-carbon projects. The British energy major is also in the talks to sell off its U.S. solar assets.\nSHEL’s refining and petrochemical complex in Singapore is put under review. In the light of cost savings, it has also implemented company-wide staff reductions, including in its low-carbon solutions division.\nShell is slowing down on its energy transition journey and refocusing its attention on the oil and natural gas businesses. In particular, management expects the demand for natural gas to rise in the upcoming decades and plans to concentrate on this segment.\nZacks Rank and Key Picks\nCurrently, SHEL has a Zacks Rank #3 (Hold).\nSome better-ranked stocks in the Energy sector are SM Energy SM, Hess Corporation HES and Eni SpA E. SM Energy and Hess presently sport a Zacks Rank #1 (Strong Buy) each, while Eni carries a Zacks Rank of 2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nSM Energy is an upstream energy firm operating in the prolific Midland Basin region and the South Texas region. For 2024, SM expects its production to increase from the prior-year reported figure, signaling a bright production outlook.\nHess is a leading upstream energy company, with its operations focused on the prolific resources offshore Guyana. HES has made significant oil discoveries in the Stabroek Block, off the coast of Guyana. These discoveries have totaled more than 11 billion barrels of oil equivalent in gross recoverable resources, adding to Hess’ production potential.\nEni is a leading global integrated energy company with a prominent focus on liquefied natural gas businesses. As natural gas has a lesser carbon footprint compared with other fossil fuel, it will play an important role in the global energy transition process. Eni’s participation in the natural gas market will allow it capitalize on the mounting global demand in the future.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nHess Corporation (HES) : Free Stock Analysis Report\nEni SpA (E) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Shell-Shel-Exits-Chinas-Power-154500093.Html", "Sentiment_Score": 0.0296477024, "Sentiment_Category": "neutral"}]}