{"timestamp": "20240719_143110", "data": [{"Ticker": "CVX", "Time": "2024-07-19T09:30:00.000Z", "Headline": "These Are the 2 Highest-Yielding Stocks in Warren Buffett's Berkshire Hathaway Equity Portfolio", "Summary": "One aspect of Warren Buffett's stock plays that often gets overlooked is the vast pile of dividend payouts they produce. Not every stock in the celebrated investor's Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) pays a dividend, and some do so at rather low yields, but there are several with quite generous payouts.\nWith that in mind, let's break out the magnifying glass to inspect the dividends of the No. 1 and No. 2 top yielders -- Kraft Heinz (NASDAQ: KHC) and Chevron (NYSE: CVX), respectively.\n1. Kraft Heinz\nIt's safe to say that \"high-yield dividend\" is not what leaps to mind when most investors think about the food industry. If comestibles businesses pay dividends at all, their yields are usually skimpy.\nThat sure isn't the case with Berkshire Hathaway equity portfolio yield champ Kraft Heinz. The company's $0.40-per-share quarterly disbursement currently pays out at an almost 5% clip.\nBut we need to be careful here. A high-yield dividend could mean a company is doing gangbusters business and harnessing a river of free cash flow to be generous to its shareholders. Conversely, it might indicate a stock's price has declined enough to boost an otherwise unremarkable payout into high-yield dividend territory.\nUnfortunately, Kraft Heinz tilts more into the second category.\nTrue, it has a brand portfolio stuffed with familiar names, such as Jell-O, Kool-Aid, and Oscar Mayer. But these products were hot in the distant past, when consumers weren't as worried about the apparently negative health effects of processed foods. These days, the trend favors fresh and healthy meals, snacks, and drinks, not packaged old standbys like hot dogs and flavored gelatin.\nKraft Heinz's financials reinforce the idea that this is a business of the past. Revenue hasn't risen to any meaningful degree since 2020, even though the company benefited somewhat from a nostalgic consumer move toward comfort foods during the COVID pandemic. On a brighter note, profitability has come up significantly of late. However, margins are still not high enough to make this operator a real standout.\nAnother positive development is that of free cash flow (FCF), since Kraft Heinz goods are well represented on grocery and convenience store shelves and the company moves a lot of product. For the full year 2023, that line item (which reflects cash flow after capital spending) for the company stood at nearly $3 billion, enough to cover the sub-$2 billion it paid out in dividends.\nHowever, to my thinking at least, a sustainable high-yield dividend isn't attractive in and of itself. I like to see at least some potential for notable revenue and profitability improvement to help push up the share price. I'm not sensing much of that for Kraft Heinz and, judging by its withered share price over the years, neither are many investors. This stock isn't a buy for me.\n2. Chevron\nChevron is a powerhouse company in an energy sector that's really hit its stride in the recent past. It is one of the top petroleum companies on the planet, and is busy reaping the benefits of the long-tail oil boom.\nInvestors expect energy extractors, refiners, and retailers to generously share their proceeds during the good times, and Chevron is obliging. That's why it's the Berkshire Hathaway equity portfolio runner-up yielder, with a payout that sits at about 4%.\nBuffett and his team are clearly believers in Big Oil, as the Chevron holding is fifth in terms of total market value within the portfolio. Not far behind is No. 6, which happens to be fellow oil incumbent Occidental Petroleum.\nBerkshire is being somewhat contrarian with these positions. After all, there's a global push for greener energy solutions, and consumers are clearly willing to spend money on environmentally friendly goods such as electric vehicles (EVs) and solar power.\nYet the petroleum industry is not only enduring but also continues to thrive. More products are made with petroleum than many realize -- it's not only about gasoline and other fuels. Meanwhile, a great many of the world's consumers are choosing to stick with classic petroleum-based solutions for a variety of reasons, such as habit, convenience, and ubiquity. Compare the density of gas stations in the U.S. with that of EV charging banks, for example.\nRelatively lower oil prices dinged Chevron's first-quarter results this year, but the company is still very much in the black. It earned more than $5.5 billion on revenue of nearly $49 billion in its first quarter. A look into the crystal ball reveals future growth, with full-year 2024 revenue anticipated to be 7% higher than the 2023 figure, and per-share net income inching up by 3%.\nIt's also worth noting that through boom and bust cycles, Chevron's management has consistently raised the company's payout. With its latest dividend raise earlier this year, the company has now increased the distribution 37 years in a row. Particularly given its recent success, there's little reason to stop anytime soon, so investors can count on getting increasing cash payouts as the years go by. To me, then, Chevron feels like a solid investment.\nShould you invest $1,000 in Kraft Heinz right now?\nBefore you buy stock in Kraft Heinz, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Kraft Heinz wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $722,993!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2024\nEric Volkman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway and Chevron. The Motley Fool recommends Kraft Heinz and Occidental Petroleum. The Motley Fool has a disclosure policy.\nThese Are the 2 Highest-Yielding Stocks in Warren Buffett's Berkshire Hathaway Equity Portfolio was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/2-Highest-Yielding-Stocks-Warren-093000573.Html", "Sentiment_Score": 0.0465264842, "Sentiment_Category": "neutral"}, {"Ticker": "CVX", "Time": "2024-07-19T08:06:00.000Z", "Headline": "75% of Warren Buffett's $416 Billion Portfolio Is Invested in 5 Unstoppable Stocks", "Summary": "When it comes to billionaire money managers, Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) CEO Warren Buffett is on a pedestal of his very own.\nSince taking the reins at Berkshire Hathaway in the mid-1960s, the affably dubbed \"Oracle of Omaha\" has overseen an aggregate return in his company's Class A shares (BRK.A) of a scorching-hot 5,422,618%, as of the closing bell on July 17. On an annualized total return basis covering nearly six decades, he's practically doubled up the benchmark S&P 500, including dividends paid.\nBuffett's secret to success is really no secret at all. He's plainly stated on multiple occasions that he seeks out time-tested businesses that have well-defined competitive advantages and strong management teams.\nBerkshire Hathaway CEO Warren Buffett. Image source: The Motley Fool.\nHowever, nowhere near enough credit for Berkshire Hathaway's long-term success is given to Buffett's penchant for portfolio concentration. Even though he and his top investment aides, Ted Weschler and Todd Combs, are currently overseeing a 44-stock, $416 billion investment portfolio at Berkshire, they all strongly believe in putting an outsized amount of capital to work in their best ideas.\nThe following five unstoppable stocks, which account for 75% of Berkshire Hathaway's invested assets ($309.9 billion), are truly Buffett's best ideas (market values are as of the closing bell on July 17).\n1. Apple: $180,670,650,836 (43.4% of invested assets)\nAny doubts about Warren Buffett's preference to concentrate his company's invested assets into a few premier businesses are tossed aside by Berkshire's stake in tech stock Apple (NASDAQ: AAPL). Even following two consecutive quarters where Buffett and his crew lightened their load on Apple, this top holding still accounts for more than 43% of Berkshire's investment portfolio.\nThe driving force for Apple as an investment has long been its innovative capacity. For instance, Apple has accounted for 50% or more of domestic smartphone market share since introducing a 5G-capable iPhone in the latter half of 2020.\nBut there's more to the largest publicly traded company than just physical product innovation. CEO Tim Cook is currently overseeing the evolution of his company to a platform-focused operating model. Though Apple has no intention of phasing out the physical products (iPhone, Mac, iPad, and Apple Watch) that endeared its brand to consumers, it's placing greater emphasis on higher-margin subscriptions designed to enhance customer loyalty and minimize the sales fluctuations that typically accompany iPhone upgrade cycles.\nI'd be remiss if I didn't also mention Apple's market-leading capital-return program. The world's largest publicly traded company by market value has repurchased $674 billion of its common stock since initiating a buyback program in 2013. Buffett is a huge fan of share repurchases.\n2. Bank of America: $45,424,831,224 (10.9% of invested assets)\nThe second-largest position in the Oracle of Omaha's $416 billion investment portfolio at Berkshire is none other than money-center goliath Bank of America (NYSE: BAC), which is commonly known as \"BofA.\". Buffett and his team oversee more than 1.03 billion shares of BofA stock, equating to a 13.2% stake in the company.\nThere's not a sector Warren Buffett enjoys putting his company's capital to work in more than financials. But his favoritism for BofA might have everything to do with its interest rate sensitivity. The Federal Reserve's most-aggressive rate-hiking cycle since the early 1980s has added billions of dollars in net-interest income to Bank of America's bottom line.\nBut did you know that Bank of America has also made significant strides with its digitization efforts? Through the midpoint of 2024, 77% of consumer households were banking digitally, while 53% of all consumer loan sales were completed online or via mobile app. This is up nine percentage points from the comparable period three years ago. Digital transactions are considerably cheaper for banks than in-person interactions, which should improve BofA's operating efficiency over time.\nLastly, Bank of America's board approved a $0.02-per-share increase to the company's quarterly dividend following the latest round of Fed stress tests. This hike increases Berkshire's annual dividend income from its stake in BofA to more than $1 billion!\nImage source: American Express.\n3. American Express: $37,896,610,572 (9.1% of invested assets)\nHave I mentioned that Warren Buffett is a big fan of financial stocks? If not, credit-services provider American Express (NYSE: AXP) occupying the third spot in Berkshire's portfolio should drive this point home. AmEx, as American Express is referred to in shorthand, has been a continuous holding by Buffett's company since 1991.\nWhat's made AmEx such a long-term winner has been its ability to benefit from both sides of the transaction aisle. For instance, it's the No. 3 payment processor by credit card network purchase volume in the U.S. But it's also a lender, as evidenced by the American Express credit cards consumers and businesses use to facilitate transactions. AmEx is able to generate fees from merchants for processing transactions, as well as annual fees and interest income from its cardholders.\nAdditionally, American Express has always been particularly good at attracting high earners as cardholders. The well-to-do are less likely than the average working American to alter their buying habits or fail to pay their bills during minor economic disruptions. On paper, AmEx is in better position to navigate periods of economic turbulence than its peers.\nSince Berkshire's cost basis for its stake in AmEx is only $8.49 per share, Buffett is overseeing a 33% annual yield, relative to cost, on this position.\n4. Coca-Cola: $26,084,000,000 (6.3% of invested assets)\nIf you thought American Express was a longtime holding of Warren Buffett, let me introduce you to beverage behemoth Coca-Cola (NYSE: KO), which has been a pillar for the Oracle of Omaha since 1988!\nBranding is a key reason Coca-Cola has been such a steady performer for decades. According to the annually released \"Brand Footprint\" report from Kantar, Coca-Cola has been the most-chosen brand from retail shelves by consumers for 12 consecutive years. Selling a product (beverages) that's considered a basic necessity leads to consistent and predictable operating cash flow year after year.\nIt also doesn't hurt that Coca-Cola offers almost unparalleled geographic diversity. With the exception of North Korea, Cuba, and Russia (the latter has to do with its invasion of Ukraine), Coke has ongoing operations in all other countries. This allows it to take advantage of organic growth opportunities in emerging markets, while generating predictable cash flow in developed countries.\nCoca-Cola's dividend is an undeniable lure, as well. Berkshire's cost basis for its 400,000,000-share stake in Coca-Cola is only $3.2475 per share, which means Coke's base annual payout of $1.94 translates into a 60% yield on cost for Buffett's company.\n5. Chevron: $19,828,098,775 (4.8% of invested assets)\nBuffett's fifth-largest holding, which collectively with Apple, Bank of America, American Express, and Coca-Cola accounts for 75% of Berkshire Hathaway's $416 billion of invested assets, is energy titan Chevron (NYSE: CVX).\nThroughout the first two decades of this century, energy stocks played a minimal role in Berkshire's portfolio. But since this decade began, Buffett has shown a clear liking to Chevron, as well as Occidental Petroleum.\nHaving nearly $20 billion devoted to Chevron is a crystal-clear indication that Berkshire's brightest minds expect the spot price for crude oil to remain elevated. Roughly three years of reduced capital expenditures by global energy companies (including Chevron) during the COVID-19 pandemic has led to tight worldwide supply of this key commodity. As long as crude oil supply remains constrained, there's a good chance we'll see its spot price hold above its historic average.\nChevron is also an integrated operator, which helps to protect its operating cash flow in pretty much any economic climate. Although it generates its beefiest margins from its upstream drilling segment, a declining spot price for crude lowers input costs for Chevron's refineries and chemical plants.\nThe final piece of the puzzle is Chevron's phenomenal capital-return program. The company's board approved a $75 billion share repurchase program in January 2023, and has green-lit 37 consecutive years of dividend increases.\nShould you invest $1,000 in Apple right now?\nBefore you buy stock in Apple, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $722,993!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. American Express is an advertising partner of The Ascent, a Motley Fool company. Sean Williams has positions in Bank of America. The Motley Fool has positions in and recommends Apple, Bank of America, Berkshire Hathaway, and Chevron. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\n75% of Warren Buffett's $416 Billion Portfolio Is Invested in 5 Unstoppable Stocks was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/75-Warren-Buffetts-416-Billion-080600352.Html", "Sentiment_Score": 0.0586720258, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-18T21:45:19.000Z", "Headline": "Chevron (CVX) Ascends While Market Falls: Some Facts to Note", "Summary": "Chevron (CVX) closed the latest trading day at $161.97, indicating a +0.46% change from the previous session's end. This change outpaced the S&P 500's 0.78% loss on the day. Meanwhile, the Dow lost 1.29%, and the Nasdaq, a tech-heavy index, lost 0.7%.\nPrior to today's trading, shares of the oil company had gained 5.15% over the past month. This has outpaced the Oils-Energy sector's loss of 7.83% and the S&P 500's gain of 2.14% in that time.\nAnalysts and investors alike will be keeping a close eye on the performance of Chevron in its upcoming earnings disclosure. The company's earnings report is set to go public on August 2, 2024. The company is forecasted to report an EPS of $3.16, showcasing a 2.6% upward movement from the corresponding quarter of the prior year. Alongside, our most recent consensus estimate is anticipating revenue of $51.6 billion, indicating a 5.52% upward movement from the same quarter last year.\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $12.90 per share and revenue of $205.6 billion, which would represent changes of -1.75% and +2.31%, respectively, from the prior year.\nInvestors should also note any recent changes to analyst estimates for Chevron. These latest adjustments often mirror the shifting dynamics of short-term business patterns. Hence, positive alterations in estimates signify analyst optimism regarding the company's business and profitability.\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. To capitalize on this, we've crafted the Zacks Rank, a unique model that incorporates these estimate changes and offers a practical rating system.\nThe Zacks Rank system, stretching from #1 (Strong Buy) to #5 (Strong Sell), has a noteworthy track record of outperforming, validated by third-party audits, with stocks rated #1 producing an average annual return of +25% since the year 1988. Over the past month, there's been a 4.19% fall in the Zacks Consensus EPS estimate. Chevron is currently sporting a Zacks Rank of #3 (Hold).\nDigging into valuation, Chevron currently has a Forward P/E ratio of 12.5. This valuation marks a premium compared to its industry's average Forward P/E of 7.83.\nWe can also see that CVX currently has a PEG ratio of 2.5. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Oil and Gas - Integrated - International was holding an average PEG ratio of 1.67 at yesterday's closing price.\nThe Oil and Gas - Integrated - International industry is part of the Oils-Energy sector. This industry currently has a Zacks Industry Rank of 96, which puts it in the top 39% of all 250+ industries.\nThe Zacks Industry Rank evaluates the power of our distinct industry groups by determining the average Zacks Rank of the individual stocks forming the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nYou can find more information on all of these metrics, and much more, on Zacks.com.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Chevron-Cvx-Ascends-While-Market-214519778.Html", "Sentiment_Score": -0.0138206817, "Sentiment_Category": "neutral"}, {"Ticker": "CVX", "Time": "2024-07-18T16:57:57.000Z", "Headline": "QatarEnergy to acquire stake in block offshore Suriname from Chevron", "Summary": "QatarEnergy has entered into a deal with US energy giant Chevron to purchase a 20% stake in a production sharing contract for the Suriname block.\nThe financial terms of the transaction were not disclosed.\nThe agreement pertains to block 5, located offshore Suriname, with water depths ranging from around 30–45m.\nUnder the agreement, Chevron, as the operator, will maintain a 40% stake, while Paradise Oil Company, a subsidiary of Suriname’s national oil company, Staatsolie, will hold the remaining 40% interest.\nCurrently, the licence is advancing into its second exploration phase, which includes a commitment to drill an exploration well.\nAt present, Suriname's oil production is concentrated exclusively onshore, but significant deepwater discoveries have been made in its offshore waters since 2019.\nThe country is projected to achieve its initial substantial offshore oil production in approximately four years, according to Reuters.\nQatarEnergy president and CEO Saad Sherida Al-Kaabi said: “This agreement highlights our continued commitment to exploring the promising basins of Suriname and marks an exciting new partnership with Chevron in the international upstream sector.\n“We are pleased to conclude this acquisition with our partners and look forward to working with them in block 5, offshore Suriname. I would like to take this opportunity to thank the authorities of the Republic of Suriname, and our partner Chevron for their support in reaching this agreement.”\nLate last year, Shell, TotalEnergies, QatarEnergy and Petronas entered into production-sharing agreements with Staatsolie for offshore blocks 63, 64 and 65.\nRecently, TotalEnergies said it hopes to reach a final investment decision for Suriname's block 58 by the fourth quarter of this year.\nThe block 58 project, anticipated to cost around $9bn (€8.25bn), is scheduled to commence production in 2028.\nSource:\nhttps://www.qatarenergy.qa/en/MediaCenter/Pages/newsdetails.aspx?ItemId=3822\n\"QatarEnergy to acquire stake in block offshore Suriname from Chevron \" was originally created and published by Offshore Technology, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/Qatarenergy-Acquire-Stake-Block-Offshore-165757932.Html", "Sentiment_Score": 0.0627858341, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-18T12:30:45.000Z", "Headline": "Is It Time To Buy ExxonMobil Stock As Is It Climbs Back?", "Summary": "ExxonMobil stock is climbing back in a base along with the rise in oil prices. The stock reclaimed a moving average. Is now the time to buy XOM?\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/3E6D9252-75F2-351D-9Ad2-96Aa58C48Afa/Is-It-Time-To-Buy-Exxonmobil.Html", "Sentiment_Score": 0.0437665023, "Sentiment_Category": "neutral"}, {"Ticker": "CVX", "Time": "2024-07-18T12:00:34.000Z", "Headline": "The 3.9% return this week takes Chevron's (NYSE:CVX) shareholders three-year gains to 82%", "Summary": "By buying an index fund, investors can approximate the average market return. But many of us dare to dream of bigger returns, and build a portfolio ourselves. For example, the Chevron Corporation (NYSE:CVX) share price is up 62% in the last three years, clearly besting the market return of around 17% (not including dividends). However, more recent returns haven't been as impressive as that, with the stock returning just 8.6% in the last year, including dividends.\nThe past week has proven to be lucrative for Chevron investors, so let's see if fundamentals drove the company's three-year performance.\nCheck out our latest analysis for Chevron\nThere is no denying that markets are sometimes efficient, but prices do not always reflect underlying business performance. By comparing earnings per share (EPS) and share price changes over time, we can get a feel for how investor attitudes to a company have morphed over time.\nDuring three years of share price growth, Chevron moved from a loss to profitability. So we would expect a higher share price over the period.\nThe graphic below depicts how EPS has changed over time (unveil the exact values by clicking on the image).\nearnings-per-share-growth\nWe know that Chevron has improved its bottom line over the last three years, but what does the future have in store? You can see how its balance sheet has strengthened (or weakened) over time in this free interactive graphic.\nWhat About Dividends?\nAs well as measuring the share price return, investors should also consider the total shareholder return (TSR). The TSR is a return calculation that accounts for the value of cash dividends (assuming that any dividend received was reinvested) and the calculated value of any discounted capital raisings and spin-offs. So for companies that pay a generous dividend, the TSR is often a lot higher than the share price return. In the case of Chevron, it has a TSR of 82% for the last 3 years. That exceeds its share price return that we previously mentioned. The dividends paid by the company have thusly boosted the total shareholder return.\nA Different Perspective\nChevron shareholders gained a total return of 8.6% during the year. But that was short of the market average. It's probably a good sign that the company has an even better long term track record, having provided shareholders with an annual TSR of 10% over five years. Maybe the share price is just taking a breather while the business executes on its growth strategy. I find it very interesting to look at share price over the long term as a proxy for business performance. But to truly gain insight, we need to consider other information, too. For instance, we've identified 2 warning signs for Chevron that you should be aware of.\nIf you are like me, then you will not want to miss this free list of undervalued small caps that insiders are buying.\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com", "Link": "Https://Finance.Yahoo.Com/News/3-9-Return-Week-Takes-120034906.Html", "Sentiment_Score": 0.9174333811, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-18T11:50:19.000Z", "Headline": "Is Chevron Corp (NYSE:CVX) the Best Energy Infrastructure Stock to Buy Now?", "Summary": "We recently published a list of 9 Best AI Energy Infrastructure Stocks to Buy Now. Since Chevron Corp (NYSE:CVX) ranks 3rd on the list, it deserves a deeper look.\nRob Thummel, senior portfolio manager at Tortoise Capital Advisors, while talking to CNBC in a latest program, said that he sees a big opportunity for AI in the energy industry. Thummel said that while everybody keeps talking about technology infrastructure when it comes to AI, they “forget” about energy infrastructure.\nThummel said that AI will create electricity demand that will in turn fuel the need for natural gas.\n“There is no AI without EI (energy infrastructure) because you need this critical infrastructure to provide the fuel to keep their lights on and electricity flowing 24 hours a day.”\nTalking about energy stocks, Thummel said a lot of them are “pretty simple stories” as they generate a lot of cash flows and return a significant portion of it back to shareholders.\nAsked about the cyclical nature of the industry, Thummel said that global energy demand is currently at its peak and has grown for 38 years over the last four decades. The analyst said the demand for energy increases every year across the world. Thummel said the US has become the largest energy exporter and he does not see that changing for a long time.\nThummel also shared some of his top picks in the energy sector. For this article we scanned his portfolio and chose his top AI energy infrastructure picks. With each stock we have mentioned the total number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nIs Chevron Corp (NYSE:CVX) Best AI Energy Infrastructure Stock to Buy Now?\nKen Wolter / Shutterstock.com\nChevron Corp (NYSE:CVX)\nNumber of Hedge Fund Investors: 62\nChevron Corp (NYSE:CVX) is one of the top energy stocks in Tortoise Capital Advisors portfolio.\nChevron stands to benefit from an expected surge in natural gas demand amid the rise of data centers.\nTalking to CNBC in May, Chevron Corp (NYSE:CVX) CEO Mike Wirth said that natural gas demand was expected to surpass expectations as electricity consumption surges from artificial intelligence and data centers.\n“It’s a little hard to quantify right now because this is evolving so quickly on the AI side. But I think demand for natural gas is likely to be higher than what people have been estimating up until now.”\nWith 37 years of consistent dividend increases, oil giant Chevron Corporation (NYSE:CVX) is one of the best dividend growth stocks to buy according to hedge funds. Chevron Corporation (NYSE:CVX) has been paying dividends without a break since 1984. Its annual dividend growth rate over the past three years is 5.40%. Chevron Corporation (NYSE:CVX)’s payout ratio is about 56%, which is higher than the industry mean of 45%, but given the company’s huge cash flows and strong fundamentals, dividend safety isn’t a major concern for Chevron Corporation (NYSE:CVX) investors.\nChevron Corp’s (NYSE:CVX) management has pledged fiscal discipline and caution amid massive swings in oil and commodity prices. Analysts believe Chevron Corp (NYSE:CVX) remains well-positioned in the Permian Basin and DJ Basin, with strong production numbers posted in the first quarter. In April, Chevron Corp’s (NYSE:CVX) management said it expects $80/BBL Brent in 2024 and guided for a 4% to 7% increase in total production in the year. Analysts believe this guidance was conservative as continued supply cuts from oil producers would support oil prices.\nAnalysts also believe now that Hess shareholders have approved Chevron Corp’s (NYSE:CVX) $53 billion acquisition of the company, the deal could go through and help Chevron expand and achieve its goals in Guyana.\nChevron Corp (NYSE:CVX) is expected to see earnings growth of 10.57% in 2025, much higher than Exxon’s 6.72% earnings growth. Given all these growth catalysts, strong fiscal position and dividends, the stock is undervalued, at a forward P/E ratio of 13.89.\nCarillon Eagle Growth & Income Fund stated the following regarding Chevron Corporation (NYSE:CVX) in its fourth quarter 2023 investor letter:\n“Chevron Corporation (NYSE:CVX) traded lower, along with oil prices, and issued a disappointing earnings announcement due to overseas refining losses. Separately, the company announced an agreement to buy another energy company with operations offshore of Guyana, as well as in North Dakota, the Gulf of Mexico, and the Gulf of Thailand. This is a strategic acquisition for very little takeout premium.”\nOverall, Chevron Corp (NYSE:CVX) ranks 3rd on Insider Monkey’s list titled 9 Best AI Energy Infrastructure Stocks to Buy Now. While we acknowledge the potential of Chevron Corp (NYSE:CVX), our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than CVX but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.", "Link": "Https://Finance.Yahoo.Com/News/Chevron-Corp-Nyse-Cvx-Best-115019556.Html", "Sentiment_Score": 0.1002019942, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-18T10:02:48.000Z", "Headline": "Analysis-Exxon clash with Chevron hinges on change of control of Hess' Guyana asset, sources say", "Summary": "By Sabrina Valle\nHOUSTON (Reuters) - Exxon Mobil's legal bid to stop Chevron's proposed $53 billion acquisition of Hess rests on whether the transaction would involve a change of control of Hess' prize subsidiary in Guyana, according to people knowledgeable about the argument.\nThe two top U.S. oil producers are in an arbitration battle over the world's largest oil discovery in almost two decades, in offshore Guyana. Exxon, which operates all output in the South American country with a 45% stake in a lucrative consortium, has challenged the merger in which Chevron would gain control of Hess and its 30% stake, a deal that would define Chevron's future.\nExxon asserts that Hess should have first given it the opportunity to purchase its stake in the Guyana asset.\nExxon's position is that the right of first refusal is triggered by a change of control in Guyana and that Chevron structured the deal in a way to bypass it, people familiar with the arguments, which are confidential, said.\nChevron and Hess say the acquisition is structured in a way that would keep Hess intact, with no change of control of its asset in Guyana, since Hess would become a unit within Chevron.\nChevron and Hess believe the argument has no merit because Hess would survive under a new Chevron and continue to own the asset, people close to their thinking said.\n\"The crux here is whether a change of control even occurred,\" agreed oil and M&A expert James English at law firm Clark Hill Law.\nThe three-person arbitration panel which will make the call must decide in part whether to focus on the language in the contract or to delve into Chevron's intent.\n\"A plain language approach would be very favorable to Chevron, while if you go with the intent, Exxon may have a case,\" English said.\nA discussion around intent also would unfold the dispute into new stages that could require discovery, interrogations and hiring independent valuation experts, pushing a resolution into next year, as Exxon has warned.\nChevron believes the discussion on how to interpret the words in the contract will be \"very straightforward,\" a person aware of the company's legal strategy said. Chevron and Hess said they are seeking a hearing in the third quarter, hoping for an outcome in the fourth and to close the deal shortly thereafter.\nThe case is unique as Guyana represents between 60-80% of the $53 billion Chevron offered for Hess, English and other experts have estimated.\nAn Exxon arbitration win would not be the end of the dispute. While Exxon has ruled out buying Hess outright, it has left the door open to bid for its 30% stake in Guyana, to bid for just a piece of it, to get a compensation from Chevron, or to just leave things as they are.\nIts final strategy will depend on what is so far a closely guarded secret by Chevron and Hess: how much their merger values Hess' Guyana stake.\nOIL RICHES\nGuyana will produce 1.9 million barrels of oil equivalent per day (boepd) in the next decade, more than twice the output of OPEC-member Venezuela and nearly as much as the Gulf of Mexico, Rystad Energy consultancy firm projects.\nChevron originally hoped to close the Hess acquisition by the first half of this year, but was taken by surprise in March when Exxon sought arbitration over the right of first refusal.\n\"Job number one is to get past the first hurdle, which is an alignment that a preemption rights exist in the contract,\" Exxon CEO Darren Woods told Reuters in March.\nThe arbitration panel will analyze a confidential joint operation agreement (JOA) between Exxon, Hess and a third partner, CNOOC, that rules the Guyana operations, known as the Stabroek oil block.\nExxon wrote the JOA in 2008 with a previous partner, before any oil discoveries, based on a 2002 model contract by the Association of International Energy Negotiators (AIEN), two of the people said.\nThe model says, for instance, that any \"direct or indirect\" change in control would constitute a change in control but is not entirely clear on what indirect means.\nThe model language, however, has been adjusted. Exxon, Chevron and Hess declined to disclose the final language of the contract.\nThe model was updated in 2023 to make it explicit that there is change of control if the ultimate parent company changes.\n\"We wrote the JOA, so we have a pretty clear line of sightness (sic) to the intent and the circumstances that apply,\" Woods said in April after reporting first quarter earnings. \"That is the point of the arbitration.\"\nThe person aware of Chevron's strategy said that there is no real precedent for Exxon's change of control arguments in decades of industry mergers and acquisitions governed by similar JOAs.\n\"We disagree with Exxon Mobil’s interpretation of the agreement and are confident that our position will prevail in arbitration,” Hess said.\n(Reporting by Sabrina Valle; Editing by Marguerita Choy)", "Link": "Https://Finance.Yahoo.Com/News/Analysis-Exxon-Clash-Chevron-Hinges-100248306.Html", "Sentiment_Score": -0.5703008175, "Sentiment_Category": "bearish"}, {"Ticker": "CVX", "Time": "2024-07-18T07:55:00.000Z", "Headline": "Forget Icahn Enterprises: 2 Energy Stocks to Buy Instead", "Summary": "Icahn Enterprises (NASDAQ: IEP) is a unique conglomerate, but it gets categorized in the energy sector because over 75% of its revenue is derived from its controlling stake in CVR Energy. Add in its dividend, which at current share prices yields a massive 23%, and it's easy to see why income investors looking for exposure to the energy sector might be interested in Icahn Enterprises.\nHowever, either Chevron (NYSE: CVX) or Enterprise Products Partners (NYSE: EPD) would be a better choice to buy. Here's why.\nWhat is Icahn Enterprises?\nWhile it is true that Icahn Enterprises derives a huge percentage of its revenue from the energy sector, it is not an energy company. It is the investment vehicle of famous Wall Street investor Carl Icahn. The company also owns businesses that operate in the real estate, auto, healthcare, home furnishing, and packaging sectors. And, on top of that, it owns a small portfolio of stocks.\nImage source: Getty Images.\nIn many ways, Icahn Enterprises is like Warren Buffett's Berkshire Hathaway, just on a much smaller scale. The big difference isn't size, however. Buffett is focused on buying and holding good companies while Icahn is an activist investor. Basically, Icahn specifically looks for companies where as a stakeholder, he can agitate for change, either because the companies are troubled or they have hidden value that he believes he can guide them to unlock.\nIn this way, Icahn Enterprises is actually a fairly aggressive investment choice and the stock's performance has been very volatile. Notably, the share price has been heading mostly lower for about a decade. A short seller's report on the company resulted in a massive stock price decline over the past year.\nThat 23% dividend yield, meanwhile, may look attractive, but it isn't actually one that investors should count on. First off, Carl Icahn owns 86% of Icahn Enterprises and is currently taking some of the distributions to which he is entitled in units rather than in cash. This makes it possible for the company to pay out more in cash to other investors, which one could easily argue artificially boosts the dividend yield. Also, the company's ability to pay dividends is directly tied to its investment success, which will wax and wane over time.\nIf you are looking for an energy investment that pays a steady dividend, Icahn Enterprises really isn't what you are looking for.\nBuy Chevron instead for oil exposure\nAmong oil and natural gas companies, globally diversified integrated energy giant Chevron would be a better pick. Chevron's current dividend yield is only 4.1%, but it has increased its payout annually for over 30 years. By contrast, Icahn Enterprises cut its payout in half in 2023 after the short seller report came to light (the huge yield still exists because the stock price fell dramatically, as well).\nChevron's business spans from the upstream (production) through the midstream (pipelines) and to the downstream (refining and chemicals). Energy is basically all it does, but its diversification within the oil and natural gas space helps to soften the peaks and valleys in the inherently volatile sector. On top of that, Chevron has one of the strongest balance sheets among its close peers. That gives it the leeway to take on leverage to help it manage through industry weak patches while continuing to pay dividends and invest in its business.\nBuy Enterprise Products Partners for yield instead\nIf what you are trying to find is an energy investment with a high yield, then master limited partnership (MLP) Enterprise Products Partners will be more your speed. The distribution yield is a hefty 7%. The yield is backed by a distribution that has been increased annually for a quarter of a century and an investment-grade-rated balance sheet. Enterprise's distributable cash flow also covers the distribution by a strong 1.7 times. A lot would have to go wrong before this MLP considered cutting its distribution.\nEnterprise Products Partners is one of the largest midstream companies in North America, with an energy infrastructure portfolio that would be difficult, if not impossible, to reproduce. The vast majority of its revenue comes from fees collected for the use of its assets, so the prices of the commodities flowing through its system aren't nearly as important to its performance as a general demand for energy (which tends to remain high throughout the cycle). It is a reliable tortoise. To be fair, its stock growth has been minimal, so its distributions are going to provide the majority of investors' return here. But if you are an income investor, you will probably view that as a positive thing.\nIcahn Enterprises might be right for some, but...\nIf you are looking to invest alongside Carl Icahn, then Icahn Enterprises is going to be a close-to-perfect investment for you. But if you think buying this stock gets you a high-yield energy stock, you will end up owning something you didn't expect. Chevron and Enterprise Products Partners are far better choices as dividend-paying energy stocks.\nShould you invest $1,000 in Enterprise Products Partners right now?\nBefore you buy stock in Enterprise Products Partners, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Enterprise Products Partners wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $774,281!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2024\nReuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway and Chevron. The Motley Fool recommends Enterprise Products Partners. The Motley Fool has a disclosure policy.\nForget Icahn Enterprises: 2 Energy Stocks to Buy Instead was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/Forget-Icahn-Enterprises-2-Energy-075500626.Html", "Sentiment_Score": 0.0347192921, "Sentiment_Category": "neutral"}, {"Ticker": "CVX", "Time": "2024-07-17T16:11:00.000Z", "Headline": "Presentation Times and Schedule for Participating Companies Now Posted on the Conference Website for 29th Annual EnerCom Denver - The Energy Investment Conference", "Summary": "Investors, Analysts, and Energy Industry Professionals Can Register to Attend at www.enercomdenver.com\nEmerging Energy Technology and Energy Transition Companies are Invited to Present at EnerCom Denver\nDENVER, July 17, 2024 /PRNewswire/ -- EnerCom, Inc. is pleased to publish presentation times and schedules for participating companies on the conference website for the 29th Annual EnerCom Denver – The Energy Investment Conference, to be held August 18-21, 2024, at the Westin Denver Downtown. The four-day conference provides investors unparalleled access and networking opportunities, including one-on-one meetings with company management teams. Meetings are limited to qualified investors, including buy-side principals, portfolio managers, CIOs, and securities analysts.\nEnerCom, Inc. Logo (PRNewsfoto/EnerCom, Inc.)\nThis year's schedule features a robust list of presenting companies, insightful panels on current industry topics, and The Energy Transition and Emerging Technology Session focused on energy-related technology, alternative energy and traditional oil and gas start-up ventures. Keynote speakers include Chris Wright of Liberty Energy and Mike Wirth of Chevron.\nThe conference kicks off with the annual Charity Golf Tournament on Sunday, August 18th at the scenic Arrowhead Golf Club. The golf event is sponsored by global sponsor Netherland, Sewell & Associates and EnerCom. The tournament is a significant fundraiser for IN! Pathways to Inclusive Higher Education. By participating in the charity golf tournament, requiring a $150 donation, you directly contribute to creating inclusive college opportunities in Colorado for students with intellectual disabilities and to foster academic growth, social development, and career advancement. Your participation makes a real difference.\nIn addition to the Charity Golf Tournament, the EnerCom Denver conference will host a Monday Mixer cocktail reception, held after day one of conference presentations. This valuable opportunity for attendees to enjoy appetizers, drinks, and live music while networking with other conference participants and key representatives from the energy industry shouldn't be missed.\nCasino Night follows day two of the Conference; experience the entertainment, fun, and excitement of playing in a real casino environment with \"funny money\" (no cash value, for entertainment only) at the poker, blackjack, roulette, and craps tables manned by professional dealers. Join us for a night of revelry, music, good food, and drinks. Open to all conference attendees.\nInstitutional investors, portfolio managers, financial analysts, CIOs, and other investment community and industry professionals are encouraged to register now for EnerCom Denver – The Energy Investment Conference. Registering for the conference for qualified investment professionals is free.\nEnerCom Denver - The Energy Investment Conference will once again include The Energy Transition and Emerging Technology Session featuring quick-pitch investment presentations from promising start-up energy and technology companies focused on innovation and operations in alternative energy, advanced oil and gas technology, environmental sustainability and carbon solutions. The Energy Transition and Emerging Technology Session provides invited start-up companies a platform to give a 15-minute presentation and participate in one-on-one meetings as requested by investors.\nEnerCom is currently accepting applications from start-up companies focused on innovation in alternative energy, advanced oil and gas technology, environmental sustainability, and carbon solutions to present at The Energy Transition and Emerging Technology Session at EnerCom Denver. Interested companies can contact Larry Busnardo at lbusnardo@enercominc.com for complete application details; space is limited.\nA complete list of companies participating in the conference and schedule of events can be found on the conference website EnerCom Denver – The Energy Investment Conference.\nPresenting company lineup as of July 17, 2024, includes:\nAfrica Oil (TSX: AOI)\nAmplify Energy (NYSE: AMPY)\nAPA Corporation (NASDAQ: APA)\nAureus Energy Services\nAvant Natural Resources\nBayswater\nBaytex Energy (TSX/NYSE: BTE)\nBerry Corporation (NASDAQ: BRY)\nBison Oil & Gas\nBlue Spruce Operating\nCalfrac Well Services  (TSX: CFW)\nChapman Nuclear\nChevron (NYSE: CVX)\nCibolo Energy Partners\nCivitas Resources (NYSE: CIVI)\nDiversified Energy (NYSE: DEC)\nDNOW (NYSE: DNOW)\nDonovan Ventures\nDrilling Tools International (NASDAQ: DTI)\nEnerCom Inc.\nFlotek Industries (NYSE: FTK)\nForum Energy Technologies (NYSE: FET)\nFranklin Mountain Energy\nFundare Resources\nGeopark (NYSE: GPRK)\nGradient Geothermal\nGran Tierra Energy (TSX/NYSE: GTE)\nGranite Ridge Resources (NYSE: GRNT)\nGTO Technologies\nHemisphere Energy (TSX: HME)\nHydroacoustics, Inc.\nKelt Exploration (TSX: KEL)\nLaramie Energy\nLiberty Energy (NYSE: LBRT)\nLiTHOS (OTC: LITSF)\nLycos Energy (TSXV: LCX)\nMach Natural Resources (NYSE: MNR)\nMobius Risk Group\nNCS Multistage (NASDAQ: NCSM)\nNuVista Energy (TSX: NVA)\nOklahoma Environmental Services\nParadigm by Puloli\nParex Resources (OTC: PARXF)\nPason Systems (TSX: PSI)\nPetroTal Corp. (TSXV: TAL)\nPine Cliff Energy (TSX: PNE)\nPulse Seismic (TSX: PSD)\nRaisa Energy\nRanger Energy Services (TSX: RNGR)\nReconAfrica (OTC: RECAF)\nRing Energy (NYSE: REI)\nSage Butte Energy\nSandRidge Energy (NYSE: SD)\nSelect Water Solutions (NYSE: WTTR)\nSendero ESG Solutions\nServe Robotics (NASDAQ: SERV)\nStandard Energy Partners\nTenaz Energy (TSX: TNZ)\nU.S. Energy Development Corp.\nVAALCO Energy (NYSE: EGY)\nVerdun Oil\nVitesse Energy (NYSE: VTS)\nW&T Offshore (NYSE: WTI)\nWalker Lane Research Partners\nWasatch Energy Management\nX Oil Development\nZephyr Energy plc (AIM: ZPHR; OTCQB: ZPHRF)\nConference Details: EnerCom Denver offers investment professionals a unique opportunity to network and listen to senior management teams from leading companies across the energy value chain update investors on their operational and financial strategies and learn how they create value for stakeholders.\nConference Dates: August 18–21, 2024. EnerCom will host its annual Charity Golf Tournament on Sunday, August 18th at the scenic Arrowhead Golf Club in Littleton, Colorado. The EnerCom Denver Golf Tournament -- a fundraiser for IN! Pathways to Inclusive Higher Education -- requires a $150 donation to participate. The Conference Global Sponsor Netherland, Sewell & Associates, Inc. (NSAI) sponsors the tournament, along with EnerCom.\nFormal presentations and meetings will be held Monday, August 19th through Wednesday, August 21st.\nVenue: Westin Denver Downtown. We highly encourage attendees to book hotel rooms under the EnerCom group block, as space is limited.\nWho Attends the Conference: Institutional, private equity, hedge fund investors, family offices, research analysts, retail brokers, trust officers, high net worth investors, investment and commercial bankers, and energy industry professionals gather in Denver throughout the conference.\nQualified investment professionals and oil and gas company executives may register for the event at no cost through the conference website. Other conference registration classifications are available for a fee.\nConference Format and Details: The EnerCom Denver conference follows EnerCom's familiar 25-minute presentation format, followed by 50-minute Q&A opportunities in separate breakout rooms, one-on-one meetings, and multiple networking opportunities. In addition to in-person access to all company presentations, panel discussions, and keynote speakers, conference registration allows investors and management teams to meet formally and informally over cocktails, breakfast, and lunch.\nPresenter Inquiries: Companies interested in presenting at EnerCom Denver can contact Larry Busnardo at lbusnardo@enercominc.com.\nInvestor One-on-One Meetings: Qualified investors can request one-on-one meetings with company management teams through the conference website. EnerCom will announce when one-on-one meeting requests for investor scheduling are available. Meetings are limited to institutional investors, buy-side principals, portfolio managers, CIOs, and securities analysts. EnerCom can work in advance with presenting company management teams to arrange one-on-one meetings with the attending institutional investors and research analysts at the conference venue.\nSponsorship Opportunities: Please contact Blanca Andrus at bandrus@enercominc.com or (303) 296.8834 x246.\nAbout EnerCom, Inc.:\nFounded in 1994, EnerCom, Inc.  has been a trusted advisor to the global energy industry, working with clients to differentiate and deliver targeted messages to investors. Headquartered in Denver, EnerCom is an internationally recognized strategic communications and management consultancy that advises companies on investor relations, corporate strategy/board advisory, Environmental, Social & Governance (ESG), marketing, financial analysis and valuation, media, branding, and visual communications design.\nFor more information about EnerCom and its services, please visit www.enercominc.com or call +1 303-296-8834 to speak with the management team or one of our consultants.\nEnerCom Denver Sponsors Include:\nNetherland, Sewell & Associates, Inc. (NSAI)\nNetherland, Sewell & Associates, Inc. (NSAI) was founded in 1961 to provide the highest quality engineering and geological consulting to the petroleum industry. Today they are recognized as the worldwide leader of petroleum property analysis to industry and financial organizations and government agencies. With offices in Dallas and Houston, NSAI provides a complete range of geological, geophysical, petrophysical, and engineering services and has the technical experience and ability to perform these services in any of the onshore and offshore oil and gas producing areas of the world. They provide reserves reports and audits, acquisition and divestiture evaluations, simulation studies, exploration resources assessments, equity determinations, and management and advisory services. netherlandsewell.com\nMobius Risk Group\nMobius Risk Group is an independent commodity and physical energy risk advisory firm. Founded in 2002, Mobius provides strategic advisory services including financial, physical, and commodity risk management and valuation, carbon strategy development, and regulated energy oversight for producers, consumers, distributors and capital providers backed by its proprietary C/ETRM, RiskNet. mobiusriskgroup.com\nHaynes and Boone, LLP\nHaynes Boone is an energy-focused corporate law firm that provides a full spectrum of legal services and solutions to clients across the energy industry, including the upstream, midstream and downstream sectors as well as power and renewables. Our team of more than 100 energy lawyers and landmen has been helping operators, lenders, and private equity firms with some of their most complex and significant transactions and disputes in recent years. The firm's nearly 700 lawyers practice across 19 global offices located in California, Colorado, Illinois, New York, North Carolina, Texas, Virginia, Washington, D.C., London, Mexico City and Shanghai. The 2023 Chambers USA Legal Guide ranked 31 different firm practice areas, and in 2024, Haynes Boone became the first Am Law 100 firm to ever earn a Gold-level Bell Seal from Mental Health America. The U.S. News & World Report and Best Lawyers \"Best Law Firms\" 2023 survey ranked Haynes Boone in National Tier 1 in Oil & Gas Law. haynesboone.com\nBDO\nBDO delivers assurance, tax, and financial advisory services to clients throughout the country and around the globe. BDO offers numerous industry-specific practices, world-class resources, and an unparalleled commitment to meeting our clients' needs. We currently serve more than 400 publicly traded domestic and international clients. For more information, please visit: www.bdo.com.\nIMA\nIMA Financial Group is an independent broker defining the future of insurance through comprehensive and consultative risk and wealth management services. A majority employee-owned and managed company, its 2,300-plus associates in offices across the country are empowered by a shared mission to manage risk, protect assets, and make a difference. www.imacorp.com\nPetrie Partners\nPetrie Partners, LLC is a boutique investment banking firm dedicated to the energy industry. The senior leadership has a multi-decade legacy of delivering specialized advice on mergers and acquisitions, asset transactions and valuations, and financings to the boards and managements of public, private and sovereign entities. Petrie clients benefit from the independent, conflict-free perspective and unwavering advocacy of their best interests that the team brings to every engagement. www.petrie.com\nWater Tower Research (WTR)\nWTR is modernizing Investor Relations through research-driven communications and Investor Engagement. Sound investment research begins with good information. At WTR, we help companies and investors connect by creating expert information flow and strategies that are the foundations of a successful modern investor relations platform. Our analysts and capital markets professionals bring decades of unrivaled Wall Street experience and insight to a new digital world of investor communications and engagement. Our research and investor content are open for everyone to access and distributed across traditional research aggregators like Bloomberg, FactSet, etc., proprietary direct distribution lists, social media, search engines, and our website. As a result, every institutional and retail investor has equal access to our high-quality company research. Our mission is to help companies take control of their IR program and proactively reach investors while bringing investors a consistent flow of quality information to help them understand our clients' businesses, industries, and the investment opportunities they present. www.watertowerresearch.com\nPreng & Associates\nPreng & Associates is the world's leading executive search firm totally dedicated to the energy industry. Over our 40 years, we have assisted more than 750 management teams and boards in 75 countries and conducted over 3,700 engagements. Our mission continues to be helping companies and boards identify and attract talent around the world that will impact shareholder value. www.preng.com\n Cision\nView original content to download multimedia:https://www.prnewswire.com/news-releases/presentation-times-and-schedule-for-participating-companies-now-posted-on-the-conference-website-for-29th-annual-enercom-denver--the-energy-investment-conference-302199561.html\nSOURCE EnerCom, Inc.", "Link": "Https://Finance.Yahoo.Com/News/Presentation-Times-Schedule-Participating-Companies-161100754.Html", "Sentiment_Score": -0.0013866872, "Sentiment_Category": "neutral"}, {"Ticker": "CVX", "Time": "2024-07-17T08:15:57.000Z", "Headline": "ExxonMobil and Chevron Are Rock-Solid Dividend Stocks, but So Are These 2 Energy Stocks That Are Down 3% and 15% in 2024", "Summary": "ExxonMobil (NYSE: XOM) and Chevron (NYSE: CVX) are the two largest U.S.-based oil and natural gas companies. However, there are plenty of other dividend-paying energy companies to consider.\nTwo that stand out today are Equinor (NYSE: EQNR), down 15% year to date, and ConocoPhillips (NYSE: COP), down 3% so far this year. Both companies pay attractive dividends and are worth buying now.\nImage source: Getty Images.\nEquinor's outsized profits have been a boon for income investors\nExxonMobil and Chevron have paid and raised their dividends annually for an impressive 42 years and 37 years, respectively.\nIn contrast, Equinor's dividend history is a little more complicated. The Norwegian oil and natural gas giant slashed its quarterly dividend from $0.27 per share at the end of 2019 to $0.09 per share at the start of 2020 as the COVID-19 pandemic took a sledgehammer to its cash flow.\nHowever, Equinor cashed in on the oil and gas recovery over the last few years — booking record revenue, net income, and free cash flow in 2022. Equinor's relatively low capital expenditures and inexpensive cost of production helped amplify its gains. Equinor's performance dipped in 2023, but its results were still excellent.\nBy late 2021, Equinor had raised its ordinary dividend back up to $0.20 per share, and it had begun to pay \"extraordinary\" dividends as well that were based on the performance of the company. These extraordinary payouts started at $0.20 per share — lifting Equinor's total dividend above its pre-pandemic level — and rose as high as $0.70 per share in Q3 2022.\nEquinor paid out a whopping $2.90 per share in dividends in 2022, and $3.40 per share in 2023. For 2024, Equinor plans to pay a $0.35 per share ordinary dividend and a $0.35 per share extraordinary dividend each quarter. That would add up to $2.80 per share for the year, giving it a forward yield of 10.5% based on the current stock price of $26.71.\nEquinor is a uniquely conservative oil major. It has been careful about ramping up production or making splashy acquisitions in the oil patch because of its aggressive energy transition goals. Equinor is 67% owned by the Norwegian state, and its management is heavily influenced by Norway's climate action targets. Over the long term, Equinor's oil and natural gas production will likely decrease, and its renewable energy investments will go up. By 2030, the company plans to allocate more than half of its annual gross capital expenditures to renewable energy projects and low-carbon solutions.\nEquinor's approach to the dividend makes sense within the context of its long-term goals to support a green and sustainable energy future. Instead of accelerating its fossil fuel investments, Equinor is using its profits from oil and gas to pay large dividends and fund its energy transition plan. Equinor would be a good fit for your portfolio if you want a high-yield stock and agree with the company's strategy.\nConocoPhillips jumps aboard the M&A train\nConocoPhillips is one of the largest U.S. exploration and production companies by market capitalization. Like Equinor, ConocoPhillips has its own climate targets, but those longer-term carbon-reduction goals are not stopping it from significantly ramping up oil and natural gas production over the medium term.\nThe company increased production by just 2% year over year in the first quarter. But production is about to surge once it completes its $22.5 billion acquisition of Marathon Oil (NYSE: MRO). That deal is a bet that oil and natural gas prices will stay at moderate levels. If all works out as hoped, ConocoPhillips will generate a boatload of free cash flow that it can use to pay down debt, accelerate growth, or increase its dividend.\nLike Equinor, ConocoPhillips has implemented a dual dividend program with an ordinary dividend and an extraordinary dividend. Its ordinary dividend currently sits at $0.58 per share quarterly, while its most recent extraordinary dividend was $0.20 per share. Annualized, that gives ConocoPhillips a yield of 2.8%, which is good, but far lower than Equinor's.\nIn October 2022, ConocoPhillips paid an extraordinary dividend of $1.40 per share. But since then, it has been paying far lower dividends, and with good reason. The company's value proposition to shareholders is based on long-term free cash flow growth, not maintaining a stagnant business and passing along profits. As such, its dividend is merely one aspect of the investment thesis. The bigger draw is the company's growth, which could lead to a strong stock price performance, higher future dividends, and share buybacks.\nConocoPhillips is the perfect energy stock if you're confident in mediocre to moderate oil and natural gas prices and growing U.S. energy exports. The company believes it will be able to buy back $20 billion of its stock over the next three years, which would offset most of the $22.5 billion all-stock transition for Marathon Oil. If all goes according to plan, ConocoPhillips will emerge with a more attractive asset base, higher production, and essentially no dilution to existing shareholders.\nChoose the path that's best for you\nWhile the short-term performance of energy stocks can be heavily dependent on oil and natural gas prices, their long-term performance can vary wildly based on management objectives and strategic execution. Comparing Equinor to ConocoPhillips highlights two starkly contrasting ways of pursuing growth. Equinor is gradually decreasing its focus on fossil fuels and shifting toward a more balanced portfolio of fossil fuel and renewable assets. In contrast, ConocoPhillips is focused on free cash flow and growth.\nThe best way to approach the energy sector is through a company that aligns with your outlook on the industry. If you believe that oil and natural gas aren't going anywhere for a while, then you may agree that now is the time for energy companies to generate a lot of free cash flow and grow their businesses, and then accelerate energy transition investments in the future.\nThere's also the ExxonMobil approach, which involves increasing oil and natural gas production and making low-carbon investments with an emphasis on profitability.\nIn sum, the best stock for you will depend on your risk tolerance, your view of the energy transition, and whether you want to invest in a company that is prioritizing high dividend payments now or is charting a path toward higher payments in the future.\nShould you invest $1,000 in Equinor Asa right now?\nBefore you buy stock in Equinor Asa, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Equinor Asa wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $787,026!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2024\nDaniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Chevron. The Motley Fool recommends Equinor Asa. The Motley Fool has a disclosure policy.\nExxonMobil and Chevron Are Rock-Solid Dividend Stocks, but So Are These 2 Energy Stocks That Are Down 3% and 15% in 2024 was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/Exxonmobil-Chevron-Rock-Solid-Dividend-140700328.Html", "Sentiment_Score": -0.9643955827, "Sentiment_Category": "bearish"}, {"Ticker": "CVX", "Time": "2024-07-16T13:30:12.000Z", "Headline": "Wall Street Analysts Think Chevron (CVX) Is a Good Investment: Is It?", "Summary": "The recommendations of Wall Street analysts are often relied on by investors when deciding whether to buy, sell, or hold a stock. Media reports about these brokerage-firm-employed (or sell-side) analysts changing their ratings often affect a stock's price. Do they really matter, though?\nLet's take a look at what these Wall Street heavyweights have to say about Chevron (CVX) before we discuss the reliability of brokerage recommendations and how to use them to your advantage.\nChevron currently has an average brokerage recommendation (ABR) of 1.48, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by 21 brokerage firms. An ABR of 1.48 approximates between Strong Buy and Buy.\nOf the 21 recommendations that derive the current ABR, 15 are Strong Buy and two are Buy. Strong Buy and Buy respectively account for 71.4% and 9.5% of all recommendations.\nBrokerage Recommendation Trends for CVX\nBroker Rating Breakdown Chart for CVX\n\n\nCheck price target & stock forecast for Chevron here>>>\n\nWhile the ABR calls for buying Chevron, it may not be wise to make an investment decision solely based on this information. Several studies have shown limited to no success of brokerage recommendations in guiding investors to pick stocks with the best price increase potential.\nDo you wonder why? As a result of the vested interest of brokerage firms in a stock they cover, their analysts tend to rate it with a strong positive bias. According to our research, brokerage firms assign five \"Strong Buy\" recommendations for every \"Strong Sell\" recommendation.\nIn other words, their interests aren't always aligned with retail investors, rarely indicating where the price of a stock could actually be heading. Therefore, the best use of this information could be validating your own research or an indicator that has proven to be highly successful in predicting a stock's price movement.\nWith an impressive externally audited track record, our proprietary stock rating tool, the Zacks Rank, which classifies stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), is a reliable indicator of a stock's near -term price performance. So, validating the Zacks Rank with ABR could go a long way in making a profitable investment decision.\nABR Should Not Be Confused With Zacks Rank\nIn spite of the fact that Zacks Rank and ABR both appear on a scale from 1 to 5, they are two completely different measures.\nBroker recommendations are the sole basis for calculating the ABR, which is typically displayed in decimals (such as 1.28). The Zacks Rank, on the other hand, is a quantitative model designed to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\nAnalysts employed by brokerage firms have been and continue to be overly optimistic with their recommendations. Since the ratings issued by these analysts are more favorable than their research would support because of the vested interest of their employers, they mislead investors far more often than they guide.\nOn the other hand, earnings estimate revisions are at the core of the Zacks Rank. And empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nIn addition, the different Zacks Rank grades are applied proportionately to all stocks for which brokerage analysts provide current-year earnings estimates. In other words, this tool always maintains a balance among its five ranks.\nAnother key difference between the ABR and Zacks Rank is freshness. The ABR is not necessarily up-to-date when you look at it. But, since brokerage analysts keep revising their earnings estimates to account for a company's changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in indicating future price movements.\nIs CVX Worth Investing In?\nIn terms of earnings estimate revisions for Chevron, the Zacks Consensus Estimate for the current year has increased 0.3% over the past month to $13.18.\nAnalysts' growing optimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates higher, could be a legitimate reason for the stock to soar in the near term.\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #2 (Buy) for Chevron. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\nTherefore, the Buy-equivalent ABR for Chevron may serve as a useful guide for investors.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Wall-Street-Analysts-Think-Chevron-133012521.Html", "Sentiment_Score": 0.6104476452, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-16T13:12:00.000Z", "Headline": "ConocoPhillips (COP) Receives Second FTC Request on Merger Deal", "Summary": "ConocoPhillips COP, a U.S.-based exploration and production player, has received a second request from the U.S. Federal Trade Commission (“FTC”) for further information on its proposed merger with Marathon Oil Corporation MRO. ConocoPhillips had announced the acquisition in May 2024 in an all-stock transaction worth $22.5 billion. Per COP’s statement, both companies received the FTC request and are jointly working with the regulatory body to review the details of the proposed merger.\nMarathon shareholders would receive 0.255 shares of ConocoPhillips, for each share of Marathon Oil common stock. The merger is anticipated to create a combined entity with a production capacity of 2.26 million barrels of oil and gas per day. Furthermore, it is expected to add proved reserves of up to 1.32 billion barrels to ConocoPhillips’ existing proved reserves of 6.8 billion barrels.\nCOP had previously stated that the deal is anticipated to close in the fourth quarter of 2024. However, the request for additional information regarding the deal may delay its closure. The cost savings and benefits that COP expects from the acquisition will not be fully realized until the transaction is closed.\nThe current trends indicate that the energy sector is undergoing rapid consolidation to achieve operational efficiencies and cost-saving benefits. The announcement of ConocoPhillips’ deal with Marathon Oil followed the $60 billion acquisition of Pioneer Natural Resources by ExxonMobil Corporation and the proposed $53-billion merger of Hess Corporation with energy giant, Chevron.\nZacks Rank and Key Picks\nCurrently, COP carries a Zacks Rank #3 (Hold).\nSome better-ranked stocks in the energy sector areSM Energy SM and Chevron Corporation CVX. SM Energy presently sports a Zacks Rank #1 (Strong Buy), while Chevron carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nSM Energy is an upstream energy firm operating in the prolific Midland Basin and the South Texas regions. For 2024, the company expects its production to increase from the prior-year reported figure, signaling a bright production outlook.\nChevron is one of the largest publicly traded oil and gas companies in the world, with its operations spread around the globe. It is currently in the process of acquiring Hess Corporation. The acquisition is seen as a major win for Chevron, as it will give the company access to Hess' high-quality assets in Guyana and the Bakken Formation.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nConocoPhillips (COP) : Free Stock Analysis Report\nMarathon Oil Corporation (MRO) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Conocophillips-Cop-Receives-Second-Ftc-131200908.Html", "Sentiment_Score": 0.0222710222, "Sentiment_Category": "neutral"}, {"Ticker": "CVX", "Time": "2024-07-16T13:11:00.000Z", "Headline": "ExxonMobil (XOM) Reveals Hammerhead Project Development Plan", "Summary": "Exxon Mobil Corporation XOM has proposed a development plan to the government of Guyana for its seventh oil project in the country. The discovery named Hammerhead is part of the prolific Starbroek Block offshore Guyana. The development of the Hammerhead discovery involves drilling up to 30 wells, per ExxonMobil’s development plan.\nThe Hammerhead project is estimated to come online by 2029, pending government approval. The oil and gas giant expects daily production from the Hammerhead field to lie in the range of 120,000-180,000 barrels of crude. The Hammerhead project is anticipated to raise the production capacity of Guyana to approximately 1.4 billion barrels per day.\nExxonMobil has proposed the use of a Very Large Crude Carrier conversion facility for its seventh oil project in Guyanese waters. The floating production unit will be situated 15 kilometers toward the southwest of Liza Destiny, which is XOM’s first oil production platform in the South American nation.\nFor the Hammerhead project, the floating production, storage and offloading (FPSO) vessel has a production capacity of 180,000 barrels of oil per day and a storage capacity of approximately 1.4 to 2 million barrels of oil. This FPSO has a lower production capacity than XOM's largest vessels in the country, which can produce up to 250,000 barrels per day.\nExxonMobil operates the prolific Starbroek Block offshore Guyana, with Hess Corporation and CNOOC as its partners.\nZacks Rank and Key Picks\nCurrently, XOM carries a Zacks Rank #4 (Sell).\nSome better-ranked stocks in the energy sector are SM Energy SM, Sunoco LP SUN and Chevron Corporation CVX. SM Energy and Sunoco presently sport a Zacks Rank #1 (Strong Buy) each, while Chevron carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nSM Energy is an upstream energy firm operating in the prolific Midland Basin and the South Texas regions. For 2024, the company expects its production to increase from the prior-year reported figure, signaling a bright production outlook.\nSunoco LP is one of the largest distributors of motor fuel in the United States. The partnership distributes fuel to independent dealers, commercial customers, convenience stores as well as distributors. Its current distribution yield is greater than the composite stocks in the industry, providing unitholders with consistent returns.\nChevron is one of the largest publicly traded oil and gas companies in the world, with its operations spread around the globe. It is currently in the process of acquiring Hess Corporation. The acquisition is seen as a major win for Chevron, as it will give the company access to Hess' high-quality assets in Guyana and the Bakken Formation.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nSunoco LP (SUN) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Exxonmobil-Xom-Reveals-Hammerhead-Project-131100776.Html", "Sentiment_Score": 0.043843437, "Sentiment_Category": "neutral"}, {"Ticker": "CVX", "Time": "2024-07-15T13:06:00.000Z", "Headline": "Martin Midstream (MMLP) Units Gain Amid Buyout Proposals", "Summary": "Martin Midstream Partners MMLP has received a non-binding offer from two New York-based capital groups, Nut Tree Capital Management LP and Caspian Capital LP, to acquire it at $4 per unit. The offer had been rejected by MMLP’s general partner's Conflicts Committee despite overshadowing the previous bid for takeover made by Martin Resource Management Corporation (“MRMC”) in May 2024. MRMC made an offer to acquire the midstream firm at $3.05 per unit, totaling approximately $100.3 million.\nNut Tree and Caspian Capital’s offer to buy out MMLP at $4 per unit, totaling approximately $131 million in cash, represents a 31% premium to MRMC’s previous offer. Martin Midstream’s management refused to comment on the offer made by the capital groups. However, it stated that the midstream firm is currently engaged in talks with the Conflicts Committee of MMLP regarding the buyout offer made by MRMC. MRMC and its subsidiaries are owned and managed by Martin Midstream’s general partner.\nIn a letter (dated Jul 11, 2024) to MMLP’s general partner, the two capital groups highlighted that their proposal was not contingent upon financing conditions and would be funded entirely via capital on hand. Furthermore, both companies were existing investors in Martin Midstream's debt and had sufficient knowledge of the midstream company’s operations and financial structure.\nThe letter also raised concerns regarding a potential conflict of interest between the midstream firm and its general partner. The two capital groups believe that MRMC’s offer at $3.05 per unit severely undervalues MMLP common units. Per Nut Tree and Caspian’s statement, the all-cash offer put forward by them would be accretive and provide immediate value to MMLP’s unitholders. It is also the best alternative to the clearly conflicted offer made by MRMC.\nDespite these factors being true, the Martin Midstream general partner’s Conflict Committee had turned down its proposal and refused to engage with the two groups on multiple occasions. The committee stated that it would need the approval of the general partner to support the proposal, which is viewed as an irregular move due to the interconnected relationships between MRMC, the general partner, and MMLP. The letter also raised questions regarding the autonomy of the Conflict Committee due to this move.\nNut Tree and Caspian Capital’s bid appears to be the most compelling option at present. However, speculations say that MRMC would raise the target price per unit in a counteroffer, making it a more lucrative bid.\nMartin Midstream’s ownership is split between the common units and the general partner units, the latter having a greater influence. The general partner units are under the control of MRMC, which also holds 15.7% of the common units. Previously, MRMC had clearly mentioned that it is only interested in acquiring the midstream firm and will not engage in selling its stake to any other party.\nMMLP common units have gained almost 10% since Nut Tree and Caspian Capital announced their bid publicly on Jul 11, 2024.\nZacks Rank and Key Picks\nCurrently, MMLP carries a Zacks Rank #3 (Hold).\nSome better-ranked stocks in the energy sector are SM Energy SM, Hess Midstream Partners LP HESM and Chevron Corporation CVX. SM Energy presently sports a Zacks Rank #1 (Strong Buy), while Hess Midstream and Chevron carry a Zacks Rank #2 (Buy) each. You can see the complete list of today’s Zacks #1 Rank stocks here.\nSM Energy is an upstream energy firm operating in the prolific Midland Basin and the South Texas regions. For 2024, the company expects its production to increase from the prior-year reported figure, signaling a bright production outlook.\nHess Midstream owns, operates, develops and acquires a wide range of midstream assets, providing services to Hess Corporation and other third-party customers. The partnership has a stable fee-based revenue model secured via long-term commercial contracts. Since Hess Midstream operates through 100% fee-based contracts, it is exposed to minimal commodity price risks.\nChevron is one of the largest publicly traded oil and gas companies in the world, with its operations spread around the globe. It is currently in the process of acquiring Hess Corporation. The acquisition is seen as a major win for Chevron, as it will give the company access to Hess' high-quality assets in Guyana and the Bakken Formation.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nMartin Midstream Partners L.P. (MMLP) : Free Stock Analysis Report\nHess Midstream Partners LP (HESM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Martin-Midstream-Mmlp-Units-Gain-130600342.Html", "Sentiment_Score": 0.8296219707, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-15T13:00:15.000Z", "Headline": "Chevron Corporation (CVX) is Attracting Investor Attention: Here is What You Should Know", "Summary": "Chevron (CVX) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term.\nOver the past month, shares of this oil company have returned +2%, compared to the Zacks S&P 500 composite's +3.8% change. During this period, the Zacks Oil and Gas - Integrated - International industry, which Chevron falls in, has lost 5.1%. The key question now is: What could be the stock's future direction?\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\nEarnings Estimate Revisions\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nChevron is expected to post earnings of $3.28 per share for the current quarter, representing a year-over-year change of +6.5%. Over the last 30 days, the Zacks Consensus Estimate has changed +0.7%.\nFor the current fiscal year, the consensus earnings estimate of $13.18 points to a change of +0.4% from the prior year. Over the last 30 days, this estimate has changed -0.1%.\nFor the next fiscal year, the consensus earnings estimate of $15.37 indicates a change of +16.6% from what Chevron is expected to report a year ago. Over the past month, the estimate has changed -1.2%.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #2 (Buy) for Chevron.\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\n12-month consensus EPS estimate for CVX _12MonthEPSChartUrl\nProjected Revenue Growth\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\nFor Chevron, the consensus sales estimate for the current quarter of $51.59 billion indicates a year-over-year change of +5.5%. For the current and next fiscal years, $205.53 billion and $219.1 billion estimates indicate +2.3% and +6.6% changes, respectively.\nLast Reported Results and Surprise History\nChevron reported revenues of $48.72 billion in the last reported quarter, representing a year-over-year change of -4.1%. EPS of $2.93 for the same period compares with $3.55 a year ago.\nCompared to the Zacks Consensus Estimate of $49.94 billion, the reported revenues represent a surprise of -2.45%. The EPS surprise was +3.17%.\nOver the last four quarters, Chevron surpassed consensus EPS estimates three times. The company topped consensus revenue estimates just once over this period.\nValuation\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nChevron is graded B on this front, indicating that it is trading at a discount to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Chevron. However, its Zacks Rank #2 does suggest that it may outperform the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Chevron-Corporation-Cvx-Attracting-Investor-130015322.Html", "Sentiment_Score": 0.0620496236, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-16T08:12:43.000Z", "Headline": "5 Dividend Stocks Billionaires Are Buying In 2024", "Summary": "5 Dividend Stocks Billionaires Are Buying In 2024\nBenzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nDividend stocks have been under pressure lately as investors flocked to high-growth tech companies to ride the AI bandwagon. However, amid the latest data showing signs of easing inflation, many analysts believe possible rate cuts from the Federal Reserve could reignite the market's interest in income stocks. Research from Columbia Threadneedle Investments, which analyzed data from 1973 through 2023, showed that dividend-growing stocks outperform other stocks when the Federal Reserve begins to cut interest rates.\nCheck it out: Bezos' favorite real estate platform launches a way to cash in on the private credit boom —.\nPerhaps that's why top money managers and billionaires have been piling into dividend growth stocks with strong balance sheets and decades of consecutive dividend hikes. This article will look at some of the most popular dividend stocks among notable billionaires. We analyzed the latest portfolios of top billionaires, including Warren Buffett, Ken Fisher, Israel Englander, Steve Cohen, and Cliff Asness. We identified five dividend stocks commonly held across these influential investors’ portfolios.\nCoca-Cola\nCoca-Cola Co. (NYSE:KO) has 62 consecutive years of dividend increases. Its resilient business makes the stock a defensive play when times are tough. The stock yields about 3% as of July 11, 2024. Some of the famous billionaires with stakes in the beverage company include Warren Buffett ($24.5 billion), Ken Griffin ($539 million), Ray Dalio ($384.74 million), and Steve Cohen ($325.04 million).\nCoca-Cola shares are up 5.4% so far this year. The latest industry data from Nielsen showed that Coca-Cola’s market share remains strong. During the 12 months ending May 18, Coca-Cola sales jumped 4.1% year over year, much higher than the beverage industry's average growth of 1.1% during the same period.\nChevron\nWhat sets Chevron Corp. (NYSE:CVX) apart from other dividend stocks is this: legendary investor Warren Buffett is the biggest stakeholder in the company, with an eye-popping $19.4 billion. But if you need more reasons to be impressed with the oil company, the list of billionaire shareholders is long. The stock is in the portfolios of Cliff Asness, Ken Griffin, Israel Englander, and Louis Bacon.\nChevron has an over 4% dividend yield and 36 years of consecutive dividend growth history. Chevron is a cash-rich company that returns value to shareholders via buybacks and dividends. Last year, the company made headlines when it announced a $75 billion share buyback plan.\nExxon Mobil\nWith a 3.3% dividend yield and over 40 straight years of dividend growth, oil giant Exxon Mobil Corp. (NYSE:XOM) is loved by income investors. As of the end of the first quarter of 2024, billionaire Ken Fisher had a $3.1 billion stake in the company. Meanwhile, billionaire Steve Cohen held a $259 million stake via his fund Point72 Asset Management. Other billionaire stakeholders in ExxonMobil include Ken Griffin, Cliff Asness and D.E. Shaw. Earlier this year, ExxonMobil completed its $60 billion acquisition of Pioneer Natural Resources.\nAnalysts expect the deal to help ExxonMobil reduce oil and gas production costs. During the first quarter alone, the company generated about $8.2 billion in earnings and $14.7 billion in cash from operations, while its structural cost savings surpassed $10 billion. This strong cash position and an expected upbeat demand for oil and gas make XOM a strong dividend player in the industry.\nWhole Foods' landlord has delivered a 15% net IRR for its investors since 2015. Check out the latest investment opportunities added to its platform.\nProcter & Gamble\nConsumer goods company Procter & Gamble Co. (NYSE:PG) is one of the favorite dividend stocks of billionaires. The company has hiked its dividend for 68 straight years. The list of billionaires having stakes in the company is long: Ken Fisher (over $2.67 billion), Ray Dalio ($666 million), D.E. Shaw ($151 million), Israel Englander ($51 million), and Cliff Asness ($256 million), among others. Procter & Gamble shares have gained about 11% this year. Despite inflation, the company remains in a strong pricing position, as it's behind household names like Gillette, Old Spice, Oral B, and Pampers. Wall Street expects a 6% to 7% annual EPS growth for the company over the next two years.\nJohnson & Johnson\nWith 62 years of consecutive dividend increases, Johnson & Johnson (NYSE:JNJ) is one of the most famous and sought-after dividend stocks. Among the notable billionaire hedge funds having stakes in the company as of the end of the first quarter include Ken Fisher's Fisher Asset Management (over $1 billion), Ray Dalio's Bridgewater Associates (about $450 million), and Cliff Asness' AQR Capital ($382 million), among several others. Johnson & Johnson shares have been down about 6% this year, and the stock's forward P/E ratio is 14.17, much lower than the sector median of 18.7. While litigation-related headwinds have taken a toll on the stock, analysts believe the company's diversified revenue stream and strong cash position make it a safe dividend stock for the long term.\nLooking For Higher-Yield Opportunities?\nThe current high-interest-rate environment has created an incredible opportunity for income-seeking investors to earn massive yields, but not through dividend stocks... Certain private market real estate investments are giving retail investors the opportunity to capitalize on these high-yield opportunities and Benzinga has identified some of the most attractive options for you to consider.\nFor instance, the Ascent Income Fund from EquityMultiple targets stable income from senior commercial real estate debt positions and has a historical distribution yield of 12.1% backed by real assets. With payment priority and flexible liquidity options, the Ascent Income Fund is a cornerstone investment vehicle for income-focused investors. First-time investors with EquityMultiple can now invest in the Ascent Income Fund with a reduced minimum of just $5,000.\nDon't miss out on this opportunity to take advantage of high-yield investments while rates are high. Check out Benzinga's favorite high-yield offerings.\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nThis article 5 Dividend Stocks Billionaires Are Buying In 2024 originally appeared on Benzinga.com", "Link": "Https://Finance.Yahoo.Com/News/5-Dividend-Stocks-Billionaires-Buying-130009915.Html", "Sentiment_Score": 0.0534564778, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-15T08:32:00.000Z", "Headline": "The Zacks Analyst Blog Highlights Amazon, Apple Walmart and Chevron", "Summary": "For Immediate Releases\nChicago, IL – July 15, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Amazon.com Inc. AMZN, Apple Inc. AAPL, Walmart Inc. WMT and Chevron Corp. CVX.\nHere are highlights from Monday’s Analyst Blog:\n4 Blue-Chip Stock Picks to Strengthen Your Portfolio\nU.S. stock markets have been on an impressive bull run over the past 18 months. However, the Dow, despite participating in the rally, lagged its peers, the S&P 500 and the Nasdaq Composite. Wall Street’s blue-chip index is up 5.4% year to date. On the other hand, the broad-market S&P 500 Index and the tech-heavy Nasdaq Composite have climbed 17.8% and 23.8%, respectively.\nMeanwhile, the Dow recorded its all-time high of 40,077.40 on an intraday basis on Mar 20 and 40,003.59 on a closing basis on May 17. Technically, at its current level of 39,753.75, the Dow is well above its 50-day and 200-day moving averages of 39,035.26 and 37,365.23, respectively.\nThe 50-day moving average line is generally recognized as a short-term trendsetter in financial literature, while the 200-day moving average is considered a long-term trendsetter. Historically it has been noticed in the technical analysis space that whenever the 50-day moving average line surges ahead of the 200-day moving average line, a long-term uptrend for the asset (in this case the Dow Index) becomes a strong possibility.\nOur Top Picks\nWe have narrowed our search to four Dow stocks that have strong earnings growth potential for the rest of 2024. These stocks have seen positive earnings estimate revisions in the last 60 days. Finally, each of our picks carries either a Zacks Rank #1 (Strong Buy) or 2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nAmazon.com Inc. is gaining on solid Prime momentum owing to ultrafast delivery services and a strong content portfolio. A deepening focus on generative AI is a major plus. Strengthening relationships with third-party sellers is a positive for AMZN.\nThe strong adoption rate of AWS is aiding AMZN’s cloud dominance. Improving Alexa skills along with robust smart home offerings are tailwinds. The advertising business is also pretty robust. AMZN enjoys a strong global presence and solid momentum among small and medium businesses. Growing capabilities in grocery, pharmacy, healthcare and autonomous driving are its other positives.\nZacks Rank #2 Amazon.com has an expected revenue and earnings growth rate of 11% and 57.9%, respectively, for the current year. The Zacks Consensus Estimate for current-year earnings has improved 0.9% over the last 60 days.\nApple Inc. has been playing catch-up in the AI space compared with Alphabet, Microsoft and Amazon, its peers in the “magnificent seven” group. Following the launch of Apple Intelligence, AAPL’s competitive position is expected to improve. Moreover, AAPL is benefiting from increasing customer engagement in the services segment.\nThe expanding content portfolio of Apple TV+ and Apple Arcade helped drive subscriber growth. AAPL’s top-line benefits from strong growth in emerging markets and growing adoption of its devices among enterprises.\nZacks Rank #2 Apple has an expected revenue and earnings growth rate of 0.8% and 7.5%, respectively, for the current year (ending September 2024). The Zacks Consensus Estimate for current-year earnings has improved 0.2% over the last 30 days.\nWalmart Inc. has been gaining from its highly diversified business with contributions from various segments, channels and formats. WMT has been benefiting from an increase in in-store and digital channel traffic due to its robust omnichannel initiatives. Store-fulfilled delivery sales jumped 50% in the first quarter of fiscal 2025.\nWalmart’s strategic focus on enhancing delivery services has also been rewarding, as evidenced by the constant increase in the market share for groceries. Upsides like these, along with growth in the advertising business, fueled WMT’s first-quarter results and led to an encouraging fiscal 2025 view.\nZacks Rank #1 Walmart has an expected revenue and earnings growth rate of 4.3% and 9.5%, respectively, for the current year (ending January 2025). The Zacks Consensus Estimate for current-year earnings has improved 3% over the last 60 days.\nChevron Corp. is positioned as one of the top global integrated oil firms, set for sustainable production growth, particularly due to its dominant position in the lucrative Permian Basin. Further, the recent acquisition of Hess Corporation is expected to significantly strengthen CVX’s presence in oil-rich Guyana.\nCVX seems one of the best-placed global integrated oil companies to achieve sustainable production ramp-up. We expect the company's average output during 2024 to rise 4-7% year over year, due to the PDC Energy acquisition and robust output in the showpiece Permian Basin region.\nZacks Rank #2 Chevron has an expected revenue and earnings growth rate of 2.3% and 0.4%, respectively, for the current year. The Zacks Consensus Estimate for current-year earnings has improved 0.1% over the last 30 days.\nWhy Haven’t You Looked at Zacks' Top Stocks?\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance  for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nChevron Corporation (CVX) : Free Stock Analysis Report\nWalmart Inc. (WMT) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Zacks-Analyst-Blog-Highlights-Amazon-083200215.Html", "Sentiment_Score": 0.0015753657, "Sentiment_Category": "neutral"}, {"Ticker": "CVX", "Time": "2024-07-14T11:02:11.000Z", "Headline": "Is Chevron Corporation's (NYSE:CVX) Latest Stock Performance Being Led By Its Strong Fundamentals?", "Summary": "Most readers would already know that Chevron's (NYSE:CVX) stock increased by 2.0% over the past month. Given that the market rewards strong financials in the long-term, we wonder if that is the case in this instance. Particularly, we will be paying attention to Chevron's ROE today.\nReturn on equity or ROE is an important factor to be considered by a shareholder because it tells them how effectively their capital is being reinvested. In simpler terms, it measures the profitability of a company in relation to shareholder's equity.\nView our latest analysis for Chevron\nHow To Calculate Return On Equity?\nROE can be calculated by using the formula:\nReturn on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity\nSo, based on the above formula, the ROE for Chevron is:\n13% = US$20b ÷ US$162b (Based on the trailing twelve months to March 2024).\nThe 'return' is the profit over the last twelve months. That means that for every $1 worth of shareholders' equity, the company generated $0.13 in profit.\nWhat Is The Relationship Between ROE And Earnings Growth?\nWe have already established that ROE serves as an efficient profit-generating gauge for a company's future earnings. We now need to evaluate how much profit the company reinvests or \"retains\" for future growth which then gives us an idea about the growth potential of the company. Assuming all else is equal, companies that have both a higher return on equity and higher profit retention are usually the ones that have a higher growth rate when compared to companies that don't have the same features.\nChevron's Earnings Growth And 13% ROE\nTo begin with, Chevron seems to have a respectable ROE. Be that as it may, the company's ROE is still quite lower than the industry average of 18%. That being the case, the significant five-year 35% net income growth reported by Chevron comes as a pleasant surprise. We reckon that there could be other factors at play here. Such as - high earnings retention or an efficient management in place. However, not to forget, the company does have a decent ROE to begin with, just that it is lower than the industry average. So this certainly also provides some context to the high earnings growth seen by the company.\nAs a next step, we compared Chevron's net income growth with the industry and found that the company has a similar growth figure when compared with the industry average growth rate of 38% in the same period.\npast-earnings-growth\nEarnings growth is an important metric to consider when valuing a stock. It’s important for an investor to know whether the market has priced in the company's expected earnings growth (or decline). This then helps them determine if the stock is placed for a bright or bleak future. What is CVX worth today? The intrinsic value infographic in our free research report helps visualize whether CVX is currently mispriced by the market.\nIs Chevron Making Efficient Use Of Its Profits?\nChevron's three-year median payout ratio is a pretty moderate 44%, meaning the company retains 56% of its income. So it seems that Chevron is reinvesting efficiently in a way that it sees impressive growth in its earnings (discussed above) and pays a dividend that's well covered.\nBesides, Chevron has been paying dividends for at least ten years or more. This shows that the company is committed to sharing profits with its shareholders. Based on the latest analysts' estimates, we found that the company's future payout ratio over the next three years is expected to hold steady at 51%. Therefore, the company's future ROE is also not expected to change by much with analysts predicting an ROE of 15%.\nSummary\nOverall, we are quite pleased with Chevron's performance. Specifically, we like that it has been reinvesting a high portion of its profits at a moderate rate of return, resulting in earnings expansion. With that said, the latest industry analyst forecasts reveal that the company's earnings growth is expected to slow down. Are these analysts expectations based on the broad expectations for the industry, or on the company's fundamentals? Click here to be taken to our analyst's forecasts page for the company.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com", "Link": "Https://Finance.Yahoo.Com/News/Chevron-Corporations-Nyse-Cvx-Latest-110211769.Html", "Sentiment_Score": 0.799980104, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-13T22:03:00.000Z", "Headline": "Forget Chevron, Buy This Magnificent High-Yield Oil Stock Instead", "Summary": "Chevron (NYSE: CVX) is a fine and worthy company, and it represents an excellent way to get exposure to a relatively high price of oil. At the same time, there's a significant amount of uncertainty hanging over the stock in connection with its planned $53 billion acquisition of Hess.\nThat's why it makes sense for Chevron investors to think about diversifying to avoid stock-specific risk but retaining exposure to oil in their portfolio by buying a few other such companies. And one of them is the 8.7%-yielding small cap Vitesse Energy (NYSE: VTS). Here's why.\nChevron's uncertainty\nFirst, a few words on Chevron and its ongoing dispute with ExxonMobil and the China National Offshore Oil Corporation (CNOOC) over Chevron's intended acquisition of Hess. The dispute centers around the Stabroek block of drilling sites in offshore Guyana.\nExxonMobil holds a 45% interest in the block, with CNOOC holding 25% and Hess holding a 30% interest.\nIn acquiring Hess, Chevron would obtain its 30% share in the block. However, ExxonMobil and CNOOC believe they have rights over the block (including the right of first refusal to acquire Hess' stake in Stabroek) and have filed for arbitration over those rights.\nArbitration can take time, and the panel might not resolve the matter in Chevron's favor. So the issue will likely hang over the stock for some time. As such, it makes sense to look at some other exciting oil stocks.\nEnter Vitesse Energy\nWith a market cap of just $711 million, Vitesse is dwarfed by companies like Chevron, but that doesn't mean its management can't be nimble and invest in myriad different assets. That's precisely what Vitesse does; this is no one-trick-pony oil and gas stock.\nVitesse's business model involves acquiring interests in wells operated by more than 30 other larger oil companies, primarily in the Bakken oil field in North Dakota. Among the larger listed operators are Chord Energy, EOG Resources, ExxonMobil, Marathon Oil, and Hess.\nAs of May, Vitesse had interests in 6,932 productive wells, with its net interest averaging 2.7% per working well. The well operators propose, initiate, and complete the wells, while Vitesse's management assesses each opportunity on investing in wells \"expected to meet a desired rate of return based upon estimates of recoverable oil and natural gas reserves,\" according to its Securities and Exchange Commission filings.\nThe model gives Vitesse significant financial flexibility and doesn't burden the company with drilling obligations and other operator-associated costs. It also allows management to focus on what it does best: using its proprietary processes to analyze and model the assets it's considering investing in.\nOn the evidence of the news flow in 2024, management is continuing to identify potential assets, with $6.8 million invested in acquiring oil and gas properties in the first quarter, followed by an agreement to acquire another $40 million in oil and gas interests in North Dakota.\nThe investment case for Vitesse Energy\nThe key is confidence in management's ability to identify and invest in productive assets. While Vitesse will obviously benefit from a higher oil price, it also uses a hedging strategy to reduce its risk exposure to oil price volatility. That's a good thing when the price of oil slumps, but it also restricts the company's upside potential when the price of oil soars.\nImage source: Getty Images.\nHowever, the hedging strategy (Vitesse hedged 50% of its oil production in the first quarter) also helps protect the company's ability to pay its fixed quarterly dividend of $0.525 per share.\nWhile the capital expenditures made in 2024 (to acquire productive assets) will reduce potential free-cash-flow (FCF) generation this year, Wall Street expects Vitesse to generate some $82 million in FCF in 2025, which would easily cover the current dividend payout of nearly $60 million.\nImage source: Getty Images.\nA stock to buy\nManagement's track record gives confidence in its business model, and the hedging strategy protects the dividend from a significant slump in the price of oil. That said, hedging is an inexact science at best, and investors should assume the dividend will be under threat if the price of oil falls significantly.\nAll told, Vitesse presents an interesting option for investors who are bullish on oil and want to express that view by investing in oil stocks. It is also a good way for Chevron investors to put some cash to work in energy stocks while waiting for a resolution of the Hess acquisition issue.\nShould you invest $1,000 in Vitesse Energy right now?\nBefore you buy stock in Vitesse Energy, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Vitesse Energy wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $791,929!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nLee Samaha has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Chevron, Chord Energy, EOG Resources, and Vitesse Energy. The Motley Fool has a disclosure policy.\nForget Chevron, Buy This Magnificent High-Yield Oil Stock Instead was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/Forget-Chevron-Buy-Magnificent-High-220300834.Html", "Sentiment_Score": 0.0400208756, "Sentiment_Category": "neutral"}, {"Ticker": "CVX", "Time": "2024-07-13T11:34:00.000Z", "Headline": "Prediction: This Will Be Occidental Petroleum's Next Big Move", "Summary": "Occidental Petroleum (NYSE: OXY) is no stranger to making big moves. It agreed to buy CrownRock for $12 billion last year. Meanwhile, it outbid Chevron to buy Anadarko Petroleum for $55 billion in 2019.\nLike the Anadarko deal before it, Occidental is using a lot of debt to fund its CrownRock purchase. That will likely lead to another big move by the oil giant. I predict it will sell its stake in master limited partnership (MLP) Western Midstream (NYSE: WES). Here's why a sale would make sense, and who might buy its interest in the midstream company.\nA sensible swap\nOccidental Petroleum has been among the many participants in a wave of mergers sweeping across the oil sector over the past year. Exxon kicked off the current wave with its roughly $60 billion deal for Pioneer Natural Resources in early October. Chevron quickly followed that up by agreeing to buy Hess for $53 billion a few weeks later. Occidental followed those leaders with its agreement to buy CrownRock for $12 billion in December.\nWhereas Exxon and Chevron agreed to all-stock deals, Occidental is primarily funding its CrownRock purchase with debt. It's issuing $9.1 billion of new debt and assuming CrownRock's $1.2 billion of debt to fund the deal, while only issuing about $1.7 billion of new stock. That debt-heavy financing strategy is risky, considering it took a similar approach to fund the Anadarko deal. That strategy backfired when crude prices crashed in early 2020, causing severe financial stress for Occidental.\nOccidental plans to quickly pay down debt following the close of its CrownRock deal. It intends to reduce its debt principal by at least $4.5 billion within 12 months of closing the deal by using its free cash flow and the proceeds from a new $4.5 billion to $6 billion divestiture program.\nWhile Occidental has many assets it could sell, monetizing its stake in Western Midstream would likely enable it to achieve its debt reduction target in one deal. The oil company owns a 49.9% interest in the MLP and 2% of its operating company, which it acquired when it bought Anadarko. With a market cap of $15.5 billion, Occidental's interest is worth around $8 billion.\nSelling its interest in Western Midstream would, in a sense, enable Occidental to trade its stake in that noncore asset for CrownRock, which will enhance its core position in the Permian Basin. While the company would lose the stable cash flow the MLP distributes to investors, it could quickly pay off a meaningful amount of debt.\nLots of potential buyers\nThe midstream sector has also undergone a lot of consolidation in the past year. Leading MLP Energy Transfer acquired fellow MLP Crestwood Equity Partners for $7.1 billion last year. It recently followed that deal up by agreeing to acquire WTG Midstream for nearly $3.3 billion. Meanwhile, Oneok merged with MLP Magellan Midstream Partners in a transformational $18.8 billion deal last year.\nSeveral other midstream companies have acquired smaller companies or assets over the past year. For example, Enterprise Products Partners bought out several joint ventures from Western Midstream for $400 million earlier this year.\nMost midstream companies have the financial flexibility to make an acquisition if the right deal comes along. Western Midstream would be a great strategic fit for many companies in the sector. They could purchase Occidental's stake (likely with a mix of cash and stock) and then buy out the rest of the company from public shareholders in the future.\nPrivate equity infrastructure funds are another potential buyer pool. For example, leading infrastructure fund manager Brookfield Asset Management and its affiliate Brookfield Infrastructure could acquire Occidental's stake in Western Midstream for cash. They could let the remaining interest in the company remain publicly traded or offer outside investors the same terms. An infrastructure fund would likely be able to close a deal faster and could pay all cash for Occidental's stake, potentially giving this group an advantage over strategic buyers.\nA sale makes so much sense\nOccidental Petroleum will need to quickly sell assets after it closes its CrownRock deal to repay debt. I predict it will decide to sell its stake in Western Midstream. There should be lots of potential buyers, which could enable it to get a great price. A sale would quickly boost the company's balance sheet by monetizing a noncore asset to fund a deal that enhances its core position.\nShould you invest $1,000 in Occidental Petroleum right now?\nBefore you buy stock in Occidental Petroleum, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Occidental Petroleum wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $780,654!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nMatt DiLallo has positions in Brookfield Asset Management, Brookfield Infrastructure Corporation, Brookfield Infrastructure Partners, Chevron, Energy Transfer, and Enterprise Products Partners. The Motley Fool has positions in and recommends Brookfield Asset Management and Chevron. The Motley Fool recommends Brookfield Infrastructure Partners, Enterprise Products Partners, ONEOK, and Occidental Petroleum. The Motley Fool has a disclosure policy.\nPrediction: This Will Be Occidental Petroleum's Next Big Move was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/Prediction-Occidental-Petroleums-Next-Big-113400399.Html", "Sentiment_Score": 0.1337598115, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-13T09:42:00.000Z", "Headline": "Warren Buffett Is Betting Nearly $35 Billion That This Conventional Wisdom Is Wrong", "Summary": "Hotter temperatures are causing climate-change concerns to intensify, and countries across the world are scrambling to reduce their carbon dioxide emissions. So are major corporations. Wind and solar energy are now often more cost-effective than coal, natural gas, and oil in generating electricity. Some governments are incentivizing the adoption of electric vehicles.\nIt shouldn't be surprising, therefore, that the conventional wisdom says the demand for fossil fuels will decline in the coming years. Not everyone agrees, though. Warren Buffett is betting nearly $35 billion that this conventional wisdom is wrong.\nBuffett's biggest contrarian bet\nChevron (NYSE: CVX) ranks as Berkshire Hathaway's fourth-largest holding, with the conglomerate's position worth nearly $19.1 billion. Buffett began buying the oil and gas giant in the fourth quarter of 2020 when the energy industry was on the ropes due to the COVID-19 pandemic.\nSure, Buffett trimmed Berkshire's stake in Chevron by 2.5% earlier this year. However, that move followed a purchase of 15.8 million shares of the oil company in the previous quarter that boosted Berkshire's position by 14.4%.\nChevron isn't on board with the view that the demand for fossil fuels will drop. The company increased its worldwide production of oil and gas by 12% year over year in the first quarter of 2024. It projects even higher production over the next three years.\nBecause of its optimism, Chevron has invested in several major projects in the Gulf of Mexico with start-ups in 2024 and 2025. It's also investing to increase production capacity at the Tamar gas field in Israel.\nNipping at Chevron's heels\nOccidental Petroleum (NYSE: OXY) trails behind Chevron as Berkshire's fifth-largest position. The conglomerate's stake in Occidental Petroleum is worth nearly $15.7 billion. I predict the oil producer will become a bigger part of Buffett's portfolio.\nBuffett proclaimed Occidental as one of eight stocks he expects Berkshire would \"maintain indefinitely\" in his annual shareholder letter earlier this year. The legendary investor praised the company's CEO, stating, \"Under Vicki Hollub's leadership, Occidental is doing the right things for both its country and its owners.\"\nAfter two years of aggressive buying, Berkshire now owns 28.8% of Occidental. It holds warrants that allow it to further increase its stake at a fixed price.\nBuffett noted in the shareholder letter that he isn't interested in fully owning Occidental. However, in 2022, Berkshire obtained regulatory approval to acquire up to 50% of the oil company.\nLike Chevron, Occidental is focused on expanding production. The company's pending $12 billion acquisition of Midland-based oil and gas producer Crownrock is a case in point.\nHas the \"Oracle of Omaha\" made a smart wager?\nBuffett is widely known as the \"Oracle of Omaha,\" but he readily admits he makes mistakes. Is his big bet against the conventional wisdom about fossil fuels one of them -- or is it a smart wager?\nI think it's the latter. And I believe Chevron and Occidental are playing key roles in ensuring the long-term viability of oil and gas.\nBoth companies have invested heavily in carbon-capture technology. Hollub told NPR in December 2023 that if this technology fulfills its potential, \"there's no reason not to produce oil and gas forever.\"\nBuffett knows he's taking a risk. He told Berkshire Hathaway shareholders, \"[T]he economic feasibility of this technique [carbon capture] has yet to be proven.\" However, Buffett has made big bets in the past that paid off handsomely. I suspect this one will, too.\nShould you invest $1,000 in Chevron right now?\nBefore you buy stock in Chevron, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Chevron wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $780,654!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nKeith Speights has positions in Berkshire Hathaway and Chevron. The Motley Fool has positions in and recommends Berkshire Hathaway and Chevron. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\nWarren Buffett Is Betting Nearly $35 Billion That This Conventional Wisdom Is Wrong was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/Warren-Buffett-Betting-Nearly-35-094200722.Html", "Sentiment_Score": 0.1034738719, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-12T15:45:08.000Z", "Headline": "Why Chevron (CVX) is a Great Dividend Stock Right Now", "Summary": "All investors love getting big returns from their portfolio, whether it's through stocks, bonds, ETFs, or other types of securities. But for income investors, generating consistent cash flow from each of your liquid investments is your primary focus.\nWhile cash flow can come from bond interest or interest from other types of investments, income investors hone in on dividends. A dividend is that coveted distribution of a company's earnings paid out to shareholders, and investors often view it by its dividend yield, a metric that measures the dividend as a percent of the current stock price. Many academic studies show that dividends account for significant portions of long-term returns, with dividend contributions exceeding one-third of total returns in many cases.\nChevron in Focus\nBased in San Ramon, Chevron (CVX) is in the Oils-Energy sector, and so far this year, shares have seen a price change of 4.09%. The oil company is paying out a dividend of $1.63 per share at the moment, with a dividend yield of 4.2% compared to the Oil and Gas - Integrated - International industry's yield of 2.15% and the S&P 500's yield of 1.57%.\nTaking a look at the company's dividend growth, its current annualized dividend of $6.52 is up 7.9% from last year. Chevron has increased its dividend 5 times on a year-over-year basis over the last 5 years for an average annual increase of 6.22%. Any future dividend growth will depend on both earnings growth and the company's payout ratio; a payout ratio is the proportion of a firm's annual earnings per share that it pays out as a dividend. Chevron's current payout ratio is 52%. This means it paid out 52% of its trailing 12-month EPS as dividend.\nEarnings growth looks solid for CVX for this fiscal year. The Zacks Consensus Estimate for 2024 is $13.18 per share, which represents a year-over-year growth rate of 0.38%.\nBottom Line\nInvestors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. It's important to keep in mind that not all companies provide a quarterly payout.\nHigh-growth firms or tech start-ups, for example, rarely provide their shareholders a dividend, while larger, more established companies that have more secure profits are often seen as the best dividend options. During periods of rising interest rates, income investors must be mindful that high-yielding stocks tend to struggle. That said, they can take comfort from the fact that CVX is not only an attractive dividend play, but is also a compelling investment opportunity with a Zacks Rank of #2 (Buy).\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Why-Chevron-Cvx-Great-Dividend-154508947.Html", "Sentiment_Score": 0.1709820777, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-12T15:01:00.000Z", "Headline": "Equinor (EQNR) Gets Drilling Permit to Explore Norwegian Sea", "Summary": "Equinor ASA EQNR has received the green light from the Norwegian Offshore Directorate to drill a wildcat well in the Norwegian Sea. Equinor has been granted the drilling permit for wellbore 6610/7-3 within the Production License (PL) 1014.\nEQNR is the operator of PL 1014, holding an 80% stake in the license. The remaining 20% is owned by OKEA. Per the permit, the entry date has been set for October 2024.\nDrilling a wildcat well involves significant risk due to the high degree of uncertainty in discovering oil and gas reserves. Equinor has contracted the Deepsea Atlantic rig owned by Odfjell Drilling to carry out drilling activities.\nThe Deepwater Atlantic is a sixth-generation semi-submersible rig capable of operating in deepwater and harsh environments. The unit is a dual derrick, dynamically positioned rig with enhanced GVA 7500 designs. The maximum drilling capacity of the rig is 10,670 meters. It can operate in water depths of up to 3000 meters.\nZacks Rank and Key Picks\nCurrently, EQNR carries a Zacks Rank #3 (Hold).\nSome better-ranked stocks in the energy sector are SM Energy SM, Hess Midstream Partners LP HESM and Chevron Corporation CVX. SM Energy presently sports a Zacks Rank #1 (Strong Buy), while Hess Midstream and Chevron carry a Zacks Rank #2 (Buy) each. You can see the complete list of today’s Zacks #1 Rank stocks here.\nSM Energy is an upstream energy firm operating in the prolific Midland Basin and the South Texas regions. For 2024, the company expects its production to increase from the prior-year reported figure, signaling a bright production outlook.\nHess Midstream owns, operates, develops and acquires a wide range of midstream assets, providing services to Hess Corporation and other third-party customers. The partnership has a stable fee-based revenue model secured via long-term commercial contracts. Since Hess Midstream operates through 100% fee-based contracts, it is exposed to minimal commodity price risks.\nChevron is one of the largest publicly traded oil and gas companies in the world, with its operations spread around the globe. It is currently in the process of acquiring Hess Corporation. The acquisition is seen as a major win for Chevron, as it will give the company access to Hess' high-quality assets in Guyana and the Bakken Formation.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nHess Midstream Partners LP (HESM) : Free Stock Analysis Report\nEquinor ASA (EQNR) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Equinor-Eqnr-Gets-Drilling-Permit-150100204.Html", "Sentiment_Score": 0.7009683251, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-12T13:56:00.000Z", "Headline": "Hess (HES) Faces Regulatory Hurdles Amid Chevron Merger Delay", "Summary": "Hess Corporation HES, entangled in a high-stakes merger with Chevron Corporation CVX, finds itself navigating regulatory uncertainties that threaten to prolong the completion of a pivotal $53-billion deal, per recent reports by Reuters and Bloomberg News.\nThe U.S. Federal Trade Commission (“FTC”) is expected to conduct a comprehensive review of the proposed merger in the third quarter of 2024.\nOriginally slated for closure in the first half of 2024, the merger has encountered significant setbacks chiefly due to an arbitration initiated by Exxon Mobil Corporation XOM. ExxonMobil’s claim of a right of first refusal over Hess’ prized assets in Guyana has triggered a prolonged legal process, complicating the timeline for regulatory approval.\nHess, a key player in Guyana's lucrative Stabroek block, alongside ExxonMobil and China's CNOOC Ltd, owns a crucial 30% stake in the venture. The partnership is aimed at doubling oil and gas production to 1.3 million barrels per day by 2027. Despite these ambitious growth plans, the unresolved arbitration poses uncertainties for Hess's strategic initiatives in the region.\nHess and Chevron had initially aimed to conclude the merger by the first half of this year. However, with the FTC's review now expected to extend into the latter half of 2024, the timeline remains uncertain, pending the resolution of the arbitration dispute.\nHess stated that the arbitration process is advancing, with hopes of resolving by the end of 2024. Despite ExxonMobil's indications that the proceedings could stretch into 2025, Hess is optimistic about concluding the legal dispute this year.\nThe FTC's decision to delay its verdict on the merger until the arbitration case is settled, potentially as late as the fourth quarter, poses further challenges for Chevron and Hess. This regulatory scrutiny is part of broader antitrust measures impacting major deals within the oil sector this year, reflecting the FTC's rigorous approach to consolidations that could influence market dynamics.\nAs both companies await the commencement of the arbitration panel's review, which is expected to outline proceedings soon, the outcome remains pivotal for the future trajectory of Hess and its merger ambitions with Chevron.\nWhile the Chevron-Hess merger promises substantial synergies in the global energy landscape, regulatory hurdles and legal complexities underscore the arduous path toward its realization. The resolution of the arbitration with ExxonMobil stands as a critical determinant in shaping the timeline and viability of this landmark consolidation in the oil and gas sector.\nZacks Ranks & Other Stock to Consider\nHess currently flaunts a Zacks Rank #1 (Strong Buy).\nInvestors interested in the energy sector may look at another top-ranked company mentioned below. The company also presently sports a Zacks Rank #1. You can see the complete list of today’s Zacks #1 Rank stocks here.\nUSA Compression Partners, LP USAC is one of the largest independent natural gas compression service providers across the United States in terms of fleet horsepower. USAC earns its revenues from the overall horsepower use of natural gas transported rather than the price. As such, the partnership is largely insulated from fluctuations in commodity prices.\nThe Zacks Consensus Estimate for USAC’s 2024 and 2025 EPS is pegged at 77 cents and 98 cents, respectively. USA Compression Partners has a Zacks Style Score of B for Growth. It has witnessed upward earnings estimate revisions for 2024 and 2025 in the past 60 days.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nHess Corporation (HES) : Free Stock Analysis Report\nUSA Compression Partners, LP (USAC) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Hess-Hes-Faces-Regulatory-Hurdles-135600548.Html", "Sentiment_Score": -0.7626986504, "Sentiment_Category": "bearish"}, {"Ticker": "CVX", "Time": "2024-07-12T13:53:39.000Z", "Headline": "3 Energy Stocks to Buy Ahead of the 2024 Presidential Election", "Summary": "It’s no secret that this year’s presidential election in the United States will significantly impact the stock market. Whether the market reacts with optimism or pessimism to the party and candidate that wins, there will be an overall shift in market dynamics. Considering the outcome of the first presidential debate back in June and the overall attitude toward President Joe Biden’s health, the current picture seems to be in favor of former President Donald Trump.\nMuch can change by November, but it’s a good idea to start preparing your portfolio for the inevitable reaction the market will have following the presidential election. Moreover, the energy sector will likely experience changes due to the differences between Trump’s outlook on fossil fuels and Biden’s. As such, energy stocks dependent on the extraction of oil and natural gas are likely to experience a generous bump if Trump turns back toward his pro-fracking and pro-domestic production policies.\nChevron (CVX)\nChevron logo on blue sign in front of skyscraper building\nSource: Jeff Whyte / Shutterstock.com\nRegardless of one’s stance on fossil fuels, Chevron (NYSE:CVX) remains a crucial player in the global energy market and stands to gain a lot from another Trump presidency. The company has constantly had to skirt around the Biden administration’s tight issuance of permits. It also faced recent pressure from the Federal Trade Commission regarding its Hess (NYSE:HES) acquisition to gain a foothold in Guyana’s oil-rich basins.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nWith Trump back in office, Chevron might have access to more exploration permits, and the FTC’s regulatory pressure could soften. Should these things occur in tandem, CVX stock would certainly see a boom following a Trump victory.\nFrom a financial standpoint, CVX remains healthily in the green and offers a 4.19% dividend yield. Thus, CVX is attractive to long-term dividend-seeking investors who are realistic about the future of fossil fuels. As such, investors should keep an eye on CVX and energy stocks like it as the presidential election approaches.\nHalliburton (HAL)\nThe Halliburton (HAL) logo on the website homepage. HAL stock price prediction.\nSource: Casimiro PT / Shutterstock.com\nArguably the most controversial company on this list, Halliburton (NYSE:HAL) remains a dominant force in the fracking industry. That’s because it remains one of the technological experts, having contributed to the development of fracking technology in the 1940s. Today, Halliburton offers a comprehensive range of services, from pressure pumps to fluid design. This positions the company to benefit significantly from any potential governmental shifts regarding fracking regulation.\nConsidering Trump’s prior support of fracking during his first presidency and his current campaign promises of new pipelines and renewed fracking on federal land, HAL stock has much to gain from a Trump win in November.\nMoreover, the company consistently surpasses earnings-per-share expectations and concluded Q1 FY2024 with $5.8 billion in revenue and a 10.44% operating margin. As such, for investors seeking substantial returns in the event of a new U.S. president, Halliburton presents a promising opportunity.\nBaker Hughes (BKR)\nThe Baker Hughes (BKR) sign and office building in Houston, Texas.\nSource: JHVEPhoto / Shutterstock.com\nBaker Hughes (NASDAQ:BKR), a leading American specialist in oilfield services and equipment, which means it also has much to gain from Trump’s return. The company serves the oil and gas industry with a comprehensive portfolio of equipment and digital technologies designed to boost operational efficiency and safety.\nThis focus has made Baker Hughes a notable sustainability-oriented player in the fracking industry. Yet, that’s not as relevant as the business boom the company will see once fracking returns to its Trump-era successes. Baker Hughes’ strong reputation positions itself advantageously in the event of changing government regulations on fracking.\nMoreover, BKR stock has successfully weathered the last four years of the Biden administration’s policies on domestic drilling and extraction. In fact, BKR is up 35% over the last five years and continues to improve its revenue YOY.\nOn the date of publication, Viktor Zarev did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\nViktor Zarev is a scientist, researcher, and writer specializing in explaining the complex world of technology stocks through dedication to accuracy and understanding.\nMore From InvestorPlace\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\nThe post 3 Energy Stocks to Buy Ahead of the 2024 Presidential Election appeared first on InvestorPlace.", "Link": "Https://Finance.Yahoo.Com/News/3-Energy-Stocks-Buy-Ahead-135339074.Html", "Sentiment_Score": 0.1024069265, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-12T11:52:00.000Z", "Headline": "Top 4 Blue-Chip Stocks Picks to Strengthen Your Portfolio", "Summary": "U.S. stock markets have been on an impressive bull run over the past 18 months. However, the Dow, despite participating in the rally, lagged its peers, the S&P 500 and the Nasdaq Composite. Wall Street’s blue-chip index is up 5.4% year to date. On the other hand, the broad-market S&P 500 Index and the tech-heavy Nasdaq Composite have climbed 17.8% and 23.8%, respectively.\nMeanwhile, the Dow recorded its all-time high of 40,077.40 on an intraday basis on Mar 20 and 40,003.59 on a closing basis on May 17. Technically, at its current level of 39,753.75, the Dow is well above its 50-day and 200-day moving averages of 39,035.26 and 37,365.23, respectively.\nThe 50-day moving average line is generally recognized as a short-term trendsetter in financial literature, while the 200-day moving average is considered a long-term trendsetter. Historically it has been noticed in the technical analysis space that whenever the 50-day moving average line surges ahead of the 200-day moving average line, a long-term uptrend for the asset (in this case the Dow Index) becomes a strong possibility.\nOur Top Picks\nWe have narrowed our search to four Dow stocks that have strong earnings growth potential for the rest of 2024. These stocks have seen positive earnings estimate revisions in the last 60 days. Finally, each of our picks carries either a Zacks Rank #1 (Strong Buy) or 2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nThe chart shows the price performance of our four picks year to date.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nAmazon.com Inc. AMZN is gaining on solid Prime momentum owing to ultrafast delivery services and a strong content portfolio. A deepening focus on generative AI is a major plus. Strengthening relationships with third-party sellers is a positive for AMZN.\nThe strong adoption rate of AWS is aiding AMZN’s cloud dominance. Improving Alexa skills along with robust smart home offerings are tailwinds. The advertising business is also pretty robust. AMZN enjoys a strong global presence and solid momentum among small and medium businesses. Growing capabilities in grocery, pharmacy, healthcare and autonomous driving are its other positives.\nZacks Rank #2 Amazon.com has an expected revenue and earnings growth rate of 11% and 57.9%, respectively, for the current year. The Zacks Consensus Estimate for current-year earnings has improved 0.9% over the last 60 days.\nApple Inc. AAPL has been playing catch-up in the AI space compared with Alphabet, Microsoft and Amazon, its peers in the “magnificent seven” group. Following the launch of Apple Intelligence, AAPL’s competitive position is expected to improve. Moreover, AAPL is benefiting from increasing customer engagement in the services segment.\nThe expanding content portfolio of Apple TV+ and Apple Arcade helped drive subscriber growth. AAPL’s top-line benefits from strong growth in emerging markets and growing adoption of its devices among enterprises.\nZacks Rank #2 Apple has an expected revenue and earnings growth rate of 0.8% and 7.5%, respectively, for the current year (ending September 2024). The Zacks Consensus Estimate for current-year earnings has improved 0.2% over the last 30 days.\nWalmart Inc. WMT has been gaining from its highly diversified business with contributions from various segments, channels and formats. WMT has been benefiting from an increase in in-store and digital channel traffic due to its robust omnichannel initiatives. Store-fulfilled delivery sales jumped 50% in the first quarter of fiscal 2025.\nWalmart’s strategic focus on enhancing delivery services has also been rewarding, as evidenced by the constant increase in the market share for groceries. Upsides like these, along with growth in the advertising business, fueled WMT’s first-quarter results and led to an encouraging fiscal 2025 view.\nZacks Rank #1 Walmart has an expected revenue and earnings growth rate of 4.3% and 9.5%, respectively, for the current year (ending January 2025). The Zacks Consensus Estimate for current-year earnings has improved 3% over the last 60 days.\nChevron Corp. CVX is positioned as one of the top global integrated oil firms, set for sustainable production growth, particularly due to its dominant position in the lucrative Permian Basin. Further, the recent acquisition of Hess Corporation is expected to significantly strengthen CVX’s presence in oil-rich Guyana.\nCVX seems one of the best-placed global integrated oil companies to achieve sustainable production ramp-up. We expect the company's average output during 2024 to rise 4-7% year over year, due to the PDC Energy acquisition and robust output in the showpiece Permian Basin region.\nZacks Rank #2 Chevron has an expected revenue and earnings growth rate of 2.3% and 0.4%, respectively, for the current year. The Zacks Consensus Estimate for current-year earnings has improved 0.1% over the last 30 days.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nChevron Corporation (CVX) : Free Stock Analysis Report\nWalmart Inc. (WMT) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Top-4-Blue-Chip-Stocks-115200516.Html", "Sentiment_Score": 0.8498823643, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-12T10:02:00.000Z", "Headline": "Here's Why You Should Retain Range Resources (RRC) Stock", "Summary": "Range Resources Corporation RRC is a leading natural gas exploration and production company. For 2025, the company is likely to see earnings growth of 46.7%.\nWhat’s Favoring the Stock?\nIn its latest short-term energy outlook, the U.S. Energy Information Administration revealed that it expects Henry Hub spot natural gas spot average price to be higher in the second half of this year at $2.90 per million British thermal units (MMBtu) compared with $2.10 per MMBtu in the first half.\nAlso, for 2025, EIA expects the price of the commodity to be higher at $3.30 per MMBtu than the projected price of $2.50 for this year. This can benefit the leading natural gas producer, Range Resources, which carries a Zacks Rank #3 (Hold).\nRRC has decades of low-risk drilling inventory in Appalachia, brightening its production outlook. The company has lower well costs per lateral foot than many other upstream players.\nIt has a strong focus on strengthening its balance sheet. Over the past several years, RRC has consistently reduced its net debt load. Notably, the company has the lowest emission intensity among the upstream companies in the United States.\nRisks\nIn spite of the positives, RRC’s overall operations are significantly exposed to extreme oil and natural gas price volatility.\nStocks to Consider\nBetter-ranked energy companies include Matador Resources Company MTDR, Chevron Corporation CVX and SM Energy Company SM. While SM Energy sports a Zacks Rank #1 (Strong Buy), Matador Resources and Chevron carry a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nMatador Resources recently entered into a $1.91 billion agreement to expand its footprint in the prolific Delaware Basin. With the deal expected to close in the late third quarter of 2024, the company is projected to have more than 190,000 net acres in the Delaware Basin on a pro forma basis. Consequently, the company estimates that its production will exceed 180,000 barrels of oil equivalent per day, positioning it for significant growth and enhanced operational scale.\nChevron generates most of its earnings from its upstream operations. The integrated energy giant has a strong foothold in the Permian – the most prolific basin in the United States – where a significant portion of the energy major’s acreage has minimum royalty payments. Thus, CVX will generate handsome cashflows through its upstream business, banking on handsome oil prices.\nIn addition to maintaining disciplined capital spending, Chevron has a strong balance sheet, providing a solid foundation to rely on during unfavorable energy market conditions.\nTo expand its premier asset portfolio, SM Energy recently agreed to acquire 80% of XCL Resources’ oil and gas assets in the Uinta Basin for $2.04 billion. The value-driven acquisition, likely to close in September this year, will increase its inventory of net locations and boost its oil production. SM Energy is also committed to maintaining its strong balance sheet, which it can rely on during low oil prices.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nRange Resources Corporation (RRC) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nMatador Resources Company (MTDR) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Heres-Why-Retain-Range-Resources-100200795.Html", "Sentiment_Score": 0.0730387047, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-11T18:40:02.000Z", "Headline": "FTC Delays Chevron-Hess Decision to After Exxon Arbitration", "Summary": "(Bloomberg) -- The US Federal Trade Commission plans to delay its decision whether to block Chevron Corp.’s $53 billion takeover of Hess Corp. until after an arbitration case with Exxon Mobil Corp. is settled, according to people familiar with the matter.\nMost Read from Bloomberg\nBiden Vows to Stay in 2024 Race Even as NATO Gaffes Risk His Campaign\nBiden’s Putin-Zelenskiy Gaffe Deals Fresh Blow to Campaign\nTesla Delays Robotaxi Event in Blow to Musk’s Autonomy Drive\nStock Rotation Hits Megacaps on Bets Fed Will Cut: Markets Wrap\nJill Biden Has Some Explaining To Do\nThe case with Exxon, which claims to have a right of first refusal over Hess’s biggest asset in Guyana, will likely take at least until the fourth quarter, meaning the FTC’s review will extend several more months. The agency plans to announce its decision when the arbitration is finished, said the people, who asked not to be named discussing an internal agency matter.\nThe delay is yet another blow to the embattled deal, which is still far from completion nearly nine months after it was announced in October. The agency has made second requests for information for several large deals in the oil sector this year.\nThe FTC declined to comment. In separate statements, Chevron and Hess both said they expect to complete the agency’s review process during the third quarter.\n“We continue to expect to complete the FTC review process during the third quarter,” Hess said in a statement.\nUnless companies have an explicit timing agreement with the FTC, the agency has discretion on when to announce its decisions.\nShares of both companies fell on the news, pairing earlier gains. Hess was up 0.2% at 2:30 p.m., after earlier being up as much as 1.1%. Chevron shares were up 0.2%, after rising 1% earlier.\nThe FTC allowed Exxon’s takeover of Pioneer Natural Resources Co. to move forward after alleging Scott Sheffield, Pioneer’s founder and former CEO, colluded with OPEC officials and blocked him from serving on the Texas oil giant’s board. Sheffield rejected the claims.\nChevron’s agreement to buy Hess, its biggest deal in two decades, has faced several hurdles, leaving both companies in strategic limbo.\nIn March, Exxon, which discovered and operates Guyana’s Stabroek Block, accused Chevron of attempting to “circumvent” its right to buy Hess’s 30% stake in the 11 billion-barrel oil field. Chevron and Hess rejected the charge, saying Exxon’s right doesn’t apply because the deal is structured as a corporate takeover rather than an asset sale.\nBut the case went to arbitration at the International Chamber of Commerce, a process that could take until the fourth quarter at the earliest. Exxon’s CEO Darren Woods has warned it could take longer.\nIn May, Hess investors approved the Chevron takeover by a razor-thin majority of 51% after several large shareholders and Institutional Shareholder Services Inc. argued the vote should be delayed until after the arbitration case. The investors expressed concern that they would not receive Chevron dividends until the deal is complete, eroding the value of the transaction.\n--With assistance from Mitchell Ferman.\n(Adds company comments in fourth paragraph; updates shares)\nMost Read from Bloomberg Businessweek\nHow Rivian Became the Anti-Tesla\nUkraine Is Fighting Russia With Toy Drones and Duct-Taped Bombs\nLooser Visa Rules for Indian Travelers Stoke a Tourism Boom\nAt SpaceX, Elon Musk’s Own Brand of Cancel Culture Is Thriving\nHe’s Starting an Olympics Rival Where the Athletes Are on Steroids\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Ftc-Delays-Chevron-Hess-Decision-154717912.Html", "Sentiment_Score": -0.5195825696, "Sentiment_Category": "bearish"}, {"Ticker": "CVX", "Time": "2024-07-11T13:37:52.000Z", "Headline": "US court's reversal of 'Chevron deference' may limit investments in EVs, safer chemicals, Jefferies says", "Summary": "(Reuters) - The U.S. Supreme Court's recent decision to overturn a 1984 precedent, which allowed government agencies to interpret unclear laws, could curb investments in electric vehicles and the development of safer chemicals used in manufacturing, according to a Jefferies analyst.\nThe precedent, known commonly as the \"Chevron deference\", arose from a ruling involving the oil company Chevron, that called for judges to defer to federal agencies for reasonable interpretations of ambiguous U.S. laws.\nWHY IT'S IMPORTANT\nSince judges are now required to interpret statutes independently, instead of deferring to agencies such as the Environmental Protection Agency (EPA), trade groups and businesses could bring in more litigation challenging agency rules, said Jefferies analyst Saree Boroditsky, in a note to clients.\nThis could limit investments in the EV transition and development of alternatives to PFAS or \"forever chemicals\" that have been found in drinking water, air and myriad consumer goods despite being toxic to human health, Boroditsky added.\nAgencies could also stop issuing regulations that have a more ambitious scope, the analyst added\nTHE CONTEXT\nRegulations related to \"forever chemicals\" and the emission standards for light- and heavy-duty vehicles already see challenges from manufacturing groups on the grounds that the respective agencies are exceeding their authority or that the rules lack explicit Congressional authorization.\nThe overturning of the precedent will only further incentivize industry groups, said Boroditsky.\nWHICH COMPANIES COULD BE IMPACTED\nBoroditsky highlights that water technology company Xylem Inc could be negatively impacted if PFAS investments are curbed.\nIf the EV transition is slowed because of the ruling, companies that manufacture electrical components such as TE Connectivity, Amphenol Corp, Sensata Technologies Holding and Littelfuse, Inc could be affected, said Boroditsky.\n(Reporting by Ananta Agarwal in Bengaluru; Editing by Vijay Kishore)", "Link": "Https://Finance.Yahoo.Com/News/Us-Courts-Reversal-Chevron-Deference-133752669.Html", "Sentiment_Score": -0.4193489552, "Sentiment_Category": "bearish"}, {"Ticker": "CVX", "Time": "2024-07-11T13:27:00.000Z", "Headline": "3 Energy Companies to Gain on Rock Solid Balance Sheet", "Summary": "The price of West Texas Intermediate (WTI) crude oil is trading at more than the $80 per barrel mark and is likely to remain strong this year. The U.S. Energy Information Administration (“EIA”) projects WTI oil to average $82.03 per barrel in 2024, a notable increase from last year's $77.58. EIA noted that ongoing reductions in global oil stockpiles are expected to continue pushing commodity prices upward.\nWhile crude prices stay favorable, the likelihood of the commodity reaching $100 per barrel, as seen in 2022, is extremely slim. Additionally, EIA expects the annual GDP growth rate to decline to 2.4% in 2024 from last year's 2.5%. For 2025, the growth rate is projected to fall further to 1.8%. Thus, the forecasted slowdown of the GDP growth rate may consequently dampen energy demand, thereby negatively impacting commodity prices.\n3 Stocks to Gain\nThe current scenario highlights the need to keep a close watch on major energy companies like Exxon Mobil Corporation XOM, Chevron Corporation CVX, and ConocoPhillips COP, which are known for their strong balance sheet. This is because these energy giants can rely on their financial stability to navigate a volatile and uncertain business environment. While Chevron has a Zacks Rank #2 (Buy), ExxonMobil and ConocoPhillips carry a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nChevron and ExxonMobil boast robust balance sheet, enabling them to withstand challenging business environments. XOM’s total debt-to-capitalization ratio stands at almost 16%, while Chevron's is at 11.9%, both significantly lower than the 24.2% average for composite stocks in the Zacks Oil & Gas Integrated International industry. Over the past three years, these industry leaders have consistently maintained lower debt-to-capitalization ratios, supported by strong oil prices that enhance their financial positions. This financial strength positions them well for future gains.\nConocoPhillips has secured a promising production outlook by capitalizing on its extensive drilling inventory and diverse upstream assets. Compared to composite stocks belonging to the industry, the leading upstream energy company has significantly less reliance on debt capital. This robust balance sheet positions ConocoPhillips to better withstand adverse business conditions. Like Chevron and ExxonMobil, favorable oil prices are also boosting COP’s financial performance.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nConocoPhillips (COP) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/3-Energy-Companies-Gain-Rock-132700833.Html", "Sentiment_Score": 0.9338282943, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-11T10:00:00.000Z", "Headline": "7 High-Growth Energy Stocks Ready to Explode", "Summary": "While the ideological machinery is seemingly focused on zero emissions, don’t be mistaken: the world is consuming energy-related resources at a blistering pace. This situation will likely only be exacerbated with global population growth combined with advanced technologies like artificial intelligence. Oh yeah, none of these developments are for “free.” Therefore, high-growth energy stocks make a lot of sense.\nI don’t even consider such a framework to be cynical, although I suppose it could be framed that way. Rather, we’re just dealing with logical deductions. More people, more power-hungry technologies, more resource consumption – it really is that simple. And that’s not to slight green infrastructure development. It’s just that we need all the help we can get.\nWhat does that mean? Well, fossil fuels, nuclear power, even coal will likely be relevant in the years ahead. It also helps in the meantime that the Republicans have a clear shot to gaining serious political power. They’re not exactly anti-hydrocarbons. With that in mind, below are high-growth energy stocks to consider.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nChevron (CVX)\nChevron (CVX) logo on gas station sign with \"diesel\" and \"food mart\" written underneath\nSource: Sundry Photography / Shutterstock.com\nWhen it comes to green solutions, Chevron (NYSE:CVX) isn’t exactly perched at the top of the list. However, when it comes to high-growth energy stocks, CVX deserves consideration. Sure, it’s a major player in the oil and gas integrated industry. Indeed, it’s one of the world’s supermajors. Nevertheless, shifting political tides bode well for the company.\nAdmittedly, the company has come across some challenges. In the past four quarters, Chevron’s average earnings per share landed at $3.07. However, analysts were expecting on average $3.15 during the same period. That led to a negative earnings surprise of 1.4%. Still, the Republicans are likely moving into power, which could lead to a hydrocarbon bonanza.\nAnother factor is that geopolitical turmoil could disrupt global oil supply chains in Europe and the Middle East. I imagine chaos would be the order of the day given former President Donald Trump’s ultracrepidarian perspectives on global affairs.\nI also imagine analysts recognize this. Therefore, CVX is a consensus strong buy with a $186.21 price target, implying nearly 22% upside.\nDiamondback Energy (FANG)\nDiamondback Energy (FANG) logo on its website to represent oil stocks. FANG stock\nSource: Pavel Kapysh / Shutterstock.com\nBased in Midland, Texas, Diamondback Energy (NASDAQ:FANG) operates in the hydrocarbon exploration and production segment. This is also known as the upstream component of the oil and gas value chain. An independent enterprise, Diamondback acquires and develops unconventional, onshore oil and natural gas reserves in the Permian Basin (located in West Texas).\nGeopolitically, the threat of oil supply chain disruptions could boost upstream entities located in friendly jurisdictions. It doesn’t get much friendlier than here at home. Further, a future Trump administration will likely bolster FANG through approval of various hydrocarbon initiatives. Therefore, the immediate horizon looks bright for Diamondback, making it one of the high-growth energy stocks.\nIn the trailing 12 months (TTM), the company posted net income of $3.18 billion or $17.73 per share. Revenue hit $8.27 billion in the cycle. For fiscal 2024, analysts anticipate nearly 6% expansion in EPS to $19.08. On the top line, revenue could rise 9% to $9.17 billion. Also, by fiscal 2025, we could see gargantuan growth to $15.8 billion in sales.\nCheniere Energy (LNG)\nLNG stock: the Cheniere logo displayed on a phone\nSource: IgorGolovniov / Shutterstock.com\nHeadquartered in Houston, Texas, Cheniere Energy (NYSE:LNG) falls under the oil and gas midstream segment. This area of the hydrocarbon industry deals primarily with storage and transportation. As you might guess from the ticker symbol, Cheniere specializes in liquefied natural gas or LNG. It’s always been relevant because LNG is a critical commodity. However, demand for it could rise.\nGeopolitically, Russia is a major provider of global LNG. It’s also providing something else in the way of military belligerence. And that’s where circumstances get tricky because of the (likely) incoming Trump administration. European leaders generally have a drastically different view of the world than that of “MAGA” Republicans. One can imagine friction if not outright chaos in the European theater.\nWith that in mind, Cheniere is a higher-risk entity. Still, I also believe that it’s one of the high-growth energy stocks to consider. Yes, on paper, analysts are targeting a 22.2% decline in sales to $15.86 billion this year compared to last. Still, the great need for LNG now that Russia is effectively off the table for western nations could boost Cheniere’s share price.\nPermian Resources (PR)\nRise in gasoline prices concept with double exposure of digital screen with financial chart graphs and oil pumps on a field. Oil prices and oil price predictions\nSource: Golden Dayz / Shutterstock.com\nAlso operating in the hydrocarbon exploration and production segment, Permian Resources (NYSE:PR) is an independent oil and natural gas company. It focuses on the development of crude oil and related liquids-rich natural gas reserves in the U.S. Its main area of operation is on the Delaware Basin, which is a sub-basin of the famous Permian.\nFinancially, the company has encountered some choppy weather in the second and third quarters of last year. During that time, the company’s EPS was well below expectations. However, the performance picked up in the last two quarters. Overall, in the trailing year, Permian managed an average EPS of 32 cents. That said, it did slip below the target of 35 cents.\nIn the TTM period, Permian posted net income of $520.76 million or $1.18 per share. Revenue hit $3.75 billion and is on a growth trek. Enticingly, analysts anticipate a 32.26% bump in EPS to $1.64 by the end of this year. More impressively, revenue could soar almost 65% to $5.14 billion. Therefore, PR makes a compelling case for high-growth energy stocks.\nCameco (CCJ)\nCCJ Stock: Hand in long yellow glove holding a chunk of uranium material\nSource: shutterstock.com/RHJPhtotoandilustration\nWhen discussing high-growth energy stocks, it doesn’t make sense to just talk about hydrocarbons although that’s naturally where the focal point is. At this juncture, it also makes sense to consider nuclear energy, which brings us to Cameco (NYSE:CCJ). Primarily, Cameco is involved in the exploration, mining, milling, acquisition and distribution of uranium concentrate (also known as yellowcake).\nUranium of course carries indirect controversies due to fallout concerns. However, because the tech ecosystem has thrown (seemingly) its full weight into AI, nuclear cannot be ignored. The power consumption is too great. And as Goldman Sachs recently suggested, the productivity gains are not yet worth the costs. However, the machinery just keeps moving forward, which means more consumption will be on the horizon.\nThat’s a problem for society but a potential godsend for the uranium industry. As one of the leaders in the space, Cameco should benefit. Yes, its earnings performances in the past year have not been quite up to snuff. Nevertheless, that could change in the years ahead.\nFor fiscal 2024, analysts see EPS expansion of almost 32% to 75 cents. The top line could rise 17.5% to $2.22 billion. It’s one of the high-growth energy stocks to keep on your radar.\nPeabody Energy (BTU)\nPeabody Energy (BTU) coal mining company logo seen displayed on smart phone\nSource: IgorGolovniov / Shutterstock.com\nSwitching gears yet again, let’s talk about Peabody Energy (NYSE:BTU). Falling under the thermal coal industry, Peabody Energy engages in the coal mining business in the U.S. and several other countries, including Japan, India, Brazil and France, to name but a few. To be sure, coal doesn’t exactly seem relevant in the current century. Yet it could make a comeback.\nLet me be clear: BTU stock represents a high-risk, questionable-reward opportunity. However, I’m putting it out there because of the math. Essentially, you have the perfect storm of global population growth, burgeoning technologies like AI and the worldwide distribution of said technologies. All that stuff isn’t free and it mainly comes at the cost of energy consumption.\nSo, hug a tree if you like. But the reality is that we probably require all the energy resources we can get. That may very well include coal. So, I understand that Peabody has been an earnings underperformer. It doesn’t look good in that context. As well, analysts project erosion in the business over the next two years.\nBut with Trump likely to be our next president (because President Biden is stubborn), I think BTU deserves a rethink.\nMatador Resources (MTDR)\n3D rendered two black oil barrels on digital financial chart screen with yellow numbers and rising, green, falling, red arrows on black background. Oil stocks\nSource: stockwars / Shutterstock.com\nBased in Dallas, Texas, Matador Resources (NYSE:MTDR) is another upstream specialist. An independent outfit, Matador focuses on the exploration, development, production and acquisition of oil and natural gas resources. Primarily, it operates in the hydrocarbon-rich regions of Southeast New Mexico and West Texas. Given its domestic focus, the coming political shift bodes well for MTDR stock.\nA key factor to consider is the company’s financial prowess. In the past four quarters, Matador’s EPS averaged $1.75. That beat out the estimate calling for $1.56 during the same period. Overall, the average earnings surprise came out to 11.53%. That’s a very solid showing considering that some hydrocarbon players encountered choppy weather.\nNotably, MTDR stock trades at 6.96X forward earnings, a modest premium to the 6.63X multiple that it printed over the past year. Further, the market prices shares at 2.31X trailing-year revenue. That’s below the past-year average of 2.36X.\nWhy is that important? Analysts project that by year’s end, EPS could rise 15.36% to $7.81. The top line could bump up 24.4% to $3.49 billion. In the following year, EPS could hit $9.38 on sales of $4.19 billion. It’s a compelling idea for high-growth energy stocks.\nOn the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\nA former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia.\nMore From InvestorPlace\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\nThe post 7 High-Growth Energy Stocks Ready to Explode appeared first on InvestorPlace.", "Link": "Https://Finance.Yahoo.Com/News/7-High-Growth-Energy-Stocks-100000105.Html", "Sentiment_Score": 0.1797725856, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-10T17:23:52.000Z", "Headline": "3 ‘Buy Now or Cry Later’ Stocks for Long-Term Wealth", "Summary": "Most investors are primarily concerned with building long-term wealth as opposed to capturing quick gains. Of course, those same investors would gladly reap short-term gains if they were reliable, but they aren’t. It remains incredibly difficult to identify stocks that will perform well over the short term. Yet, identifying stocks with the potential to create long-term wealth has proven easier.\nGiven time, companies with readily identifiable fundamental strengths tend to increase in value. These are the kinds of stocks you’re likely to find recommended by value investors such as Warren Buffett.\nInvesting in strong companies with durable competitive advantages is one of the best ways to build long-term wealth. These are the kind of companies that routinely maintain strong pricing advantages over the long term that create all kinds of beneficial internal economics. The companies discussed below certainly benefit from those factors and more, which is the reason to buy now.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nMicrosoft (MSFT)\nmicrosoft stock\nSource: Peteri / Shutterstock.com\nOne of the best reasons to believe Microsoft (NASDAQ:MSFT) stock will continue to create long-term wealth for investors is its forecast growth.\nMicrosoft reported just under $212 billion in sales in 2023. That figure is expected to approximately double by 2028. Given how successful the company has been in investing in artificial intelligence, it’s easy to see why Microsoft continues to be so loved.\nIt is one of the so-called hyperscaler companies looking to commoditize artificial intelligence. It is doing so by buying up massive quantities of AI chips and implementing them at its data centers.\nAs artificial intelligence becomes more and more a part of our lives Microsoft should become that much more valuable.\nThe strategy is highly logical and is part of a broader thinking that characterizes AI as the new digital gold. Outside of AI, Microsoft continues to be subsidized by the strength of its Office and Windows products. Microsoft has multiple ways to continue winning and creating long-term wealth.\nAmazon (AMZN)\nAn image of an Amazon logo on a building\nSource: Jonathan Weiss / Shutterstock.com\nAmazon (NASDAQ:AMZN) is another strong choice for investors looking for stocks that will create long-term wealth. I believe many investors automatically discount Amazon and other similarly sized companies for the simple fact that they believe past growth is not replicable.\nAfter all, Amazon reported $574 billion in revenues in 2023. It’s therefore easy to presume growth will slow due to reaching such a massive scale. Yet, it’s possible that Amazon could reach $1 trillion in sales by 2028. It is predicted to come very close as it will grow by roughly 70% over that period.\nWhat I particularly like about Amazon is the company’s substantial investment in Anthropic, for which it recently completed its $4 billion investment. I believe Amazon will benefit substantially from that investment as Anthropic is noted to take a slower, more pragmatic approach to AI development than rival OpenAI. That developmental approach is likely to yield better results in the enterprise space, which requires greater accuracy and where substantial revenues will flow from.\nExxon Mobil (XOM)\nExxon Retail Gas Location\nSource: Jonathan Weiss / Shutterstock.com\nExxon Mobil (NYSE:XOM) has long proven capable of creating long-term wealth. It is primarily an income-producing stock with much of its long-term wealth-creating ability coming from dividends. However, it also produces substantial share price gains as oil prices peak.\nWe now may be entering another such period as Brent crude surges past $86 per barrel. Analysts believe that it could peak above $90. Standard Chartered says the current supply deficit characterizing the third quarter will spill into the fourth quarter. That suggests Exxon Mobil will perform strongly throughout the remainder of 2024.\nAnd while investors should be able to capitalize on those supply shortfalls, there are other reasons to like ExxonMobil. Most investors will compare it to Chevron (NYSE:CVX), the other common Big Oil choice. But with a choice between the two, Exxon is better at creating more value than Chevron. The peak oil argument was overdone and companies like ExxonMobil continue to have the ability to create long-term wealth for investors.\nOn the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\nOn the date of publication, the responsible editor held a LONG position in XOM and CVX.\nAlex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.\nMore From InvestorPlace\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\nThe post 3 ‘Buy Now or Cry Later’ Stocks for Long-Term Wealth appeared first on InvestorPlace.", "Link": "Https://Finance.Yahoo.Com/News/3-Buy-Now-Cry-Later-172352244.Html", "Sentiment_Score": 0.0464918315, "Sentiment_Category": "neutral"}, {"Ticker": "CVX", "Time": "2024-07-10T13:26:00.000Z", "Headline": "Tellurian (TELL) Gets FERC Approval for Driftwood Completion", "Summary": "Tellurian Inc.’s TELL three-year extension, granted by the U.S. Federal Energy Regulatory Commission (“FERC”), to complete the construction of its Driftwood LNG facility has been upheld by the U.S. regulatory body. The FERC denied a rehearing request from the environmental group Sierra Club regarding the extension approval. Sierra Club argued that the Biden administration’s decision to put a pause on its LNG export authorizations to certain countries should impact the Commission’s decision to grant an extension for the construction of Driftwood, noting that Driftwood LNG already had a license to export LNG to the “non-FTA” countries.\nThe regulatory body did not agree with the argument, stating that the FERC’s analysis was not influenced by the federal government’s decision to temporarily halt its authorization of LNG exports to some other countries. The FERC mentioned that it had valid reasons to grant the extension to Tellurian. To complete the construction of Driftwood LNG, it appeared before the commission and took the necessary actions to proceed with the construction. Driftwood also engaged with the commission staff and received the authorization required to proceed with the construction activities.\nTellurian has invested more than $1 billion to construct Driftwood LNG over several years. The LNG facility, with a capacity of 27.6 million metric tons per annum (mtpa), to be constructed near Lake Charles, LA, has received an extension from the FERC to complete the project by Apr 18, 2029.\nTellurian also recently sold off its integrated upstream assets to Aethon Energy Management in order to pay off its borrowings and proceed with the construction of the LNG facility. Aethon also signed an agreement to purchase 2 mtpa of liquefied natural gas (LNG) from Tellurian’s Driftwood LNG after the completion of the first phase.\nZacks Rank and Key Picks\nCurrently, TELL carries a Zacks Rank #3 (Hold).\nSome better-ranked stocks in the energy sector are SM Energy SM, Hess Midstream Partners LP HESM and Chevron Corporation CVX.SM Energy presently sports a Zacks Rank #1 (Strong Buy), while Hess Midstream and Chevron carry a Zacks Rank #2 (Buy) each. You can see the complete list of today’s Zacks #1 Rank stocks here.\nSM Energy is an upstream energy firm operating in the prolific Midland Basin and the South Texas regions. For 2024, the company expects its production to increase from the prior-year reported figure, signaling a bright production outlook.\nHess Midstream owns, operates, develops, and acquires a wide range of midstream assets, providing services to Hess Corporation and other third-party customers. The partnership has a stable fee-based revenue model secured via long-term commercial contracts. Since Hess Midstream operates through 100% fee-based contracts, it is exposed to minimal commodity price risks.\nChevron is one of the largest publicly traded oil and gas companies in the world, with its operations spread around the globe. It is currently in the process of acquiring Hess Corporation. The acquisition is seen as a major win for Chevron, as it will give the company access to Hess' high-quality assets in Guyana and the Bakken Formation.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nHess Midstream Partners LP (HESM) : Free Stock Analysis Report\nTellurian Inc. (TELL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Tellurian-Tell-Gets-Ferc-Approval-132600301.Html", "Sentiment_Score": 0.6403520107, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-10T13:26:00.000Z", "Headline": "Cenovus Energy (CVE) Demobilizes Workers Over Wildfire Risks", "Summary": "Cenovus Energy Inc. CVE has decided to demobilize some of its workers at the Sunrise oil sands site in the wake of blazing wildfires across northern Alberta. The wildfires do not pose any threat to the company’s operations at present. However, as a precautionary measure, the staff that is not directly involved in operations is being demobilized from the site.\nCVE stated that it has been closely communicating with the provincial and municipal agencies to aid their efforts in controlling the situation. The Sunrise oil sands site lies nearly 60 kilometers toward the northeast of the oil sands hub in Fort McMurray. The Sunrise facility had a production capacity of 48,900 barrels per day in 2023.\nCurrently, Alberta is battling more than 60 wildfires, and the risks on the northern side have been categorized as very high to extreme. Previously, Suncor Energy’s Firebag facility had been shut down temporarily due to the risk of wildfires. The company also cut down on its production as a precautionary measure. Suncor had also demobilized staff from the Firebag oil sands site, retaining only essential workers on-site.\nMeanwhile, operations at Imperial Oil’s Kearl oil sands site remain unaffected. The Kearl oil sands site is located approximately 70 kilometers north of Fort McMurray.\nZacks Rank and Key Picks\nCurrently, CVE carries a Zacks Rank #3 (Hold).\nSome better-ranked stocks in the energy sector are SM Energy SM, Hess Midstream Partners LP HESM and Chevron Corporation CVX. SM Energy presently sports a Zacks Rank #1 (Strong Buy), while Hess Midstream and Chevron carry a Zacks Rank #2 (Buy) each. You can see the complete list of today’s Zacks #1 Rank stocks here.\nSM Energy is an upstream energy firm operating in the prolific Midland Basin and the South Texas regions. For 2024, the company expects its production to increase from the prior-year reported figure, signaling a bright production outlook.\nHess Midstream owns, operates, develops, and acquires a wide range of midstream assets, providing services to Hess Corporation and other third-party customers. The partnership has a stable fee-based revenue model secured via long-term commercial contracts. Since Hess Midstream operates through 100% fee-based contracts, it is exposed to minimal commodity price risks.\nChevron is one of the largest publicly traded oil and gas companies in the world, with its operations spread across the globe. It is currently in the process of acquiring Hess Corporation. The acquisition is seen as a major win for Chevron, as it will give the company access to Hess' high-quality assets in Guyana and the Bakken Formation.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nCenovus Energy Inc (CVE) : Free Stock Analysis Report\nHess Midstream Partners LP (HESM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Cenovus-Energy-Cve-Demobilizes-Workers-132600637.Html", "Sentiment_Score": -0.942379117, "Sentiment_Category": "bearish"}, {"Ticker": "CVX", "Time": "2024-07-10T13:25:00.000Z", "Headline": "Here's Why Matador (MTDR) is an Attractive Investment Bet", "Summary": "Matador Resources Company MTDR is a leading upstream player, having a strong foothold in prolific oil and natural gas shale and other unconventional plays. The company is likely to see earnings growth of 16.7% and 19.1% in 2024 and 2025, respectively.\nWhat’s Favoring the Stock?\nThe price of West Texas Intermediate crude is trading at more than the $80-per-barrel mark, which is highly favorable for exploration and production activities. Handsome crude price is likely to aid MTDR, carrying a Zacks Rank #2 (Buy), in increasing production volumes.\nRecently, the upstream energy major has entered into a $1.91 billion agreement to expand its footprint in the prolific Delaware Basin. With the deal expected to close in the late third quarter of 2024, Matador Resources is projected to have more than 190,000 net acres in the Delaware Basin on a pro forma basis. Consequently, the company estimates that its production will exceed 180,000 barrels of oil equivalent per day, positioning it for significant growth and enhanced operational scale.\nOverall, handsome commodity prices and expectations for higher production will likely aid MTDR’s bottom line.\nRisks\nHowever, being an upstream energy player, the company’s overall operations are exposed to extreme volatility in oil and natural gas prices. This is reflected in the company’s beta of 3.29.\nOther Stocks to Consider\nSome other top-ranked energy companies are Range Resources Corporation RRC, Chevron Corporation CVX and SM Energy Company SM. While SM Energy sports a Zacks Rank #1 (Strong Buy), RRC and Chevron carry a Zacks Rank #2. You can see the complete list of today’s Zacks #1 Rank stocks here.\nRange Resources is among the top 10 producers of natural gas and natural gas liquids in the United States. It is a pure-play Appalachian producer having a bright production outlook. The company has been active in the Marcellus Shale, which is among the largest natural gas fields in the United States, known for its extensive reserves and economic viability for production, and has significant reserves of natural gas within this formation.\nChevron generates most of its earnings from its upstream operations. The integrated energy giant has a strong foothold in the Permian – the most prolific basin in the United States – where a significant portion of the energy major’s acreage has minimum royalty payments. Thus, CVX will generate handsome cashflows through its upstream business, banking on handsome oil prices.\nIn addition to maintaining disciplined capital spending, Chevron has a strong balance sheet, providing a solid foundation to rely on during unfavorable energy market conditions.\nTo expand its premier asset portfolio, SM Energy recently agreed to acquire 80% of XCL Resources’ oil and gas assets in the Uinta Basin for $2.04 billion. The value-driven acquisition, likely to close in September this year, will increase its inventory of net locations and boost its oil production. SM Energy is also committed to maintaining its strong balance sheet, which it can rely on during low oil prices.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nRange Resources Corporation (RRC) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nMatador Resources Company (MTDR) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Heres-Why-Matador-Mtdr-Attractive-132500443.Html", "Sentiment_Score": 0.1701957881, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-10T12:56:00.000Z", "Headline": "Should You Buy, Hold, or Sell ExxonMobil (XOM) Post Q2 Update?", "Summary": "Exxon Mobil Corporation XOM recently made a Form 8-K disclosure, stating that soft natural gas prices — resulting from reduced demand and surplus inventories — are expected to have negatively impacted its second-quarter 2024 earnings. Additionally, its announcement regarding diminished refining margins exacerbates apprehensions about second-quarter earnings performance.\nThe critical question now facing investors is how to strategically position themselves regarding the stock. Before addressing this, let's review some fundamental aspects of ExxonMobil.\nStrong Permian & Guyana Presence\nWith a strong focus on strengthening its presence in the Permian, ExxonMobil completed the acquisition of Pioneer Natural Resources Company on May 3. With 1.4 million net acres of the combined company in the Delaware and Midland basins, having an estimated 16 billion barrels of oil equivalent resource, ExxonMobil has greatly transformed its upstream portfolio.\nThe company expects that based on 2023 volumes, its production from the most prolific basin will more than double to 1.3 million barrels of oil equivalent per day (MMBoE/D). For 2027, the energy giant expects its Permian production volume to increase to 2 MMBoE/D.\nSimilar to its operations in the Permian, ExxonMobil boasts a robust project pipeline in offshore Guyana resources. The company is well-positioned to generate significant returns from both the Permian and Guyana due to low production costs in these assets. With oil prices remaining favorable this year, ExxonMobil is strategically poised to generate substantial cash flows from its upstream operations, which contribute the majority to its total earnings.\nIntegrated Business Model & Robust Balance Sheet\nDue to its integrated business model, ExxonMobil is well protected when oil price turns low. This is because, apart from exploration and production activities, the company has an extensive footprint in refining and chemical businesses.\nDuring uncertain times, ExxonMobil can rely on its robust balance sheet. Compared to the industry composite stocks, which have a debt-to-capitalization ratio of 24.2%, ExxonMobil maintains a much lower ratio at 15.9%. Favorable commodity prices have enabled it to enhance its financial position and repay the debt incurred during the pandemic. Chevron Corporation CVX is another integrated energy giant with a strong balance sheet. Belonging to the same industry, Chevron has a much lower debt-to-capitalization ratio of 11.9%.\nBP plc BP, another major player in the integrated energy space, is also reducing its debt load backed by higher oil prices and decreased capital spending. BP’s debt-to-capitalization ratio is much higher at 38.4%.\nZacks Investment Research\nImage Source: Zacks Investment Research\nEntry Into the Lithium Market\nIn addition to its traditional upstream and downstream energy operations, ExxonMobil is entering the lithium market, a critical component in electric vehicle batteries. The world is demanding more lithium to meet the growth in electric vehicles, and XOM is thus well-positioned to gain in the long run.\nOn Jun 25, ExxonMobil signed an agreement with SK On to supply up to 100,000 metric tons of lithium from its upcoming project in Arkansas. SK On will utilize this lithium in its U.S.-based electric vehicle battery manufacturing facility.\nKeep an Eye on the Stock\nExxonMobil, carrying a Zacks Rank #3 (Hold), maintains a robust and diversified business model, which will enable it to continue returning cash to shareholders. Over the past 41 years, XOM's dividend payments have grown at an average annual rate of 5.8%.You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nThese positive developments are evident in the year-to-date price performance of XOM's stock. During this period, the company has appreciated 12.9%, outperforming the 7.7% increase of the industry.\nZacks Investment Research\nImage Source: Zacks Investment Research\nIt is evident that while ExxonMobil expects challenges such as soft gas prices and unfavorable industry margins to affect second-quarter earnings, the company's long-term outlook remains promising. However, investors are advised against rushing to add the stock to their portfolios at present and should instead await a more opportune entry point.\nThis is because, at this moment, shares are somewhat expensive on a relative basis, with the current 6.15X trailing 12-month Enterprise Value/Earnings before Interest Tax Depreciation and Amortization staying above the 6.12X five-year median. Also, the company is trading at a premium to the broader industry average of 3.95X.\nZacks Investment Research\nImage Source: Zacks Investment Research\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Buy-Hold-Sell-Exxonmobil-Xom-125600127.Html", "Sentiment_Score": 0.0171557665, "Sentiment_Category": "neutral"}, {"Ticker": "CVX", "Time": "2024-07-10T10:45:00.000Z", "Headline": "3 Stocks to Watch as Buffett’s Berkshire Bets Big on Energy", "Summary": "Warren Buffett’s Berkshire Hathaway (NYSE:BRK-B, BRK-A) has been making some pretty notable bets in energy stocks over the past several years. Undoubtedly, the conglomerate is sitting on a rather large stockpile of cash. And relative to the growing cash position, some of its recent energy bets may be somewhat less newsworthy but still worth examining.\nIndeed, beginning value investors seeking to know where the Oracle of Omaha and company may see the “sales” to be had in a scorching AI-driven stock market may be directed towards the energy patch this summer.\nBuffett’s energy stocks may lack the explosive euphoria to be had in AI chip and software stocks. But if you, like Buffett, appreciate steady cash flows, earnings growth, and very reasonable, even cheap valuations, the following slate of stocks seems worth watching closely or even buying, if not for the energy exposure for the potential deep value.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nOccidental Petroleum (OXY)\nPerson holding cellphone with logo of American company Occidental Petroleum Corp. (OXY) on screen in front of website. Focus on phone display. Unmodified photo.\nSource: T. Schneider / Shutterstock.com\nBerkshire hasn’t made a ton of moves of late, but one of the most notable is the accumulation of Occidental Petroleum (NYSE:OXY) shares. For the first quarter of 2024, Buffett’s firm continued buying, snapping up around 4.3 million shares to the already sizeable position. More recently, a filing showed Buffett’s firm bought another 2.57 million shares of OXY stock in the first week of June 2024.\nThe rate of buying is remarkable, even if Berkshire has no plans to gobble up the entire firm. At writing, OXY stock has pulled back considerably from its 52-week highs hit back in April 2024.\nDespite the Berkshire buying spree, OXY stock is down around 12% from this peak. Only time will tell if Buffett’s firm keeps buying more as shares sink lower. Either way, Occidental is a very well-run producer in the Permian Basin equipped to continue generating gushing cash flows, with or without the help of higher oil prices. At 14.4 times forward price-to-earnings (P/E), OXY stock has value written all over it.\nChevron (CVX)\nchevron stock\nSource: LesPalenik / Shutterstock.com\nChevron (NYSE:CVX) is a long-time big oil holding of Berkshire’s. However, it’s one that the insurance giant has lightened up on this year, with Buffett’s empire reportedly selling 3.1 million shares of CVX in the first quarter of 2024. I’d mark the move as a slight trim rather than the start of any sort of selling spree. Of course, only the next big quarterly filing will tell.\nIn any case, CVX stock looks like a cheap way to gain exposure to one of the biggest and most efficient oil behemoths out there. The firm has also been making some smart acquisitions in the space, which could prove well-timed should oil’s rally still have legs.\nNow down more than 17% from its two-year highs of $186 and change per share, CVX stock goes for 12.4 times forward P/E. With a 4.23% dividend yield and an extensive track record of dividend growth, Chevron stands out as the ultimate long-term holding. Perhaps the recent pullback is buyable, even if Buffett is inclined to take profits.\nBerkshire Hathaway (BRK-B, BRK-A)\nWarren Buffett face art style isolated template design warren buffet white background. Strong Buy Warren Buffett Stocks\nFinally, we have Berkshire Hathaway itself, which, while not an energy pure-play (not even close to it), is still a diversified way to indirectly benefit from the energy scene. Apart from the exposure to the stock portfolio’s exposure to Occidental Petroleum and Chevron, you’re also getting Berkshire Hathaway Energy and, of course, a pile of cash that could be used to scoop up cheap energy stocks (perhaps more OXY stock?) on weakness.\nBerkshire Hathaway Energy is itself diversified, with exposure to numerous different types of projects. Whether we’re talking renewables (think wind, solar, hydro, and geothermal) or transmission, the division is poised to power significant cash flows for Berkshire for decades to come. Additionally, Greg Abel, the man at the top of Berkshire Hathaway Energy, is slated to be Warren Buffett’s eventual successor.\nAll considered, Berkshire is a great diversified investment for those seeking exposure to a broad range of industries, most notably insurance and energy.\nOn the date of publication, Joey Frenette held shares of Berkshire Hathaway. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article. \nJoey Frenette is a seasoned investment writer specializing in technology and consumer stocks. Contributing to the Motley Fool Canada, TipRanks, and Barchart, Joey excels in spotting mispriced stocks with long-term growth potential in a fast-paced market.\nMore From InvestorPlace\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\nThe post 3 Stocks to Watch as Buffett’s Berkshire Bets Big on Energy appeared first on InvestorPlace.", "Link": "Https://Finance.Yahoo.Com/News/3-Stocks-Watch-Buffett-Berkshire-104500416.Html", "Sentiment_Score": 0.1555245221, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-10T09:30:00.000Z", "Headline": "2 High-Yield Energy Stocks to Buy With $10,000 and Hold Forever", "Summary": "Energy stocks are not exactly known for being boring investments. But that doesn't mean you can't find great companies that are worth buying and holding for the long term, even forever in some cases. You just need to go in knowing that they have to be held through the often-volatile energy cycle. If you have that kind of timeframe and $10,000 to invest right now in the energy sector, you'll want to look at Chevron (NYSE: CVX) and Enterprise Products Partners (NYSE: EPD).\nChevron has an incredible dividend streak\nThere are a lot of things to like about integrated energy giant Chevron, but one that stands out is its 37-year streak of annual dividend increases. Keep in mind that oil and natural gas prices are known for their dramatic, and often swift, price swings. For investors seeking income, Chevron has been a rock in a stormy sea.\nImage source: Getty Images.\nThere are a couple of additional strengths to consider here. Notably, Chevron, like all integrated energy companies, has a diversified portfolio that includes upstream, midstream, and downstream assets. Each of these parts of the energy sector has different operating dynamics, and putting them all together under one roof helps to soften the blow from swings in energy prices.\nBut Chevron also happens to have one of the strongest balance sheets when compared to its closest peers. That gives it the leeway to take on leverage to support its business and dividend during industry downturns. When oil prices recover, it reduces debt to prepare for the next downturn.\nBasically, if you are looking for energy exposure, Chevron is a solid way to go about getting it. But there's one more thing to like here: Chevron's 4.2% yield is notably higher than that of its most direct peer, ExxonMobil (NYSE: XOM), which is yielding roughly 3.3%. BP (NYSE: BP) and Shell (NYSE: SHEL), meanwhile, both cut their dividends in 2020. TotalEnergies (NYSE: TTE) is more aggressively shifting its business toward clean energy and makes more aggressive use of debt, so it's a bit more of an acquired taste despite offering a slightly higher yield (investors also have to deal with French taxes, which reduces the income stream). Overall, Chevron is a clear standout within the integrated energy group.\nEnterprise Products Partners is focused on playing it safe\nEnterprise is one of the largest midstream companies in North America, with an irreplaceable portfolio of pipelines, storage, processing, and transportation assets. This is the vital infrastructure that connects oil and natural gas producers to the world. But the interesting thing here is that oil and natural gas prices aren't all that important to Enterprise's success, because it charges fees for the use of its assets. Demand for energy, which tends to remain robust throughout the energy cycle, is what is most important.\nThat's how Enterprise has managed to increase its distribution annually for 25 consecutive years. The master limited partnership (MLP) also has an investment grade rated balance sheet, and its distributable cash flow covers its distribution by a very comfortable 1.7 times. Like Chevron, Enterprise is a rock in what is often a stormy energy sea. Add in a 7.1% distribution yield, and you can see why income investors might like Enterprise.\nBut there's another little fact here that's worth noting. Like Chevron, Enterprise has one of the strongest balance sheets relative to its closest peers. That's by design and is fairly typical, historically speaking. So Enterprise has long been one of the least risky investments in a sector known for high risk. The caveat here is that the lofty distribution yield will probably make up most of an investor's return, but for income investors, that probably won't be a big problem.\nStick around to benefit\nHere's the key with both Chevron and Enterprise: You have to buy and hold for the long term. These are well-run energy companies that have proven they can stand the test of time. You should give them the benefit of the doubt when -- not if -- the energy sector gets battered. In fact, an energy downturn could be a great time to add to your positions in these forever stocks.\nShould you invest $1,000 in Chevron right now?\nBefore you buy stock in Chevron, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Chevron wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $785,556!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nReuben Gregg Brewer has positions in TotalEnergies. The Motley Fool has positions in and recommends BP and Chevron. The Motley Fool recommends Enterprise Products Partners. The Motley Fool has a disclosure policy.\n2 High-Yield Energy Stocks to Buy With $10,000 and Hold Forever was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/2-High-Yield-Energy-Stocks-093000086.Html", "Sentiment_Score": 0.0444548093, "Sentiment_Category": "neutral"}, {"Ticker": "CVX", "Time": "2024-07-09T14:52:19.000Z", "Headline": "It's Crazy Chicken Right Now Within That Party' Says Kevin O'Leary — Biden's Lapses 'Speak For Themselves'", "Summary": "In a recent interview with FOX Business, Kevin O’Leary, known for his \"Shark Tank\" fame, shared his thoughts on the Supreme Court Chevron ruling and President Biden’s comments on \"investing in energy shortages.\"\n\nThis content is not available due to your privacy preferences.\nUpdate your settings here to see it.\nDon't Miss:\nCan you guess how many Americans successfully retire with $1,000,000 saved? The percentage may shock you.\nElon Musk and Jeff Bezos are bullish on one city that could dethrone New York and become the new financial capital of the US. Investing in its booming real estate market has never been more accessible.\nThe President delivered a speech on Tuesday, July 2, at the D.C. Emergency Operations Center about extreme weather and his proposal to protect Americans from extreme heat.\nHowever, during the speech, the President made a faux pas. Reading from the teleprompter, he said, \"We've invested billions to enhance our power grid, expand energy shortages so that lights, air conditioning, refrigeration, internet stay on during heat waves, storms, and other climate changes. It's building back a different way.\"\nInstead of saying storages, the President mentioned shortages, which caused a whirlwind of reactions from both sides of the aisle.\nIt also prompted Kevin O’Leary to say, \"It speaks for itself, and I really think Biden’s family has to do some soul-searching here. I’m not the only person saying that.\"\nHe also mentioned that he’s talking and meeting with prominent Democrats to understand their point of view before saying, \"I don’t know what’s going to happen. It’s crazy chicken right now.\"\nTrending: Amid the ongoing EV revolution, previously overlooked low-income communities now harbor a huge investment opportunity at just $500.\nO’Leary’s comments come after Biden’s disastrous debate performance against former President Donald Trump. During the debate, Biden appeared tired and unfocused, which he later attributed to sickness. He said, \"Because I was sick, I was feeling terrible. As a matter of fact, the doctor was with me — I asked if they did a COVID test because I was trying to figure out what was wrong.\"\nThe President also blamed jet lag and a busy international travel schedule leading up to the event. He had relatively recently returned from trips to Italy for the G7 summit and France for the D-Day anniversary. Still, he had spent six days at Camp David preparing for the debate.\nThese explanations have done little to suppress concerns among Democrats, who are worried about his campaign’s momentum and capability to effectively compete against Trump in the upcoming election. The debate fallout has also negatively impacted Biden’s poll numbers, giving Trump a slight edge as the campaign progresses. The media also hasn't let up, with analysts picking apart everything he did and said. This scrutiny has further fueled the narrative that Biden’s age and health may be significant liabilities.\nSupporters are calling for a stronger defense strategy and better planning of his public appearances to avoid future mistakes. Meanwhile, his campaign team is working hard to convince voters and party members that Biden can still lead effectively.\nRead Next:\nElon Musk’s secret mansion in Austin revealed through court filings. Here’s how to invest in the city’s growth before prices go back up.\nProperty taxes got you stressed? Save money and only pay if you save in 3 minutes or less.\nMany are surprised by Mark Cuban’s advice for lotto winners: Cash or annuity?\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article It's Crazy Chicken Right Now Within That Party' Says Kevin O'Leary — Biden's Lapses 'Speak For Themselves' originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "Link": "Https://Finance.Yahoo.Com/News/Crazy-Chicken-Now-Within-Party-145219147.Html", "Sentiment_Score": -0.2511911392, "Sentiment_Category": "bearish"}, {"Ticker": "CVX", "Time": "2024-07-09T13:58:00.000Z", "Headline": "Halliburton (HAL) and AIQ Join Forces to Boost Well Efficiency", "Summary": "Halliburton Company HAL has announced a collaboration with Abu Dhabi-based artificial intelligence (AI) firm AIQ, to combine the RoboWell autonomous well control (AWC) solution with Halliburton Landmark’s iEnergy hybrid cloud. RoboWell, developed by AIQ, is the first advanced process control solution designed for gas-lifted wells supported by AI.\nAIQ believes that the agreement with Halliburton’s Landmark is a pivotal step toward expanding the use of AI-enabled AWC tools across the upstream sector globally. An increase in the use of AI-enabled solutions should help optimize operations and increase production across the entire oil and gas industry. Landmark’s iEnergy cloud platform has been developed for the deployment, integration and management of advanced exploration and production applications. Further, the platform can also connect assets in public or private cloud environments.\nOwing to the collaboration, AIQ’s RoboWell autonomous well control will be integrated into the iEnergy cloud platform, making it accessible to Halliburton’s customers worldwide. RoboWell enables autonomous well operations and is engineered to maximize production under specified conditions. It also supports environmental sustainability by reducing carbon dioxide emissions and upholding health, safety and environmental standards. AIQ’s AI-enabled technology has achieved a 30% optimization in gas lift consumption, thereby raising the production from existing wells by up to 5%.\nAIQ’s management has stated that the partnership with Halliburton aligns with its wider strategy of expanding the availability of its AI-powered technologies to support the oil and gas industry worldwide. Halliburton also remarked that combining its expertise in the industry with AIQ’s AI-based solutions will help provide greater efficiency and asset value for its customers.\nZacks Rank and Key Picks\nCurrently, HAL carries a Zacks Rank #3 (Hold).\nSome better-ranked stocks in the energy sector are SM Energy SM, Hess Midstream Partners LP HESM and Chevron Corporation CVX. SM Energy and Hess Midstream presently sport a Zacks Rank #1 (Strong Buy) each, while CVX carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nSM Energy is an upstream energy firm operating in the prolific Midland Basin and the South Texas regions. For 2024, the company expects its production to increase from the prior-year reported figure, signaling a bright production outlook.\nHess Midstream owns, operates, develops, and acquires a wide range of midstream assets, providing services to Hess Corporation and other third-party customers. The partnership has a stable fee-based revenue model secured via long-term commercial contracts. Since Hess Midstream operates through 100% fee-based contracts, it is exposed to minimal commodity price risks.\nChevron is one of the largest publicly traded oil and gas companies in the world, with its operations spread around the globe. It is currently in the process of acquiring Hess Corporation. The acquisition is seen as a major win for Chevron, as it will give the company access to Hess' high-quality assets in Guyana and the Bakken Formation.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nHalliburton Company (HAL) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nHess Midstream Partners LP (HESM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Halliburton-Hal-Aiq-Join-Forces-135800089.Html", "Sentiment_Score": 0.8787330985, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-09T13:08:57.000Z", "Headline": "3 Undervalued Blue-Chip Stocks Ready for a Big Comeback", "Summary": "Investing in undervalued blue-chip stocks might be the safe harbor your portfolio needs at this time. In the past year, we’ve seen blue-chip stocks play second fiddle to tech stocks. The Dow Jones Industrial Average, which tracks 30 of the top blue-chip stocks, posted a modest 4.5% increase year-to-date, substantially behind the tech-heavy S&P 500’s 16.7% gain.\nThis scenario underscores the potential upside opportunity in undervalued blue-chip stocks that are trading at attractive valuations. Such investments promise stability and offer significant long-term gains. Though tech stocks continue basking in the spotlight, the resilience and enduring value of blue-chip stocks are tough to ignore.\nThat said, let’s look at three of the best undervalued blue-chip stocks, which the stock market has unfairly punished in recent months. These stocks continue posting strong operating results and are positioned to thrive despite navigating a tricky business environment.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nNewmont (NEM)\nNewmont logo on a mobile phone screen\nSource: Piotr Swat/Shutterstock\nNewmont (NYSE:NEM) is a top undervalued blue-chip stock that’s mostly moved sideways in the past year. Though its stock jumped 7.5% in 2024, it trailed comfortably behind the S&P 500’s 16.7% gain. Hence, it trades at just 2.9 times forward sales, yielding almost 3%.\nThere’s plenty of reason to believe that the gold mining giant is in for a strong rally ahead. The Federal Reserve is gearing up for its first-rate cut of 2024 soon, and the ensuing weaker dollar could lead to a rally in gold prices. Most analysts expect gold to fall in the $2,421 and $2,651 range this year, pointing to a robust upside at the upper end of the forecast.\nOn the operational front, Newmont continues to fire. This is shown by its solid asset foundation, which boasts 128 million ounces in gold reserves and 155 million ounces in resources. Moreover, gold sales and production surged over 30% year-over-year (YOY) in the first quarter (Q1). Moreover, Newmont reported an operating cash flow of $776 million in the same period, backed by a superior balance sheet and a powerful liquidity buffer.\nMerck (MRK)\nMerck (MRK) logo outside of corporate building\nSource: Atmosphere1 / Shutterstock.com\nMerck (NYSE:MRK) is another attractively priced blue-chip stock that’s lagged behind the broader market lately. It’s a stand-out pharmaceutical play with a promising growth trajectory and a compelling dividend profile. To put things in perspective, it yields an excellent 2.4% and raised its payout for 13 consecutive years.\nIts superb long-term positioning is underpinned by its healthy pipeline, featuring 80 programs in Phase 2 and 30 in Phase 3 testing. Its oncology segment, in particular, is expected to be a major cash cow for its business, potentially generating upwards of $20 billion in incremental sales by the mid-2030s.\nRecent results haven’t been too shabby, either. First-quarter results showed a 9% increase in sales from a year ago, reaching $15.8 billion. Moreover, its non-GAAP earnings per share jumped 48% during the period. Consequently, Wall Street is bullish over its prospects, assigning a consensus “strong buy” rating and expecting a 16% upside from current prices.\nChevron (CVX)\nCVX stock\nSource: tishomir / Shutterstock.com\nCrude oil prices are inching higher, buoyed by expectations of an imminent rate cut. With the current backdrop, it’s an ideal time to consider investing in top oil and gas blue chips like Chevron (NYSE:CVX).\nCVX stock ended in the red last year and has trailed the broader market this year. The past six months have been relatively better, but it’s still 12% behind its 52-week highs. Nevertheless, given the dip and its stellar prospects, Wall Street forecasts a 21% upside in CVX stock from current prices.\nDespite its subdued stock market performance, there’s a lot to like about Chevron. It boasts an investment-grade balance sheet, which powers its aggressive mergers and acquisitions policy. Moreover, in line with its bold expansion strategy, Chevron is also in the midst of a $53 billion acquisition of Hess (NYSE:HES), which will likely turbocharge its operating cash flows significantly.\nAnother competitive advantage for Chevron is its low-cost assets that ensure strong operating and free cash flows, even with oil prices around $80 per barrel.  With oil prices expected to rise, expect a gusher of free cash flows for the company.\nOn the date of publication, Muslim Farooque did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\nMuslim Farooque is a keen investor and an optimist at heart. A life-long gamer and tech enthusiast, he has a particular affinity for analyzing technology stocks. Muslim holds a bachelor’s of science degree in applied accounting from Oxford Brookes University.\nMore From InvestorPlace\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\nThe post 3 Undervalued Blue-Chip Stocks Ready for a Big Comeback appeared first on InvestorPlace.", "Link": "Https://Finance.Yahoo.Com/News/3-Undervalued-Blue-Chip-Stocks-130857353.Html", "Sentiment_Score": 0.4764901698, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-09T12:30:00.000Z", "Headline": "Oil Little Changed as Hurricane Beryl-Related Concerns Fade", "Summary": "Hurricane Beryl, which recently made landfall in Texas, had notable yet manageable impacts on the oil and gas industry. Let’s try to understand the natural event’s influence on the Oil/Energy space, specifically regarding energy demand, supply disruptions and prices.\nImpact on Energy Demand and Oil Prices\nHurricane Beryl’s arrival in Texas initially created concerns about potential disruptions in oil supply. However, the actual impact was less severe than anticipated, which meant that oil prices were essentially unmoved. The market response indicates minimal damage and the swift resumption of operations at major ports and refineries.\n\nHistorically, hurricanes in the eastern Gulf of Mexico tend to be bullish for oil prices due to the significant offshore production disruptions they cause. In contrast, storms hitting the western Gulf, particularly Texas, are often bearish for oil prices but bullish for refined products. This dichotomy occurs because refinery shutdowns reduce crude demand while constraining the supply of refined products, driving up their prices. Beryl’s impact on prices was muted, as the storm caused only temporary disruptions.\nWhat About Energy Infrastructure?\nTexas, a critical hub for the U.S. oil and gas industry, saw several key infrastructures affected:\n\nRefineries: Marathon Petroleum’s MPC Galveston Bay Refinery experienced flaring due to a brief power outage. Phillips 66’s PSX Sweeny refinery was in the storm’s direct path but reported no significant issues. Meanwhile, Citgo Petroleum reduced rates at its Corpus Christi refinery, reflecting cautious operational adjustments.\n\nPorts: Major oil-shipping ports, including Corpus Christi, Galveston and Houston, were preemptively closed. The Corpus Christi Ship Channel reopened quickly, while the Port of Houston aimed to resume operations shortly.\n\nOffshore Platforms: Companies like Shell SHEL and Chevron CVX evacuated personnel and shut in production from offshore platforms such as Perdido and Hoover. Despite these measures, Zacks Rank #2 (Buy) Chevron’s Gulf of Mexico production remained normal throughout the storm.\n\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nSupply-Side Issues\nThe Gulf of Mexico contributes approximately 1.8 million barrels per day, about 14% of total U.S. output. Although Shell and Chevron halted some offshore operations, overall production in the Gulf saw minimal interruptions. This resilience is partly due to proactive measures taken by energy operators.\n\nShell and Chevron evacuated nonessential personnel from offshore platforms and shut down vulnerable operations. The companies also facilitated a quick restart post-storm. Moreover, ExxonMobil and other companies adjusted their operations in anticipation of the storm, ensuring minimal impact on production.\nConclusion\nTo sum up, Hurricane Beryl’s impact on the oil and gas industry was a mix of immediate disruptions and quick recoveries, leading to a muted effect on commodity prices. The industry's preparedness and swift action mitigated long-term damage, highlighting the resilience of U.S. energy infrastructure.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nMarathon Petroleum Corporation (MPC) : Free Stock Analysis Report\nPhillips 66 (PSX) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Oil-Little-Changed-Hurricane-Beryl-123000623.Html", "Sentiment_Score": 0.3850879073, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-09T12:26:00.000Z", "Headline": "ExxonMobil (XOM) Expects Soft Gas Prices to Hurt Q2 Earnings", "Summary": "Exxon Mobil Corporation XOM recently disclosed in a Form 8-K that soft natural gas prices due to lower demand and excess inventories will sequentially hurt its earnings for the second quarter of 2024.\nOwing to changes in prices of the commodity, the leading integrated energy player expects its second-quarter earnings to decline sequentially by $300 million to $700 million. However, XOM projects that a favorable crude pricing scenario in the June quarter will completely offset this negative impact.\nExxonMobil added that unfavorable changes in industry margins will affect its earnings from refining activities by $1.1 billion to $1.5 billion. These estimates exclude the impact of the acquisition of Pioneer Natural Resources, which was closed on May 3 and strengthened the company’s footprint in the Permian Basin, the most prolific basin in the United States.\nThe additional impact from the Pioneer Natural acquisition is expected to result in the production of 500-550 thousand barrels of oil equivalent per day. This acquisition is likely to have affected XOM’s earnings from May 3 to Jun 30 in the second quarter.\nThe Zacks Consensus Estimate for XOM’s earnings per share in the second quarter is pegged at $2.34. ExxonMobil, currently, carries a Zacks Rank #3 (Hold).\nStocks to Consider\nBetter-ranked energy companies include Matador Resources Company MTDR, Chevron Corporation CVX and SM Energy Company SM. While SM Energy sports a Zacks Rank #1 (Strong Buy), Matador Resources and Chevron carry a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nMatador Resources recently entered into a $1.91 billion agreement to expand its footprint in the prolific Delaware Basin. With the deal expected to close in the late third quarter of 2024, the #3 Ranked company is projected to have more than 190,000 net acres in the Delaware Basin on a pro forma basis. Consequently, the company estimates that its production will exceed 180,000 barrels of oil equivalent per day, positioning it for significant growth and enhanced operational scale.\nChevron generates most of its earnings from its upstream operations. The integrated energy giant has a strong foothold in the Permian – the most prolific basin in the United States – where a significant portion of the energy major’s acreage has minimum royalty payments. Thus, CVX will generate handsome cashflows through its upstream business, banking on handsome oil prices.\nIn addition to maintaining disciplined capital spending, Chevron has a strong balance sheet, providing a solid foundation to rely on during unfavorable energy market conditions.\nTo expand its premier asset portfolio, SM Energy recently agreed to acquire 80% of XCL Resources’ oil and gas assets in the Uinta Basin for $2.04 billion. The value-driven acquisition, likely to close in September this year, will increase its inventory of net locations and boost its oil production. SM Energy is also committed to maintaining its strong balance sheet, which it can rely on during low oil prices.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nMatador Resources Company (MTDR) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Exxonmobil-Xom-Expects-Soft-Gas-122600067.Html", "Sentiment_Score": -0.9533138871, "Sentiment_Category": "bearish"}, {"Ticker": "CVX", "Time": "2024-07-09T11:40:00.000Z", "Headline": "The 7 Best Warren Buffett Stocks to Buy in July 2024", "Summary": "I just read an article that quoted billionaire hedge fund manager, David Einhorn, as saying value investing was dead. Since I’m writing about the best Warren Buffett stocks, that thought piqued my interest. After all, Buffett is a legendary value investor.\nIt turns out that Einhorn’s new religion keeps some principles of value investing. However, he believes that many money managers no longer care about valuation as a primary measure of whether a stock is a buying opportunity.\nIt’s hard to argue that point when you look at the stocks that are fogging the mirror of institutional investors. But, if the last five years have shown investors anything it’s that valuation doesn’t matter until it does. Besides, Buffett also considers companies that offer a competitive advantage, have a strong brand with a substantial customer base, and a moat (i.e. a high barrier to entry).\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nLooked at in that light, it’s never a bad time to look at some of the best Warren Buffett stocks to buy. Here are some holdings that look particularly good as the summer heats up.\nOccidental Petroleum (OXY)\nOccidental Petroleum (OXY) Company logo seen displayed on smart phone\nSource: IgorGolovniov / Shutterstock.com\nThere are many reasons to make Occidental Petroleum (NYSE:OXY) the first stock on this list of the best Warren Buffett stocks for July. But the recent weather headlines move to the top of the list. Hurricane Beryl is bearing down on the Caribbean, and it’s not likely to be the only storm to pass that way.\nThe National Oceanic and Atmospheric Administration (NOAA) is projecting between 17 and 25 named storms. Not all of them will impact oil production in the Gulf of Mexico, but a forecast like that supports oil prices remaining above $80 a barrel. And all it will take is one bad storm to send oil close to $90 or even $100.\nBuffett’s hedge fund Berkshire Hathaway (NYSE:BRK.B) has been buying shares since 2019. His buy zone tends to be when the stock goes below $60. It’s not likely to hit that level anytime soon. However, OXY stock is only up about 4% in 2024 and analysts believe that double-digit gains are in its future.\nChevron (CVX)\nCVX stock\nSource: tishomir / Shutterstock.com\nIf you’re going to make an argument that valuation doesn’t matter, Chevron (NYSE:CVX) would be one of the case studies. Chevron stock has a forward valuation of 11.4x, The company continually beats analysts’ expectations for revenue and earnings despite increasing oil production which is a drag on earnings. And perhaps, most importantly, the last time oil prices were this high CVX stock was trading about $10 higher than its closing price on July 3, 2024.\nThere are still some details to be ironed out concerning the arbitration with ExxonMobil (NYSE:XOM) that will need to be resolved before the Hess (NYSE:HES) merger is complete. Once that’s complete, the company will have much more leverage over oil prices which will be bullish for the stock price.\nAnalysts see 17% upside for CVX stock and that doesn’t include the company’s rock-solid dividend. Chevron consistently uses its ample cash flow to support shareholder value, and its dividend which has been growing for 37 consecutive years can be supported with oil prices in the $50 range.\nApple (AAPL)\nApple logo on a pink and purple background. AAPL stock.\nSource: Moab Republic / Shutterstock\nWith the stock price up 31% in the last three months, you can make a strong case that Apple (NASDAQ:AAPL) is due for a healthy pullback. That’s the consensus opinion of analysts.\nBut a consensus opinion doesn’t include all analysts. Several analysts have a price target of $250 and even $260 on AAPL stock.\nThe primary factor in figuring out the short-term fortunes of Apple will come when the company reports earnings in early August. The company has had a pattern of coming in light on the top line. That’s why all eyes will be on iPhone sales ahead of the next refresh cycle in September.\nThat uncertainty makes Apple a tricky trade, but if you’re taking a long position, your decision is pretty simple. If the stock pulls back, it’s a buyable dip. And if the company posts a strong earnings report, you can feel comfortable chasing AAPL stock higher.\nAbbVie (ABBV)\nCloseup of AbbVie (ABBV) building corporate office, an American biopharmaceutical company with its headquarters in Lake Bluff, Illinois, USA\nSource: Valeriya Zankovych / Shutterstock.com\nAbbVie (NYSE:ABBV) is down about 4% as the second half of the year kicks off. This may be a simple rebalancing, or it may be the start of a larger pullback.\nInvestors have been concerned about the impact on revenue now that the company’s blockbuster drug, Humira, faces biosimilar competition in the U.S. and Europe. However, with drugs such as Skyrizi, Rinvoq, Vraylar and Elahere, the company is confident that it can make up for any lost revenue from Humira.\nNevertheless, AbbVie may be a victim of its own success. The stock’s total return over the last five years has averaged around 35%. And even though the stock continues to outpace the S&P 500, it’s not likely to post that kind of return in 2024.\nBut most investors aren’t buying ABBV stock for its growth prospects. They can see a fundamentally sound company that has 52 years of uninterrupted dividend increases. That dividend also currently yields 3.78% making it one of the best dividends that value investors can own.\nBristol Myers Squibb (BMY)\nA Bristol-Myers Squibb (BMY) sign outside a company facility in New Brunswick, New Jersey.\nSource: Katherine Welles / Shutterstock.com\nBristol Myers Squibb (NYSE:BMY) checks off many boxes that investors expect from the best Warren Buffett stocks. The company has a solid balance sheet and a high-yield dividend that has been growing for 16 consecutive years. But when you’re considering investing in biopharmaceutical stocks, it comes down to the pipeline.\nLike AbbVie and other companies in this sector, Bristol Myers Squibb is not immune from concerns about patent expirations. That’s one reason that BMY stock is down 21.9% in 2024. However, any concerns should be mitigated by the company’s deep pipeline which is concentrated in the field of oncology. This includes its blockbuster skin cancer drug, Opdivo.\nLike many large-cap biopharma stocks, Bristol Myers has been growing through acquisition. That’s the main reason why it posted a sharp earnings loss in the first quarter. That will turn around in the coming quarters. That will be bullish for BMY stock which analysts predict will increase by over 30%.\nVisa (V)\nseveral Visa branded credit cards\nSource: Kikinunchi / Shutterstock.com\nBuffett has owned Visa (NYSE:V) stock to the Berkshire portfolio in 2011. His stake is only about 8 million shares which is about where he started. That means he’s done some buying and selling. However, since that time, he’s generated a 405% return on that investment.\nWith a dividend yield of just 0.77%, Visa isn’t the most impressive dividend stock you can find. But while Buffett likes the cash that dividends provide, it’s not the primary reason for his interest in Visa.\nThat would be the company’s moat. Visa and Mastercard (NYSE:MA) are for all intents and purposes a duopoly when it comes to payment processing. And although fintel companies have attempted to disrupt the industry, Visa has shown that it can adjust and will be a leader in an increasingly cashless world.\nSince hitting its all-time high in May 2024, V stock has been in pullback mode. That may be driven by concerns that the consumer is slowing down. Certainly, that could be a concern for traders, but it’s hard to dispute that Visa belongs on any list of the best Warren Buffett stocks.\nKroger (KR)\nA Kroger (KR) logo on a building.\nSource: Jonathan Weiss / Shutterstock.com\nKroger (NYSE:KR) is a leading regional grocery chain. And if you look at the company’s earnings history, you have a snapshot of the impact of inflation on food prices in the country. However, after peaking at around $61 in early 2022, KR stock was rangebound until March 2024. That’s when $50 became the floor rather than the ceiling for the stock.\nIt’s likely to move higher. Analysts are suggesting the stock may move up 14%, but the consensus estimate may be too low.\nThe reason is that while food prices may not go much higher, it will take a long time for deflation to set in. Oil prices are likely to rise, and virtually everything you buy in the grocery store is affected by the price of oil. Also, if interest rates move lower, that will likely have an inflationary effect as consumer spending increases.\nAnd when you add in a dividend that has a 2.29% yield, you can see why KR stock is an intriguing choice of stocks to buy even if its proposed merger with Albertson’s (NYSE:ACI) is blocked by regulators.\nOn the date of publication, Chris Markoch had LONG positions in CVX and AAPL. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\nOn the date of publication, the responsible editor did not have (either directly or\nindirectly) any positions in the securities mentioned in this article.\nChris Markoch is a freelance financial copywriter who has been covering the market for over five years. He has been writing for InvestorPlace since 2019.\nMore From InvestorPlace\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\nThe post The 7 Best Warren Buffett Stocks to Buy in July 2024 appeared first on InvestorPlace.", "Link": "Https://Finance.Yahoo.Com/News/7-Best-Warren-Buffett-Stocks-114000784.Html", "Sentiment_Score": 0.0267987922, "Sentiment_Category": "neutral"}, {"Ticker": "CVX", "Time": "2024-07-08T20:57:41.000Z", "Headline": "Venezuela Inflation Slows to 12-Year Low as Maduro Eyes Votes", "Summary": "(Bloomberg) -- Venezuela’s monthly inflation slowed to 1% in June, the lowest in twelve years, as the government ramps up local dollar sales ahead of presidential elections.\nMost Read from Bloomberg\nMicrosoft Orders China Staff to Use iPhones for Work and Drop Android\nBiden’s Biggest Donors Left Powerless to Sway Him to End Bid\nZyn Imitators Rush In as Online Sales Halt Worsens US Shortage\nRich Chinese Return to Hong Kong as Singapore Steps Up Scrutiny\nBoeing to Plead Guilty to Fraud for Violating Deal Over 737 Max Crashes\nConsumer prices eased to 1% from 1.5% May, the smallest increase since July 2012, according to central bank data. After a stretch of hyperinflation that neared an estimated 2 million percent a year, President Nicolás Maduro has stuck with a strategy that combines tight monetary and fiscal restrictions while also allowing the free-flow of the US dollar. Maduro’s efforts come ahead of July 28 elections, when he seeks to extend his 11 years in power.\nThe central bank boosted dollar sales in June to $441 million, adding to a total of $2 billion during the first half of the year, according to Caracas-based consulting firm Síntesis Financiera.\nPetróleos de Venezuela SA’s joint ventures with international oil majors, led by US Chevron Corp., have “substantially increased” dollar sales to the market after US licenses allowed them to scale up operations without breaching oil sanctions, Síntesis Financiera added.\n--With assistance from Nicolle Yapur.\nMost Read from Bloomberg Businessweek\nAt SpaceX, Elon Musk’s Own Brand of Cancel Culture Is Thriving\nPsychedelics Are Now Legal in Australia—With a Catch\nThe Rich Investor Club Is Getting Crowded\nHow Stocks Became the Game That Record Numbers of Americans Are Playing\nHow to Invest During a High Interest Rate Era\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Venezuela-Inflation-Slows-12-Low-205741487.Html", "Sentiment_Score": -0.8759230375, "Sentiment_Category": "bearish"}, {"Ticker": "CVX", "Time": "2024-07-08T12:15:00.000Z", "Headline": "I Have High Hopes for These 3 Dirt Cheap Dividend Stocks in the Second Half of 2024 (and Beyond)", "Summary": "This year has been a great one for the broader indexes like the S&P 500 and the Nasdaq Composite, which have been driven higher by outsize gains in megacap growth stocks. But other pockets of the market have done fairly poorly, like industry-leading dividend payers whose consistency and stability shine in a downturn but are getting overlooked in today's market.\nPepsiCo (NASDAQ: PEP), Deere (NYSE: DE), and Chevron (NYSE: CVX) stand out as three dividend stocks that have been underperforming the S&P 500 but look like excellent buys now. Here's why.\nImage source: Getty Images.\nPut some pep in the step of your passive-income stream\nIn her 12-year stint as PepsiCo CEO, Indra Nooyi helped improve its brand and grow profits. Since taking over as CEO in October 2018, Ramon Laguarta has done a good job navigating many unexpected challenges, including the U.S.-China trade war, the worst of the pandemic, inflation, and supply chain bottlenecks. Effective management is extremely important, since every percentage point in margin can mean hundreds of millions of dollars.\nFor Pepsi, growth usually comes from new product developments, strategic acquisitions, or efficiency improvements. Nooyi was instrumental in helping Pepsi acquire Quaker Oats and Gatorade. But arguably the biggest deal under Laguarta's tenure has been with the energy drink company Celsius (NASDAQ: CELH).\nThe company entered a partnership with the upstart beverage company in August 2022. It included a $550 million cash investment in exchange for convertible stock, an estimated 8.5% ownership in Celsius on a converted basis, and a 5% annual dividend. As with other consumer goods companies, Celsius shares have pulled back recently, but there's plenty of reason to think the deal will pay off over the long term.\nCelsius also benefits from using PepsiCo's strategic distribution network. It is a complicated business -- arguably far more complicated than its peer, Coca-Cola -- because PepsiCo operates its own production facilities compared to Coke's royalty/franchise model. PepsiCo is also involved in far more product categories besides beverages, like snacks and breakfast items, whereas Coke focuses on what it does best: beverages.\nPepsi has a lower market capitalization than Coke but generates roughly double the revenue and half the operating margin. Due to its size and business model, it is a bit more vulnerable than Coke. However, the company's past management and current leadership have a track record of effective capital allocation.\nHovering around a 52-week low with a 3.3% yield, over 50 years of consecutive dividend raises, and a 24.5 price-to-earnings (P/E) ratio, PepsiCo stands out as an excellent stock to buy and hold for years to come.\nDeere may be cyclical, but the stock is a bargain\nAfter an initial surge in early 2021, Deere stock has gone practically nowhere despite achieving record profits last year. Unfortunately, there have been glaring signs that Deere could enter a downturn.\nIt is a highly cyclical stock. When the company's customers are in expansion mode (and financing is inexpensive), they might be inclined to make a big purchase of its industrial machinery like farming and forestry equipment.\nBut when the cycle turns, Deere's sales can fall in a flash. The trick is to pay a reasonable multiple based on a company's mid-cycle earnings. Its P/E will look low when it is coming off a strong year and will be high coming off a bad year. Understandably, its P/E looks dirt cheap at just 10.9 -- but earnings are expected to decline over the medium term.\nConsensus analyst estimates have Deere earning $22.79 per share in fiscal 2024 and $22 in fiscal 2025, compared to $33.17 in fiscal 2023.\nIt would be one thing if Deere's stock surged in lockstep with its earnings growth, but it didn't. In fact, earnings have nearly doubled over the last three years while the stock is up just 3%. Deere's earnings could be cut in half, and it would still have a P/E of about 22. It is simply too good a company to be this cheap.\nDE Chart\nAnother reason to get excited about Deere is its earnings trajectory and automation and artificial intelligence advancements. The company has been ramping up research and development spending, investing in autonomous tractors, and automating farm tasks, such as crop spacing and recommended fertilizer use that can save operators money. It is making sizable product improvements that might not impact its bottom line until the next uptick in the cycle.\nThe stock only yields 1.6%, but that's mainly because it uses both dividends and buybacks to reward shareholders. Over the last five years, the dividend is up over 93% while its outstanding share count is down 12.5%. That's roughly the same pace of buybacks that Apple has done in the last five years, which is impressive considering Apple is famous for buying back a boatload of its stock.\nAdd it all up, and Deere looks like an excellent value stock to buy now.\nA relatively safe way to invest in the energy sector\nChevron is another stock that has gone practically nowhere over the last year or so. There are a few factors at play. The first is uncertainty regarding Chevron's acquisition of Hess, whose crown jewel is its stake in the Stabroek drilling block off the shores of Guyana. The other partners in the Guyana joint venture -- ExxonMobil and CNOOC, a Chinese national oil company -- are looking to stymie the deal and keep Chevron out of Guyana.\nThe good news is that Chevron doesn't need the deal to go through to be a great investment. It can continue ramping up spending in its existing plays, namely the Permian Basin. It can also continue buying back its stock, which remains a good value with a 14.4 P/E ratio.\nIt's also important to know how the market can reward or overlook certain qualities at different times. Right now, sentiment is optimistic, and peers like ExxonMobil are rewarded for higher spending and bold acquisitions.\nMany other companies have followed suit. Even ConocoPhillips, which is known for being a conservative capital allocator, announced it is acquiring Marathon Oil in a blockbuster $22.5 billion deal. With Chevron's major deal in limbo, there's just one more box left unchecked.\nChevron's financial health and prudence could also be getting overlooked right now. When oil prices are falling, investors often gravitate toward safe, stodgy, dividend-paying names like Chevron. And for good reason. Its financial health helped it acquire multiple companies at compelling valuations during the COVID-induced downturn when other producers were struggling to stay afloat.\nFor the last three years or so, oil prices have been remarkably stable and strong, which might convince some investors to gravitate toward riskier, more-leveraged plays. It could work out, but long-term investors know the best way to compound gains is to buy quality companies and hold them as long as the investment thesis remains intact.\nIn sum, Chevron has the qualities of an excellent long-term holding. Its greatest strength is its financial health, which is particularly important given the volatile nature of commodities like oil and gas. With its 4.2% dividend yield, the company stands out as a compelling choice for generating passive income regardless of oil prices.\nShould you invest $1,000 in PepsiCo right now?\nBefore you buy stock in PepsiCo, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and PepsiCo wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $771,034!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 2, 2024\nDaniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Celsius, and Chevron. The Motley Fool recommends Deere & Company. The Motley Fool has a disclosure policy.\nI Have High Hopes for These 3 Dirt Cheap Dividend Stocks in the Second Half of 2024 (and Beyond) was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/High-Hopes-3-Dirt-Cheap-121500958.Html", "Sentiment_Score": 0.7662978768, "Sentiment_Category": "bullish"}, {"Ticker": "CVX", "Time": "2024-07-08T12:15:00.000Z", "Headline": "Chevron (CVX) Furloughs Biodiesel Workers Amid Market Flood", "Summary": "Chevron Corporation CVX has announced the furlough of workers at its German biodiesel plant in Oeding due to an oversupply in the market. The decision, influenced by challenging margins and alleged fraud from Chinese biodiesel flooding the market, highlights the complex dynamics within the European biodiesel industry.\nLet's delve into the implications of this move, the market challenges and the broader impact on the European biodiesel sector.\nBackground of the Oeding Biodiesel Plant\nThe Role of Chevron's Biodiesel Plant: The biodiesel plant in Oeding, northern Germany, plays an important role in CVX’s renewable energy strategy. The facility, which has recently been upgraded to handle various feedstocks, including brown grease and Pome (a byproduct of the palm industry), produces fuel from waste ingredients like used cooking oil. This upgrade was part of CVX’s commitment to sustainability and innovation in the biofuel sector.\nOperational Challenges and Market Oversupply: The plant has faced operational challenges due to market oversupply. This oversupply has been exacerbated by a surge in Chinese biodiesel exports to the European Union. The alleged dumping of biodiesel mixed with cheaper feedstocks and mislabeling has created an environment where European producers struggle to compete.\nImpact of Chinese Biodiesel on the European Market\nMarket Disruption and Price Undercutting: The influx of Chinese biodiesel has disrupted the European market. European producers, including CVX, have raised concerns about being undercut by cheaper imports.\nThe attractiveness of the EU market, driven by incentives for biofuels made from waste products, has made it a prime target to the importers. However, this has led to significant price pressures and margin challenges for local producers.\nRegulatory and Compliance Issues: The European Biodiesel Board has highlighted issues with the mislabeling of feedstocks like palm oil. In a letter to EU policymakers, the board emphasized the need for stricter regulations and enforcement to ensure fair competition. CVX’s call for a U.S.-style accreditation system for producers highlights the need for regulatory reforms to address these challenges.\nEconomic and Social Implications\nFurloughs and Government Support: The decision to furlough workers at the Oeding plant, effective Aug 1, is a direct response to these market pressures. Under a German government program aimed at avoiding redundancies, part of the workers' salaries will be covered. This move, reflects the broader economic impact of market disruptions on the workforce.\nProspects and Strategic Adjustments:\nFor CVX, the furloughs are part of a strategic adjustment to navigate the challenging market environment. The company’s emphasis on sustainability and innovation remains strong, but adapting to market realities is crucial. The long-term prospects for the Oeding plant will depend on regulatory changes and market conditions.\nThe Broader European Biodiesel Industry\nSustainability and Innovation: The European biodiesel industry is at a crossroads, balancing sustainability goals with economic viability. Innovations in feedstock processing and the production of biofuels from waste products are key to the industry’s future. However, ensuring fair competition and addressing market distortions are equally important.\nPolicy and Regulatory Landscape: The response of European policymakers to the concerns raised by industry players will shape the future of the biodiesel market. Stricter regulations, better enforcement and an accreditation system for producers should level the playing field and support the growth of sustainable biofuels.\nConclusion\nThe furlough of workers at CVX's Oeding biodiesel plant highlights the significant challenges faced by the European biodiesel industry. Market oversupply, driven by Chinese imports and alleged fraud, has created a challenging environment for local producers. Regulatory reforms and strategic adjustments by companies like CVX will be crucial in navigating these challenges and ensuring the sustainability and competitiveness of the industry.\nZacks Rank and Other Key Picks\nCurrently, CVX carries a Zacks Rank #2 (Buy).\nInvestors interested in the energy sector might look at some other top-ranked stocks like Sunoco LP SUN, sporting a Zacks Rank #1 (Strong Buy), and SM Energy Company SM and Coterra Energy Inc. CTRA,  each carrying a Zacks Rank #2 at present. You can see the complete list of today’s Zacks #1 Rank stocks here.\nSunoco is valued at $5.6 billion. It is a major wholesale motor fuel distributor in the United States, distributing over 10 fuel brands through long-term contracts with more than 10,000 convenience stores, ensuring consistent cash flow.\nSUN’s extensive distribution network across 40 states provides a robust and reliable source of income and the Brownsville terminal expansion should add to its revenue diversification.\nDenver, CO-based SM Energy is valued at $5.02 billion. The company currently pays a dividend of 72 cents per share, or 1.65%, on an annual basis.\nSM, an independent energy company, engages in the acquisition, exploration, development and production of oil, gas and natural gas liquids in the state of Texas.\nCoterra Energy is valued at $19.52 billion. The company currently pays a dividend of 84 cents per share, or 3.2%, on an annual basis.\nCTRA is an independent upstream operator engaged in the exploration, development and production of natural gas, crude oil and natural gas liquids.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nSunoco LP (SUN) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nCoterra Energy Inc. (CTRA) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Chevron-Cvx-Furloughs-Biodiesel-Workers-121500175.Html", "Sentiment_Score": -0.9508085251, "Sentiment_Category": "bearish"}, {"Ticker": "CVX", "Time": "2024-07-08T10:43:00.000Z", "Headline": "Fed’s Powell, Inflation Data, Earnings Can Cement a September Rate Cut. Here’s Why and 4 Other Things to Know Today.", "Summary": "Biden hits the campaign trail amid calls to abandon presidential race, Houston coast braces for Hurricane Beryl, and more news to start your day.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/Cc5Aa9A7-Cbc6-3397-8A2D-60B8Bbc61F3D/Fed%E2%80%99S-Powell-Inflation-Data-.Html", "Sentiment_Score": -0.0419006757, "Sentiment_Category": "neutral"}]}