{"timestamp": "20240719_142559", "data": [{"Ticker": "XOM", "Time": "2024-07-19T11:08:14.000Z", "Headline": "Exclusive-ExxonMobil selling Malaysia oil and gas assets to Petronas, sources say", "Summary": "By Yantoultra Ngui and Florence Tan\nSINGAPORE (Reuters) - Exxon Mobil Corp has agreed to sell its Malaysian oil and gas assets to state energy firm Petronas, exiting the country's upstream sector where it used to be a dominant producer, two sources with direct knowledge of the matter said.\nThe U.S. major, which last year marked its 130th year in Malaysia, has been trying to sell its ageing upstream assets in the country since 2020, Malaysian media have reported, part of a shift in its strategy to focus on oil production in the Americas.\nPetronas has taken over operations of Exxon's assets, including the country's flagship Tapis oilfield in Terengganu which began production in 1978, three sources said.\nExxon's staff would be transferred to Petronas as part of the deal, one of the sources said.\nPetronas and ExxonMobil did not respond to requests for comment.\nThe terms of the deal were not immediately known.\nIn an article posted on its website dated Nov. 12, 2023, Exxon said it remained a significant energy producer in Malaysia, contributing about 40% and 50%, respectively, to Peninsular Malaysia's crude oil and natural gas production.\nThe company operates 35 oil and gas platforms in 12 fields offshore Terengganu, and has a working interest in another 10 platforms in five fields in the South China Sea.\nThe combined operations produce about 15% of Malaysia's crude oil and condensate of 600,000 barrels a day, and more than half of peninsular Malaysia's natural gas of more than 2 billion cubic feet per day.\nIts last major investment in the country was in a $2.5 billion enhanced oil recovery project at the Tapis field, which started up in late 2014.\n(Reporting by Yantoultra Ngui and Florence Tan; additional reporting by Trixie Yap in Singapore, Ron Bousso in London, and Rozanna Latiff in Kuala Lumpur; Editing by Tony Munroe and Susan Fenton)", "Link": "Https://Finance.Yahoo.Com/News/Exclusive-Exxonmobil-Selling-Malaysia-Oil-110814879.Html", "Sentiment_Score": 0.0216523129, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-18T12:30:45.000Z", "Headline": "Is It Time To Buy ExxonMobil Stock As Is It Climbs Back?", "Summary": "ExxonMobil stock is climbing back in a base along with the rise in oil prices. The stock reclaimed a moving average. Is now the time to buy XOM?\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/3E6D9252-75F2-351D-9Ad2-96Aa58C48Afa/Is-It-Time-To-Buy-Exxonmobil.Html", "Sentiment_Score": 0.0437665023, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-18T11:48:32.000Z", "Headline": "Is Exxon Mobil Corp (NYSE:XOM) the Best AI Energy Infrastructure Stock to Buy Now?", "Summary": "We recently published a list of 9 Best AI Energy Infrastructure Stocks to Buy Now. Since Exxon Mobil Corp (NYSE:XOM) ranks 1st on the list, it deserves a deeper look.\nRob Thummel, senior portfolio manager at Tortoise Capital Advisors, while talking to CNBC in a latest program, said that he sees a big opportunity for AI in the energy industry. Thummel said that while everybody keeps talking about technology infrastructure when it comes to AI, they “forget” about energy infrastructure.\nThummel said that AI will create electricity demand that will in turn fuel the need for natural gas.\n“There is no AI without EI (energy infrastructure) because you need this critical infrastructure to provide the fuel to keep their lights on and electricity flowing 24 hours a day.”\nTalking about energy stocks, Thummel said a lot of them are “pretty simple stories” as they generate a lot of cash flows and return a significant portion of it back to shareholders.\nAsked about the cyclical nature of the industry, Thummel said that global energy demand is currently at its peak and has grown for 38 years over the last four decades. The analyst said the demand for energy increases every year across the world. Thummel said the US has become the largest energy exporter and he does not see that changing for a long time.\nThummel also shared some of his top picks in the energy sector. For this article we scanned his portfolio and chose his top AI energy infrastructure picks. With each stock we have mentioned the total number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nIs Exxon Mobil Corp (NYSE:XOM) Best AI Energy Infrastructure Stock to Buy Now?\nKatherine Welles / Shutterstock.com\nExxon Mobil Corp (NYSE:XOM)\nNumber of Hedge Fund Investors: 81\nXOM is an important name in Tortoise Capital’s portfolio.\nWith over four decades of consistent dividend growth, Exxon Mobil Corp (NYSE:XOM) is one of the best dividend aristocrat stocks to buy now.  Over the past five years, Exxon Mobil Corp’s (NYSE:XOM) dividend growth rate came in at 2.20% per year. Exxon Mobil Corp’s (NYSE:XOM) future looks bright. Exxon Mobil Corp (NYSE:XOM) has pledged a whopping $20 billion and $25 billion in annual capex spending through 2027. During the first nine months of last year, Exxon Mobil Corp’s (NYSE:XOM) FCF came in at $28.1 billion. Out of that, just $11.1 billion were paid in dividends. Exxon Mobil Corp’s (NYSE:XOM) payout ratio is just 46%, which means it’s spending for business growth, a healthy sign.\nAs of the end of the first quarter of 2024, 81 hedge funds reported owning stakes in Exxon Mobil Corp (NYSE:XOM). The biggest stakeholder of Exxon Mobil Corp (NYSE:XOM) during this period was Ken Fisher’s Fisher Asset Management which owns a $3 billion stake in Exxon Mobil Corp (NYSE:XOM).\nMadison Dividend Income Fund stated the following regarding Exxon Mobil Corporation (NYSE:XOM) in its first quarter 2024 investor letter:\n“This quarter we are highlighting Exxon Mobil Corporation (NYSE:XOM) as a relative yield example in the Energy sector. XOM is a leading integrated oil and natural gas company. It has upstream assets that develop and produce oil and natural gas, along with downstream refining and chemical manufacturing assets. We believe it has attractive low-cost acreage in the Permian basin and has a sizeable growth opportunity in Guyana. Further, we think XOM has a sustainable competitive advantage due to size and scale, and its ability to integrate refining and chemical assets provides a low-cost advantage versus competitors.\nOur thesis on XOM is that it will grow production volumes of oil and gas moderately over the next few years, while limiting excessive capital investment that plagued the industry from 2014-2020. Production growth will come from its 2023 acquisition of Pioneer Natural Resources, which is the largest producer in the Permian basin. XOM plans to double its Permian output by 2027, to 2 million barrels per day. Capital spending will be limited to $20-25 billion per year through 2027, which should allow for significant amounts of cash to be returned to shareholders including a $35 billion share repurchase program and continued dividend increases. Higher oil prices would provide a tailwind to our thesis but are not necessary. We think XOM can grow earnings and cash flow if oil prices remain above $60 per barrel…” (Click here to read the full text)\nOverall, Exxon Mobil Corp (NYSE:XOM) ranks 1st on Insider Monkey’s list titled 9 Best AI Energy Infrastructure Stocks to Buy Now. While we acknowledge the potential of Exxon Mobil Corp (NYSE:XOM), our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than CVX XOM but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.", "Link": "Https://Finance.Yahoo.Com/News/Exxon-Mobil-Corp-Nyse-Xom-114832505.Html", "Sentiment_Score": 0.0935640559, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-18T10:02:48.000Z", "Headline": "Analysis-Exxon clash with Chevron hinges on change of control of Hess' Guyana asset, sources say", "Summary": "By Sabrina Valle\nHOUSTON (Reuters) - Exxon Mobil's legal bid to stop Chevron's proposed $53 billion acquisition of Hess rests on whether the transaction would involve a change of control of Hess' prize subsidiary in Guyana, according to people knowledgeable about the argument.\nThe two top U.S. oil producers are in an arbitration battle over the world's largest oil discovery in almost two decades, in offshore Guyana. Exxon, which operates all output in the South American country with a 45% stake in a lucrative consortium, has challenged the merger in which Chevron would gain control of Hess and its 30% stake, a deal that would define Chevron's future.\nExxon asserts that Hess should have first given it the opportunity to purchase its stake in the Guyana asset.\nExxon's position is that the right of first refusal is triggered by a change of control in Guyana and that Chevron structured the deal in a way to bypass it, people familiar with the arguments, which are confidential, said.\nChevron and Hess say the acquisition is structured in a way that would keep Hess intact, with no change of control of its asset in Guyana, since Hess would become a unit within Chevron.\nChevron and Hess believe the argument has no merit because Hess would survive under a new Chevron and continue to own the asset, people close to their thinking said.\n\"The crux here is whether a change of control even occurred,\" agreed oil and M&A expert James English at law firm Clark Hill Law.\nThe three-person arbitration panel which will make the call must decide in part whether to focus on the language in the contract or to delve into Chevron's intent.\n\"A plain language approach would be very favorable to Chevron, while if you go with the intent, Exxon may have a case,\" English said.\nA discussion around intent also would unfold the dispute into new stages that could require discovery, interrogations and hiring independent valuation experts, pushing a resolution into next year, as Exxon has warned.\nChevron believes the discussion on how to interpret the words in the contract will be \"very straightforward,\" a person aware of the company's legal strategy said. Chevron and Hess said they are seeking a hearing in the third quarter, hoping for an outcome in the fourth and to close the deal shortly thereafter.\nThe case is unique as Guyana represents between 60-80% of the $53 billion Chevron offered for Hess, English and other experts have estimated.\nAn Exxon arbitration win would not be the end of the dispute. While Exxon has ruled out buying Hess outright, it has left the door open to bid for its 30% stake in Guyana, to bid for just a piece of it, to get a compensation from Chevron, or to just leave things as they are.\nIts final strategy will depend on what is so far a closely guarded secret by Chevron and Hess: how much their merger values Hess' Guyana stake.\nOIL RICHES\nGuyana will produce 1.9 million barrels of oil equivalent per day (boepd) in the next decade, more than twice the output of OPEC-member Venezuela and nearly as much as the Gulf of Mexico, Rystad Energy consultancy firm projects.\nChevron originally hoped to close the Hess acquisition by the first half of this year, but was taken by surprise in March when Exxon sought arbitration over the right of first refusal.\n\"Job number one is to get past the first hurdle, which is an alignment that a preemption rights exist in the contract,\" Exxon CEO Darren Woods told Reuters in March.\nThe arbitration panel will analyze a confidential joint operation agreement (JOA) between Exxon, Hess and a third partner, CNOOC, that rules the Guyana operations, known as the Stabroek oil block.\nExxon wrote the JOA in 2008 with a previous partner, before any oil discoveries, based on a 2002 model contract by the Association of International Energy Negotiators (AIEN), two of the people said.\nThe model says, for instance, that any \"direct or indirect\" change in control would constitute a change in control but is not entirely clear on what indirect means.\nThe model language, however, has been adjusted. Exxon, Chevron and Hess declined to disclose the final language of the contract.\nThe model was updated in 2023 to make it explicit that there is change of control if the ultimate parent company changes.\n\"We wrote the JOA, so we have a pretty clear line of sightness (sic) to the intent and the circumstances that apply,\" Woods said in April after reporting first quarter earnings. \"That is the point of the arbitration.\"\nThe person aware of Chevron's strategy said that there is no real precedent for Exxon's change of control arguments in decades of industry mergers and acquisitions governed by similar JOAs.\n\"We disagree with Exxon Mobil’s interpretation of the agreement and are confident that our position will prevail in arbitration,” Hess said.\n(Reporting by Sabrina Valle; Editing by Marguerita Choy)", "Link": "Https://Finance.Yahoo.Com/News/Analysis-Exxon-Clash-Chevron-Hinges-100248306.Html", "Sentiment_Score": -0.5703008175, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-17T16:09:55.000Z", "Headline": "Chicago gas prices could soar after tornado narrowly misses refinery", "Summary": "Gas prices could soon soar across the Chicago metropolitan area after a tornado narrowly missed a major ExxonMobil refinery outside of Chicago Monday night, knocking out power to the facility.\nThe refinery, know as ExxonMobil’s Joliet Refinery, is located in neighboring Channahon, Illinois. Channahon Fire Chief John Petrakis told CNN Wednesday that the tornado was just on the other side of Interstate 55 from the refinery.\nGasoline futures for the Chicago region jumped about 11 cents a gallon in trading Tuesday, Andy Lipow, president of consulting firm Lipow Oil Associates, told CNN. That came even as other gasoline future prices fell slightly nationwide. The power outage at the refinery “is a significant event,” he said.\n“There are three refineries in the Chicagoland area: BP (in Whiting Indiana) with a capacity of 440,000 barrels per day, ExxonMobil Joliet at 275,000 and Citgo in Lemont Illinois at 194,000,” he said. “When one of these refineries shuts, there is little to no cushion of extra supply in the area.”\nWholesale futures for Chicago were up another 4 cents a gallon in Wednesday trading, said Tom Kloza, global head of energy analysis at the OPIS. He said that oil prices have been relatively weak this summer nationally, with even Hurricane Beryl’s hit on the Houston area not being enough to lift prices. But this refinery is major enough to have a impact on local prices.\nThe line of storms that hit the area Monday night produced 11 tornadoes in the greater Chicago area, including the one that hit Channahon, according to the National Weather Service. It will take a few days to return the Joliet refinery to normal production, assuming no damage occurred beyond the power outage, Lipow said. ExxonMobil has yet to reply to questions about damage or its operational plans.\nIf damage delays a return of production, gasoline will need to be shipped up from the Gulf Coast via pipeline which will take a couple of weeks to get to the Chicago market, Lipow said.\nLipow said he expects prices will start to rise at Chicago stations almost immediately. The the Chicago area is already at $4.07 a gallon, according to AAA, but that average price, based on Tuesday’s prices, was down 1 cent from the previous day.\nFor more CNN news and newsletters create an account at CNN.com", "Link": "Https://Finance.Yahoo.Com/News/Chicago-Gas-Prices-Could-Soar-160955324.Html", "Sentiment_Score": -0.4996232092, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-17T15:22:00.000Z", "Headline": "ExxonMobil's (XOM) Joliet Refinery Shuts Down Due to Power Outage", "Summary": "ExxonMobil Corporation XOM, a U.S. energy major, has shut down its 251,800-barrel-per-day refinery in Joliet, IL, following a power outage caused by a severe storm, per a Reuters report. The outage led to a flaring incident on Monday night, adding to the operational challenges faced by the refinery.\nThe storm, which brought heavy wind and rain to the area, resulted in widespread power outages, affecting thousands, according to National Weather Service. The Joliet refinery, a significant player in ExxonMobil's portfolio, processes Canadian crude oil and is crucial for producing gasoline and diesel, generating approximately 9 million gallons daily. The sudden loss of power not only halted these operations but also posed potential risks to the refinery's equipment and systems.\nRecovery from such situations typically takes time, as the sudden shutdown might have caused damage to some of the units. The assessment and recovery process involves thorough inspections to ensure that no critical component was compromised during the abrupt shutdown.\nXOM has neither commented on the incident nor provided an estimated timeline for the refinery's return to normal operations. The company's focus will likely be on ensuring the safety and integrity of the refinery before resuming full production.\nZacks Rank & Key Picks\nExxonMobil currently carries a Zack Rank #4 (Sell).\nInvestors interested in the energy sector may look at some better-ranked stocks like Sunoco LP SUN, SM Energy Company SM and Hess Corporation HES. While Sunoco and SM Energy sport a Zacks Rank #1 (Strong Buy) each, Hess carries a Zacks Rank #2 (Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.\nSunoco is a leading wholesale motor fuel distributor in the United States, boasting a vast distribution network spanning 40 states. With long-term contracts servicing more than 10,000 convenience stores, it distributes over 10 fuel brands, ensuring a stable revenue stream. SUN currently has a Value Score of A.\nThe Zacks Consensus Estimate for 2024 and 2025 earnings per unit is pegged at $7.29 and $7.17, respectively. The partnership has witnessed upward earnings estimate revisions for 2024 and 2025 in the past 60 days.\nSM Energy is set to expand its oil-centered operations in the coming years, with an increasing focus on crude oil, especially in the Permian Basin and Eagle Ford regions. The company’s attractive oil and gas investments should create long-term value for shareholders.\nThe Zacks Consensus Estimate for SM’s 2024 EPS is pegged at $7.15. The company has a Zacks Style Score of A for Value. It has witnessed upward earnings estimate revisions for 2024 and 2025 in the past 30 days.\nHess is a leading oil and natural gas exploration and production company that made several world-class oil discoveries in the Stabroek Block, located off the coast of Guyana. The company is currently in the process of being acquired by supermajor Chevron in an all-stock deal worth $53 billion. The merger will likely result in the creation of an energy behemoth with a massive portfolio of producing assets.\nThe Zacks Consensus Estimate for HES’ 2024 EPS is pegged at $10.52. The company has a Zacks Style Score of B for Growth. It has witnessed upward earnings estimate revisions for 2024 and 2025 in the past 30 days.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nHess Corporation (HES) : Free Stock Analysis Report\nSunoco LP (SUN) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Exxonmobils-Xom-Joliet-Refinery-Shuts-152200771.Html", "Sentiment_Score": -0.9480396509, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-16T21:45:20.000Z", "Headline": "Exxon Mobil (XOM) Outpaces Stock Market Gains: What You Should Know", "Summary": "Exxon Mobil (XOM) ended the recent trading session at $116.04, demonstrating a +0.72% swing from the preceding day's closing price. The stock exceeded the S&P 500, which registered a gain of 0.64% for the day. Meanwhile, the Dow gained 1.85%, and the Nasdaq, a tech-heavy index, added 0.2%.\nThe oil and natural gas company's shares have seen an increase of 6.32% over the last month, surpassing the Oils-Energy sector's loss of 8% and the S&P 500's gain of 3.82%.\nAnalysts and investors alike will be keeping a close eye on the performance of Exxon Mobil in its upcoming earnings disclosure. The company is expected to report EPS of $2.19, up 12.89% from the prior-year quarter. At the same time, our most recent consensus estimate is projecting a revenue of $91.28 billion, reflecting a 10.08% rise from the equivalent quarter last year.\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $8.92 per share and revenue of $359.24 billion, which would represent changes of -6.3% and +4.25%, respectively, from the prior year.\nInvestors should also take note of any recent adjustments to analyst estimates for Exxon Mobil. Such recent modifications usually signify the changing landscape of near-term business trends. Hence, positive alterations in estimates signify analyst optimism regarding the company's business and profitability.\nResearch indicates that these estimate revisions are directly correlated with near-term share price momentum. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 4.26% lower. Exxon Mobil is currently a Zacks Rank #4 (Sell).\nIn the context of valuation, Exxon Mobil is at present trading with a Forward P/E ratio of 12.92. For comparison, its industry has an average Forward P/E of 7.77, which means Exxon Mobil is trading at a premium to the group.\nIt is also worth noting that XOM currently has a PEG ratio of 4.31. The PEG ratio bears resemblance to the frequently used P/E ratio, but this parameter also includes the company's expected earnings growth trajectory. The Oil and Gas - Integrated - International industry currently had an average PEG ratio of 1.83 as of yesterday's close.\nThe Oil and Gas - Integrated - International industry is part of the Oils-Energy sector. With its current Zacks Industry Rank of 92, this industry ranks in the top 37% of all industries, numbering over 250.\nThe Zacks Industry Rank is ordered from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nYou can find more information on all of these metrics, and much more, on Zacks.com.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Exxon-Mobil-Xom-Outpaces-Stock-214520621.Html", "Sentiment_Score": 0.1863139421, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-16T20:48:39.000Z", "Headline": "Exxon Mobil Corporation (XOM): Why Is It One of the Best Dividend Stocks to Buy?", "Summary": "We recently compiled a list of the 15 Best Stocks For Dividends. In this article, we are going to take a look at where Exxon Mobil Corporation (NYSE:XOM) stands against the other dividend stocks.\nIn 2023, dividend stocks underperformed compared to the overall market, which was driven largely by tech stocks. As we move into the latter half of 2024, dividend stocks have shown a similar performance trend in the first half of the year. The Dividend Aristocrats Index, which tracks the performance of companies with at least 25 consecutive years of dividend growth, is down by 0.17% year-to-date, compared with a nearly 18% gain in the broader market. Dividend stocks are declining for two main reasons. First, high interest rates are drawing investors towards bonds instead. Second, the current surge in AI technology is capturing investors' focus on tech stocks. The tech-heavy NASDAQ has achieved its all-time high this year, surging by over 25% so far in 2024. That said, investors haven't completely lost faith in dividend stocks. When all is said and done, successful investing is about playing the long game. Dividend stocks have consistently delivered, accounting for 36% of the market's total return since 1927. Bank of America has also declared 2024 as ‘the year of dividends’.\nIn dividend investing, dividend growth stocks often take a lead over high-yield dividend stocks. Recent research indicates that companies providing consistent and sustainable dividends, without excessive payouts, have delivered the best long-term returns. Wellington Management conducted a study that categorized dividend-paying companies into five groups based on their payout levels. Since 1930, the research found that stocks with the highest dividend payouts generally performed similarly to those with high, but not the very highest, payouts, although they frequently traded places as the top performers over the decades.\nAlso read:\n10 Very High Yield Dividend Stocks With Upside Potential\nThe dividend growth strategy has become so prominent over the years that many companies in the US are steadily increasing their payouts. In 2023, dividend payments reached an all-time high and have consistently increased over the years. Analysts are very optimistic about dividend payments for 2024, and recent projections indicate that the companies are on course to meet this new target record. One of the key reasons for this growth is that many companies, especially large technology firms, have abundant cash reserves and are rapidly increasing their free cash flows. This strong financial position enables them to continue rewarding their investors with higher dividend payments. According to the latest report by S&P Dow Jones Indices, companies in the index paid $153.4 billion in dividends in the second quarter of 2024, up from $151.6 billion from the previous quarter and up from $143.2 billion in the same period last year. The report also mentioned that there were 539 reported dividend increases, compared to 460 in the prior-year period, marking a 17.2% year-over-year rise. The total amount of these dividend increases reached $20.4 billion for the quarter, up from $9.8 billion in Q2 2023.\nDividend growth stocks are a hit with investors because they have rock-solid businesses, a steady cash flow, and strong balance sheets. These companies are top-notch for generating passive income. In this article, we will take a look at some of the best dividend stocks to buy.\nOur Methodology:\nTo compile this list, we thoroughly reviewed reputable sources such as Forbes, Morningstar, Barron’s, and Business Insider. From their latest articles, we gathered the stocks they collectively favored. Additionally, we assessed the sentiment of hedge funds for each stock using Insider Monkey's Q1 2024 database. The stocks are arranged in ascending order based on the number of hedge funds that hold stakes in these companies. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points. (see more details here).\nAerial view of a major oil rig in the middle of the sea, pumping crude oil.\nExxon Mobil Corporation (NYSE:XOM)\nNumber of Hedge Fund Holders: 81\nExxon Mobil Corporation (NYSE:XOM) is an American multinational oil and natural gas company. The company managed to stabilize its financial position through several years of profitability. In the first quarter of 2024, the company generated over $10 billion in free cash flow, surpassing analysts' expectations by 21%. Its operating cash flow for the quarter amounted to $14.7 billion. Achieving a $10 billion increase in cash flow represents a significant return on the company's $94 billion capital expenditures since 2019. Despite reducing capital spending by 8.5% compared to the previous year, Exxon Mobil Corporation (NYSE:XOM) returned $6.8 billion to shareholders through dividends and share repurchases. Additionally, it allocated $5.8 billion toward capital and exploration expenditures. With its strong cash generation and commitment to shareholder returns, the company remains a highly dependable choice for income investors.\nAnother reason that makes Exxon Mobil Corporation (NYSE:XOM) popular among investors is its modest debt level of approximately $40 billion and strong free cash flow amounting to $33 billion. With a debt-to-EBITDA ratio of 0.58, the company's debt is manageable and not a significant concern for shareholders. The stock is currently trading at a forward price-to-earnings ratio of 12.44, which seems attractively priced considering the company's solid cash reserves, recent earnings performance, and growth prospects.\nExxon Mobil Corporation (NYSE:XOM), one of the best stocks for dividends, has never missed a dividend payment in 142 years. Moreover, the company maintains a 41-year streak of consistent dividend growth. The company offers a quarterly dividend of $0.95 per share and has a dividend yield of 3.30%, as of July 15.\nExxon Mobil Corporation (NYSE:XOM) was included in 81 hedge fund portfolios at the end of Q1 2024, compared with 85 in the previous quarter, according to Insider Monkey’s database. The stakes held by these hedge funds have a consolidated value of over $5.5 billion.\nOverall XOM ranks 2nd on our list of the best dividend stocks to buy. You can visit 15 Best Stocks For Dividends to see the other dividend stocks that are on hedge funds’ radar. While we acknowledge the potential of XOM as an investment, our conviction lies in the belief that some deeply undervalued dividend stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for a deeply undervalued dividend stock that is more promising than XOM but that trades at less than 7 times its earnings and yields nearly 10%, check out our report about the dirt cheap dividend stock.\n READ NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and 10 Best of Breed Stocks to Buy For The Third Quarter of 2024 According to Bank of America.\n Disclosure: None. This article is originally published at Insider Monkey.", "Link": "Https://Finance.Yahoo.Com/News/Exxon-Mobil-Corporation-Xom-Why-204839749.Html", "Sentiment_Score": 0.0692447796, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-17T08:15:57.000Z", "Headline": "ExxonMobil and Chevron Are Rock-Solid Dividend Stocks, but So Are These 2 Energy Stocks That Are Down 3% and 15% in 2024", "Summary": "ExxonMobil (NYSE: XOM) and Chevron (NYSE: CVX) are the two largest U.S.-based oil and natural gas companies. However, there are plenty of other dividend-paying energy companies to consider.\nTwo that stand out today are Equinor (NYSE: EQNR), down 15% year to date, and ConocoPhillips (NYSE: COP), down 3% so far this year. Both companies pay attractive dividends and are worth buying now.\nImage source: Getty Images.\nEquinor's outsized profits have been a boon for income investors\nExxonMobil and Chevron have paid and raised their dividends annually for an impressive 42 years and 37 years, respectively.\nIn contrast, Equinor's dividend history is a little more complicated. The Norwegian oil and natural gas giant slashed its quarterly dividend from $0.27 per share at the end of 2019 to $0.09 per share at the start of 2020 as the COVID-19 pandemic took a sledgehammer to its cash flow.\nHowever, Equinor cashed in on the oil and gas recovery over the last few years — booking record revenue, net income, and free cash flow in 2022. Equinor's relatively low capital expenditures and inexpensive cost of production helped amplify its gains. Equinor's performance dipped in 2023, but its results were still excellent.\nBy late 2021, Equinor had raised its ordinary dividend back up to $0.20 per share, and it had begun to pay \"extraordinary\" dividends as well that were based on the performance of the company. These extraordinary payouts started at $0.20 per share — lifting Equinor's total dividend above its pre-pandemic level — and rose as high as $0.70 per share in Q3 2022.\nEquinor paid out a whopping $2.90 per share in dividends in 2022, and $3.40 per share in 2023. For 2024, Equinor plans to pay a $0.35 per share ordinary dividend and a $0.35 per share extraordinary dividend each quarter. That would add up to $2.80 per share for the year, giving it a forward yield of 10.5% based on the current stock price of $26.71.\nEquinor is a uniquely conservative oil major. It has been careful about ramping up production or making splashy acquisitions in the oil patch because of its aggressive energy transition goals. Equinor is 67% owned by the Norwegian state, and its management is heavily influenced by Norway's climate action targets. Over the long term, Equinor's oil and natural gas production will likely decrease, and its renewable energy investments will go up. By 2030, the company plans to allocate more than half of its annual gross capital expenditures to renewable energy projects and low-carbon solutions.\nEquinor's approach to the dividend makes sense within the context of its long-term goals to support a green and sustainable energy future. Instead of accelerating its fossil fuel investments, Equinor is using its profits from oil and gas to pay large dividends and fund its energy transition plan. Equinor would be a good fit for your portfolio if you want a high-yield stock and agree with the company's strategy.\nConocoPhillips jumps aboard the M&A train\nConocoPhillips is one of the largest U.S. exploration and production companies by market capitalization. Like Equinor, ConocoPhillips has its own climate targets, but those longer-term carbon-reduction goals are not stopping it from significantly ramping up oil and natural gas production over the medium term.\nThe company increased production by just 2% year over year in the first quarter. But production is about to surge once it completes its $22.5 billion acquisition of Marathon Oil (NYSE: MRO). That deal is a bet that oil and natural gas prices will stay at moderate levels. If all works out as hoped, ConocoPhillips will generate a boatload of free cash flow that it can use to pay down debt, accelerate growth, or increase its dividend.\nLike Equinor, ConocoPhillips has implemented a dual dividend program with an ordinary dividend and an extraordinary dividend. Its ordinary dividend currently sits at $0.58 per share quarterly, while its most recent extraordinary dividend was $0.20 per share. Annualized, that gives ConocoPhillips a yield of 2.8%, which is good, but far lower than Equinor's.\nIn October 2022, ConocoPhillips paid an extraordinary dividend of $1.40 per share. But since then, it has been paying far lower dividends, and with good reason. The company's value proposition to shareholders is based on long-term free cash flow growth, not maintaining a stagnant business and passing along profits. As such, its dividend is merely one aspect of the investment thesis. The bigger draw is the company's growth, which could lead to a strong stock price performance, higher future dividends, and share buybacks.\nConocoPhillips is the perfect energy stock if you're confident in mediocre to moderate oil and natural gas prices and growing U.S. energy exports. The company believes it will be able to buy back $20 billion of its stock over the next three years, which would offset most of the $22.5 billion all-stock transition for Marathon Oil. If all goes according to plan, ConocoPhillips will emerge with a more attractive asset base, higher production, and essentially no dilution to existing shareholders.\nChoose the path that's best for you\nWhile the short-term performance of energy stocks can be heavily dependent on oil and natural gas prices, their long-term performance can vary wildly based on management objectives and strategic execution. Comparing Equinor to ConocoPhillips highlights two starkly contrasting ways of pursuing growth. Equinor is gradually decreasing its focus on fossil fuels and shifting toward a more balanced portfolio of fossil fuel and renewable assets. In contrast, ConocoPhillips is focused on free cash flow and growth.\nThe best way to approach the energy sector is through a company that aligns with your outlook on the industry. If you believe that oil and natural gas aren't going anywhere for a while, then you may agree that now is the time for energy companies to generate a lot of free cash flow and grow their businesses, and then accelerate energy transition investments in the future.\nThere's also the ExxonMobil approach, which involves increasing oil and natural gas production and making low-carbon investments with an emphasis on profitability.\nIn sum, the best stock for you will depend on your risk tolerance, your view of the energy transition, and whether you want to invest in a company that is prioritizing high dividend payments now or is charting a path toward higher payments in the future.\nShould you invest $1,000 in Equinor Asa right now?\nBefore you buy stock in Equinor Asa, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Equinor Asa wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $787,026!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2024\nDaniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Chevron. The Motley Fool recommends Equinor Asa. The Motley Fool has a disclosure policy.\nExxonMobil and Chevron Are Rock-Solid Dividend Stocks, but So Are These 2 Energy Stocks That Are Down 3% and 15% in 2024 was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/Exxonmobil-Chevron-Rock-Solid-Dividend-140700328.Html", "Sentiment_Score": -0.9643955827, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-16T13:30:11.000Z", "Headline": "Is It Worth Investing in Exxon (XOM) Based on Wall Street's Bullish Views?", "Summary": "Investors often turn to recommendations made by Wall Street analysts before making a Buy, Sell, or Hold decision about a stock. While media reports about rating changes by these brokerage-firm employed (or sell-side) analysts often affect a stock's price, do they really matter?\nLet's take a look at what these Wall Street heavyweights have to say about Exxon Mobil (XOM) before we discuss the reliability of brokerage recommendations and how to use them to your advantage.\nExxon currently has an average brokerage recommendation (ABR) of 1.95, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by 21 brokerage firms. An ABR of 1.95 approximates between Strong Buy and Buy.\nOf the 21 recommendations that derive the current ABR, 11 are Strong Buy, representing 52.4% of all recommendations.\nBrokerage Recommendation Trends for XOM\nBroker Rating Breakdown Chart for XOM\n\n\nCheck price target & stock forecast for Exxon here>>>\n\nWhile the ABR calls for buying Exxon, it may not be wise to make an investment decision solely based on this information. Several studies have shown limited to no success of brokerage recommendations in guiding investors to pick stocks with the best price increase potential.\nAre you wondering why? The vested interest of brokerage firms in a stock they cover often results in a strong positive bias of their analysts in rating it. Our research shows that for every \"Strong Sell\" recommendation, brokerage firms assign five \"Strong Buy\" recommendations.\nThis means that the interests of these institutions are not always aligned with those of retail investors, giving little insight into the direction of a stock's future price movement. It would therefore be best to use this information to validate your own analysis or a tool that has proven to be highly effective at predicting stock price movements.\nZacks Rank, our proprietary stock rating tool with an impressive externally audited track record, categorizes stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), and is an effective indicator of a stock's price performance in the near future. Therefore, using the ABR to validate the Zacks Rank could be an efficient way of making a profitable investment decision.\nZacks Rank Should Not Be Confused With ABR\nIn spite of the fact that Zacks Rank and ABR both appear on a scale from 1 to 5, they are two completely different measures.\nThe ABR is calculated solely based on brokerage recommendations and is typically displayed with decimals (example: 1.28). In contrast, the Zacks Rank is a quantitative model allowing investors to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\nAnalysts employed by brokerage firms have been and continue to be overly optimistic with their recommendations. Since the ratings issued by these analysts are more favorable than their research would support because of the vested interest of their employers, they mislead investors far more often than they guide.\nOn the other hand, earnings estimate revisions are at the core of the Zacks Rank. And empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nFurthermore, the different grades of the Zacks Rank are applied proportionately across all stocks for which brokerage analysts provide earnings estimates for the current year. In other words, at all times, this tool maintains a balance among the five ranks it assigns.\nThere is also a key difference between the ABR and Zacks Rank when it comes to freshness. When you look at the ABR, it may not be up-to-date. Nonetheless, since brokerage analysts constantly revise their earnings estimates to reflect changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in predicting future stock prices.\nShould You Invest in XOM?\nLooking at the earnings estimate revisions for Exxon, the Zacks Consensus Estimate for the current year has declined 4.3% over the past month to $8.92.\nAnalysts' growing pessimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates lower, could be a legitimate reason for the stock to plunge in the near term.\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #4 (Sell) for Exxon. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\nTherefore, it could be wise to take the Buy-equivalent ABR for Exxon with a grain of salt.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Worth-Investing-Exxon-Xom-Based-133011777.Html", "Sentiment_Score": 0.1036635712, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-16T13:11:00.000Z", "Headline": "ExxonMobil (XOM) Reveals Hammerhead Project Development Plan", "Summary": "Exxon Mobil Corporation XOM has proposed a development plan to the government of Guyana for its seventh oil project in the country. The discovery named Hammerhead is part of the prolific Starbroek Block offshore Guyana. The development of the Hammerhead discovery involves drilling up to 30 wells, per ExxonMobil’s development plan.\nThe Hammerhead project is estimated to come online by 2029, pending government approval. The oil and gas giant expects daily production from the Hammerhead field to lie in the range of 120,000-180,000 barrels of crude. The Hammerhead project is anticipated to raise the production capacity of Guyana to approximately 1.4 billion barrels per day.\nExxonMobil has proposed the use of a Very Large Crude Carrier conversion facility for its seventh oil project in Guyanese waters. The floating production unit will be situated 15 kilometers toward the southwest of Liza Destiny, which is XOM’s first oil production platform in the South American nation.\nFor the Hammerhead project, the floating production, storage and offloading (FPSO) vessel has a production capacity of 180,000 barrels of oil per day and a storage capacity of approximately 1.4 to 2 million barrels of oil. This FPSO has a lower production capacity than XOM's largest vessels in the country, which can produce up to 250,000 barrels per day.\nExxonMobil operates the prolific Starbroek Block offshore Guyana, with Hess Corporation and CNOOC as its partners.\nZacks Rank and Key Picks\nCurrently, XOM carries a Zacks Rank #4 (Sell).\nSome better-ranked stocks in the energy sector are SM Energy SM, Sunoco LP SUN and Chevron Corporation CVX. SM Energy and Sunoco presently sport a Zacks Rank #1 (Strong Buy) each, while Chevron carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nSM Energy is an upstream energy firm operating in the prolific Midland Basin and the South Texas regions. For 2024, the company expects its production to increase from the prior-year reported figure, signaling a bright production outlook.\nSunoco LP is one of the largest distributors of motor fuel in the United States. The partnership distributes fuel to independent dealers, commercial customers, convenience stores as well as distributors. Its current distribution yield is greater than the composite stocks in the industry, providing unitholders with consistent returns.\nChevron is one of the largest publicly traded oil and gas companies in the world, with its operations spread around the globe. It is currently in the process of acquiring Hess Corporation. The acquisition is seen as a major win for Chevron, as it will give the company access to Hess' high-quality assets in Guyana and the Bakken Formation.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nSunoco LP (SUN) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Exxonmobil-Xom-Reveals-Hammerhead-Project-131100776.Html", "Sentiment_Score": 0.043843437, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-16T11:00:00.000Z", "Headline": "Exxon Plans Seventh Oil Project Offshore Guyana", "Summary": "ExxonMobil continues to bet big on Guyana, planning a new project set for start-up in 2029 and expected to boost Guyana’s oil production capacity to over 1.4 million barrels per day (bpd).\nThe development plan for the Hammerhead project entails the drilling of up to 30 wells in the Hammerhead discovery from 2018 in the Stabroek Block, according to Exxon’s plan which the Guyana government made public on Monday.\nExxon is the operator of the Stabroek Block offshore Guyana, from which the U.S. supermajor and its partners currently pump more than 600,000 bpd.\nThe project is set to undergo environmental reviews and needs a final approval from the Guyanese government.\nGuyana’s Environmental Protection Agency (EPA) on Monday said that Exxon, as the operator of the Stabroek Block, would be required to conduct an Environmental Impact Assessment for Hammerhead, its seventh deepwater project in the block.\nAccording to current plans, oil production at Hammerhead is expected to begin in 2029 via another Floating Production Storage and Offloading (FPSO) vessel, at a rate of between 120,000 bpd and 180,000 bpd.\nExxon and its Stabroek partners, U.S. Hess Corporation and CNOOC of China, currently produce all the oil in the South American country, which became the newest oil-exporting nation at the end of 2019.\nPlans for the seventh project on Stabroek are being drafted three months after Exxon made a final investment decision for its sixth project, the $12.7-billion Whiptail development offshore Guyana, after receiving the required government and regulatory approvals.\nExxon targets the Whiptail project to start oil production in 2027, adding 250,000 bpd to Guyana’s oil output capacity.\n“Our sixth multi-billion-dollar project in Guyana will bring the country’s production capacity to approximately 1.3 million barrels per day,” Liam Mallon, president of ExxonMobil Upstream Company, said in April, commenting on the decision to invest in the Whiptail project.\nBy Tsvetana Paraskova for Oilprice.com\nMore Top Reads From Oilprice.com:\nBolivia Announces Biggest Natural Gas Discovery Since 2005\nHouthis Target Ships in the Red Sea and Mediterranean\nTrump's VP Choice Could Signal Rollback of Climate Protections\nRead this article on OilPrice.com", "Link": "Https://Finance.Yahoo.Com/News/Exxon-Plans-Seventh-Oil-Project-110000241.Html", "Sentiment_Score": 0.1384903789, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-16T10:36:55.000Z", "Headline": "Exxon looking to drill up to 30 wells for seventh oil project in Guyana", "Summary": "US energy giant ExxonMobil is gearing up to drill as many as 30 wells at its latest project in Guyana, reported Reuters.\nCalled Hammerhead, it would be Exxon’s seventh oil project in the South American nation.\nThe initiative, which awaits the green light from the government, is expected to commence production in 2029 and could boost the nation's oil output to more than 1.4 million barrels of oil per day (mbbl/d).\nCurrently, Exxon oversees all oil production in Guyana.\nThe Hammerhead project is projected to yield a daily output of 120,000–180,000 barrels (bbl) of crude oil, less than the 250,000bbl produced by the country's largest vessels.\nExxon has disclosed that the planned vessel for the project will have a storage capacity ranging from 1.4mbbl to 2mbbl of oil.\nThe floating production unit is expected to be a very large crude carrier conversion facility 15 km south-west of Liza Destiny, Exxon's inaugural platform in Guyana.\nIn April this year, Exxon made a final investment decision to advance with the Whiptail development offshore Guyana, marking the sixth project in the Stabroek block.\nEsso Exploration and Production Guyana, an ExxonMobil affiliate, manages the Guyanese oil block with a 45% interest, alongside partners Hess Guyana Exploration holding 30% and CNOOC Petroleum Guyana with 25%.\nThe Whiptail project, representing a $12.7bn investment, is expected to add another 250,000bopd to the block’s production by the end of 2027 and will include up to ten drill centres and 48 production and injection wells.\nAdding to the series of successes, Exxon announced a new discovery at the Bluefin well in the Stabroek block offshore Guyana in March.\nThe Bluefin well, which was drilled in 1,294m of water by the Stena Drillmax drill-ship, encountered approximately 60m of hydrocarbon-bearing sandstone. The discovery is situated roughly 8.5km south-east of the Sailfin-1 well in the south-eastern part of the Stabroek block.\n\"Exxon looking to drill up to 30 wells for seventh oil project in Guyana\" was originally created and published by Offshore Technology, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/Exxon-Looking-Drill-30-Wells-103655085.Html", "Sentiment_Score": 0.4515615404, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-15T14:00:27.000Z", "Headline": "Exxon Mobil Corporation's (NYSE:XOM) Fundamentals Look Pretty Strong: Could The Market Be Wrong About The Stock?", "Summary": "With its stock down 4.6% over the past three months, it is easy to disregard Exxon Mobil (NYSE:XOM). However, stock prices are usually driven by a company’s financial performance over the long term, which in this case looks quite promising. Specifically, we decided to study Exxon Mobil's ROE in this article.\nReturn on equity or ROE is an important factor to be considered by a shareholder because it tells them how effectively their capital is being reinvested. In short, ROE shows the profit each dollar generates with respect to its shareholder investments.\nView our latest analysis for Exxon Mobil\nHow Is ROE Calculated?\nThe formula for return on equity is:\nReturn on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity\nSo, based on the above formula, the ROE for Exxon Mobil is:\n16% = US$34b ÷ US$213b (Based on the trailing twelve months to March 2024).\nThe 'return' is the profit over the last twelve months. Another way to think of that is that for every $1 worth of equity, the company was able to earn $0.16 in profit.\nWhat Has ROE Got To Do With Earnings Growth?\nWe have already established that ROE serves as an efficient profit-generating gauge for a company's future earnings. Depending on how much of these profits the company reinvests or \"retains\", and how effectively it does so, we are then able to assess a company’s earnings growth potential. Generally speaking, other things being equal, firms with a high return on equity and profit retention, have a higher growth rate than firms that don’t share these attributes.\nA Side By Side comparison of Exxon Mobil's Earnings Growth And 16% ROE\nAt first glance, Exxon Mobil seems to have a decent ROE. And on comparing with the industry, we found that the the average industry ROE is similar at 18%. This probably goes some way in explaining Exxon Mobil's significant 35% net income growth over the past five years amongst other factors. However, there could also be other drivers behind this growth. For instance, the company has a low payout ratio or is being managed efficiently.\nWe then performed a comparison between Exxon Mobil's net income growth with the industry, which revealed that the company's growth is similar to the average industry growth of 38% in the same 5-year period.\npast-earnings-growth\nEarnings growth is a huge factor in stock valuation. The investor should try to establish if the expected growth or decline in earnings, whichever the case may be, is priced in. This then helps them determine if the stock is placed for a bright or bleak future. What is XOM worth today? The intrinsic value infographic in our free research report helps visualize whether XOM is currently mispriced by the market.\nIs Exxon Mobil Efficiently Re-investing Its Profits?\nExxon Mobil's three-year median payout ratio is a pretty moderate 29%, meaning the company retains 71% of its income. By the looks of it, the dividend is well covered and Exxon Mobil is reinvesting its profits efficiently as evidenced by its exceptional growth which we discussed above.\nBesides, Exxon Mobil has been paying dividends for at least ten years or more. This shows that the company is committed to sharing profits with its shareholders. Looking at the current analyst consensus data, we can see that the company's future payout ratio is expected to rise to 43% over the next three years. Despite the higher expected payout ratio, the company's ROE is not expected to change by much.\nConclusion\nIn total, we are pretty happy with Exxon Mobil's performance. Particularly, we like that the company is reinvesting heavily into its business, and at a high rate of return. Unsurprisingly, this has led to an impressive earnings growth. That being so, a study of the latest analyst forecasts show that the company is expected to see a slowdown in its future earnings growth. Are these analysts expectations based on the broad expectations for the industry, or on the company's fundamentals? Click here to be taken to our analyst's forecasts page for the company.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com", "Link": "Https://Finance.Yahoo.Com/News/Exxon-Mobil-Corporations-Nyse-Xom-140027842.Html", "Sentiment_Score": 0.0861480981, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-16T08:12:43.000Z", "Headline": "5 Dividend Stocks Billionaires Are Buying In 2024", "Summary": "5 Dividend Stocks Billionaires Are Buying In 2024\nBenzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nDividend stocks have been under pressure lately as investors flocked to high-growth tech companies to ride the AI bandwagon. However, amid the latest data showing signs of easing inflation, many analysts believe possible rate cuts from the Federal Reserve could reignite the market's interest in income stocks. Research from Columbia Threadneedle Investments, which analyzed data from 1973 through 2023, showed that dividend-growing stocks outperform other stocks when the Federal Reserve begins to cut interest rates.\nCheck it out: Bezos' favorite real estate platform launches a way to cash in on the private credit boom —.\nPerhaps that's why top money managers and billionaires have been piling into dividend growth stocks with strong balance sheets and decades of consecutive dividend hikes. This article will look at some of the most popular dividend stocks among notable billionaires. We analyzed the latest portfolios of top billionaires, including Warren Buffett, Ken Fisher, Israel Englander, Steve Cohen, and Cliff Asness. We identified five dividend stocks commonly held across these influential investors’ portfolios.\nCoca-Cola\nCoca-Cola Co. (NYSE:KO) has 62 consecutive years of dividend increases. Its resilient business makes the stock a defensive play when times are tough. The stock yields about 3% as of July 11, 2024. Some of the famous billionaires with stakes in the beverage company include Warren Buffett ($24.5 billion), Ken Griffin ($539 million), Ray Dalio ($384.74 million), and Steve Cohen ($325.04 million).\nCoca-Cola shares are up 5.4% so far this year. The latest industry data from Nielsen showed that Coca-Cola’s market share remains strong. During the 12 months ending May 18, Coca-Cola sales jumped 4.1% year over year, much higher than the beverage industry's average growth of 1.1% during the same period.\nChevron\nWhat sets Chevron Corp. (NYSE:CVX) apart from other dividend stocks is this: legendary investor Warren Buffett is the biggest stakeholder in the company, with an eye-popping $19.4 billion. But if you need more reasons to be impressed with the oil company, the list of billionaire shareholders is long. The stock is in the portfolios of Cliff Asness, Ken Griffin, Israel Englander, and Louis Bacon.\nChevron has an over 4% dividend yield and 36 years of consecutive dividend growth history. Chevron is a cash-rich company that returns value to shareholders via buybacks and dividends. Last year, the company made headlines when it announced a $75 billion share buyback plan.\nExxon Mobil\nWith a 3.3% dividend yield and over 40 straight years of dividend growth, oil giant Exxon Mobil Corp. (NYSE:XOM) is loved by income investors. As of the end of the first quarter of 2024, billionaire Ken Fisher had a $3.1 billion stake in the company. Meanwhile, billionaire Steve Cohen held a $259 million stake via his fund Point72 Asset Management. Other billionaire stakeholders in ExxonMobil include Ken Griffin, Cliff Asness and D.E. Shaw. Earlier this year, ExxonMobil completed its $60 billion acquisition of Pioneer Natural Resources.\nAnalysts expect the deal to help ExxonMobil reduce oil and gas production costs. During the first quarter alone, the company generated about $8.2 billion in earnings and $14.7 billion in cash from operations, while its structural cost savings surpassed $10 billion. This strong cash position and an expected upbeat demand for oil and gas make XOM a strong dividend player in the industry.\nWhole Foods' landlord has delivered a 15% net IRR for its investors since 2015. Check out the latest investment opportunities added to its platform.\nProcter & Gamble\nConsumer goods company Procter & Gamble Co. (NYSE:PG) is one of the favorite dividend stocks of billionaires. The company has hiked its dividend for 68 straight years. The list of billionaires having stakes in the company is long: Ken Fisher (over $2.67 billion), Ray Dalio ($666 million), D.E. Shaw ($151 million), Israel Englander ($51 million), and Cliff Asness ($256 million), among others. Procter & Gamble shares have gained about 11% this year. Despite inflation, the company remains in a strong pricing position, as it's behind household names like Gillette, Old Spice, Oral B, and Pampers. Wall Street expects a 6% to 7% annual EPS growth for the company over the next two years.\nJohnson & Johnson\nWith 62 years of consecutive dividend increases, Johnson & Johnson (NYSE:JNJ) is one of the most famous and sought-after dividend stocks. Among the notable billionaire hedge funds having stakes in the company as of the end of the first quarter include Ken Fisher's Fisher Asset Management (over $1 billion), Ray Dalio's Bridgewater Associates (about $450 million), and Cliff Asness' AQR Capital ($382 million), among several others. Johnson & Johnson shares have been down about 6% this year, and the stock's forward P/E ratio is 14.17, much lower than the sector median of 18.7. While litigation-related headwinds have taken a toll on the stock, analysts believe the company's diversified revenue stream and strong cash position make it a safe dividend stock for the long term.\nLooking For Higher-Yield Opportunities?\nThe current high-interest-rate environment has created an incredible opportunity for income-seeking investors to earn massive yields, but not through dividend stocks... Certain private market real estate investments are giving retail investors the opportunity to capitalize on these high-yield opportunities and Benzinga has identified some of the most attractive options for you to consider.\nFor instance, the Ascent Income Fund from EquityMultiple targets stable income from senior commercial real estate debt positions and has a historical distribution yield of 12.1% backed by real assets. With payment priority and flexible liquidity options, the Ascent Income Fund is a cornerstone investment vehicle for income-focused investors. First-time investors with EquityMultiple can now invest in the Ascent Income Fund with a reduced minimum of just $5,000.\nDon't miss out on this opportunity to take advantage of high-yield investments while rates are high. Check out Benzinga's favorite high-yield offerings.\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nThis article 5 Dividend Stocks Billionaires Are Buying In 2024 originally appeared on Benzinga.com", "Link": "Https://Finance.Yahoo.Com/News/5-Dividend-Stocks-Billionaires-Buying-130009915.Html", "Sentiment_Score": 0.0534564778, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-15T10:01:00.000Z", "Headline": "The Zacks Analyst Blog Highlights Exxon Mobil, Merck & Co, Qualcomm and Armanino Foods of Distinction", "Summary": "For Immediate Releases\nChicago, IL – July 15, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Exxon Mobil Corp. XOM, Merck & Co., Inc. MRK, Qualcomm Inc. QCOM and Armanino Foods of Distinction, Inc. AMNF.\nHere are highlights from Monday’s Analyst Blog:\nTop Research Reports for Exxon Mobil, Merck & Qualcomm\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Exxon Mobil Corp., Merck & Co., Inc. and Qualcomm Inc., as well as a micro-cap stock Armanino Foods of Distinction, Inc. The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\n\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today’s research reports here >>>\n\nExxon Mobil’s shares have outperformed the Zacks Oil and Gas - Integrated - International industry over the past year (+8.0% vs. +5.3%). The company is a reliable player in the energy sector, boasts a resilient capital structure, a robust balance sheet and track record of prudent capex management. Its strategic discoveries in the Stabroek Block and Permian Basin promise growth and lower greenhouse gas intensity.\n\nExxon Mobil prioritizes shareholder returns, evidenced by substantial buybacks that are slated to increase to $20 billion through 2025. Exxon Mobil’s entry into the lithium market positions it for long-term gains as the demand for lithium is poised to increase with the growing adoption of electric vehicles.\n\nHowever, challenges loom, notably in the upstream operations, which are susceptible to volatile oil prices and regulatory hurdles. Reliance on finding economically recoverable reserves and exposure to OPEC production cuts add to uncertainties.\n\n(You can read the full research report on Exxon Mobil here >>>)\n\nShares of Merck’s have gained +21.2% over the past year against the Zacks Large Cap Pharmaceuticals industry’s gain of +35.1%. The company’s products like Keytruda and Gardasil have been driving sales. With continued label expansion into new indications, particularly earlier-stage launches, Keytruda is expected to see continued growth.\n\nAnimal health and vaccine products are core growth drivers. Merck boasts a strong cancer pipeline, including Keytruda, which should drive long-term growth. The company is investing in M&A activity to strengthen its pipeline.\n\nHowever, generic competition for several drugs and rising competitive pressure, mainly on the diabetes franchise, will continue to be overhangs on the top line. There are concerns about Merck’s ability to grow its non-oncology business ahead of Keytruda’s loss of exclusivity later in the decade.\n\n(You can read the full research report on Merck here >>>)\n\nQualcomm’s shares have outperformed the Zacks Wireless Equipment industry over the past year (+65.0% vs. +39.5%). The company is benefiting from healthy traction in Android handsets and automotive businesses. The development of Snapdragon Dev Kit for Windows in collaboration with Microsoft will likely boost its commercial prospects in the AI PC market.\n\nThe Snapdragon X Series Platform integrated with Qualcomm AI Hub is also witnessing significant market traction among leading global PC manufacturers. The company is increasingly focusing on the seamless transition from a wireless communications firm for the mobile industry to a connected processor firm for the intelligent edge. This augurs well for long-term growth.\n\nHowever, inventory corrections by clients are impeding sales in the IoT business. Increasing competition in the mobile phone chipset market is likely to strain margins. Rising geopolitical instability and high debt obligation remain concerns.\n\n(You can read the full research report on QUALCOMM here >>>)\n\nShares of Armanino Foods of Distinction have outperformed the Zacks Food - Miscellaneous industry over the past year (+27.0% vs. -10.2%). This microcap company with market capitalization of $175.72 million boasts strong cash reserves and consistent dividends, with the highest payout in its history.\n\nThe company is expanding geographically, securing new customers like Brookshire Brothers and Harris Teeter, and has become the #1 brand in Northern California’s Safeway. Offering a wide range of products, Armanino Foods holds a 65% market share in the food service pesto category. AMNF’s Global Food Safety Initiative BRC Grade AA certification ensures high standards.\n\nYet, rising operating expenses, the dependence on key customers and exposure to commodity price volatility pose risks. Competition from larger companies and private labels could impact market share and margins. Higher storage and transport costs for frozen products impact profitability, and heavy reliance on the U.S. market limits international growth opportunities.\n\n(You can read the full research report on Armanino Foods of Distinction here >>>)\nWhy Haven’t You Looked at Zacks' Top Stocks?\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com                                                   \nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance  for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nMerck & Co., Inc. (MRK) : Free Stock Analysis Report\nArmanino Foods of Distinction Inc. (AMNF): Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Zacks-Analyst-Blog-Highlights-Exxon-100100398.Html", "Sentiment_Score": 0.0470424742, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-13T14:53:00.000Z", "Headline": "3 Dividend Stocks That Were Home Runs in the First Half (Will the Second Half Be as Good?)", "Summary": "The stock market enjoyed a strong first half, with the S&P 500 rallying 14.5%. Given the election uncertainty and growing macroeconomic concerns, it will be hard for the market to repeat that performance in the second half.\nMany dividend stocks enjoyed even stronger first-half returns, including NextEra Energy (NYSE: NEE), Targa Resources (NYSE: TRGP), and ExxonMobil (NYSE: XOM). While they'll likely face similar second-half headwinds as the broader market, they stand out to a few Fool.com contributors because they could deliver an encore performance in the second half.\nNextEra Energy rebounded in the first half\nReuben Gregg Brewer (NextEra Energy): Although NextEra Energy is a utility, it somehow managed to provide investors with a total return of just over 18% in the first half of 2024. That soundly beats the S&P 500 index's total return of roughly 15%. That said, NextEra Energy's price performance really represents a bounce back after rising interest rates led to a steep price decline. So investors probably shouldn't go in here thinking that a utility stock is going to shoot to the Moon.\nAnd yet there's something unique about NextEra Energy that will still attract investors: dividend growth. Over the past decade, the company's dividend growth has averaged around 10% a year. That's a good number for any company, let alone a utility. But here's the thing -- management is calling for dividend growth of 10% through at least 2026, backed by annual earnings growth of between 6% and 8% through 2027. So in this way NextEra Energy should be just as rewarding in the future for dividend growth investors as it has been in the past.\nThe key to the story is that Wall Street knows NextEra Energy is a dividend growth stock. It prices the shares accordingly, usually at a premium to other utilities. But so long as the dividend keeps growing at a rapid clip, the shares are likely to remain strong performers. The price drop that occurred when rates rose was based on the fear that dividend growth would be curtailed. Since that's not the case, it's reasonable to expect this dividend growth machine to keep on chugging along.\nLots of momentum heading into 2025\nMatt DiLallo (Targa Resources): Shares of Targa Resources rocketed in the year's first half, surging 48.2%. That crushed the S&P 500's 14.5% gain over the first six months of 2024.\nSeveral factors fueled Targa's big move. The pipeline company reported record adjusted earnings before interest, taxes, depreciation, and amortization (EBITDA) in the first quarter, driven by record volumes in the Permian and for liquefied petroleum gas exports. Its growing earnings and free cash flow gave the company the fuel to return more cash to investors. It announced a monster 50% dividend increase in the first quarter. The company also repurchased $124 million of its stock in the period.\nTarga still has a lot more growth coming down the pipeline. The company completed a new expansion project in May. It also secured two more projects, which it expects to complete in the fourth quarter of 2025 and the third quarter of 2026. They will add to the backlog of projects the company expects to complete in the coming months. Those expansions should continue driving its earnings and cash flow higher over the next few years.\nThe midstream company is about to hit a major inflection point. Targa Resources expects its total capital spending to decline from a range of $2.3 billion to $2.5 billion this year to around $1.4 billion in 2025 as its current wave of capital projects enter service. That will supply it with about $1 billion of incremental free cash flow next year. The company could use that excess cash to buy back more shares and continue boosting its dividend.\nWith momentum building for 2025, Targa could continue to deliver market-crushing returns in the second half of 2024 and beyond.\nThis oil giant keeps growing\nNeha Chamaria (ExxonMobil): After ending 2023 with barely 2% gains, ExxonMobil stock surged 15% in the first half of 2024, mirroring S&P 500 index gains. Rising crude oil prices, a big acquisition, and strong growth projections propelled shares of the oil and gas giant higher in recent months. ExxonMobil stock rose the most during the first few months of 2024 and hit all-time highs in April, also a period when crude oil prices rebounded sharply.\nEarlier in the year, ExxonMobil delivered industry-leading earnings of $36 billion and as much in free cash flow for 2023. It distributed $32.4 billion among its shareholders in the form of dividends and share repurchases, with 2023 also marking ExxonMobil's 41st year of consecutive dividend increases.\nExxonMobil's 2023 earnings, however, were lower compared with 2022, and that trend continued into the first quarter, with its Q1 earnings dropping nearly 28% year over year. That partly explains why the oil stock has cooled down a bit since late April, but investors overall remain focused on ExxonMobil's growth prospects.\nThe oil giant took a massive growth leap in May by acquiring Pioneer Natural Resources in an all-stock deal worth $64.5 billion. The acquisition more than doubles ExxonMobil's footprint in the Permian Basin and is expected to be immediately accretive to its earnings and cash flows. Those higher earnings and cash flows should start reflecting in ExxonMobil's upcoming quarterly numbers and help the stock maintain momentum for the rest of the year.\nExxonMobil's stock, in fact, should keep humming beyond 2024 given management's expectation to more than double its earnings potential and nearly double its cash flows by 2027 versus 2019 at a Brent crude oil price of $60 per barrel.\nShould you invest $1,000 in NextEra Energy right now?\nBefore you buy stock in NextEra Energy, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and NextEra Energy wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $791,929!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nMatt DiLallo has positions in NextEra Energy. Neha Chamaria has no position in any of the stocks mentioned. Reuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends NextEra Energy. The Motley Fool recommends Targa Resources. The Motley Fool has a disclosure policy.\n3 Dividend Stocks That Were Home Runs in the First Half (Will the Second Half Be as Good?) was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/3-Dividend-Stocks-Were-Home-145300870.Html", "Sentiment_Score": 0.010953851, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-12T20:58:00.000Z", "Headline": "Top Research Reports for Exxon Mobil, Merck & Qualcomm", "Summary": "Friday, July 12, 2024\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Exxon Mobil Corp. (XOM), Merck & Co., Inc. (MRK) and Qualcomm Inc. (QCOM), as well as a micro-cap stock Armanino Foods of Distinction, Inc. (AMNF). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\n\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today’s research reports here >>>\n\nExxon Mobil’s shares have outperformed the Zacks Oil and Gas - Integrated - International industry over the past year (+8.0% vs. +5.3%). The company is a reliable player in the energy sector, boasts a resilient capital structure, a robust balance sheet and track record of prudent capex management. Its strategic discoveries in the Stabroek Block and Permian Basin promise growth and lower greenhouse gas intensity. \n\nExxon Mobil prioritizes shareholder returns, evidenced by substantial buybacks that are slated to increase to $20 billion through 2025. Exxon Mobil’s entry into the lithium market positions it for long-term gains as the demand for lithium is poised to increase with the growing adoption of electric vehicles.\n\nHowever, challenges loom, notably in the upstream operations, which are susceptible to volatile oil prices and regulatory hurdles. Reliance on finding economically recoverable reserves and exposure to OPEC production cuts add to uncertainties.\n\n(You can read the full research report on Exxon Mobil here >>>)\n\nShares of Merck’s have gained +21.2% over the past year against the Zacks Large Cap Pharmaceuticals industry’s gain of +35.1%. The company’s products like Keytruda and Gardasil have been driving sales. With continued label expansion into new indications, particularly earlier-stage launches, Keytruda is expected to see continued growth. \n\nAnimal health and vaccine products are core growth drivers. Merck boasts a strong cancer pipeline, including Keytruda, which should drive long-term growth. The company is investing in M&A activity to strengthen its pipeline. \n\nHowever, generic competition for several drugs and rising competitive pressure, mainly on the diabetes franchise, will continue to be overhangs on the top line. There are concerns about Merck’s ability to grow its non-oncology business ahead of Keytruda’s loss of exclusivity later in the decade.\n\n(You can read the full research report on Merck here >>>)\n\nQualcomm’s shares have outperformed the Zacks Wireless Equipment industry over the past year (+65.0% vs. +39.5%). The company is benefiting from healthy traction in Android handsets and automotive businesses. The development of Snapdragon Dev Kit for Windows in collaboration with Microsoft will likely boost its commercial prospects in the AI PC market. \n\nThe Snapdragon X Series Platform integrated with Qualcomm AI Hub is also witnessing significant market traction among leading global PC manufacturers. The company is increasingly focusing on the seamless transition from a wireless communications firm for the mobile industry to a connected processor firm for the intelligent edge. This augurs well for long-term growth. \n\nHowever, inventory corrections by clients are impeding sales in the IoT business. Increasing competition in the mobile phone chipset market is likely to strain margins. Rising geopolitical instability and high debt obligation remain concerns.\n\n(You can read the full research report on QUALCOMM here >>>)\n\nShares of Armanino Foods of Distinction have outperformed the Zacks Food - Miscellaneous industry over the past year (+27.0% vs. -10.2%). This microcap company with market capitalization of $175.72 million boasts strong cash reserves and consistent dividends, with the highest payout in its history.\n\nThe company is expanding geographically, securing new customers like Brookshire Brothers and Harris Teeter, and has become the #1 brand in Northern California’s Safeway. Offering a wide range of products, Armanino Foods holds a 65% market share in the food service pesto category. AMNF’s Global Food Safety Initiative BRC Grade AA certification ensures high standards. \n\nYet, rising operating expenses, the dependence on key customers and exposure to commodity price volatility pose risks. Competition from larger companies and private labels could impact market share and margins. Higher storage and transport costs for frozen products impact profitability, and heavy reliance on the U.S. market limits international growth opportunities.\n\n(You can read the full research report on Armanino Foods of Distinction here >>>)\n\nOther noteworthy reports we are featuring today include Fomento Económico Mexicano, S.A.B. de C.V. (FMX), Vertex Pharmaceuticals Inc. (VRTX) and América Móvil, S.A.B. de C.V. (AMX).\n\nMark Vickery\nSenior Editor\n\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nExxonMobil's (XOM) Stabroek & Permian Oil Discoveries Aid\nKeytruda to Remain Merck's (MRK) Key Top-Line Driver\nQualcomm (QCOM) Rides on Healthy AI Traction in Android & PC\nFeatured Reports\nFEMSA's (FMX) Digital & Other Initiatives Seem Encouraging\nPer the Zacks analyst, FEMSA has been gaining pace in the digital space through tech and innovation business unit. Spin by OXXO reached 7.4 million active users during the first quarter of 2024.\nGrowth Projects, Newcrest Buyout Aid Newmont (NEM)\nPer the Zacks analyst, Newmont will gain from the progress of its key growth projects and significant synergies of the Newcrest acquisition amid headwinds from higher production costs.\nAlcon (ALC) Banks on Implantable Sales Amid Stiff Rivalry\nPer the Zacks Analyst, Alcon continues to lead the implantables market with its flagship Vivity, PanOptix lenses while monofocal torics too are gaining shares. Yet, tough competition may hurt growth.\nArcher Daniels (ADM) Growth Plan on Track, Nutrition Unit Soft\nPer the Zacks analyst, Archer Daniels is on track with its three strategic pillars, optimize, drive and growth for sustained gains. A sluggish Nutrition unit hurts sentiment.\nMetal Prices & Healthy Portfolio Aid Franco-Nevada (FNV)\nPer the Zacks analyst, the recent pick up in gold price is aiding Franco-Nevada's performance. The company's healthy portfolio of streaming and royalty agreements is also driving margins.\nW.R. Berkley (WRB) Solid Insurance Business Aid, Cat Loss Ail\nPer the Zacks analyst, W.R. Berkley's Insurance business is set to grow on rate increases, and improving premiums from international unit. Yet, exposure to cat loss, increasing expenses drag margins.\nInvestments, Customer Growth Aid Essential Utilities (WTRG)\nPer the Zacks analyst, Essential Utilities' (WTRG) $7.2 billion investment to fortify it water and natural gas infrastructure and demand from expanding customer base are going to boost its performance\nNew Upgrades\nVertex (VRTX) Enjoys a Strong Non-Cystic Fibrosis Pipeline\nThe Zacks analyst says Vertex saw rapid success in its non-CF pipeline candidates' development in the past year. Casgevy was approved in multiple regions, which diversified its commercial opportunity.\nAmerica Movil (AMX) Gains from Rising Subscriber Engagement\nPer the Zacks analyst, America Movil's performance is benefiting from an uptick in broadband client base and wireless subscribers. Augmented 5G footprint is a tailwind.\nRising Assets & Strong Liquidity Aid T. Rowe Price (TROW)\nPer the Zacks analyst, T. Rowe Price's increasing assets under management and strong liquidity position will positively support its financials.\nNew Downgrades\nSchneider (SNDR) Continues to Grapple With Segmental Weakness\nPer the Zacks Analyst, below par performance in the Truckload, Intermodal and Logistics segments is hurting Schneider's top line. Lowered earnings outlook for 2023 looks disappointing.\nWeak Industrial & Medical Markets Hurt Advanced Energy (AEIS)\nPer the Zacks Analyst, Advanced Energy is suffering from weakness in Industrial & Medical, Data Center Computing and Telecom & Networking end-markets.\nChoppy Office Market and High Rates to Affect Vornado (VNO)\nPer the Zacks analyst, the overall choppiness in the office market amid rightsizing and elevated interest rate offer bleak prospects for Vornado despite having premium assets in select markets.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nAmerica Movil, S.A.B. de C.V. Unsponsored ADR (AMX) : Free Stock Analysis Report\nMerck & Co., Inc. (MRK) : Free Stock Analysis Report\nFomento Economico Mexicano S.A.B. de C.V. (FMX) : Free Stock Analysis Report\nVertex Pharmaceuticals Incorporated (VRTX) : Free Stock Analysis Report\nAMCON Distributing Company (DIT): Free Stock Analysis Report\nArmanino Foods of Distinction Inc. (AMNF): Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Top-Research-Reports-Exxon-Mobil-205800241.Html", "Sentiment_Score": 0.0103644002, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-12T13:56:00.000Z", "Headline": "Hess (HES) Faces Regulatory Hurdles Amid Chevron Merger Delay", "Summary": "Hess Corporation HES, entangled in a high-stakes merger with Chevron Corporation CVX, finds itself navigating regulatory uncertainties that threaten to prolong the completion of a pivotal $53-billion deal, per recent reports by Reuters and Bloomberg News.\nThe U.S. Federal Trade Commission (“FTC”) is expected to conduct a comprehensive review of the proposed merger in the third quarter of 2024.\nOriginally slated for closure in the first half of 2024, the merger has encountered significant setbacks chiefly due to an arbitration initiated by Exxon Mobil Corporation XOM. ExxonMobil’s claim of a right of first refusal over Hess’ prized assets in Guyana has triggered a prolonged legal process, complicating the timeline for regulatory approval.\nHess, a key player in Guyana's lucrative Stabroek block, alongside ExxonMobil and China's CNOOC Ltd, owns a crucial 30% stake in the venture. The partnership is aimed at doubling oil and gas production to 1.3 million barrels per day by 2027. Despite these ambitious growth plans, the unresolved arbitration poses uncertainties for Hess's strategic initiatives in the region.\nHess and Chevron had initially aimed to conclude the merger by the first half of this year. However, with the FTC's review now expected to extend into the latter half of 2024, the timeline remains uncertain, pending the resolution of the arbitration dispute.\nHess stated that the arbitration process is advancing, with hopes of resolving by the end of 2024. Despite ExxonMobil's indications that the proceedings could stretch into 2025, Hess is optimistic about concluding the legal dispute this year.\nThe FTC's decision to delay its verdict on the merger until the arbitration case is settled, potentially as late as the fourth quarter, poses further challenges for Chevron and Hess. This regulatory scrutiny is part of broader antitrust measures impacting major deals within the oil sector this year, reflecting the FTC's rigorous approach to consolidations that could influence market dynamics.\nAs both companies await the commencement of the arbitration panel's review, which is expected to outline proceedings soon, the outcome remains pivotal for the future trajectory of Hess and its merger ambitions with Chevron.\nWhile the Chevron-Hess merger promises substantial synergies in the global energy landscape, regulatory hurdles and legal complexities underscore the arduous path toward its realization. The resolution of the arbitration with ExxonMobil stands as a critical determinant in shaping the timeline and viability of this landmark consolidation in the oil and gas sector.\nZacks Ranks & Other Stock to Consider\nHess currently flaunts a Zacks Rank #1 (Strong Buy).\nInvestors interested in the energy sector may look at another top-ranked company mentioned below. The company also presently sports a Zacks Rank #1. You can see the complete list of today’s Zacks #1 Rank stocks here.\nUSA Compression Partners, LP USAC is one of the largest independent natural gas compression service providers across the United States in terms of fleet horsepower. USAC earns its revenues from the overall horsepower use of natural gas transported rather than the price. As such, the partnership is largely insulated from fluctuations in commodity prices.\nThe Zacks Consensus Estimate for USAC’s 2024 and 2025 EPS is pegged at 77 cents and 98 cents, respectively. USA Compression Partners has a Zacks Style Score of B for Growth. It has witnessed upward earnings estimate revisions for 2024 and 2025 in the past 60 days.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nHess Corporation (HES) : Free Stock Analysis Report\nUSA Compression Partners, LP (USAC) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Hess-Hes-Faces-Regulatory-Hurdles-135600548.Html", "Sentiment_Score": -0.7626986504, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-12T10:16:56.000Z", "Headline": "FTC delays decision on Chevron-Hess deal until after Exxon’s Guyana arbitration", "Summary": "The US Federal Trade Commission (FTC) is postponing its decision on Chevron's proposed $53bn acquisition of Hess until the resolution of an arbitration case involving ExxonMobil, reported Bloomberg, citing sources.\nThe case, which contests Exxon's claimed right of first refusal over Hess' key assets in Guyana, is expected to conclude no earlier than Q4.\nBloomberg sources indicate that the FTC will wait for the arbitration outcome before announcing its decision on the deal.\nThe delay is the latest setback for the Chevron-Hess transaction, which has been under scrutiny since its announcement in October last year.\nThe FTC has been actively requesting additional information on several large oil sector deals throughout the year.\nBoth Chevron and Hess have said they anticipate completing the FTC review process by Q3.\n\"We continue to expect to complete the FTC review process during the third quarter,\" said Hess.\nThe FTC, which has discretion over the timing of its decisions unless bound by a specific agreement, did not comment on the matter.\nPreviously, the FTC allowed Exxon's acquisition of Pioneer Natural Resources to proceed, despite allegations of collusion between Pioneer's founder Scott Sheffield and OPEC officials.\nSheffield has denied these accusations.\nIn March, Exxon accused Chevron of attempting to bypass its right to purchase Hess' 30% stake in Guyana's Stabroek Block, an oilfield containing an estimated 11 billion barrels.\nChevron and Hess have refuted the allegation, arguing that the structure of the deal as a corporate takeover does not trigger Exxon's right of first refusal.\nHowever, the dispute has moved to arbitration under the International Chamber of Commerce, a process that could extend into Q4, with Exxon CEO Darren Woods suggesting it may take even longer.\nIn May, Hess shareholders narrowly approved the Chevron takeover with a 51% majority vote, despite recommendations from large shareholders and Institutional Shareholder Services to postpone the vote until after the arbitration.\n\"FTC delays decision on Chevron-Hess deal until after Exxon’s Guyana arbitration \" was originally created and published by Offshore Technology, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/Ftc-Delays-Decision-Chevron-Hess-101656310.Html", "Sentiment_Score": -0.3417555392, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-11T21:00:00.000Z", "Headline": "Big Oil is Quietly Investing in the Lithium Revolution", "Summary": "Big Oil is quietly investing in the renewable revolution – not through solar and wind power, but through lithium. The ‘white gold’ is an essential ingredient in a laundry list of clean energy technology components, most notably the lithium-ion batteries used in electrical vehicles and for short-term energy storage – an essential stop-gap for variable renewable energy production.\nJust last month, ExxonMobil inked a preliminary deal to provide lithium to South Korean electric vehicle battery manufacturer sk On. Just months before that, the firm began drilling for lithium extraction in Arkansas. And according to Exxon insiders, this is just the beginning. ExxonMobil’s Dan Holton recently told the Economist that a “material” part of the $20 billion that the oil supermajor has earmarked for low-carbon investments between 2022 and 2027 will go directly to the lithium sector. “By 2030 the company hopes to produce enough lithium to supply 1m electric vehicles a year,” the Economist reports.\nThough lithium prices have stumbled lately, this dip hasn’t seemed to spook investors, as lithium is expected to generate high rates of return for its investors as clean energy manufacturing giants around the world scramble to shore up supply chains while the green energy transition heats up. The International Renewable Energy Agency (IRENA) estimates that lithium demand for battery-making alone is expected to increase by a factor of ten over the decade between 2020 and 2030. A 2023 report from Popular Mechanics calculated that “an electrified economy in 2030 will likely need anywhere from 250,000 to 450,000 tonnes of lithium.” To put that sum in perspective, “In 2021, the world produced only 105—not 105,000—tonnes.”\nPolitics aside – money talks. And whether or not Big Oil is ready to give up the ghost of fossil fuels, they are ready to jump into the deep end of lithium production. \"What we're seeing right now in lithium is the sentiment is bearish,\" Exxon's Lithium Global Business Manager, Patrick Howarth, told Bloomberg in an interview on the sidelines of the Fastmarkets Lithium Supply and Battery Raw Materials Conference in Las Vegas. \"We know the world urgently needs significantly more lithium than it's producing today.\"\nAs such, companies are looking to get into lithium from a number of angles, including opening up new mines, extracting the valuable element from the oil and gas industry’s wastewater, and squeezing more revenue out of lands already owned by these firms where oil and gas have long since run dry.\nPutting the formidable weight of Big Oil behind lithium production in the West could have major implications for global clean energy markets. Currently, the market is all-but monopolized by China. Beijing alone controlled nearly ten percent of global lithium reserves and a whopping 72% of lithium refining capacity as of 2022. And Xi Jinping’s government is hard at work inking more and more lithium supply deals in emerging countries around the world, and in South America’s so-called ‘lithium triangle’ in particular.\nThe United States has been trying to break into the South American lithium market for years now, but has hit significant hurdles posed by China’s already considerable presence and mistrust of dealmaking with the United States. The United States government has also put considerable funds into ramping up domestic lithium production, notably in Utah. Indeed, the Biden administration has offered more than $407 million for domestic exploration and production of lithium through the Inflation Reduction Act. But there is still only one functioning lithium mine in the country, and other prospective projects are still fledgling and woefully inadequate to stand up to China any time soon.\nBut if oil supermajors, with all of their bargaining power, deep pockets, and long arms of corporate influence, get increasingly involved in lithium production in the United States, this could provide the West with a much more even playing field in the clean energy competition with China.\nBy Haley Zaremba for Oilprice.com\nMore Top Reads From Oilprice.com\nKazakhstan’s Surprise Tax Increase Shakes Up Global Uranium Market\nIndia and Russia Deepen Trade Ties Despite Ukraine Conflict\nWill China's Central Bank Cut Rates to Boost Sagging Economy?\nRead this article on OilPrice.com", "Link": "Https://Finance.Yahoo.Com/News/Big-Oil-Quietly-Investing-Lithium-210000174.Html", "Sentiment_Score": 0.1633452028, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-11T19:44:14.000Z", "Headline": "Three Energy Stocks to Buy as the Summer Heat Cranks Up", "Summary": "This summer is set to be a record breaker – with multiple heatwaves already impacting millions of people across the U.S. – even though we are still at the start of July. The weather has been so extreme that, tragically, people have passed away due to the heat this year.\nThe heat will naturally cause a spike in demand for energy-centric companies as more people use air conditioners in order to cool down, which is why today, I’ll be talking about three energy companies you should invest in. The influx in demand comes at a crucial stage for all of these companies. If you want to crank up the magnitude of your returns, consider scooping up the shares of these three energy companies.\nTesla (TSLA)\nTesla (TSLA) sign on the building on car sales\nSource: Vitaliy Karimov / Shutterstock.com\nTesla (NASDAQ:TSLA) is primarily an EV company but has recently started to expand far beyond just vehicles. It is developing the “Tesla Bot,” an AI-powered robot. Additionally, it has also rapidly expanded Tesla Energy. TSLA’s energy division has seen rapid growth recently, making it an intriguing energy play for investors.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nIn terms of quarterly revenue growth, TSLA has seen a reduction of -8.7% YoY, with a reduction of -55.1% in earnings YoY. The profit margin is sitting at 14.37%, with a lower operating margin of 5.50%. This reduction is drastic, but investors are bullish for multiple reasons, and this reduction is likely already priced in.\nTSLA has seen rapid growth in its valuation over the last few weeks; it is up over 50% over the last month, with investors being bullish on different concepts such as Robotaxi. However, it is important to note the impact of its energy segment, with Morgan Stanley increasing its price target for TSLA primarily based on the sector. This is for good reason; in Q2 2024, it deployed 9.4 GWh of energy storage, which is a record for the company, but pails in comparison to what is expected soon. This came as the company missed vehicle delivery targets, making it an important catalyst for investors to consider and weigh.\nExxon Mobile (XOM)\nExxon Mobil logo outside of a corporate building\nSource: Harry Green / Shutterstock.com\nExxon Mobile (NYSE:XOM) is a premier crude oil and natural gas explorer and extractor. While it is based in the U.S., it operates all over the world, with many of its investments being international. Earnings are coming on July 26th, and as analysts are expecting lower earnings, the stock has slipped over the last month.\nIt’s currently trading at a price of $113+ and is up almost 1% over the last month. The company has reported troubling earnings lately, by missing estimates in three of the last four quarters. Quarterly revenue is down 3.5% over the last year, with earnings down 28.1% over the same period. This is due to volatility in global energy prices, with has significantly impacted the margins XOM has.\nHowever, there are reasons to be bullish, especially for the long run. Due to expectations sliding before earnings are released, a miss will already be priced in – to a certain extent. Additionally, a new director bought $2 million worth of XOM, which is a significant bullish move and carries a heavy impact. Additionally, investments in international locations for the purpose of oil/natural gas explorations indicate the company’s commitment to increasing the stream of supply it has.\nNextEra Energy (NEE)\nNextra Energy (NEE) website on a mobile phone screen\nSource: madamF / Shutterstock.com\nNextEra Energy (NYSE:NEE) is a leading clean energy company specializing in renewable power generation, operating wind, solar, and natural gas facilities, and providing electricity through its subsidiaries, including Florida Power & Light.\nNEE stock is currently trading at ~$75, with a market cap of about $154 billion. NextEra has great financials, proven by its profit and operating margins of 27.62% and 34.78% respectively. It has a beta of 0.54, which makes NEE stock a relatively stable investment. It has consistently beaten EPS predictions over the past year, with an average surprise of 9.5%.\nThe stock is considered a ‘Buy’ and ‘Overweight’ by multiple reputed financial institutions. The company has proved its resiliency by staying profitable and delivering solid results despite fluctuations in the energy market. Investors looking for a stable, long-term investment should consider buying NEE stock for steady growth and low volatility.\nOn the date of publication, Achintya Pasricha did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article. \nAchintya Pasricha is a self-taught investor who has recently started to publish articles on a freelance basis.\nMore From InvestorPlace\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\nThe post Three Energy Stocks to Buy as the Summer Heat Cranks Up appeared first on InvestorPlace.", "Link": "Https://Finance.Yahoo.Com/News/Three-Energy-Stocks-Buy-Summer-194414781.Html", "Sentiment_Score": 0.1458262354, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-11T18:40:02.000Z", "Headline": "FTC Delays Chevron-Hess Decision to After Exxon Arbitration", "Summary": "(Bloomberg) -- The US Federal Trade Commission plans to delay its decision whether to block Chevron Corp.’s $53 billion takeover of Hess Corp. until after an arbitration case with Exxon Mobil Corp. is settled, according to people familiar with the matter.\nMost Read from Bloomberg\nBiden Vows to Stay in 2024 Race Even as NATO Gaffes Risk His Campaign\nBiden’s Putin-Zelenskiy Gaffe Deals Fresh Blow to Campaign\nTesla Delays Robotaxi Event in Blow to Musk’s Autonomy Drive\nStock Rotation Hits Megacaps on Bets Fed Will Cut: Markets Wrap\nJill Biden Has Some Explaining To Do\nThe case with Exxon, which claims to have a right of first refusal over Hess’s biggest asset in Guyana, will likely take at least until the fourth quarter, meaning the FTC’s review will extend several more months. The agency plans to announce its decision when the arbitration is finished, said the people, who asked not to be named discussing an internal agency matter.\nThe delay is yet another blow to the embattled deal, which is still far from completion nearly nine months after it was announced in October. The agency has made second requests for information for several large deals in the oil sector this year.\nThe FTC declined to comment. In separate statements, Chevron and Hess both said they expect to complete the agency’s review process during the third quarter.\n“We continue to expect to complete the FTC review process during the third quarter,” Hess said in a statement.\nUnless companies have an explicit timing agreement with the FTC, the agency has discretion on when to announce its decisions.\nShares of both companies fell on the news, pairing earlier gains. Hess was up 0.2% at 2:30 p.m., after earlier being up as much as 1.1%. Chevron shares were up 0.2%, after rising 1% earlier.\nThe FTC allowed Exxon’s takeover of Pioneer Natural Resources Co. to move forward after alleging Scott Sheffield, Pioneer’s founder and former CEO, colluded with OPEC officials and blocked him from serving on the Texas oil giant’s board. Sheffield rejected the claims.\nChevron’s agreement to buy Hess, its biggest deal in two decades, has faced several hurdles, leaving both companies in strategic limbo.\nIn March, Exxon, which discovered and operates Guyana’s Stabroek Block, accused Chevron of attempting to “circumvent” its right to buy Hess’s 30% stake in the 11 billion-barrel oil field. Chevron and Hess rejected the charge, saying Exxon’s right doesn’t apply because the deal is structured as a corporate takeover rather than an asset sale.\nBut the case went to arbitration at the International Chamber of Commerce, a process that could take until the fourth quarter at the earliest. Exxon’s CEO Darren Woods has warned it could take longer.\nIn May, Hess investors approved the Chevron takeover by a razor-thin majority of 51% after several large shareholders and Institutional Shareholder Services Inc. argued the vote should be delayed until after the arbitration case. The investors expressed concern that they would not receive Chevron dividends until the deal is complete, eroding the value of the transaction.\n--With assistance from Mitchell Ferman.\n(Adds company comments in fourth paragraph; updates shares)\nMost Read from Bloomberg Businessweek\nHow Rivian Became the Anti-Tesla\nUkraine Is Fighting Russia With Toy Drones and Duct-Taped Bombs\nLooser Visa Rules for Indian Travelers Stoke a Tourism Boom\nAt SpaceX, Elon Musk’s Own Brand of Cancel Culture Is Thriving\nHe’s Starting an Olympics Rival Where the Athletes Are on Steroids\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Ftc-Delays-Chevron-Hess-Decision-154717912.Html", "Sentiment_Score": -0.5195825696, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-11T18:48:26.000Z", "Headline": "Chevron and Hess say US FTC merger review expected for third quarter", "Summary": "By Sabrina Valle\n(Reuters) -Oil producers Chevron Corp and Hess Corp expect the U.S. Federal Trade Commission will review their proposed merger in the third quarter, the companies said in a statement on Thursday.\nBloomberg News reported earlier on Thursday the FTC planned to delay its decision on whether to block Chevron's $53-billion takeover of Hess until after an arbitration case with Exxon Mobil is settled, or at least until the fourth quarter, citing unnamed sources.\nChevron and Hess have previously said an FTC review in the third quarter would allow them to resolve the arbitration dispute by year-end.\n\"The arbitration is moving forward and we expect to have a decision by the end of 2024,\" Hess said on June 19. Exxon has signaled the arbitration process would extend into 2025.\nThe deal, which was initially planned to close in the first half of the year, had already stalled after Exxon in March filed for arbitration, claiming a right of first refusal over Hess' valuable assets in Guyana.\nA three-member panel has not yet begun work on a review of Exxon's claim of preemption rights to acquire Hess's Guyana assets. It is expected to set a schedule for proceedings in the coming weeks.\nHess owns 30% of Guyana's giant Stabroek block operated by Exxon, which owns 45%. China's CNOOC Ltd [0883.HK] holds the remaining 25%. The companies expect to double production to 1.3 million barrels of oil and gas per day by 2027.\n(Reporting by Sabrina Valle in Houston; additional reporting by Jody Godoy. Editing by Shilpi Majumdar, David Gregorio, Richard Chang and Rod Nickel)", "Link": "Https://Finance.Yahoo.Com/News/Us-Ftc-Delay-Decision-Chevron-162804700.Html", "Sentiment_Score": -0.1571344435, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-11T13:27:00.000Z", "Headline": "3 Energy Companies to Gain on Rock Solid Balance Sheet", "Summary": "The price of West Texas Intermediate (WTI) crude oil is trading at more than the $80 per barrel mark and is likely to remain strong this year. The U.S. Energy Information Administration (“EIA”) projects WTI oil to average $82.03 per barrel in 2024, a notable increase from last year's $77.58. EIA noted that ongoing reductions in global oil stockpiles are expected to continue pushing commodity prices upward.\nWhile crude prices stay favorable, the likelihood of the commodity reaching $100 per barrel, as seen in 2022, is extremely slim. Additionally, EIA expects the annual GDP growth rate to decline to 2.4% in 2024 from last year's 2.5%. For 2025, the growth rate is projected to fall further to 1.8%. Thus, the forecasted slowdown of the GDP growth rate may consequently dampen energy demand, thereby negatively impacting commodity prices.\n3 Stocks to Gain\nThe current scenario highlights the need to keep a close watch on major energy companies like Exxon Mobil Corporation XOM, Chevron Corporation CVX, and ConocoPhillips COP, which are known for their strong balance sheet. This is because these energy giants can rely on their financial stability to navigate a volatile and uncertain business environment. While Chevron has a Zacks Rank #2 (Buy), ExxonMobil and ConocoPhillips carry a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nChevron and ExxonMobil boast robust balance sheet, enabling them to withstand challenging business environments. XOM’s total debt-to-capitalization ratio stands at almost 16%, while Chevron's is at 11.9%, both significantly lower than the 24.2% average for composite stocks in the Zacks Oil & Gas Integrated International industry. Over the past three years, these industry leaders have consistently maintained lower debt-to-capitalization ratios, supported by strong oil prices that enhance their financial positions. This financial strength positions them well for future gains.\nConocoPhillips has secured a promising production outlook by capitalizing on its extensive drilling inventory and diverse upstream assets. Compared to composite stocks belonging to the industry, the leading upstream energy company has significantly less reliance on debt capital. This robust balance sheet positions ConocoPhillips to better withstand adverse business conditions. Like Chevron and ExxonMobil, favorable oil prices are also boosting COP’s financial performance.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nConocoPhillips (COP) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/3-Energy-Companies-Gain-Rock-132700833.Html", "Sentiment_Score": 0.9338282943, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-11T13:19:00.000Z", "Headline": "Exxon Is the King of Big Oil. Here’s Why the Stock Is a Top Holding in an ‘Energy Transition’ Fund.", "Summary": "FEATURE Beauty is in the eye of the beholder. So too, at times, is sustainability. Big energy companies have long been seen as antithetical to the transition away from fossil fuels toward more green energy solutions.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/9Fa4Bb67-72D5-35Af-8Be4-1A8673E1Cc2A/Exxon-Is-The-King-Of-Big-Oil-.Html", "Sentiment_Score": 0.0845862851, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-11T12:22:00.000Z", "Headline": "Oil & Gas Stock Roundup: ExxonMobil & Shell's Q2 Updates in Focus", "Summary": "It was a week when oil prices moved up, but natural gas futures posted a loss.\n\nThe headlines revolved around energy biggies ExxonMobil XOM and Shell’s SHEL Q2 earnings update. Developments associated with Kosmos Energy KOS, Eni SpA E and Pembina Pipeline Corporation PBA also grabbed attention.\n\nOverall, it was a mixed seven-day period for the sector. West Texas Intermediate (WTI) crude futures rose around 2% to close at $83.16 per barrel, but natural gas prices fell 10.8% to end at $2.32 per million British thermal units (MMBtu).\n\nOil prices extended gains for the fourth straight week after a report from the Energy Information Administration (\"EIA\") showed drawdowns in crude and fuel stockpiles.\n\nMeanwhile, natural gas settled with a heavy loss following bearish inventory numbers, together with signs of production gains.\nRecap of the Week’s Most Important Stories\n1.    American energy major ExxonMobil recently disclosed in a Form 8-K that soft natural gas prices due to lower demand and excess inventories will sequentially hurt its second-quarter 2024 earnings.\n\nOwing to changes in prices of the commodity, the leading integrated energy player expects its second-quarter earnings to decline sequentially by $300 million to $700 million. However, XOM projects that a favorable crude pricing scenario in the June quarter will completely offset this negative impact.\n\nExxonMobil added that unfavorable changes in industry margins will affect its earnings from refining activities by $1.1 billion to $1.5 billion. These estimates exclude the impact of the acquisition of Pioneer Natural Resources, which was closed on May 3 and strengthened the company’s footprint in the Permian Basin, the most prolific basin in the United States. (ExxonMobil Expects Soft Gas Prices to Hurt Q2 Earnings)\n\n2.    Shell expects a $2 billion impairment in the second quarter of 2024 after pausing its Rotterdam biofuels facility and divesting its Singapore refinery. Rotterdam's construction halt leads to a $600 million to $1 billion non-cash charge, while Singapore sees $600 million to $800 million in charges.\n\nAccording to the London-based energy biggie’s latest update, Shell’s upstream production fell 5.4% on a sequential basis in the second quarter of 2024 at the midpoint of the guidance. The Zacks Rank #3 (Hold) supermajor is estimating its output in the range of 1,720-1,820 (thousand barrels of oil equivalent per day) MBOE/d compared to 1,872 MBOE/d in the first quarter of 2024. Tax charges are expected to hurt earnings in the range of $1.8-$2.6 billion.\n\nYou can see the complete list of today’s Zacks #1 Rank stocks here.\n\nMeanwhile, Shell’s LNG liquefaction volumes in its Integrated Gas unit are expected in the range of 6.8-7.2 million tons, translating into a decrease of around 7.7% sequentially. Shell’s integrated gas production is expected in the range of 940,000-9800,000 barrels of oil equivalent per day (BOE/d) or 960,000 BOE/d at the midpoint. It was 992,000 BOE/d in the January-March period. (Shell Provides Q2 Guidance: Warns of Up to $2B Hit)\n\n3.    Kosmos Energy, a deepwater exploration and production firm, has announced the initiation of oil production from the Winterfell development in the U.S. Gulf of Mexico. The Winterfell development in the Green Canyon area of the U.S. Gulf of Mexico is operated by Beacon Offshore Energy, with Kosmos holding a 25.04% working interest in the field.\n\nWinterfell is a phased development. For the first phase, two production wells are currently online and working to increase the production from the development. Alongside, a third well is being drilled, expected to be operational by the end of the third quarter of 2024. The three wells are anticipated to produce 20,000 barrels of oil equivalent per day (boe/d).\n\nThe first phase includes five wells in total, which are projected to produce 100 million boe, with significant upside potential in subsequent phases. The Miocene-aged Winterfell field is situated in water depths of approximately 5,400 feet. It was developed using a 13-mile subsea tieback to a host platform operated by Occidental Petroleum. Discovered in 2021, the final investment decision for Winterfell was made in January 2024. (Kosmos Energy Hits Production Milestone With Winterfell)\n\n4.    Eni, an Italian energy giant, has announced a major new oil discovery in the Yopaat-1 EXP exploration well in Block 9, located approximately 63 kilometers off the coast in the mid-deep waters of the Cuenca Salina in the Sureste Basin, offshore Mexico. The preliminary estimates suggest that the discovery holds around 300-400 million barrels of oil equivalents (Mboe) and associated gas in place.\n\nThe Yopaat-1 EXP well was drilled in a water depth of 525 meters and reached a total depth of 2,931 meters, encountering approximately 200 meters of net pay of hydrocarbon-bearing sands in the Pliocene and Miocene sequences. The drilling operation was accompanied by an extensive subsurface data acquisition campaign, ensuring a comprehensive understanding of the geological formation.\n\nEni's presence in Mexico dates back to 2006. In 2015, the company established its wholly-owned subsidiary, Eni Mexico S. de R. L. de C.V. Today, Eni stands as the leading foreign operator in the country, holding rights in eight exploration and production blocks in the Sureste Basin, of which the company operates seven. (Eni Strikes Big With New Discovery in Sureste Basin).\n\n5.    Pembina Pipeline, an energy transportation and midstream services provider, has entered into a purchase and sale agreement through its joint venture entity, Pembina Gas Infrastructure Inc. (\"PGI\"), with Whitecap Resources Inc., a Calgary-based oil and gas exploration and production company.\n\nThis strategic collaboration will see PGI acquiring a 50% working interest in Whitecap’s 15-07 Kaybob Complex in Alberta and supporting the infrastructure development of the company’s Lator growth area. The gross proceeds related to this transaction amount to C$420 million, with C$252 million net to Pembina.\n\nDespite the acquisition, Whitecap will retain operatorship of the assets. A long-term take-or-pay agreement for PGI’s capacity in the Kaybob Complex has been secured with Whitecap, which will be a dedicated area for all volumes produced by the company in the region.\nPrice Performance\nThe following table shows the price movement of some major oil and gas players over the past week and during the last six months.\n\nCompany    Last Week    Last 6 Months\nXOM               -1.5%                +14.9%\nCVX                -1.3%                +8.2%\nCOP               -1.6%                +1.9%\nOXY                -2%                   +7.7%\nSLB                -2.2%                -7.1%\nRIG                 -4.7%                -11.3%\nVLO                -2.5%                +15.3%\nMPC               -1.6%                +5.1%\n\nStocks had a mostly bearish week, indicative of the uncertain trading in oil and gas. The Energy Select Sector SPDR — a popular way to track energy companies — fell 1.2% last week. However, the sector tracker has increased 10.6% over the past six months.\nWhat’s Next in the Energy World?\nAs usual, market participants will closely track the regular releases to look for guidance on the direction of the commodities. In this context, the U.S. government’s statistics on oil and natural gas — one of the few solid indicators that come out regularly — will be on energy traders' radar. Fuel demand and the rate of stock drawdowns in the coming weeks will determine the trend in commodity prices. Data on rig count from the oilfield service firm Baker Hughes, which is a pointer to the trends in U.S. crude/natural gas production, is closely followed, too.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nEni SpA (E) : Free Stock Analysis Report\nKosmos Energy Ltd. (KOS) : Free Stock Analysis Report\nPembina Pipeline Corp. (PBA) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Oil-Gas-Stock-Roundup-Exxonmobil-122200601.Html", "Sentiment_Score": 0.0008513555, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-11T10:01:00.000Z", "Headline": "3 Top Hydrogen Fuel Stocks Offering Tremendous Upside Potential", "Summary": "Signs continue to mount that the demand for hydrogen fuel stocks will be quite strong in the coming years. One of the latest such developments was the strong Q2 delivery data provided by Hydrogen-powered truck maker Nikola (NASDAQ:NKLA). In Q2, the company delivered 72 such trucks, well above its previous guidance of 60. Moreover, one of its customers was Walmart’s (NYSE:WMT) Canada unit. That indicates that the world’s largest retailer is interested in participating in the Hydrogen Revolution.\nMeanwhile, in Australia, Climate Impact Corporation intends to develop a huge 20 gigawatts of green hydrogen initiatives. The firm plans to partner with GE Vernova (NYSE:GEV) for the projects. Here are three top hydrogen fuel stocks that can soar as the demand for green hydrogen surges.\nPlug Power (PLUG)\nPerson holding smartphone with logo of US hydrogen fuel cell company Plug Power Inc. on screen in front of website. Focus on phone display. Unmodified photo. PLUG stock\nSource: T. Schneider / Shutterstock.com\nPlug Power (NASDAQ:PLUG) continues to lay the groundwork to become a leader of the Hydrogen Revolution. The company is reporting huge losses. However, in the coming years, it plans to build several new green hydrogen plants. Given the large, growing demand for green hydrogen, and the tax credits for the fuel in the U.S., the company’s fuel business will likely become very profitable in the long-term. Indeed, Plug has said that it plans to generate “growing positive fuel margins in 2025 and beyond.”\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nSimilarly, deployments of the company’s electrolyzers are rapidly ramping up. As a result, I believe that this business will generate huge profits over the long-term as its revenue surges and its costs drop. Electrolyzers are used to produce green hydrogen.\nShowing how rapidly the business is growing, Plug reported that it plans to “ship and begin commissioning” at least 37 electrolyzers in 2024. These units will produce 40 metric tons of green hydrogen per day.\nMoreover, Plug is likely to benefit from Nikola’s success, since the two firms announced a partnership in December 2022. With Plug becoming a leader in the green hydrogen boom, I believe that it is one of the best hydrogen fuel stocks to buy.\nAir Products (APD)\nAir Products truck on motorway. APD stock.\nSource: Bjoern Wylezich / Shutterstock\nAir Products (NYSE:APD) provides gases for industrial companies, and looks poised to benefit tremendously from strong demand for green hydrogen. Last month, Air Products disclosed that it had signed a 15-year deal to provide 70,000 tons of green hydrogen to TotalEnergies in Europe. The deliveries are slated to begin in 2030.\nAlso last month, the firm announced that it would “build a network of hydrogen refueling stations running the length of California.” As a result, the company looks poised to become a leader in the operation of such stations. Given the likely strong demand for hydrogen in the U.S., these stations are likely to eventually become very profitable.\nThe company plans to build a $4 billion green hydrogen plant in Texas. However, APD has decided to wait for the IRS to issue the final rules on America’s hydrogen tax credits before making its final investment decision. But, since the company said that the initial rules reduced by the agency were acceptable, it is likely to proceed. The facility will give the company another way to benefit from the strong demand for green hydrogen.\nGiven the many ways in which Air Products looks poised to benefit from the Hydrogen Revolution, I view it as one of the top hydrogen fuel stocks.\nAir Liquide (AIQUY)\nAir Liquide (AIQUY) company logo on a gas tank. Air Liquide S.A. is a French multinational company which supplies industrial gases and services\nSource: Oliver Hoffmann / Shutterstock.com\nGas producer Air Liquide (OTCMKTS:AIQUY) is slated to become a major supplier for Exxon Mobil’s (NYSE:XOM). XOM plans to build a hydrogen plant in Texas which will also produce ammonia. Air Liquide intends to supply 9,000 metric tons per day of oxygen and up to 6,500 metric tons per day of nitrogen to the facility. According to Exxon, the plant will become the world’s largest producer of hydrogen. It is slated to produce 1 billion cubic feet per day of hydrogen.\nInterestingly, Air Liquide also looks poised to benefit from the AI Revolution. That’s because it’s building a $250 million plant in Idaho to provide Micron (NASDAQ:MU) and other chip makers with gases. The facility is supposed to start producing gas at the end of next year.\nKeep an eye on AIQUY since it is dipping its toes into two different, yet lucrative, markets.\nOn the date of publication, Larry Ramer held long positions in PLUG,GEV, and MU. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\nOn the date of publication, the responsible editor did not have (either directly or\nindirectly) any positions in the securities mentioned in this article.\nLarry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer.\nMore From InvestorPlace\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\nThe post 3 Top Hydrogen Fuel Stocks Offering Tremendous Upside Potential appeared first on InvestorPlace.", "Link": "Https://Finance.Yahoo.Com/News/3-Top-Hydrogen-Fuel-Stocks-100100902.Html", "Sentiment_Score": 0.8944448233, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-10T17:23:52.000Z", "Headline": "3 ‘Buy Now or Cry Later’ Stocks for Long-Term Wealth", "Summary": "Most investors are primarily concerned with building long-term wealth as opposed to capturing quick gains. Of course, those same investors would gladly reap short-term gains if they were reliable, but they aren’t. It remains incredibly difficult to identify stocks that will perform well over the short term. Yet, identifying stocks with the potential to create long-term wealth has proven easier.\nGiven time, companies with readily identifiable fundamental strengths tend to increase in value. These are the kinds of stocks you’re likely to find recommended by value investors such as Warren Buffett.\nInvesting in strong companies with durable competitive advantages is one of the best ways to build long-term wealth. These are the kind of companies that routinely maintain strong pricing advantages over the long term that create all kinds of beneficial internal economics. The companies discussed below certainly benefit from those factors and more, which is the reason to buy now.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nMicrosoft (MSFT)\nmicrosoft stock\nSource: Peteri / Shutterstock.com\nOne of the best reasons to believe Microsoft (NASDAQ:MSFT) stock will continue to create long-term wealth for investors is its forecast growth.\nMicrosoft reported just under $212 billion in sales in 2023. That figure is expected to approximately double by 2028. Given how successful the company has been in investing in artificial intelligence, it’s easy to see why Microsoft continues to be so loved.\nIt is one of the so-called hyperscaler companies looking to commoditize artificial intelligence. It is doing so by buying up massive quantities of AI chips and implementing them at its data centers.\nAs artificial intelligence becomes more and more a part of our lives Microsoft should become that much more valuable.\nThe strategy is highly logical and is part of a broader thinking that characterizes AI as the new digital gold. Outside of AI, Microsoft continues to be subsidized by the strength of its Office and Windows products. Microsoft has multiple ways to continue winning and creating long-term wealth.\nAmazon (AMZN)\nAn image of an Amazon logo on a building\nSource: Jonathan Weiss / Shutterstock.com\nAmazon (NASDAQ:AMZN) is another strong choice for investors looking for stocks that will create long-term wealth. I believe many investors automatically discount Amazon and other similarly sized companies for the simple fact that they believe past growth is not replicable.\nAfter all, Amazon reported $574 billion in revenues in 2023. It’s therefore easy to presume growth will slow due to reaching such a massive scale. Yet, it’s possible that Amazon could reach $1 trillion in sales by 2028. It is predicted to come very close as it will grow by roughly 70% over that period.\nWhat I particularly like about Amazon is the company’s substantial investment in Anthropic, for which it recently completed its $4 billion investment. I believe Amazon will benefit substantially from that investment as Anthropic is noted to take a slower, more pragmatic approach to AI development than rival OpenAI. That developmental approach is likely to yield better results in the enterprise space, which requires greater accuracy and where substantial revenues will flow from.\nExxon Mobil (XOM)\nExxon Retail Gas Location\nSource: Jonathan Weiss / Shutterstock.com\nExxon Mobil (NYSE:XOM) has long proven capable of creating long-term wealth. It is primarily an income-producing stock with much of its long-term wealth-creating ability coming from dividends. However, it also produces substantial share price gains as oil prices peak.\nWe now may be entering another such period as Brent crude surges past $86 per barrel. Analysts believe that it could peak above $90. Standard Chartered says the current supply deficit characterizing the third quarter will spill into the fourth quarter. That suggests Exxon Mobil will perform strongly throughout the remainder of 2024.\nAnd while investors should be able to capitalize on those supply shortfalls, there are other reasons to like ExxonMobil. Most investors will compare it to Chevron (NYSE:CVX), the other common Big Oil choice. But with a choice between the two, Exxon is better at creating more value than Chevron. The peak oil argument was overdone and companies like ExxonMobil continue to have the ability to create long-term wealth for investors.\nOn the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\nOn the date of publication, the responsible editor held a LONG position in XOM and CVX.\nAlex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.\nMore From InvestorPlace\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\nThe post 3 ‘Buy Now or Cry Later’ Stocks for Long-Term Wealth appeared first on InvestorPlace.", "Link": "Https://Finance.Yahoo.Com/News/3-Buy-Now-Cry-Later-172352244.Html", "Sentiment_Score": 0.0464918315, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-10T16:30:00.000Z", "Headline": "Why private equity is 'the real issue' in M&A", "Summary": "The mergers and acquisition (M&A) landscape has seen significant activity in 2024, with major deals like ConocoPhillips' (COP) announcing its plans to acquire Marathon Oil (MRO) and Capital One's (COF) intent to purchase Discover (DFS) making headlines. To gain insight into whether this trend can continue, Solomon Partners CEO Marc Cooper shares his outlook on dealmaking for the remainder of 2024.\nCooper characterizes the current M&A environment as \"a tale of two cities.\" On one hand, he notes that \"strategic M&A is doing great,\" with companies continuing to engage in \"noteworthy transactions\" aimed at creating increased value. However, Cooper points out, \"the real issue is private equity.\" He explains that this segment of the market has not yet reached \"that equilibrium point\" between buyers' and sellers' expectations.\n\"There are an unprecedented number of assets owned by private equity that are slated for sale, but are not getting done because of price discrepancy. It's really going to be an issue of just accepting what the new price reality is,\" Cooper told Yahoo Finance.\nFor more expert insight and the latest market action, click here to watch this full episode of Catalysts.\nThis post was written by Angel Smith", "Link": "Https://Finance.Yahoo.Com/Video/Why-Private-Equity-Real-Issue-163000076.Html", "Sentiment_Score": -0.0118499286, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-10T12:56:00.000Z", "Headline": "Should You Buy, Hold, or Sell ExxonMobil (XOM) Post Q2 Update?", "Summary": "Exxon Mobil Corporation XOM recently made a Form 8-K disclosure, stating that soft natural gas prices — resulting from reduced demand and surplus inventories — are expected to have negatively impacted its second-quarter 2024 earnings. Additionally, its announcement regarding diminished refining margins exacerbates apprehensions about second-quarter earnings performance.\nThe critical question now facing investors is how to strategically position themselves regarding the stock. Before addressing this, let's review some fundamental aspects of ExxonMobil.\nStrong Permian & Guyana Presence\nWith a strong focus on strengthening its presence in the Permian, ExxonMobil completed the acquisition of Pioneer Natural Resources Company on May 3. With 1.4 million net acres of the combined company in the Delaware and Midland basins, having an estimated 16 billion barrels of oil equivalent resource, ExxonMobil has greatly transformed its upstream portfolio.\nThe company expects that based on 2023 volumes, its production from the most prolific basin will more than double to 1.3 million barrels of oil equivalent per day (MMBoE/D). For 2027, the energy giant expects its Permian production volume to increase to 2 MMBoE/D.\nSimilar to its operations in the Permian, ExxonMobil boasts a robust project pipeline in offshore Guyana resources. The company is well-positioned to generate significant returns from both the Permian and Guyana due to low production costs in these assets. With oil prices remaining favorable this year, ExxonMobil is strategically poised to generate substantial cash flows from its upstream operations, which contribute the majority to its total earnings.\nIntegrated Business Model & Robust Balance Sheet\nDue to its integrated business model, ExxonMobil is well protected when oil price turns low. This is because, apart from exploration and production activities, the company has an extensive footprint in refining and chemical businesses.\nDuring uncertain times, ExxonMobil can rely on its robust balance sheet. Compared to the industry composite stocks, which have a debt-to-capitalization ratio of 24.2%, ExxonMobil maintains a much lower ratio at 15.9%. Favorable commodity prices have enabled it to enhance its financial position and repay the debt incurred during the pandemic. Chevron Corporation CVX is another integrated energy giant with a strong balance sheet. Belonging to the same industry, Chevron has a much lower debt-to-capitalization ratio of 11.9%.\nBP plc BP, another major player in the integrated energy space, is also reducing its debt load backed by higher oil prices and decreased capital spending. BP’s debt-to-capitalization ratio is much higher at 38.4%.\nZacks Investment Research\nImage Source: Zacks Investment Research\nEntry Into the Lithium Market\nIn addition to its traditional upstream and downstream energy operations, ExxonMobil is entering the lithium market, a critical component in electric vehicle batteries. The world is demanding more lithium to meet the growth in electric vehicles, and XOM is thus well-positioned to gain in the long run.\nOn Jun 25, ExxonMobil signed an agreement with SK On to supply up to 100,000 metric tons of lithium from its upcoming project in Arkansas. SK On will utilize this lithium in its U.S.-based electric vehicle battery manufacturing facility.\nKeep an Eye on the Stock\nExxonMobil, carrying a Zacks Rank #3 (Hold), maintains a robust and diversified business model, which will enable it to continue returning cash to shareholders. Over the past 41 years, XOM's dividend payments have grown at an average annual rate of 5.8%.You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nThese positive developments are evident in the year-to-date price performance of XOM's stock. During this period, the company has appreciated 12.9%, outperforming the 7.7% increase of the industry.\nZacks Investment Research\nImage Source: Zacks Investment Research\nIt is evident that while ExxonMobil expects challenges such as soft gas prices and unfavorable industry margins to affect second-quarter earnings, the company's long-term outlook remains promising. However, investors are advised against rushing to add the stock to their portfolios at present and should instead await a more opportune entry point.\nThis is because, at this moment, shares are somewhat expensive on a relative basis, with the current 6.15X trailing 12-month Enterprise Value/Earnings before Interest Tax Depreciation and Amortization staying above the 6.12X five-year median. Also, the company is trading at a premium to the broader industry average of 3.95X.\nZacks Investment Research\nImage Source: Zacks Investment Research\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Buy-Hold-Sell-Exxonmobil-Xom-125600127.Html", "Sentiment_Score": 0.0171557665, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-09T21:48:13.000Z", "Headline": "Lennar upgrade, private market investing: Market Domination", "Summary": "It was a quiet day on Wall Street, with the S&P 500 (^GSPC) and the Nasdaq (^IXIC) closing at record highs. The Dow Jones Industrial Average (^DJI) closed 52 points lower.\nOne thing investors were watching was Federal Reserve Chairman Jerome Powell's semiannual testimony before the Senate Banking Committee. Powell says the Fed needs to see more data showing inflation is slowing before cutting rates. Claudia Sahm, the founder of Sahm Consulting and former Federal Reserve Board Economist, says the Fed is in a difficult balancing act but that the central bank has, so far, brought inflation down without a recession occurring.\nHamilton Lane Co-CEO Erik Hirsch tells investors how they can learn to navigate opportunities in the private market, while Hennessy Energy Transition Portfolio Manager Fund Ben Cook explains why he thinks ExxonMobil (XOM) is a better energy sector pick than First Solar (FSLR). Wedbush Securities SVP of equity research Jay McCanless also joins the program to explain why he homebuilder Lennar (LEN) to Neutral from Underperform.\nMarket Domination anchors Julie Hyman and Josh Lipton also take a look at some of the day's trending tickers, including Tesla (TSLA), Nvidia (NVDA), Albermarle (ALB), Boeing (BA), and Oracle (ORCL).\nFor more expert insight and the latest market action, click here.\nThis post was written by Stephanie Mikulich.", "Link": "Https://Finance.Yahoo.Com/Video/Lennar-Upgrade-Private-Market-Investing-214813672.Html", "Sentiment_Score": 0.0447666459, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-09T20:37:45.000Z", "Headline": "Why this portfolio manager favors ExxonMobil over First Solar", "Summary": "Today's segment of Good Buy or Goodbye features host Julie Hyman alongside Hennessy Energy Transition Portfolio Manager Fund Ben Cook. Together, they explore Cook's top stock pick and top stock to avoid within the energy sector.\nCook highlights ExxonMobil (XOM) as his top stock pick for investors, citing several key factors. He praises the company's integrated business model, stating it \"affords flexibility to generate consistent financial results through the cycle.\" Cook also notes ExxonMobil's success in creating growth opportunities \"through acquisitions and through the drill business.\" Furthermore, he describes the company as \"best in the business\" at returning capital to shareholders, emphasizing the attractive \"cash return profile.\"\nConversely, Cook advises investors to steer clear of First Solar (FSLR), pointing out several risk factors. He notes that the company's revenue generation heavily depends on \"protective policy measures,\" which are subject to change with different presidential administrations. Cook also highlights the challenges of the energy transition, noting its \"uneven pace\" with reliability and cost being primary concerns. Lastly, he mentions that First Solar has been negatively impacted by the high interest rate environment.\nFor more expert insight and the latest market action, click here to watch this full episode of Market Domination.\nThis post was written by Angel Smith", "Link": "Https://Finance.Yahoo.Com/Video/Why-Portfolio-Manager-Favors-Exxonmobil-203745842.Html", "Sentiment_Score": 0.0201826431, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-09T17:00:00.000Z", "Headline": "Offshore Guyana: ‘The Place to Spend Money’", "Summary": "Three companies. Ten projects. Twelve years. One prolific offshore block.\nAnd a combined capex that could reach as high as $105 billion.\nThe consortium of Exxon Mobil, Hess Corp. and China National Offshore Oil Corp. (CNOOC) has already made final investment decisions (FID) worth $54.5 billion on six projects in the Stabroek Block offshore Guyana. Moving forward is simply a matter of figuring out the best way to exploit a resource estimated at 11 Bboe.\nAlistair Routledge, the president of Exxon Mobil Guyana, said the resource figure was based on a lot of analyses but also a lot of uncertainty. Each partner is working with its own numbers, he said during a panel discussion at the Offshore Technology Conference (OTC) in May.\n“The six initial [projects] are developing around 4.9 billion oil equivalent barrels. So, we are already getting close to developing half of that resource through the commitments that we’ve made to date. That still leaves another 6 billion,” Routledge said. “We’re basically working through that resource base to understand it, [and] one of the particular areas of focus … is the gas resource.”\nHe reiterated that the figures were resources, not reserves. Future updates to the resource estimate could take time owing to the huge amount of data to sort through and understand.\n“Our focus has actually shifted to: are we moving the resource into project execution? We are focused on getting those matured,” Routledge said. “We are very encouraged with the work that has been going on with all the technical teams around concepts and maturing the understanding of that resource, both from a reservoir static and dynamic performance perspective.”\nCombined production from the first phase of development will reach 1.33 MMbbl/d by 2027, according to Exxon.\n“In general, if you look at the entirety of Exxon’s portfolio, this is the place that they want to spend money,” Rystad Energy Senior Vice President and Head of Latin America W. Schreiner Parker told Oil and Gas Investor (OGI).\nA second phase of development will require four new FPSOs in Stabroek over the near term. The last project sanctioned by the consortium, Whiptail in April 2024, cost $12.7 billion with associated FPSO production capacity of 250,000 bbl/d. Assuming future projects will be of the same magnitude, the combined FIDs will total about $51 billion and add at least 1 MMbbl/d of production.\nParker expects the consortium to spend an average of about $10 billion per year between 2025 and 2030, mostly on development but also on exploration.\nThe expense will not divert Exxon from its “build one, design many” mindset in Guyana. Parker expects the consortium to move forward with construction of the FPSOs. Welligence Energy Analytics Vice President Andre Fagundes agrees.\n“Our valuation model considers the installation of five additional FPSOs at Stabroek by 2029 with a total capex of $52 billion, and followed by two additional [FPSOs] in 2030 and 2031,” Fagundes told OGI. He doubts the consortium will be constrained by finances.\n(Source: Exxon Mobil Corp./ Hess Corp.)\n(Source: Welligence Energy Analytics/ Hart Energy)\n“Given the exceptional fiscal terms and projected production growth, we estimate the projects to be practically self-funded from their own free cash flow,” Fagundes said. “Consequently, we believe that the project partners are financially equipped to support this development.”\nStabroek is located approximately 120 miles offshore Guyana and covers 6.6 million acres. The block is equivalent in size to 1,150 U.S. Gulf of Mexico (GoM) blocks and contains multiple prospects and play types, according to Hess.\nExxon Mobil Guyana operates Stabroek and holds a 45% interest. Its local partners include Hess Guyana Exploration (30%) and CNOOC Petroleum Guyana (25%).\nQuick rise\nGuyana was colonized by the Dutch in the 17th century, but by 1815 had become a British possession. It is the third-smallest country in South America after Suriname to its east and Uruguay to the south. It is almost twice the size of Tennessee with a population of about 800,000.\nExxon initiated exploration offshore Guyana in 2008 and drilled its first exploration well, Liza-1, in 2015. That well encountered over 295 ft of high-quality oil-bearing sandstone reservoirs and was safely drilled to 17,825 ft in 5,719 ft of water.\n“Guyana is a long-time gold producer and also had a history where there was this big belief that there was going to be the ‘El Dorado,’ the big find of oil in Guyana,” Exxon’s Routledge said during OTC.\n“Well, finally we have it and it’s catapulting Guyana up the league tables and becoming a true emerging powerhouse of energy in South America, and a vital source of energy … in a world that needs that diversity of supply to give us all security and affordability of energy supply,” he said.\nTo grasp the impact of the “big find,” consider that oil production is responsible for Guyana’s GDP soaring to $14.7 billion in 2022 from $1.1 billion in 2005, according to the World Bank.\nExxon’s first three Stabroek projects—Liza 1 (using the Liza Destiny FPSO), Liza 2 (Liza Unity FPSO) and Payara (Prosperity FPSO)—produce just north of 600,000 bbl/d, analysts estimate.\n(Source: Exxon Mobil)\n“In terms of the production, we’re kind of in a little bit of a plateau here in 2024 to 2025, but it will essentially double between next year and 2030 off the back of all that investment that’s going to take place between 2025 and 2030,” Rystad’s Parker told OGI.\nThe fourth, fifth and sixth Stabroek projects have been sanctioned but have yet to start producing. All will use FPSOs with production capacity of 250,000 bbl/d.\nYellowtail, sanctioned in April 2022, will use the ONE GUYANA FPSO with first oil expected in 2025; Uaru, sanctioned in April 2023, will use the Errea Wittu FPSO, with first oil expected in 2026. Whiptail, sanctioned in April 2024, will use the Jaguar FPSO, with first oil expected in 2027.\nThe Liza Unity FPSO will operate in Liza Phase 2. (Source: Lim Weixiang)\nFollow the money\nExxon’s Routledge said about one-third of the capital spend in Guyana was on the wells that are drilled, another third on subsea umbilicals, risers and flowlines (SURF), and the remainder on the FPSOs.\n“We tend to focus on the FPSOs because that’s what we see every day, and when we go offshore, we get to land on those, and that’s where our workforce is. But the reality is, most of the work goes into what sits on the seabed or indeed the wells that go down into the reservoirs,” Routledge said.\nStena Drilling and Noble Corp. are Exxon’s main drilling contractors. They have provided the Stabroek consortium with six deepwater rigs, which are operating at a “benchmarking and industry-leading pace,” Routledge said.\n“They set an aspirational goal just a year and a half ago that they would achieve zero/five/35 in the drilling operations. And that was zero safety incidents, less than 5% non-productive time and 35 days to drill and complete these deepwater wells. They have already achieved wells in less than 30 days, drilled and completed, which in all the benchmarking you look at just sets a new level of performance,” Routledge said.\nEach of the FPSOs in Stabroek can store up to 2 MMbbl of oil. Exxon’s cargo lifts can total 1 MMbbl, so the FPSOs need to unload a cargo every four days.\n“Sometimes we’re using the very large crude carrier (VLCC), which are 2 MMbbl vessels. They will take two separate cargoes, so we will attach them to one of the FPSOs, lift a 1 MMbbl cargo, and then they’ll disconnect and either go to one of the other terminals or reconnect afterwards. These are vast vessels, and once connected are less than 492 feet apart in the ocean,” Routledge said, adding it takes around 24 hours to pump 1 MMbbl from the FPSO onto the carriers.\n‘Tiger economy’\n“Guyana is a tiger economy moving at a rapid pace and this is probably the last time you will see such a development in the world,” Guyana Office for Investment Agency Head Peter R. Ramsaroop told OGI on the sidelines of OTC. “So, if you are in the oil business and you’re not in Guyana, you’re missing out.”\nRamsaroop said that the next wave of Guyana’s economic growth would focus on agriculture sustainability, food security, climate security and energy security. Ramsaroop said Guyana would “lead CARICOM (Caribbean Community) in those areas.”\nRamsaroop said the government of President Mohamed Irfaan Ali plans to continue to grow the country while ensuring that the people benefit. He warned that Guyana needed a lot more skilled people.\n“Like Dubai or Qatar, we are out of resources. If you win a contract to build a 20-mile road or a bridge, you have to bring your people,” Ramsaroop said. “We’re working on new immigration policies and making it easier for work permits over time. But by 2030 plus, we may have around 3 million people in Guyana.”\nThe country occupies 83,000 square miles, or about the size of Great Britain, he said. But Great Britain’s population is about 65 million. “For us to develop Guyana to the level that Guyana is being developed, you need people.” Ramsaroop reiterated.\n“We have a low-carbon development strategy. We have the lowest deforestation rate. We’re doing things in a sustainable manner, but don’t tell us to keep our people poor,” Ramsaroop said. “If the other option is to cut our $95 billion forest down, we won’t do that [either].”\nGuyana’s impressive growth story has attracted the attention of government and companies alike. Chevron’s $53 billion all-stock offer for Hess is as much about Guyana as much as it is about Chevron adding assets in the GoM, offshore Southeast Asia and in the Bakken Shale.\nHess’ assets in Stabroek instigated a spat between Chevron and Exxon, drawing in CNOOC as the latter two claim they have a right of first refusal (ROFR) to Hess’ interest. Arbitration among the three companies continues.\nChevron’s deal with Hess could close in 2025, TD Cowen managing director David Deckelbaum wrote in an April commentary.\nRoutledge told OGI that “Our balance sheet is in good shape [and] what we are looking for are just good investments.”\n“We are not in position to make any decision on other equity in Stabroek Block right now, but we are focused on [finding] the right opportunities—whether in Guyana or elsewhere in the world,” he said. “And if they compete [financially], then we have the resources to get after them.”", "Link": "Https://Finance.Yahoo.Com/News/Offshore-Guyana-Place-Spend-Money-170000706.Html", "Sentiment_Score": 0.0351279303, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-09T13:01:00.000Z", "Headline": "BP Stock Slips. It Joins Exxon Mobil in Warning About Weaker Margins.", "Summary": "The British supermajor said that it expects weak refining margins to hit its second-quarter earnings by between $500 million and $700 million, also flagging impairment charges of up to $2 billion. Its American depositary receipts slipped 4.1% ahead of the opening bell, while U.K.-listed shares fell 3.7%. BP bad news comes less than 24 hours after Exxon Mobil said that weaker refining margins could lower its own profits by between $1.1 billion and $1.5 billion for the three months ending June 30.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/6D8A9Af0-57Cd-3696-88F6-F21E8Cab8B0C/Bp-Stock-Slips-It-Joins.Html", "Sentiment_Score": -0.9474237561, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-09T12:34:57.000Z", "Headline": "BP Slides After Projecting Up To $2B in Q2 Impairment Charges", "Summary": "BP, Exxon both say weak refining margins likely to hit earnings\nPeter Dazeley / Contributor / Getty Images\nMore\n\n\nKey Takeaways\nBP ADRs slid in premarket trading Tuesday after the energy giant said its second-quarter earnings will likely be impacted by lower refining margins.\nThe company also expects to take an impairment charge of between $1 billion and $2 billion related to a review of one of its German refineries.\nExxon also said refining margins would negatively impact its second-quarter earnings on Monday.\n\n\nBP (BP) American depositary receipts (ADRs) fell in premarket trading Tuesday after the energy giant said that it expects lower refining margins and an impairment charge of up to $2 billion will impact its second-quarter results.\nThe British oil and gas company said Tuesday that \"significantly lower realized refining margins\" are projected to have a negative impact between $500 million to $700 million when it reports second-quarter earnings at the end of the month.\nBP Joins Exxon in Warning About Refining Margins\nBP, which expects to take an impairment charge between $1 billion and $2 billion related to a review of one of its German refineries, is not the only one in the industry warning about potential hits to second-quarter results.\nExxon Mobil (XOM) on Monday said that lower refining margins would cause its second-quarter profits to be between $1.1 billion to $1.5 billion lower. The company also expects lower natural gas prices to cause a hit of about $300 million to $700 million when it reports earnings later this month.\nBP ADRs, as well as its shares traded on the London Stock Exchange, were each down around 4% as of 8:30 a.m. ET Tuesday.\nRead the original article on Investopedia.", "Link": "Https://Finance.Yahoo.Com/News/Bp-Slides-Projecting-2B-Q2-123457940.Html", "Sentiment_Score": -0.881898284, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-09T12:26:00.000Z", "Headline": "ExxonMobil (XOM) Expects Soft Gas Prices to Hurt Q2 Earnings", "Summary": "Exxon Mobil Corporation XOM recently disclosed in a Form 8-K that soft natural gas prices due to lower demand and excess inventories will sequentially hurt its earnings for the second quarter of 2024.\nOwing to changes in prices of the commodity, the leading integrated energy player expects its second-quarter earnings to decline sequentially by $300 million to $700 million. However, XOM projects that a favorable crude pricing scenario in the June quarter will completely offset this negative impact.\nExxonMobil added that unfavorable changes in industry margins will affect its earnings from refining activities by $1.1 billion to $1.5 billion. These estimates exclude the impact of the acquisition of Pioneer Natural Resources, which was closed on May 3 and strengthened the company’s footprint in the Permian Basin, the most prolific basin in the United States.\nThe additional impact from the Pioneer Natural acquisition is expected to result in the production of 500-550 thousand barrels of oil equivalent per day. This acquisition is likely to have affected XOM’s earnings from May 3 to Jun 30 in the second quarter.\nThe Zacks Consensus Estimate for XOM’s earnings per share in the second quarter is pegged at $2.34. ExxonMobil, currently, carries a Zacks Rank #3 (Hold).\nStocks to Consider\nBetter-ranked energy companies include Matador Resources Company MTDR, Chevron Corporation CVX and SM Energy Company SM. While SM Energy sports a Zacks Rank #1 (Strong Buy), Matador Resources and Chevron carry a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nMatador Resources recently entered into a $1.91 billion agreement to expand its footprint in the prolific Delaware Basin. With the deal expected to close in the late third quarter of 2024, the #3 Ranked company is projected to have more than 190,000 net acres in the Delaware Basin on a pro forma basis. Consequently, the company estimates that its production will exceed 180,000 barrels of oil equivalent per day, positioning it for significant growth and enhanced operational scale.\nChevron generates most of its earnings from its upstream operations. The integrated energy giant has a strong foothold in the Permian – the most prolific basin in the United States – where a significant portion of the energy major’s acreage has minimum royalty payments. Thus, CVX will generate handsome cashflows through its upstream business, banking on handsome oil prices.\nIn addition to maintaining disciplined capital spending, Chevron has a strong balance sheet, providing a solid foundation to rely on during unfavorable energy market conditions.\nTo expand its premier asset portfolio, SM Energy recently agreed to acquire 80% of XCL Resources’ oil and gas assets in the Uinta Basin for $2.04 billion. The value-driven acquisition, likely to close in September this year, will increase its inventory of net locations and boost its oil production. SM Energy is also committed to maintaining its strong balance sheet, which it can rely on during low oil prices.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nMatador Resources Company (MTDR) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Exxonmobil-Xom-Expects-Soft-Gas-122600067.Html", "Sentiment_Score": -0.9533138871, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-08T21:45:20.000Z", "Headline": "Exxon Mobil (XOM) Stock Sinks As Market Gains: Here's Why", "Summary": "Exxon Mobil (XOM) closed at $112.18 in the latest trading session, marking a -1.05% move from the prior day. The stock fell short of the S&P 500, which registered a gain of 0.1% for the day. On the other hand, the Dow registered a loss of 0.08%, and the technology-centric Nasdaq increased by 0.28%.\nComing into today, shares of the oil and natural gas company had gained 0.55% in the past month. In that same time, the Oils-Energy sector gained 0.75%, while the S&P 500 gained 4.08%.\nInvestors will be eagerly watching for the performance of Exxon Mobil in its upcoming earnings disclosure. The company's upcoming EPS is projected at $2.34, signifying a 20.62% increase compared to the same quarter of the previous year. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $91.69 billion, up 10.59% from the year-ago period.\nFor the entire fiscal year, the Zacks Consensus Estimates are projecting earnings of $9.18 per share and a revenue of $360.44 billion, representing changes of -3.57% and +4.6%, respectively, from the prior year.\nIt's also important for investors to be aware of any recent modifications to analyst estimates for Exxon Mobil. These recent revisions tend to reflect the evolving nature of short-term business trends. Hence, positive alterations in estimates signify analyst optimism regarding the company's business and profitability.\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.\nThe Zacks Rank system, stretching from #1 (Strong Buy) to #5 (Strong Sell), has a noteworthy track record of outperforming, validated by third-party audits, with stocks rated #1 producing an average annual return of +25% since the year 1988. Over the past month, there's been a 4.06% fall in the Zacks Consensus EPS estimate. Right now, Exxon Mobil possesses a Zacks Rank of #3 (Hold).\nWith respect to valuation, Exxon Mobil is currently being traded at a Forward P/E ratio of 12.35. This signifies a premium in comparison to the average Forward P/E of 7.91 for its industry.\nIt's also important to note that XOM currently trades at a PEG ratio of 4.12. Comparable to the widely accepted P/E ratio, the PEG ratio also accounts for the company's projected earnings growth. As of the close of trade yesterday, the Oil and Gas - Integrated - International industry held an average PEG ratio of 1.96.\nThe Oil and Gas - Integrated - International industry is part of the Oils-Energy sector. At present, this industry carries a Zacks Industry Rank of 66, placing it within the top 27% of over 250 industries.\nThe Zacks Industry Rank evaluates the power of our distinct industry groups by determining the average Zacks Rank of the individual stocks forming the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nKeep in mind to rely on Zacks.com to watch all these stock-impacting metrics, and more, in the succeeding trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Exxon-Mobil-Xom-Stock-Sinks-214520907.Html", "Sentiment_Score": -0.443102479, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-08T21:20:02.000Z", "Headline": "Commercial real estate, Good Buy or Goodbye: Market Domination", "Summary": "The markets are rushing to the close with just one hour to go, but Market Domination's Julie Hyman and Josh Lipton are still here to walk investors through the day's biggest stories and stock moves.\nBD8 Capital Partners CEO and chief investment officer Barbara Doran lays out the key differences between President Biden and former President Trump's fiscal policies, and what they both mean for US equity markets (^DJI, ^IXIC, ^GSPC) at large. Doran sticks around for today's episode of Good Buy or Goodbye and argues which music label stock investors should be watching.\nMoody's Analytics head of commercial real estate economics Tom LaSalvia joins the program to discuss the biggest detractors to getting the CRE sector back on track as office vacancy rates climb to record highs.\nOther top trending tickers on the Yahoo Finance platform include Nvidia (NVDA), ServiceNow (NOW), and ExxonMobil (XOM).\nFor more expert insight and the latest market action, click here.\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Commercial-Real-Estate-Good-Buy-212002468.Html", "Sentiment_Score": 0.0166833289, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-08T19:30:42.000Z", "Headline": "Exxon expects Q2 earnings to take a hit from refining profits", "Summary": "Ahead of its full second-quarter earnings results on August 2, oil giant ExxonMobil (XOM) is signaling that its refinery profits could be taking a hit of up to $1.5 billion. The Market Domination team monitors the energy company's stock movement on this news.\nFor more expert insight and the latest market action, click here to watch this full episode of Market Domination.\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Exxon-Reduces-Q2-Earnings-Estimates-193042819.Html", "Sentiment_Score": 0.682965219, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-08T16:02:44.000Z", "Headline": "Exxon signals Q2 below market consensus, excluding Pioneer buy", "Summary": "By Sabrina Valle and Tanay Dhumal\nHOUSTON (Reuters) - Exxon Mobil Corp on Monday signaled that lower refining margins across the industry and lower natural gas prices will reduce profits in the second quarter.\nA snapshot of operating factors affecting the quarter suggests earnings per share between $1.50 and $2.40, or about $8.3 billion, which is 17% below market consensus.\nThe preview excludes additional oil and gas production from its $60 billion acquisition of Pioneer Natural Resources, concluded on May 3.\nBut Exxon has provided some indication on how the Pioneer deal will affect results, which includes capital spending running at about $4.8 billion on an annualized basis.\nThe oil major anticipated that Pioneer would add between 500,000 and 550,000 barrels of oil equivalent per day to its second quarter production, compared with the first three months of the year.\nFull financial results, which includes other factors other than operational resuts, are due on Aug. 2.\nThe largest U.S. oil producer indicated operational results from oil and gas - its main business - will increase due to higher oil prices and despite of lower natural gas prices to about $6.2 billion from $4.6 billion in the second quarter last year, according to a securities filing.\nExxon also said lower refining margins would have a negative impact on second-quarter profit of between $1.1 billion and $1.5 billion compared with the prior quarter.\nPIONEER\nExxon has more than doubled its production to 1.3 million barrels of oil equivalent per day (boepd) since concluding the acquisition of Pioneer, up from 620,000 boepd in 2023. The full effects of the merger will be felt in the third quarter.\nThe company has said it plans to triple Permian production to 2 million boepd by 2027 by drilling horizontal wells that are closer to each other than the industry average, in a cube format, in order to extract more oil and gas from the rocks.\nResults also reflect record oil production in Guyana, where Exxon pumped 632,000 boepd with partners in May, reaching a daily record of 663,000 boepd. This is about 100,000 boepd above the initial planned capacity.\nExxon shares were down less than 1%. Its shares have risen more than 13% this year, below the S&P 500's 16% increase, but ahead of other major Western oil rivals.\nThe company has announced it will increase share buybacks to a $20 billion run rate following the closure of the acquisition. It had projected a 40,000 boepd negative production impact in the quarter due to scheduled maintenance and $3 billion in seasonal cash tax payments.\n(Reporting by Sabrina Valle, Editing by Franklin Paul and Tomasz Janowski)", "Link": "Https://Finance.Yahoo.Com/News/Exxon-Signals-Q2-Below-Market-160244332.Html", "Sentiment_Score": -0.9416543245, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-08T15:56:00.000Z", "Headline": "3 Dividend Aristocrats to Buy for Retirement: July Edition", "Summary": "Dividend stocks can generate steady cash flow for long-term investors. This stream of passive income can make it easier to cover living expenses in retirement, and dividend aristocrats to buy tend to be less risky than growth stocks.\nHowever, even dividend stocks have their faults. Some companies that have issued dividends for many years suddenly have to cut or suspend them. Furthermore, some dividend stocks significantly underperform the stock market and result in lost capital.\nHowever, not every investor wants to outperform the stock market. Some people will exchange beating the market for steady cash flow with very little downside. That’s where some of the top dividend aristocrats to buy come into play. Dividend aristocrats are stocks that have increased their dividends in each of the past 25 years. The corporations on this list have a good history of dividend hikes and offer solid yields for present investors. These are some of the top dividend aristocrats to consider as retirement draws closer.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nIBM (IBM)\nQuantum computing stocks: Sign of IBM with Canada Head Office Building in background in Markham, Ontario, Canada. IBM is an American multinational technology company.\nSource: JHVEPhoto / Shutterstock.com\nIBM (NYSE:IBM) offers a 3.80% yield and trades at a 20 P/E ratio. Although the company has lagged the stock market and even produced a lost decade for investors, the stock is rebounding. New investments into cloud computing have positioned IBM to capitalize on artificial intelligence tailwinds. The stock has a spark based on its 9% year-to-date gain and 33% gain over the past year.\nInvestors don’t need IBM to do as well on stock price returns to stay ahead of the market. The yield is quite high, and IBM continues to hike its dividend each year. The company raised its quarterly dividend from $1.66 per share to $1.67 per share this year.\nThe low dividend growth rate is based on IBM’s low growth rates. The company only reported 1% year-over-year revenue growth in the first quarter, although the growth rate goes up to 3% at constant currency. However, the company grew its net income by 73% year-over-year and ended up with a double-digit net profit margin.\nSysco (SYY)\nBest Stocks for Students: Sysco (SYY)\nSource: Shutterstock\nMost high-yielding stocks trade long-term gains for high yields and stability. Sysco (NYSE:SYY) is no exception to the rule. The food distribution company trades at a 17 P/E ratio and has a 2.92% yield. Shares are roughly flat over the past five years. Shares only dropped by about 3% in 2022. That year featured many meltdowns from tech stocks and pandemic favorites, but Sysco held steady.\nSysco tends to report low-single-digit revenue growth, and the company did not disappoint. Revenue increased by 3% year-over-year in the first quarter while EBITDA was hip by 10.5% year-over-year. Leadership cited “volume growth, excellent margin management, and disciplined productivity improvement” for the company’s successful quarter. Sysco also generated a record first quarter operating profit of $803.6 million.\nAlthough the stock hasn’t budged for most of the last five years, Wall Street analysts believe that’s due to change. Sysco is rated as a Strong Buy with a projected 23% upside. The highest price target of $91 per share indicates that Sysco can gain 30% from current levels.\nExxon Mobil (XOM)\nXOM Stock Is on the Way Back, but It Will Take Some Time\nSource: Jonathan Weiss / Shutterstock.com\nPeople will always need gasoline for their vehicles. While many companies fulfill this demand, few corporations do it as well as Exxon Mobil (NYSE:XOM). The company has amassed a market cap north of $500 billion and has a 14 P/E ratio. Investors also get a 3.35% yield at current levels. The company even has a decent dividend growth rate considering its high yield. Exxon Mobil hiked its quarterly dividend from $0.91 per share to $0.95 per share last year. That’s a 4.4% year-over-year increase.\nExxon Mobil has also delivered solid returns for long-term investors. Shares are up by 11% year-to-date and have gained 49% over the past five years. Revenue and net income were both down in the first quarter. However, the company still generated $8.2 billion in Q1 earnings and achieved quarterly gross production of more than 600,000 oil-equivalent barrels per day in Guyana.\nWall Street analysts have rated the stock as a Moderate Buy. The average price target from 15 analysts suggests that the stock can gain an additional 20%.\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\nOn the date of publication, Marc Guberti did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.comPublishing Guidelines.\nMarc Guberti is a finance freelance writer at InvestorPlace.com who hosts the Breakthrough Success Podcast. He has contributed to several publications, including the U.S. News & World Report, Benzinga, and Joy Wallet.\nMore From InvestorPlace\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\nThe post 3 Dividend Aristocrats to Buy for Retirement: July Edition appeared first on InvestorPlace.", "Link": "Https://Finance.Yahoo.Com/News/3-Dividend-Aristocrats-Buy-Retirement-155600220.Html", "Sentiment_Score": 0.0181661714, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-08T15:45:00.000Z", "Headline": "Exxon Stock Slips on Chance of Weak Earnings", "Summary": "Exxon Mobil’s earnings results next month look like they will be weaker than analysts had been expecting, causing the stock to drop on Monday. Exxon hit an record high in April, but is still off 9% from that level despite a rebound in oil prices. The filing, with the Securities and Exchange Commission, includes information on how factors such as margins and commodity prices may impact earnings in the latest quarter compared to the previous quarter.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/54193E56-9Af8-3449-A76C-B8747A9Ab9E8/Exxon-Stock-Slips-On-Chance.Html", "Sentiment_Score": -0.9261543155, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-08T13:07:48.000Z", "Headline": "Exxon Mobil signals second-quarter earnings hit from refining margins, natural gas prices", "Summary": "By Tanay Dhumal\n(Reuters) -Exxon Mobil said on Monday lower natural gas prices and refining margins are expected to hit the oil major's second-quarter earnings.\nThe oil major would be reporting its first earnings after closing the acquisition of Pioneer Natural Resources for $60 billion, with the combined operations making it the largest oil producer in the Permian basin.\nExxon said changes in gas prices could decrease its quarterly upstream earnings by $300 million to $700 million compared with the first quarter.\nNatural gas prices had fallen in the reported quarter hurt by lower demand forecast, high output and excess inventories.\nHowever, higher crude prices helped undercut this weakness, with Exxon expecting oil earnings to rise by at least $300 million.\nThe company's first-quarter total upstream earnings stood at $5.7 billion.\nExxon also said lower refining margins would have a negative impact on second-quarter profit of between $1.1 billion and $1.5 billion compared with the prior quarter.\nThe oil major said in its earnings snapshot the Pioneer acquisition would add between 500,000 and 550,000 barrels of oil equivalent per day to its second quarter production, compared with the first three months of the year.\nShares of Exxon, which have gained about 13% so far this year, were down 1.3% in pre-market trade.\n\"QoQ earnings are set to be impacted by lower refining margins, which should be expected. Further, we note the hit from gas prices, as well as the earnings contribution from Pioneer were worse than we had modeled,\" said Biraj Borkhataria, analyst at RBC Capital Markets.\nAnalysts expect the company to post an adjusted per share profit of $2.37, according to LSEG's consensus estimate.\n(Reporting by Tanay Dhumal in Bengaluru; Editing by Krishna Chandra Eluri)", "Link": "Https://Finance.Yahoo.Com/News/Exxon-Mobil-Expects-Second-Quarter-111618057.Html", "Sentiment_Score": 0.4698067009, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-08T10:43:00.000Z", "Headline": "Fed’s Powell, Inflation Data, Earnings Can Cement a September Rate Cut. Here’s Why and 4 Other Things to Know Today.", "Summary": "Biden hits the campaign trail amid calls to abandon presidential race, Houston coast braces for Hurricane Beryl, and more news to start your day.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/Cc5Aa9A7-Cbc6-3397-8A2D-60B8Bbc61F3D/Fed%E2%80%99S-Powell-Inflation-Data-.Html", "Sentiment_Score": -0.0419006757, "Sentiment_Category": "neutral"}, {"Ticker": "XOM", "Time": "2024-07-08T10:00:00.000Z", "Headline": "3 Triple Threat Stocks to Buy: High Yields, Big Gains and Rock-Solid Safety", "Summary": "Life and the market are about compromise. Generally speaking, if you’re looking for high growth, you typically aren’t getting much in the way of dividends, if anything. On the other hand, established enterprises usually offer robust passive income at the expense of growth potential. Still, on rare occasions, it’s possible to have high-yield safe stocks that can also expand the top line.\nFundamentally, the math helps the underlying narrative. Presently, we have thousands upon thousands of publicly traded opportunities available. It’s simply not possible for analysts to provide equal coverage to every enterprise. So, it’s inevitable that some companies – even big ones – fall through the cracks. Intrepid investors can exploit this “coverage gap” so to speak and potentially profit handsomely.\nFurther, in shaky circumstances – such as a recovery from a pandemic – the established players can deliver some surprises. Basically, their massive footprint enables surprisingly stout performances. With that in mind, below are enticing high-yield safe stocks to consider.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nPepsiCo (PEP)\nPepsi (PEP) Factory in Samara, Russia. Pepsi logo on a blue warehouse.\nSource: FotograFFF / Shutterstock\nOne of the world’s biggest beverage (and snack) manufacturers, PepsiCo (NASDAQ:PEP) is no stranger to the business community. Thanks to its massive footprint, it easily commands stability. Further, amid a tough economic environment, PepsiCo offers a cheap source of caffeine. Given this and many other advantages, it’s no surprise that analysts rate PEP stock a consensus moderate buy.\nAnother factor to consider regarding Pepsi is its financial consistency. During the past four quarters, its average earnings per share landed at $1.90. However, covering experts anticipated EPS of almost $1.81. Therefore, the earnings surprise came out to nearly 5.1%. That’s not bad for an established stalwart.\nDuring the trailing 12 months (TTM), Pepsi posted net income of $9.18 billion or earnings of $6.63 per share. Revenue during the cycle came out to $91.88 billion. For fiscal 2024, experts anticipate 11.2% growth in the top line to $94.44 billion.\nLastly, the company offers a forward dividend yield of 3.33%. It makes a solid case for high-yield safe stocks to buy.\nExxon Mobil (XOM)\nExxon Retail Gas Location\nSource: Jonathan Weiss / Shutterstock.com\nOn the surface, integrated oil and gas giant Exxon Mobil (NYSE:XOM) might not seem the most relevant idea for high-yield safe stocks. With the ideological winds pushing for green and sustainable solutions, Exxon seems anachronistic. Still, the world runs on oil. And one geopolitical flashpoint could change the narrative cynically in favor of XOM stock. Thus, it carries a moderate buy view among experts with a $135.53 average price target.\nAdmittedly, Exxon has encountered a rough patch in terms of meeting expectations. In the past four quarters, its average EPS reached just under $2.19. However, analysts were looking on average for around $2.20. Therefore, the earnings surprise landed at about half a percent below parity. That’s not ideal.\nDuring the TTM period, Exxon posted net income of $32.8 billion or $8.16 per share. Revenue in the cycle hit $335.35 billion, which is rather disappointing. For fiscal 2024, analysts only see a modest lift in the top line to $353.7 billion. However, it’s also possible that sales could soar to $470.13 billion based on geopolitical rumblings.\nOh yeah, the oil giant offers a big yield of 3.31%.\nMcDonald’s (MCD)\nMcDonald's golden arches\nSource: Vytautas Kielaitis / Shutterstock\nFast-food giant McDonald’s (NYSE:MCD) really needs no introduction. Basically, the Golden Arches is both a business icon and a symbol of American capitalism. So, when it comes to attributes like brand power and awareness, MCD hits the safe component of high-yield safe stocks. However, does it provide much growth and is it a dividend monster?\nTo be sure, it’s pretty much impossible to expect a blue-chip icon to have the growth potential of a promising tech startup. However, McDonald’s is a respectable growth machine given how long it’s been in business. During the TTM period, it posted net income of $8.6 billion on sales of $25.76 billion. In the most recent quarter, its sales growth rate (year-over-year) came in at 4.6%.\nSure, that’s not the most impressive stat you’ve seen. However, keep in mind that for fiscal 2024, analysts anticipate revenue of $26.6 billion. That’s up 11.7% from the prior year. As for the bottom line, McDonald’s has seen average EPS of $2.96 in the past four quarters. That helps to support the underlying dividend yield of 2.67%. Overall, it’s one of the balanced high-yield safe stocks to buy.\nOn the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\nA former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia.\nMore From InvestorPlace\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\nThe post 3 Triple Threat Stocks to Buy: High Yields, Big Gains and Rock-Solid Safety appeared first on InvestorPlace.", "Link": "Https://Finance.Yahoo.Com/News/3-Triple-Threat-Stocks-Buy-100000646.Html", "Sentiment_Score": 0.3477225602, "Sentiment_Category": "bullish"}, {"Ticker": "XOM", "Time": "2024-07-08T09:32:46.000Z", "Headline": "Hurricane Beryl Makes Landfall in Texas After Raking Mexico", "Summary": "(Bloomberg) -- Hurricane Beryl made landfall on the Texas coast early Monday, bringing heavy rains and life-threatening storm surge after churning across the Caribbean Sea and the Gulf of Mexico.\nMost Read from Bloomberg\nMicrosoft Orders China Staff to Use iPhones for Work and Drop Android\nBoeing to Plead Guilty to Fraud for Violating Deal Over 737 Max Crashes\nBiden Narrows Gap With Trump in Swing States Despite Debate Loss\nMorgan Stanley’s Wilson Says a 10% Stock Market Correction Is ‘Highly Likely’\nHedge Funds That Piled Into Big Tesla Short Stung by Rally\nThe storm — a Category 1 hurricane with winds of about 80 miles (130 kilometers) per hour — struck near Matagorda, between Houston and Corpus Christi, according to the US National Hurricane Center. Flash flooding is expected, it said in a notice at 4 a.m. local time.\nWhile Beryl is significantly weaker than it was last week, when it reached Category 5 status, it’s still dangerous. Officials urged residents to take caution, oil companies adjusted operations and emergency workers gathered resources as the storm bore down on Texas.\nA hurricane warning was in effect for the coastal area from Mesquite Bay to Port Bolivar. The storm is expected to pass over eastern Texas on Monday, then through the Lower Mississippi Valley and Ohio Valley on Tuesday and Wednesday.\nCoastal areas are likely to see “large and destructive waves,” with the storm surge reaching as high as seven feet (2.1 meters) in some areas, according to the NHC. Some locations could see as much as 15 inches (38 centimeters) of rainfall, it said.\nMore than 130,000 customers in Texas were without power early Monday, many of them in coastal areas, according to website poweroutage.us. Hundreds of flights in and out of Houston-area airports had canceled flights, according to FlightAware, which tracks air traffic.\n“The bottom line is, it’s all hands on deck,” Houston Mayor John Whitmire said during a briefing Sunday. “This storm has been unpredictable since Day One.”\nRenewed Strength\nBeryl initially weakened as it passed across the Yucatan Peninsula on Friday. However, it regained strength from unusually warm waters as it moved across the Gulf of Mexico.\n“It will be a deadly storm for people who are in its path,” Texas Lieutenant Governor Dan Patrick said during a briefing Sunday.\nHe urged people to use caution if they must venture outside. Beryl caused devastation as it ripped through the Caribbean and Mexico, leaving nine people dead. “We don’t want No. 10 to be in Texas,” he said.\nStorms are classified as hurricanes when their wind speeds reach 74 miles per hour.\nA state of emergency has been declared in 121 counties in Texas. Exxon Mobil Corp. said Sunday it was adjusting some operations. Freeport LNG ramped down liquefaction operations with plans to resume once the storm safely passes, a company spokesperson said.\n--With assistance from Dan Murtaugh and Ocean Hou.\n(Updates with additional details throughout.)\nMost Read from Bloomberg Businessweek\nHow Stocks Became the Game That Record Numbers of Americans Are Playing\nThe Rich Investor Club Is Getting Crowded\nPsychedelics Are Now Legal in Australia—With a Catch\nDragons and Sex Are Now a $610 Million Business Sweeping Publishing\nOnline Shopping Warehouses Are Reshaping Rural America\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Beryl-Regaining-Strength-Track-Reach-160716999.Html", "Sentiment_Score": -0.3415631056, "Sentiment_Category": "bearish"}, {"Ticker": "XOM", "Time": "2024-07-05T17:54:00.000Z", "Headline": "Exxon’s Newest Director Buys Large Block of Stock", "Summary": "Director Maria Jelescu Dreyfus bought $2 million of shares of the energy firm within weeks of joining Exxon Mobil’s board.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/E0C329Ec-A270-3C70-B75C-D9Cd841F2D21/Exxon%E2%80%99S-Newest-Director-Buys.Html", "Sentiment_Score": 0.1020243838, "Sentiment_Category": "bullish"}]}