{"timestamp": "20240719_140550", "data": [{"Ticker": "BAC", "Time": "2024-07-19T12:19:54.000Z", "Headline": "Copper Set for Worst Week Since 2022 as China Plenum Disappoints", "Summary": "(Bloomberg) -- Copper headed for its biggest weekly loss since 2022 and iron ore extended a slump toward $100 a ton as a policy meeting in China failed to lay out more stimulus to shore up metals demand.\nMost Read from Bloomberg\nUnprecedented IT Outage Cripples Businesses Around the Globe\nGlobal Flights Grind to Halt as United, Delta Stop Service\nCanada’s Immigration Minister Has a Message for Foreign Students: You Can’t All Stay\nZuckerberg Calls Trump ‘Badass’ Without Endorsing Him\nBrookfield Lines Up a 36-Year-Old Rising Star as Next Billionaire CEO\nFutures for the red metal have fallen by about 5% in London this week amid a broad retreat that’s also battered aluminum, tin and nickel. The complex was also dragged lower on Friday by a shift away from risk assets and a stronger US dollar.\n“You’ve had a liquidation of some of the bullish positions people had on and at the margin you’re seeing shorts coming in as well,” said Bank of America head of metals research Michael Widmer.\nCopper prices have retreated from a record hit in May on concerns about the strength of demand in China, where growth was the slowest in five quarters in the three months to June. The outcome of the Third Plenum, a key conclave of Communist Party officials in Beijing this week, has so far showed few signs of major steps to boost demand or arrest a long-running property slump.\n“A lack of major policy shift in China weighed on sentiment,” ANZ Group Holdings Ltd. analysts including Daniel Hynes said in a note. “That left investors disappointed that there wasn’t greater focus on tackling structural issues in the economy, such as the beleaguered property sector.”\nIn sign of weak demand, global copper inventories have ballooned in recent months. Stockpiles held in warehouses tracked by the London Metal Exchange have more than doubled since mid-May to hit the highest since September 2021, with most of the build-up seen in Asian sheds.\nA further 4,000 tons of cathodes were delivered into LME warehouses in South Korea and Taiwan, exchange data showed on Friday. That’s happening as premiums for physical copper cathodes being imported into China remain resolutely low.\nMetals traders, meanwhile, are also monitoring the fallout from a 7.4 magnitude earthquake that struck in Chile, 45 kilometers (28 miles) outside San Pedro de Atacama in the country’s northern copper and lithium mining region.\nCopper was 0.75% lower at $9,317 a ton on the LME at 12:50 p.m. in London, dropping for a fifth day. Aluminum has slumped about 4% this week, while tin has retreated by over 8%. Miners shares fell in Australia, with BHP Group Ltd. closing at the lowest since late 2022.\nIron ore dropped 1% to $103.70 a ton in Singapore, down 3.3% this week. In addition to the China demand outlook, losses have also been driven by reports of higher production from the world’s top miners.\n--With assistance from Audrey Wan.\nMost Read from Bloomberg Businessweek\nThe Zombie Mall King Doesn’t Want to Be a Bottom-Feeder Forever\nWhy the Nobel-Laureate Pioneer of Microfinance Risks Life in Jail\nTop Takeaways From Businessweek’s Donald Trump Interview\nFive Questions With Apollo Global Co-Founder Josh Harris\nHow Trader Joe’s Mini Cooler Bags Became a Viral Hit\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Copper-Set-Worst-Week-Since-030940960.Html", "Sentiment_Score": -0.9311015606, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-19T12:15:00.000Z", "Headline": "Bank of America Says It's Poised to Start Growing Its Net Interest Income Again. Is It Time to Buy the Stock?", "Summary": "Shares of Bank of America (NYSE: BAC) jumped Tuesday after the bank reported mixed second-quarter results, but indicated that it expects its net interest income to start growing again soon. Net interest income is the difference between the interest a bank earns from its loans and the interest it pays out on its deposits, and is an important metric for banks.\nMixed results\nWhen Bank of America delivered that report before the opening bell Tuesday, the headline trends were strong investment banking and wealth management growth, but declining net interest income.\nOverall, its profits fell by 7% to $6.9 billion, or $0.83 per share, compared to $7.4 billion, or $0.88 per share, in the prior-year period. Revenue edged up 1% to $25.4 billion.\nIts global markets segment led the way, with revenue climbing 12% to $5.5 billion, powered by trading revenue and investment banking fees. Trading revenue jumped 9% to $4.7 billion, with equities revenue surging 20% to $1.9 billion. Investment banking fees soared by 29%.\nThe global wealth and investment management unit was also strong, with revenue increasing 6% to $5.6 billion, powered by a 14% increase in asset management fees. Client balances climbed 10% year over year to more than $4 trillion, helped by a strong stock market. The company also added more than 6,000 Merrill and private bank clients in the quarter.\nNet interest income, however, fell by 3% to $13.9 billion on a fully taxable-equivalent basis (FTE) as higher deposit costs outpaced higher asset yields and loan growth. Its net interest yield fell 13 basis points to 1.93%; excluding its global market segment, net interest yield decreased 24 basis points to 2.41%.\nHowever, management is projecting that its FTE net interest income will rise to $14.5 billion in the fourth quarter. This forecast includes the expectation that the Fed will cut the benchmark federal funds rate by 25 basis points three times before year's end, causing a $225 million negative impact for the bank. It is looking for more potential net interest income upside in 2025 helped by fixed-rate-asset repricing on assets such as auto loans, cash flow hedge benefits, and loans and deposit growth.\nLooking at credit quality, Bank of America's net charge-off ratio was 0.59%, up modestly from 0.58% in Q1. Provision for credit losses increased by $189 million quarter over quarter to $1.51 billion. Its book value grew 7% to $34.39 per share, while its tangible book value per share rose 9% to $25.37.\nWhile it was a mixed quarter, the bank displayed strong revenue growth across its trading, investment banking, and wealth management businesses. A rising stock market certainly helped in these areas. And while its net interest income fell in the quarter, the bank forecast that it would begin to grow in Q3 and would likely continue to through 2025. As this is its largest source of income, that should prove a nice growth driver.\nImage source: Getty Images\nValuation\nBank of America now trades at a forward price-to-earnings ratio of under 14 -- above its long-term average of around 10.6. Meanwhile, its price-to-tangible-book-value ratio is less than 1.8, and its price-to-book-value is about 1.3 -- around the average levels where the bank has historically traded.\nBAC PE Ratio (Forward) Chart\nGiven its expected rebound in net interest income, I would anticipate that Bank of America will start seeing improvement in both its earnings and book value. So while the stock is not in the bargain bin, it should have moderate upside over the next year, and is a solid option to consider for the longer term as well.\nShould you invest $1,000 in Bank of America right now?\nBefore you buy stock in Bank of America, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Bank of America wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $722,993!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Geoffrey Seiler has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bank of America. The Motley Fool has a disclosure policy.\nBank of America Says It's Poised to Start Growing Its Net Interest Income Again. Is It Time to Buy the Stock? was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/Bank-America-Says-Poised-Start-121500208.Html", "Sentiment_Score": 0.1076126769, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-19T08:06:00.000Z", "Headline": "75% of Warren Buffett's $416 Billion Portfolio Is Invested in 5 Unstoppable Stocks", "Summary": "When it comes to billionaire money managers, Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) CEO Warren Buffett is on a pedestal of his very own.\nSince taking the reins at Berkshire Hathaway in the mid-1960s, the affably dubbed \"Oracle of Omaha\" has overseen an aggregate return in his company's Class A shares (BRK.A) of a scorching-hot 5,422,618%, as of the closing bell on July 17. On an annualized total return basis covering nearly six decades, he's practically doubled up the benchmark S&P 500, including dividends paid.\nBuffett's secret to success is really no secret at all. He's plainly stated on multiple occasions that he seeks out time-tested businesses that have well-defined competitive advantages and strong management teams.\nBerkshire Hathaway CEO Warren Buffett. Image source: The Motley Fool.\nHowever, nowhere near enough credit for Berkshire Hathaway's long-term success is given to Buffett's penchant for portfolio concentration. Even though he and his top investment aides, Ted Weschler and Todd Combs, are currently overseeing a 44-stock, $416 billion investment portfolio at Berkshire, they all strongly believe in putting an outsized amount of capital to work in their best ideas.\nThe following five unstoppable stocks, which account for 75% of Berkshire Hathaway's invested assets ($309.9 billion), are truly Buffett's best ideas (market values are as of the closing bell on July 17).\n1. Apple: $180,670,650,836 (43.4% of invested assets)\nAny doubts about Warren Buffett's preference to concentrate his company's invested assets into a few premier businesses are tossed aside by Berkshire's stake in tech stock Apple (NASDAQ: AAPL). Even following two consecutive quarters where Buffett and his crew lightened their load on Apple, this top holding still accounts for more than 43% of Berkshire's investment portfolio.\nThe driving force for Apple as an investment has long been its innovative capacity. For instance, Apple has accounted for 50% or more of domestic smartphone market share since introducing a 5G-capable iPhone in the latter half of 2020.\nBut there's more to the largest publicly traded company than just physical product innovation. CEO Tim Cook is currently overseeing the evolution of his company to a platform-focused operating model. Though Apple has no intention of phasing out the physical products (iPhone, Mac, iPad, and Apple Watch) that endeared its brand to consumers, it's placing greater emphasis on higher-margin subscriptions designed to enhance customer loyalty and minimize the sales fluctuations that typically accompany iPhone upgrade cycles.\nI'd be remiss if I didn't also mention Apple's market-leading capital-return program. The world's largest publicly traded company by market value has repurchased $674 billion of its common stock since initiating a buyback program in 2013. Buffett is a huge fan of share repurchases.\n2. Bank of America: $45,424,831,224 (10.9% of invested assets)\nThe second-largest position in the Oracle of Omaha's $416 billion investment portfolio at Berkshire is none other than money-center goliath Bank of America (NYSE: BAC), which is commonly known as \"BofA.\". Buffett and his team oversee more than 1.03 billion shares of BofA stock, equating to a 13.2% stake in the company.\nThere's not a sector Warren Buffett enjoys putting his company's capital to work in more than financials. But his favoritism for BofA might have everything to do with its interest rate sensitivity. The Federal Reserve's most-aggressive rate-hiking cycle since the early 1980s has added billions of dollars in net-interest income to Bank of America's bottom line.\nBut did you know that Bank of America has also made significant strides with its digitization efforts? Through the midpoint of 2024, 77% of consumer households were banking digitally, while 53% of all consumer loan sales were completed online or via mobile app. This is up nine percentage points from the comparable period three years ago. Digital transactions are considerably cheaper for banks than in-person interactions, which should improve BofA's operating efficiency over time.\nLastly, Bank of America's board approved a $0.02-per-share increase to the company's quarterly dividend following the latest round of Fed stress tests. This hike increases Berkshire's annual dividend income from its stake in BofA to more than $1 billion!\nImage source: American Express.\n3. American Express: $37,896,610,572 (9.1% of invested assets)\nHave I mentioned that Warren Buffett is a big fan of financial stocks? If not, credit-services provider American Express (NYSE: AXP) occupying the third spot in Berkshire's portfolio should drive this point home. AmEx, as American Express is referred to in shorthand, has been a continuous holding by Buffett's company since 1991.\nWhat's made AmEx such a long-term winner has been its ability to benefit from both sides of the transaction aisle. For instance, it's the No. 3 payment processor by credit card network purchase volume in the U.S. But it's also a lender, as evidenced by the American Express credit cards consumers and businesses use to facilitate transactions. AmEx is able to generate fees from merchants for processing transactions, as well as annual fees and interest income from its cardholders.\nAdditionally, American Express has always been particularly good at attracting high earners as cardholders. The well-to-do are less likely than the average working American to alter their buying habits or fail to pay their bills during minor economic disruptions. On paper, AmEx is in better position to navigate periods of economic turbulence than its peers.\nSince Berkshire's cost basis for its stake in AmEx is only $8.49 per share, Buffett is overseeing a 33% annual yield, relative to cost, on this position.\n4. Coca-Cola: $26,084,000,000 (6.3% of invested assets)\nIf you thought American Express was a longtime holding of Warren Buffett, let me introduce you to beverage behemoth Coca-Cola (NYSE: KO), which has been a pillar for the Oracle of Omaha since 1988!\nBranding is a key reason Coca-Cola has been such a steady performer for decades. According to the annually released \"Brand Footprint\" report from Kantar, Coca-Cola has been the most-chosen brand from retail shelves by consumers for 12 consecutive years. Selling a product (beverages) that's considered a basic necessity leads to consistent and predictable operating cash flow year after year.\nIt also doesn't hurt that Coca-Cola offers almost unparalleled geographic diversity. With the exception of North Korea, Cuba, and Russia (the latter has to do with its invasion of Ukraine), Coke has ongoing operations in all other countries. This allows it to take advantage of organic growth opportunities in emerging markets, while generating predictable cash flow in developed countries.\nCoca-Cola's dividend is an undeniable lure, as well. Berkshire's cost basis for its 400,000,000-share stake in Coca-Cola is only $3.2475 per share, which means Coke's base annual payout of $1.94 translates into a 60% yield on cost for Buffett's company.\n5. Chevron: $19,828,098,775 (4.8% of invested assets)\nBuffett's fifth-largest holding, which collectively with Apple, Bank of America, American Express, and Coca-Cola accounts for 75% of Berkshire Hathaway's $416 billion of invested assets, is energy titan Chevron (NYSE: CVX).\nThroughout the first two decades of this century, energy stocks played a minimal role in Berkshire's portfolio. But since this decade began, Buffett has shown a clear liking to Chevron, as well as Occidental Petroleum.\nHaving nearly $20 billion devoted to Chevron is a crystal-clear indication that Berkshire's brightest minds expect the spot price for crude oil to remain elevated. Roughly three years of reduced capital expenditures by global energy companies (including Chevron) during the COVID-19 pandemic has led to tight worldwide supply of this key commodity. As long as crude oil supply remains constrained, there's a good chance we'll see its spot price hold above its historic average.\nChevron is also an integrated operator, which helps to protect its operating cash flow in pretty much any economic climate. Although it generates its beefiest margins from its upstream drilling segment, a declining spot price for crude lowers input costs for Chevron's refineries and chemical plants.\nThe final piece of the puzzle is Chevron's phenomenal capital-return program. The company's board approved a $75 billion share repurchase program in January 2023, and has green-lit 37 consecutive years of dividend increases.\nShould you invest $1,000 in Apple right now?\nBefore you buy stock in Apple, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $722,993!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. American Express is an advertising partner of The Ascent, a Motley Fool company. Sean Williams has positions in Bank of America. The Motley Fool has positions in and recommends Apple, Bank of America, Berkshire Hathaway, and Chevron. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\n75% of Warren Buffett's $416 Billion Portfolio Is Invested in 5 Unstoppable Stocks was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/75-Warren-Buffetts-416-Billion-080600352.Html", "Sentiment_Score": 0.0586720258, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-18T23:14:20.000Z", "Headline": "Bank of America Corporation (BAC): The Best Financial Stock Right Now According to Street Analysts?", "Summary": "We recently compiled a list of the 10 Best Financial Stocks To Buy According to Hedge Funds. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against the other financial stocks.\nThe financial services industry in the US is poised for a dynamic and challenging year ahead, shaped by a confluence of economic, technological, and regulatory factors. The global economy is anticipated to grow modestly, with advanced economies like the US expecting around 1.4% growth. This is influenced by ongoing geopolitical tensions, climate-related disruptions, and persistently high inflation rates. These macroeconomic conditions are expected to significantly impact the operations and profitability of financial institutions. High interest rates have been a double-edged sword for the industry. While they have led to substantial increases in net interest income, particularly for larger banks, they have also driven up funding costs, especially for smaller and regional banks, squeezing their margins. According to Deloitte, the Federal Reserve's monetary policy will be crucial, with expectations that rates will remain elevated initially but may decrease later in the year. This will necessitate careful management of the balance between deposit rates and lending rates to sustain profitability. Economic uncertainty and the potential for slower growth have prompted banks to increase their loan loss provisions as a precautionary measure to cover potential defaults. This trend is expected to persist, reflecting a cautious approach to managing credit risk amidst economic volatility and increased regulatory scrutiny.\nConcurrently, the financial services sector is experiencing significant technological shifts. Advances in AI and generative AI are set to transform various aspects of the industry, from retail investing and fraud detection to insurance offerings. However, these advancements also introduce new risks, such as heightened fraud potential and the need for robust cybersecurity measures. On the regulatory front, changes are becoming more stringent, particularly around climate-related disclosures and sustainability. Financial institutions are required to adapt to these new regulations aimed at enhancing transparency and effectively managing climate risks. These regulatory changes, coupled with technological advancements, are forcing financial institutions to innovate and evolve their business models and strategies. Overall, banks and financial institutions must remain agile and proactive, navigating these multifaceted challenges to maintain profitability and drive growth in 2024. This will involve balancing the benefits and risks of high interest rates, managing loan loss provisions prudently, leveraging technological advancements, and complying with evolving regulatory requirements.\nIn a recent development, major U.S. banks withstood a hypothetical 40% decline in commercial real estate values in the U.S. Federal Reserve's annual health test, which alleviated concerns about the banking sector amid rising interest rates. With increasing risks in the commercial real estate (CRE) sector, investors were keenly observing the Fed's stress tests to gauge the exposure of American lenders at a time when pandemic-era work patterns have left office towers largely vacant, pushing vacancy rates to a historic high of 20%. Chris Marinac, head of research at Janney Montgomery Scott, commented, “In many ways, there should be a sense of relief that banks can endure a severe crisis. However, this doesn’t mean the Fed believes commercial real estate is in the clear. We are still in the early stages of this credit cycle”. The Fed's stress tests evaluate banks' balance sheets against a hypothetical severe economic downturn, including a 36% drop in U.S. home prices, a 55% plunge in equity prices, and an unemployment rate of 10%, reported Reuters.\nResults of the stress test released recently showed that banks could continue lending to households and businesses in the event of a severe global recession and indicated the capital needed to be deemed healthy and to determine how much they can return to shareholders through dividends and buybacks. The 31 large banks tested demonstrated they had enough capital to absorb nearly $685 billion in losses. This test comes over a year after the collapse of mid-sized lenders like Silicon Valley Bank, Signature Bank, and First Republic, which sparked criticism that the Fed had underestimated banks' vulnerabilities to rising interest rates, previously assuming rates would fall during a severe recession. Commercial office space is a significant concern, with $929 billion of the $4.7 trillion in outstanding commercial mortgages maturing in 2024, according to the Mortgage Bankers Association. This approaching maturity wall occurs amid declining property values and reduced rental income. Analysts foresee a challenging period for CRE, with banks still having \"considerable concentration risks,\" according to Moody's Ratings. Of the banks tested, Goldman Sachs had the highest projected loan loss for commercial real estate at 15.9%, followed by RBC USA (15.8%), Capital One (14.6%), and Northern Trust (13%). One critique from analysts is that the Fed's stress test did not include regional banks, which hold most of the CRE loans and are less regulated than their larger counterparts.\nOver the coming months, senior leaders in the financial services industry anticipate a challenging landscape marked by high interest rates, increased regulatory scrutiny, and persistent inflation concerns. While these trends are familiar to industry veterans, many younger employees have not encountered such conditions before. According to Deloitte, leaders will need to guide their teams through uncertainty, focusing on navigating near-term challenges and identifying potential opportunities. Looking ahead, rapid technological advancements—including generative AI, cloud migration, heightened fraud and cyber risks, and the convergence of industries through embedded finance—will demand unprecedented agility from financial services leaders. Adapting to these changes will require creating new strategic pathways to align with evolving market dynamics. Throughout history, the financial services sector has often driven progress by helping organizations and individuals navigate economic and societal shifts. By the end of this decade, 2024 may be recognized as a pivotal year when the future began to materialize in tangible ways. Investing now in innovative products and services that foster positive outcomes could position firms for sustained competitive advantage in the years ahead.\nOur Methodology\nWe leveraged Insider Monkey’s comprehensive database of 920 prominent hedge funds to identify the top 10 financial stocks with the highest level of hedge fund investment as of Q1 2024. These stocks are listed in order of increasing hedge fund ownership, providing insight into the most popular financial stocks among elite investors.\nA professional banker providing consultation to a customer in the security of his office.\nBank of America Corporation (NYSE:BAC)\nNumber of Hedge Fund Holders: 82\nNumber six on our list of 10 Best Financial Stocks To Buy According to Hedge Funds is Bank of America Corporation (NYSE:BAC). During Q1, 2024 the count of hedge funds holding positions in Bank of America Corporation (NYSE:BAC) fell to 82 from 96 in the prior quarter, as reported by Insider Monkey’s database encompassing 920 hedge funds. These holdings collectively amount to around $45.59 billion. Warren Buffett's Berkshire Hathaway emerged as the leading shareholder among these hedge funds during this timeframe. On June 14, Keefe Bruyette analyst David Konrad upgraded Bank of America to \"Outperform\" from \"Market Perform\" and raised the price target to $46 from $37.\nOn June 26, Bank of America Corporation (NYSE:BAC) amended its bylaws during its regular governance review. The Board of Directors approved changes to clarify remote shareholder meeting procedures as per Delaware law and outlined voting requirements for decisions needing more than a majority vote. The amendments also define the process for selecting a presiding chair in the Chair's absence and revise procedural and disclosure requirements for shareholder proposals and director nominations, including the Board's role in validating them. These revisions aim to streamline governance and enhance transparency.\nSequoia Fund stated the following regarding Bank of America Corporation (NYSE:BAC) in its fourth quarter 2023 investor letter:\n“Exits last year included Netflix, Bank of America Corporation (NYSE:BAC) and Micron. As discussed in our Q1 shareholder letter, we exited our investment in Bank of America soon after making it, as our thesis was quickly undermined by the regional banking crisis and the regulatory developments that it catalyzed. We think both Bank of America and Micron were purchased at conservative prices given the facts at hand, but the facts changed and we moved on.”\nOverall BAC ranks 6th on our list of the best financial stocks to buy. You can visit 10 Best Financial Stocks To Buy According to Hedge Funds to see the other financial stocks that are on hedge funds’ radar. While we acknowledge the potential of BAC as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than BAC but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n READ NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These 10 Stocks in June.\n Disclosure: None. This article is originally published at Insider Monkey.", "Link": "Https://Finance.Yahoo.Com/News/Bank-America-Corporation-Bac-Best-231420227.Html", "Sentiment_Score": 0.2876216471, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-18T16:17:47.000Z", "Headline": "Goldman Sachs, Morgan Stanley and Bank of America Continued The Strong Trend With Their Second Quarter Financials", "Summary": "Goldman Sachs, Morgan Stanley and Bank of America Continued The Strong Trend With Their Second Quarter Financials\nOn Monday, bank earnings continued with The Goldman Sachs Group Inc (NYSE: GS), also joining the trend of topped profit and revenue estimates on the back of better-than-expected fixed income results and smaller-than-expected loan loss provisions. On Tuesday, Morgan Stanley (NYSE: MS) and Bank of America (NYSE: BAC) boarded the bank earnings train. Morgan Stanley topped profit and revenue estimates with its second quarter financials on the back of stronger-than-expected trading and investment banking performance. Bank of America also topped estimates with second-quarter revenue and profit that were fueled by rising investment banking and asset management fees.\nGoldman Sachs Justified The High Expectations\nOut of the six biggest banks,  Goldman is the most reliant on investment banking and trading to generate revenue and therefore, expectations were high with the rebound in Wall Street activity.  For the quarter ended on June 30th, revenue grew 17% to $12.73 billion on the back of core trading, advisory, as well as asset and wealth management operations, surpassing Wall Street’s $12.46 billion estimate. Prrofit surged 150% YoY to $3.04 billion, or $8.62 per share; but last year’s financials were dragged down by hamstrung by write-downs from commercial real estate and the sale of a consumer business.\nFixed income was one of the highlights with revenue jumping 17% to $3.18 billion, surassping StreetAccount’s estimate by $220 million, along with the bank’s shrinking exposure to consumer loans as provision for credit losses went down 54% to $282 million, which is quite below StreetAccount’s estimate of $435.4 million. On other fronts, Goldman Sachs was mainly in line with estimates. Equities trading rose 7% to $3.17 billion based on strong activity in derivatives.\nAsset and wealth management division reported growth of 27% as revenue amounted to $3.88 billion. Platform solutions division reported revenue grew 2% to $669 million on the back of rising credit card balances and deposits.\nBut the well-known investment banking business disappointed compared to rivals as investment banking fees rose only 21% to $1.73 billion, slightly brlow StreetAccount’s $1.8 billion estimate, with growth behind far behind rivals JPMOrgan Chase and Citigroup who have reported rises exceeding 50%. Goldman Sachs attributed the miss to weaker-than-expected advisory fees of $688 million.\nMorgan Stanley Benefited From Rebounding Wall Street Activity\nFor the quarter ended on June 30th, Morgan Stanley reported revenue grew 12% YoY to $15.02 billion, topping Wall Street’s $14.3 billion estimate.\nWealth management revenue grew 2% to $6.79 billion, which was short of $6.88 billion estimate. Equity trading reported growth of 18% as revenue amounted to $3.02 billion, surpassing the StreetAccount estimate by about $330 million. Fixed income trading revenue grew by 16% to $1.99 billion, topping the Wall Street estimate by $130 million. Fueled by rising fixed income underwriting activity, investment banking revenue surged 51% to $1.62 billion, exceeding the estimate by $220 million.\nThe bottom line surged 41% YoY as profit amounted to $3.08 billion, or $1.82 per share, helped by a rebound in Wall Street activity..\nInterest income plunged 17% YoY to $1.79 billion as the rate environment pushed rich clients to continue shifting cash into higher-yielding assets, resulting in lower deposit levels. Earnings amounted to $1.82 a share, surpassing LSEG’s estimate of $1.65 a share.\nMorgan Stanley investors value the more steady nature of the wealth management business due to its more predictable nature compared to investment banking and trading. However, its usual dynamic got flupped as institutional securities division earn more revenue compared to its wealth management division.\nBank Of America Promised A NII Rebound\nFor the June quarter, Bank of America reported revenue grew less than 1% to $25.54 billion, surpassing LSEG’s estimate of $25.22 billion. Profit slipped 6.9% YoY to $6.9 billion, or 83 cents a share, also topping LSEG’s estimate of 80 cents.\nInvestment banking fees rose 29% to $1.56 billion while asset management fees grew 14% to $3.37 billion, and wealth management division reported a 6.3% revenue growth of $5.57 billion. Net interest income contracted 3% to $13.86 billion.\nBut net interest income fourth quarter guidance of $14.5 billion gave hope of a turnaround this year. Aided by this guidance, shares grew 5.4%.\nDISCLAIMER: This content is for informational purposes only. It is not intended as investing advice.\nThis article is from an unpaid external contributor. It does not represent Benzinga's reporting and has not been edited for content or accuracy.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Goldman Sachs, Morgan Stanley and Bank of America Continued The Strong Trend With Their Second Quarter Financials originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Sachs-Morgan-Stanley-Bank-161747656.Html", "Sentiment_Score": 0.9248392582, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-18T14:00:00.000Z", "Headline": "Fast Racing Will be on Display at the 2024 Bank of America Chicago Marathon", "Summary": "Media Interested in Covering the Race Can Now Apply for Credentials\nCHICAGO, July 18, 2024 /PRNewswire/ -- The professional athlete field for the 46th running of the Bank of America Chicago Marathon was announced today. It features two of the top 10 fastest women of all time, two of the world's most exciting marathon stars racing in the United States for the first time and both defending champions in the wheelchair field.\nBank of America Chicago Marathon logo (PRNewsfoto/Bank of America Corporation)\n\"We are accustomed to making history at the Bank of America Chicago Marathon,\" said Executive Race Director Carey Pinkowski. \"With some of the fastest athletes in the world joining us this fall, we are hopeful to build on the tradition of great performances this year.\"\nThis year's fastest women's marathoner, Sutume Kebede of Ethiopia, leads the women's field. Her 2:15:55 victory in the 2024 Tokyo Marathon makes her the eighth fastest woman of all time. That performance came just two months after Kebede set the record for fastest half marathon ever completed in the United States at the Aramco Houston Half Marathon in January with her winning time of 1:04:37.\n\"I am extremely happy to come back to Chicago and run on a course that has proven to be very fast,\" said Kebede, who had a disappointing finish in the 2023 Bank of America Chicago Marathon. \"After seeing what my teammate Kelvin Kiptum did last year, I want to come to Chicago to do something great.\"\nKebede is part of a training group that once included the late Kelvin Kiptum. Kiptum was killed in a car crash this past February, just four months after setting the marathon world record at the 2023 Bank of America Chicago Marathon.\nKebede will face the fourth fastest woman in history, Ruth Chepngetich of Kenya. Chepngetich, the 2021 and 2022 Chicago champion, was runner up here last year. Also among the top contenders is fellow Kenyan Joyciline Jepkosgei, a TCS London and TCS New York City Marathon Champion who was fourth in the 2023 Chicago Marathon.\nThe second and third fastest American women of all time will join the three East African stars on the start line. Former American marathon record holder Keira D'Amato, who has been part of the broadcast team for the past two years, will return to the start line this year. Betsy Saina, who placed fifth in this year's Tokyo Marathon, will look to record her first Chicago finish after dropping out of the race in 2019 due to illness.\n\"I have a special history with the Chicago Marathon,\" said D'Amato who finished fourth here in 2021. \"The past two years I've run my mouth in the lead vehicle for NBC. I'm excited to get back to running my legs.\"\nOther American contenders include Sara Hall and Annie Frisbie, both top 10 finishers at the 2024 U.S. Olympics Team Trials - Marathon, and Emma Bates, the 2021 Chicago runner-up.\nLeading the way in the men's field is Amos Kipruto of Kenya. Having reached the podium in three Abbott World Marathon Majors including a victory in the 2022 TCS London Marathon, Kipruto now has his sights set on Chicago and like Kebede, says he will also run in honor of Kiptum.\n\"My goal is to try to run a personal best,\" said Kipruto, who trains with 2022 Chicago winner Benson Kipruto. \"I want to show the world that I am still the kind of athlete who is capable of winning a major like Chicago.\"\nKipruto will have to fend off Vincent Ngetich, also of Kenya, who has an identical personal best of 2:03:13 and is seeking his first major victory. Ngetich placed second at the 2023 BMW Berlin Marathon, five places in front of Kipruto, and third at this year's Tokyo Marathon. This will be the first time either Kipruto or Ngetich has competed in the United States. The race also marks the marathon debut of Daniel Ebenyo of Kenya. Ebenyo, the 2023 World Championships silver medalist in the 10,000m, won the Generali Berlin Half Marathon earlier this year.\nThe American contenders feature four of the top 10 finishers at the 2024 U.S. Olympic Team Trials - Marathon: CJ Albertson, Zach Panning, Nathan Martin and Reed Fischer. Martin won this year's Bank of America Shamrock Shuffle in Chicago. Panning was the second American finisher at the 2022 Chicago Marathon.\n\"After a heartbreaking Olympic Trials I knew I wanted to run fast this fall. I can't think of a better place to do that than the fastest marathon course in the world,\" said Panning who led most of the Trials before fading to a sixth-place finish. \"Chicago feels like home. It's where I debuted in the marathon and it's where I ran my personal best. This year I'm coming to the race with big goals, hoping to improve on that PB and compete against many of the best in the world.\"\nDefending champions in the wheelchair division Marcel Hug and Catherine Debrunner will return to attempt to repeat their victories and better the course records they set in 2023. Hug, known as the Swiss Silver Bullet, will be chasing his fifth Chicago title. Hug will face two top Americans: familiar rival Daniel Romanchuk, a three-time Chicago winner, and Aaron Pike, who will be making his 15th Chicago start.\n\"The Chicago Marathon has been a permanent fixture in my race calendar for years,\" said Hug, a four-time Abbott World Marathon Majors series champion. \"The energy of the city and the enthusiasm of the spectators are unique. I'm looking forward to taking on the challenge and trying to defend my title again.\"\n\"I feel honored to return to the Chicago Marathon as defending champion,\" said Debrunner, who holds the world record for the marathon in the women's wheelchair division. \"The crowd last year was amazing and I am confident it will be the same this year.\"\nDebrunner, of Switzerland, looks to repeat following last year's down-to-the-wire battle with Susannah Scaroni of the United States. Scaroni, the 2022 Bank of America Chicago Marathon champion and Manuela Schär, the 2018 champion, are also set to return in what promises to be another exciting race.\nMedia interested in covering the 2024 Bank of America Chicago Marathon can apply for media credentials now through Friday, September 13. Visit chicagomarathon.com/mediacredentials for more information on the media credential application. More than 50,000 participants will take part in the 46th edition of the Bank of America Chicago Marathon on Sunday, October 13, 2024. For the latest event updates, registered participants and community members are encouraged to visit the Event FAQ which is available at chicagomarathon.com.\nBank of America Chicago Marathon Professional Field – Women's Open Division\nName\nCountry\nPersonal Best\nRuth Chepngetich\nKEN\n2:14:18 (Chicago, 2022)\nSutume Kebede\nETH\n2:15:55 (Tokyo, 2024)\nJoyciline Jepkosgei\nKEN\n2:16:24 (London, 2024)\nDegitu Azimeraw\nETH\n2:17:58 (London, 2021)\nAshete Bekere Dido\nETH\n2:17:58 (Tokyo, 2022)\nHiwot Gebrekidan\nETH\n2:17:59 (Valencia, 2023)\nIrine Cheptai\nKEN\n2:18:22 (Hamburg, 2024)\nKeira D'Amato\nUSA\n2:19:12 (Houston, 2022)\nBetsy Saina\nUSA\n2:19:17 (Tokyo, 2024)\nDorcas Tuitoek\nKEN\n2:20:02 (Amsterdam, 2023)\nMary Ngugi-Cooper\nKEN\n2:20:22 (London, 2022)\nSara Hall\nUSA\n2:20:32 (Chandler, 2020)\nEmma Bates\nUSA\n2:22:10 (Boston, 2022)\nBuze Diriba\nETH\n2:23:11 (Toronto, 2023)\nSara Vaughn\nUSA\n2:23:24 (Chicago, 2023)\nSusanna Sullivan\nUSA\n2:24:27 (London, 2023)\nGabi Rooker\nUSA\n2:24:35 (Chicago, 2023)\nLindsay Flanagan\nUSA\n2:24:43 (Gold Coast, 2022)\nNell Rojas\nUSA\n2:24:51 (Boston, 2023)\nStacey Ndiwa\nKEN\n2:25:29 (Los Angeles, 2024)\nLaura Thweatt\nUSA\n2:25:38 (London, 2017)\nLauren Hagans\nUSA\n2:25:56 (Duluth, 2023)\nAnnie Frisbie\nUSA\n2:26:18 (New York, 2021)\nJackie Gaughan\nUSA\n2:27:08 (Berlin, 2023)\nDominique Scott\nRSA\n2:27:31 (Chicago, 2023)\nDiane Nukuri\nUSA\n2:27:50 (London, 2015)\nMakena Morley\nUSA\n2:30:25 (Los Angeles, 2024)\nAnne Marie Blaney\nUSA\n2:30:43 (Orlando, 2024)\nAndrea Pomaranski\nUSA\n2:31:06 (Houston, 2023)\nAmy Davis-Green\nUSA\n2:33:09 (Orlando, 2024)\nAubrey Frentheway\nUSA\nDebut\nBank of America Chicago Marathon Professional Field – Women's Wheelchair Division\nName\nCountry\nClassification\nPersonal Best\nSusannah Scaroni\nUSA\nT54\n1:27:31 (Duluth, 2022)\nManuela Schär\nSUI\nT54\n1:28:17 (Boston, 2017)\nTatyana McFadden\nUSA\nT54\n1:31:30 (Duluth, 2019)\nJenna Fesemyer\nUSA\nT54\n1:33:50 (Duluth, 2022)\nCatherine Debrunner\nSUI\nT53\n1:34:16 (Berlin, 2023) World Record\nNikita Den Boer\nNED\nT54\n1:38:16 (Tokyo, 2021)\nEden Rainbow-Cooper\nGBR\nT54\n1:35:11 (Boston, 2024)\nTian Yajuan \nCHN\nT54\n1:39:39 (Dubai, 2024)\nVanessa De Souza\nBRA\nT54\n1:40:21 (Seville, 2020)\nYen Hoang\nUSA\nT53\n1:47:29 (London, 2022)\nBank of America Chicago Marathon Professional Field – Men's Open Division\nName\nCountry\nPersonal Best\nAmos Kipruto\nKEN\n2:03:13 (Tokyo, 2022)\nVincent Ngetich\nKEN\n2:03:13 (Berlin, 2023)\nDawit Wolde\nETH\n2:03:48 (Valencia, 2023)\nAmdework Walelegn\nETH\n2:04:50 (Rotterdam, 2024)\nJohn Korir\nKEN\n2:05:01 (Chicago, 2022)\nHuseydin Mohamed Esa\nETH\n2:05:05 (Amsterdam, 2022)\nJemal Yimer\nETH\n2:06:08 (Seoul, 2024)\nTatsuya Maruyama\nJPN\n2:07:50 (Berlin, 2022)\nYuichi Yasui\nJPN\n2:08:48 (Beppu, 2023)\nJorge Castelblanco\nPAN\n2:09:24 (Seville, 2024)\nZach Panning\nUSA\n2:09:28 (Chicago, 2022)\nBrian Shrader\nUSA\n2:09:46 (Chicago, 2023)\nCJ Albertson\nUSA\n2:09:53 (Boston, 2024)\nTomoki Yoshioka\nJPN\n2:10:03 (Beppu, 2024)\nReed Fischer\nUSA\n2:10:34 (Boston, 2022)\nNathan Martin\nUSA\n2:10:45 (Duluth, 2023)\nColin Mickow\nUSA\n2:11:22 (Chandler, 2020)\nKevin Salvano\nUSA\n2:11:26 (Chicago, 2023)\nJacob Thomson\nUSA\n2:11:40 (Gold Coast, 2023)\nTurner Wiley\nUSA\n2:11:59 (Chicago, 2022)\nJP Flavin\nUSA\n2:13:27 (Boston, 2023)\nCharlie Sweeney\nUSA\n2:13:41 (Sacramento, 2023)\nBen Kendell\nUSA\n2:15:49 (Sacramento, 2022)\nPhil Migas\nCAN\n2:15:53 (Hamburg, 2024)\nDaniel Ebenyo\nKEN\nDebut\nAlex Maier\nUSA\nDebut\nIsai Rodriguez\nUSA\nDebut\nBank of America Chicago Marathon Professional Field – Men's Wheelchair Division\nName\nCountry\nClassification\nPersonal Best\nMarcel Hug\nSUI\nT54\n1:17:47 (Oita, 2021) World Record\nAaron Pike\nUSA\nT54\n1:20:02 (Duluth, 2022)\nJohnboy Smith\nGBR\nT54\n1:20:05 (Duluth, 2022)\nKota Hokinoue\nJPN\nT54\n1:20:54 (Seoul, 2013)\nDaniel Romanchuk\nUSA\nT54\n1:21:36 (Boston, 2019)\nRafael Botello Jimenez\nESP\nT54\n1:22:09 (Boston, 2017)\nPatrick Monahan\nIRL\nT53\n1:22:23 (Duluth, 2019)\nLuo Xingchuan \nCHN\nT54\n1:23:49 (Chengdu, 2023)\nSho Watanabe\nJPN\nT54\n1:24:00 (Oita, 2019)\nSimon Lawson\nGBR\nT53\n1:25:06 (Boston, 2017)\nMa Zhuo\nCHN\nT54\n1:25:10 (Chengdu, 2023)\nHiroki Nishida\nJPN\nT54\n1:20:28 (Boston, 2017)\nBrian Siemann\nUSA\nT53\n1:26:46 (Boston, 2017)\nHu Yang\nCHN\nT54\n1:32:15 (Chengdu, 2023)\nRob Smith\nGBR\nT52\n1:55:51 (Dubai, 2017)\nAbout the Bank of America Chicago Marathon\nThe Bank of America Chicago Marathon welcomes thousands of participants from more than 100 countries and all 50 states, including a world-class professional field, top regional and Masters runners, race veterans, debut marathoners and charity participants. The race's iconic course takes participants through 29 vibrant neighborhoods on an architectural and cultural tour of Chicago. The 2024 Bank of America Chicago Marathon, a member of the Abbott World Marathon Majors, will start and finish in Grant Park on Sunday, October 13, 2024. In advance of the race, a three-day Abbott Health & Fitness Expo will be held at McCormick Place Convention Center on Thursday, October 10, Friday, October 11, and Saturday, October 12. For more information about the event and how to get involved, go to chicagomarathon.com.\nFor more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for news email alerts.\nReporters May Contact:\nAlex Sawyer, Bank of America Chicago Marathon\nPhone: 1.312.992.6618\nalex.sawyer@cemevent.com\nDiane Wagner, Bank of America\nPhone: 1.312.992.2370\ndiane.wagner@bofa.com\nCision\nView original content to download multimedia:https://www.prnewswire.com/news-releases/fast-racing-will-be-on-display-at-the-2024-bank-of-america-chicago-marathon-302200725.html\nSOURCE Bank of America Corporation", "Link": "Https://Finance.Yahoo.Com/News/Fast-Racing-Display-2024-Bank-140000448.Html", "Sentiment_Score": 0.0725384206, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-18T10:14:35.000Z", "Headline": "Bank of America Corporation (NYSE:BAC) Second-Quarter Results Just Came Out: Here's What Analysts Are Forecasting For This Year", "Summary": "It's been a good week for Bank of America Corporation (NYSE:BAC) shareholders, because the company has just released its latest second-quarter results, and the shares gained 5.4% to US$43.98. The result was positive overall - although revenues of US$25b were in line with what the analysts predicted, Bank of America surprised by delivering a statutory profit of US$0.83 per share, modestly greater than expected. This is an important time for investors, as they can track a company's performance in its report, look at what experts are forecasting for next year, and see if there has been any change to expectations for the business. We thought readers would find it interesting to see the analysts latest (statutory) post-earnings forecasts for next year.\nCheck out our latest analysis for Bank of America\nearnings-and-revenue-growth\nTaking into account the latest results, the current consensus from Bank of America's 19 analysts is for revenues of US$102.0b in 2024. This would reflect a decent 9.5% increase on its revenue over the past 12 months. Statutory earnings per share are predicted to accumulate 9.1% to US$3.21. In the lead-up to this report, the analysts had been modelling revenues of US$101.7b and earnings per share (EPS) of US$3.21 in 2024. So it's pretty clear that, although the analysts have updated their estimates, there's been no major change in expectations for the business following the latest results.\nThere were no changes to revenue or earnings estimates or the price target of US$43.91, suggesting that the company has met expectations in its recent result. It could also be instructive to look at the range of analyst estimates, to evaluate how different the outlier opinions are from the mean. Currently, the most bullish analyst values Bank of America at US$52.00 per share, while the most bearish prices it at US$37.50. There are definitely some different views on the stock, but the range of estimates is not wide enough as to imply that the situation is unforecastable, in our view.\nTaking a look at the bigger picture now, one of the ways we can understand these forecasts is to see how they compare to both past performance and industry growth estimates. The analysts are definitely expecting Bank of America's growth to accelerate, with the forecast 20% annualised growth to the end of 2024 ranking favourably alongside historical growth of 3.7% per annum over the past five years. By contrast, our data suggests that other companies (with analyst coverage) in a similar industry are forecast to grow their revenue at 5.6% per year. Factoring in the forecast acceleration in revenue, it's pretty clear that Bank of America is expected to grow much faster than its industry.\nThe Bottom Line\nThe most obvious conclusion is that there's been no major change in the business' prospects in recent times, with the analysts holding their earnings forecasts steady, in line with previous estimates. Fortunately, they also reconfirmed their revenue numbers, suggesting that it's tracking in line with expectations. Additionally, our data suggests that revenue is expected to grow faster than the wider industry. The consensus price target held steady at US$43.91, with the latest estimates not enough to have an impact on their price targets.\nKeeping that in mind, we still think that the longer term trajectory of the business is much more important for investors to consider. We have estimates - from multiple Bank of America analysts - going out to 2026, and you can see them free on our platform here.\nWe also provide an overview of the Bank of America Board and CEO remuneration and length of tenure at the company, and whether insiders have been buying the stock, here.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com", "Link": "Https://Finance.Yahoo.Com/News/Bank-America-Corporation-Nyse-Bac-101435401.Html", "Sentiment_Score": 0.0263521746, "Sentiment_Category": "neutral"}, {"Ticker": "BAC", "Time": "2024-07-17T23:39:00.000Z", "Headline": "Q2 Earnings Season Starts Positively", "Summary": "Note: The following is an excerpt from this week’s Earnings Trends report. You can access the full report that contains detailed historical actual and estimates for the current and following periods, please click here>>>\nHere are the key points:\n We are off to a good start in the Q2 earnings season, with the growth pace steadily improving, an above-average proportion of companies beating EPS estimates, and companies generally providing a reassuring outlook for the coming periods. This should help sustain the favorable revisions trend that we experienced ahead of the start of the Q2 earnings season.\n Partly offsetting the above positive take is companies’ difficulty in beating consensus revenue estimates, with the Q2 revenue beats percentage the lowest of the preceding 20-quarter period at this stage of the reporting cycle.\n For the 45 S&P 500 companies that have reported Q2 results, total earnings are up +8.7% from the same period last year on +5.2% higher revenues, with 82.2% beating EPS estimates and 55.6% beating revenue estimates.\n Except for the revenue beats percentage, which at 55.6% is the lowest for this group of 45 index members over the preceding 20-quarter period, all of the other performance metrics are tracking better relative to what we have seen in other recent periods.\n The big banks kicked off the Q2 reporting cycle for the Finance sector, with the market markedly appreciating the results from Bank of America BAC and Goldman Sachs GS. That said, all of the major banks came out with better-than-expected results.\nThe key difference between the Bank of America and, say, JPMorgan JPM results was the former’s explicit favorable outlook for the second half of the year, particularly in the context of net interest income.\nBank of America also came out with good investment banking results, but we are seeing improving results on that count from all of the players, including Goldman Sachs. Management teams had been talking about ‘green shoots’ on the investment banking side for some time now, but greater visibility on the monetary policy front appears to have finally cleared the path for greater deal flow.\nBanks are still facing multiple headwinds that are pressuring their profitability, including margin pressures and subdued loan demand, but there is reasonable optimism about their earnings outlook due to the beneficial effects of the expected Fed easing cycle.\nWhile we have a reasonably representative sample of results from the Finance sector, it is still very early for other sectors. For the quarter as a whole, S&P 500 earnings are expected to be up +8.7% on +4.8% higher revenues.\nAs we have been flagging all along, the Q2 revisions trend was very favorable, with estimates barely coming down since the quarter got underway. Estimates increased for the Tech, Utilities, Transportation, Autos, and Consumer Discretionary sectors, helping partly offset negative cuts for the other sectors.\nThe revisions trend for the Tech sector has been positive for a while now, which is important since the sector alone is on track to bring in almost 30% of all S&P 500 earnings over the coming four-quarter period.\nThe 2024 Q2 quarter will be the fourth consecutive quarter of robust Tech sector earnings growth, with total earnings for the sector expected to be up +15.5% from the same period last year.\nFor full-year 2024, Tech sector earnings are expected to be up +17.2%, followed by another strong showing expected next year. The chart below shows how the aggregate earnings total for the Tech sector has evolved over the past year.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nA big contributing factor to the Tech sector’s positive earnings outlook is the sector’s margins outlook, as the chart below shows.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nWe are already in record territory with Tech sector margins, with 2024 margins expected to exceed last year’s record level. The expectation is for some more gains next year and the year after, with the ever-growing share of higher-margin software and services in the overall Tech earnings pie explaining the favorable trend. Part of this likely also reflects optimism about the impact of AI on the sector’s productivity.\nThe Earnings Big Picture\nThe chart below shows the overall earnings picture on a quarterly basis.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nThe chart below shows the overall earnings picture on an annual basis.\nZacks Investment Research\n\nImage Source: Zacks Investment Research\nPlease note that this year’s +8.8% earnings growth on only +1.6% top-line gains reflects revenue weakness in the Finance sector. Excluding the Finance sector, the earnings growth pace changes to +8.7%, and the revenue growth rate improves to +3.9%. In other words, about half of this year’s earnings growth comes from revenue growth, with margin gains accounting for the rest.\nOn the margins front, 11 of the 16 Zacks sectors are expected to have higher margins in 2024 relative to last year, with Tech, Finance, and Consumer Discretionary as the big gainers.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\nBank of America Corporation (BAC) : Free Stock Analysis Report\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Q2-Earnings-Season-Starts-Positively-233900199.Html", "Sentiment_Score": -0.023719009, "Sentiment_Category": "neutral"}, {"Ticker": "BAC", "Time": "2024-07-17T13:40:00.000Z", "Headline": "Company News for Jul 17, 2024", "Summary": "Shares of Bank of America Corporation (BAC) jumped 5.4% after the company reported second-quarter 2024 earnings of $0.83 per share, beating the Zacks Consensus Estimate of $0.79 per share.\nMorgan Stanley’s (MS) shares gained 0.9% after the company reported second-quarter quarterly earnings of $1.82 per share, surpassing the Zacks Consensus Estimate of $1.65 per share.\nShares of The PNC Financial Services Group, Inc. (PNC) increased 4.7% after the company reported second-quarter 2024 earnings of $3.30 per share, outpacing the Zacks Consensus Estimate of $3 per share.\nFB Financial Corporation’s (FBK) shares soared 8% after the company reported second-quarter 2024 earnings of $0.84 per share, beating the Zacks Consensus Estimate of $0.76 per share.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBank of America Corporation (BAC) : Free Stock Analysis Report\nMorgan Stanley (MS) : Free Stock Analysis Report\nThe PNC Financial Services Group, Inc (PNC) : Free Stock Analysis Report\nFB Financial Corporation (FBK) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Company-News-Jul-17-2024-134000280.Html", "Sentiment_Score": -0.0410035178, "Sentiment_Category": "neutral"}, {"Ticker": "BAC", "Time": "2024-07-18T08:25:04.000Z", "Headline": "1 Vanguard Index Fund to Buy That Soared 1,500% in 15 Years, With Help From Stock-Split AI Stocks Nvidia and Broadcom", "Summary": "The Vanguard Information Technology ETF (NYSEMKT: VGT) returned 1,500% during the last decade and a half, growing by 20.3% annually. At that pace, $400 invested monthly in the exchange-traded fund (ETF) would now be worth more than $350,000.\nThose monster gains were due in part to artificial intelligence (AI) stocks Nvidia (NASDAQ: NVDA) and Broadcom (NASDAQ: AVGO), which soared 50,130% and 14,510%, respectively, during that 15-year period. Nvidia and Broadcom recently reset their share prices with stock splits. But the chipmakers retain compelling growth prospects, as do many other AI stocks.\nIndeed, analysts at Swiss investment bank UBS believe \"AI will be the most profound innovation and one of the largest investment opportunities in human history.\" That makes the Vanguard Information Technology ETF a compelling buy for growth-focused investors.\nArtificial intelligence could keep the technology sector on the leading edge of the stock market\nThe S&P 500 is divided into 11 stock market sectors by the Global Industry Classification Standard (GICS). Among those, information technology generated the best returns over the last five, 10, 15, and 20 years due to investment themes like cloud computing, cybersecurity, digital commerce, mobile devices, and streaming media.\nThe chart below illustrates how profoundly the information technology sector outperformed the S&P 500 during the past five years. It was the only sector to beat the benchmark index, and it more than doubled its gains.\nGoing forward, artificial intelligence (AI) is the next major investment theme that could keep powering the information technology sector ahead of the broader market. Indeed, Grand View Research says AI spending across hardware, software, and services could compound by 37% annually through 2030. That means the Vanguard Information Technology ETF has a good shot at outperforming the S&P 500 in the coming years.\nThe Vanguard Information Technology ETF provides exposure to the stock market's best-performing sector\nThe Vanguard Information Technology ETF measures the performance of 320 stocks in the information technology sector. Its constituents fall into three broad categories: (1) internet services and infrastructure companies, (2) technology consulting, hardware, and equipment providers, and (3) semiconductor and semiconductor equipment manufacturers.\nThe five largest holdings in the Vanguard ETF are listed by weight below.\nMicrosoft: 16.7%\nApple: 16.1%\nNvidia: 14.6%\nBroadcom: 4.7%\nAdvanced Micro Devices: 1.7%\nImportantly, those five companies should be major beneficiaries as businesses and consumers pour money into AI goods and services in the coming years.\nMorgan Stanley believes Microsoft is the company best positioned to monetize generative AI across cloud infrastructure and enterprise software.\nWedbush Securities thinks Apple will emerge as the gatekeeper of the consumer AI revolution following its launch of Apple Intelligence later this year.\nForrester Research recently wrote that Nvidia graphics processing units (GPUs) set the pace for AI infrastructure, so much so that \"without Nvidia GPUs, modern AI wouldn't be possible.\"\nBank of America recently selected Broadcom as its top AI stock due to the company's leadership in networking chips and custom silicon.\nPiper Sandler recently selected Advanced Micro Devices as a top pick due to its strength in data center server chips used for AI workloads.\nThe last item of consequence is the expense ratio. The Vanguard Information Technology ETF bears a reasonable expense ratio of 0.10%, meaning the annual fees will total $1 on every $1,000 invested in the fund. Similar investment products have an average expense ratio of 0.98%, according to Vanguard.\nHere's the bottom line: This Vanguard ETF lets investors spread money across hundreds of technology stocks that have collectively outperformed the S&P 500 on a consistent basis. Of course, the highly concentrated nature of the fund means it can be quite volatile at times. But patient investors comfortable with volatility should consider buying a position today given that AI spending could keep the Vanguard ETF ahead of the S&P 500 for years to come.\nShould you invest $1,000 in Vanguard World Fund - Vanguard Information Technology ETF right now?\nBefore you buy stock in Vanguard World Fund - Vanguard Information Technology ETF, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Vanguard World Fund - Vanguard Information Technology ETF wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $787,026!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Trevor Jennewine has positions in Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Bank of America, Microsoft, and Nvidia. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\n1 Vanguard Index Fund to Buy That Soared 1,500% in 15 Years, With Help From Stock-Split AI Stocks Nvidia and Broadcom was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/1-Vanguard-Index-Fund-Buy-084400614.Html", "Sentiment_Score": 0.8621543646, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-16T21:57:23.000Z", "Headline": "Bank earnings, spot ether ETF, US labor data: Market Domination", "Summary": "The weather is sweltering today, but equities are still thriving (^DJI, ^IXIC, ^GSPC) Julie Hyman and Josh Lipton monitor the latest market movements and report on the biggest industry stories heading into Tuesday's market close.\nMizuho US chief economist Steven Ricchiuto joins Market Domination to talk about what he is seeing in US labor and employment data and what it could mean about the supposed cooling economy.\nBank earnings continue to roll out with Bank of America (BAC), Morgan Stanley (MS), and Charles Schwab (SCHW) reporting results today. CFRA director of equity research Ken Leon comes onto the program to discuss prevalent trends in Big Bank earnings and the direction investment banking businesses could head in the latter half of 2024.\nAhead of Netflix's (NFLX) earnings due out on Thursday, July 18, Bloomberg Intelligence senior media analyst Geetha Ranganathan comments on the \"very, very high\" expectations for the streaming giant that it very well could live up to and even surpass for its past quarter.\nOther top trending stocks on the Yahoo Finance platform include UnitedHealth Group (UNH), Warner Bros. Discovery (WBD), Adidas (ADS.DE, ADDYY), and cryptocurrency ethereum (ETH-USD) around the expected launch of spot ether ETF products.\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Bank-Earnings-Spot-Ether-Etf-215723650.Html", "Sentiment_Score": 0.0114147775, "Sentiment_Category": "neutral"}, {"Ticker": "BAC", "Time": "2024-07-16T20:50:00.000Z", "Headline": "These Stocks Are Moving the Most Today: UnitedHealth, Trump Media, Schwab, Bank of America, Morgan Stanley, Shopify, Reddit, and More", "Summary": "UnitedHealth stock surges after profit at the health insurer tops estimates, while Trump Media stock falls after the company files for the resale of nearly 38 million common shares. Charles Schwab is down sharply after the brokerage giant issued second-quarter earnings.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/10335B70-120A-36F7-8C82-1B805E2Ca9B0/These-Stocks-Are-Moving-The.Html", "Sentiment_Score": 0.0807099938, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-16T20:38:46.000Z", "Headline": "How long will the investment banking boost last?", "Summary": "With the potential for the Federal Reserve to cut interest rates as soon as this September, there may be added hurdles for investment banking to keep profitability high even after several banks reported positive second quarter results.\nCFRA director of equity research Ken Leon joins Market Domination to discuss the state of investment banking and how these big banks may operate moving forward in current and future interest rate environments.\nOn sustainability of growth for investment banking, Leon comments: \"We hit the trough for investment banking fees last year, probably in July. We're still at just the beginning of a rebound, but saying that, the first quarter, first half of this year had record results for debt cap, debt underwriting. But equity underwriting and IPOs, are still really in early innings of recovery. And keep in mind, there's two major sources for deals: one is obviously corporates, but the one that has not been participating as it tries to figure out valuation with rates is financial sponsors.\"\nFor more expert insight and the latest market action, click here to watch this full episode of Market Domination.\nThis post was written by Nicholas Jacobino", "Link": "Https://Finance.Yahoo.Com/Video/Long-Investment-Banking-Boost-Last-203846171.Html", "Sentiment_Score": 0.0677114949, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-16T20:09:47.000Z", "Headline": "Bank Of America Adds To 24% Rally On Q2 Earnings; Financial Stocks Break Out", "Summary": "BAC stock surged Tuesday after Bank of America reported results. PNC Financial, State Street, Morgan Stanley release earnings.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/F2Fa1838-A574-34B1-B5A1-3831D5C7B470/Bank-Of-America-Adds-To-24-.Html", "Sentiment_Score": 0.5527445078, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-16T20:00:20.000Z", "Headline": "Bank of America (BAC) Q2 2024 Earnings Call Transcript", "Summary": "Image source: The Motley Fool.\nBank of America (NYSE: BAC)\nQ2 2024 Earnings Call\nJul 16, 2024, 8:30 a.m. ET\nContents:\nPrepared Remarks\nQuestions and Answers\nCall Participants\nPrepared Remarks:\n\nOperator\nGood day, everyone, and welcome to the Bank of America earnings announcement. At this time, all participants are any listen-only mode. Later, you will have the opportunity to ask questions during the question-and-answer session. [Operator instructions] Please note, this call may be recorded.\nI'll be standing by if you should need any assistance. It is now my pleasure to turn the conference over to Lee McEntire of Bank of America.\nLee McEntire -- Senior Vice President, Investor Relations\nGood morning. Welcome. Thank you for joining the call to review our second-quarter results. Our earnings release documents are available on the Investor Relations section of the bankofamerica.com website, and they include the earnings presentation that we will make reference to during the call.\nI hope everyone has had a chance to review those documents. Our CEO, Brian Moynihan, will make some opening comments before Alastair Borthwick, our CFO, discusses the details of the quarter. Let me just remind you that we may make forward-looking statements and refer to non-GAAP financial measures during the call. Forward-looking statements are based on management's current expectations and assumptions that are subject to risks and uncertainties.\nShould you invest $1,000 in Bank of America right now?\nBefore you buy stock in Bank of America, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Bank of America wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $787,026!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2024\nFactors that may cause our actual results to materially differ from expectations are detailed in our earnings materials and SEC filings available on our website. Information about non-GAAP financial measures, including reconciliations to U.S. GAAP, can also be found in our earnings materials that are available on our website. So, with that, let me turn the call over to Brian.\nThank you.\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nThank you, Lee, and good morning and thank all of you for joining us today. Before I begin today, I just want to reflect for a second on the horrible events this weekend. We at Bank of America are clear that there's no place for political violence in our great country, and we continue to wish the former President Trump a speedy recovery. And our thoughts, of course, go out to the victims and their families and others impacted by this terrible event.\nWith that, let's turn our results -- let's turn our attention to the results for the second quarter of 2024 Bank of America Corporation. This quarter, we achieved success in a number of areas, underscoring the benefits of our diversity and the dedication of our team to deliver responsible growth. Our organic growth engine continues to add customers and activity in all our businesses even as we see the drop in net interest income this quarter. I'm starting on Slide 2.\nOur net income for the quarter was $6.9 billion after tax or $0.83 in diluted EPS. Attesting to the balance in our franchise, the earnings were split evenly, half in our consumer GWIM businesses, which serve people, and the other half in our institutional-focused business, global banking and markets. We grew revenue from the second-quarter 2023 as improvement in noninterest income overcame the decline in net interest income. Fees grew 6% year over year and represented 46% of total revenue in the quarter.\nOur strong fee performance was led by a 14% improvement in asset management fees in our wealth management businesses. We grew investment banking fees 29% year over year and saw sales and trading revenue increase 7%. Global markets had its ninth consecutive quarter of year-over-year growth in sales and trading revenue, a good job by Jimmy DeMare and his team. Card and service charge revenue also grew by 6% year over year in our consumer business.\nMuch of this fee growth is a result of our intensity around organic growth and is a testimony to the -- a testament to the diversity of our operating model. Now, on to Slide 3. Organic growth has been driven by several key factors. First, we focus on our customers.\nWe continue to place them at the center of everything we do. Consumer led the way in delivering solid organic growth with high-quality accounts and engaged clients. For the 22nd consecutive quarter, we had significant net new consumer checking accounts. We expanded our customer base and our market share.\nSpecifically, we added 278,000 net new checking accounts this quarter, which brings our first six months of 2024 to more than 500,000. In wealth management, we added another 6,100 new relationships this quarter. In our commercial businesses, we added thousands of small businesses and hundreds of commercial banking relationships. This has led to now managing $5.7 trillion in client balances, loans, deposits, and investments across the consumer and wealth management client segments.\nIn those areas, we saw flows of $58 billion in the past four quarters. Our emphasis on personalized financial solutions and superior customer service has strengthened customer loyalty, attracting new clients across all our businesses. Our focus on providing liquidity and risk management solutions to our institutional clients positions us to continue to gain more share of their wallets as well. Second, we continue to deliver innovative digital solutions.\nOne of the primary contributors of both attracting and maintaining customers to our platforms is our digital banking capabilities for our clients across all the businesses. Our fully integrated consumer banking investment app drives the utility for our customers across their investment and consumer accounts. Our user stats are strong proof points. Our second-language capabilities in our consumer businesses further enhance our customers' capabilities.\nYou can see the continued digital growth in the slides on Pages 26, 28, and 30 in the appendix. A couple of highlights. Our consumer mobile banking app now serves more than 47 million active users. They logged in 3.5 billion times this quarter.\nWe also committed -- continued to see more sales through the use of our digital properties. Digital sales represented 53% of our total sales in the past quarter in our consumer businesses. 23 million consumers are now using Zelle. They send money on Zelle at nearly two and a half times the rate they write checks.\nAnd in fact, more Zelle transactions -- send transactions take place in the combination of customer ATM transaction, cash withdrawals, and teller. Simply put, Zelle is becoming a dominant way to move money. In our Wealth Management business, we are seeing more banking accounts being open to complement the investment business those clients do with us. Importantly, these clients are also recognizing the ease of our digital banking capability.\nSeventy-five percent of our new accounts in our Merrill teammates were opened digitally. Eighty-seven percent of our global banking clients also are digitally active. We have innovated and significantly streamlined service requests by enabling clients to directly initiate and track transaction inquiries within our awarded CashPro platform using AI to accomplish that. Third, we continued to make core strategic investments in our businesses.\nWe're not complacent with the success you see on this page. We continue to strategically invest in our core businesses. A few examples. While we had a leading retail deposit share in America, we continued to invest and have opened 11 new financial centers this quarter in the first half of the year and renovated another 243.\nThis is investment in both our expansion markets and our growth markets. In wealth management, we continue to invest in our Advisor Development Program. It's grown to 2,300 teammates, allowing us to continuously add more than -- teammates to our 18,000 strong best-in-class financial advisory force across all our wealth management businesses. We're also adding teams of experienced advisors strategically in areas across the country.\nIn our banking teams, we continued to add to our regional investment banking team. We now have more than 200 regional bankers across the country to better serve our commercial clients, and they complement our industry coverage to our corporate clients. In our global markets business, we continued to extend balance sheet to our clients and adding expertise and talent to continue to lead our market share improvement seen over the last several years. We also have increased our technology initiatives and expect to spend nearly $4 billion on technology initiatives this year.\nWe have focused projects around our artificial intelligence enhancements with both clients and our teammates. A recent example of our use of AI is our Advisor and Client Insights tools. We've delivered more than 6 million insights year to date to our financial advisors, providing them proactive reason to engage with clients. AI has moved from cost-savings ideas to enhancing the quality of our customer interactions.\nFourth, our organic growth is driving integrated flows across our business. We invest heavily in each line of business that compete in the markets based on their particular customer segment. But importantly, we also invest across our lines of business to knit them together and gain market share in the local markets. It's a differentiated advantage for us, our banking leadership position across our businesses and our nationwide franchise.\nFor example, we leverage our franchise by connecting business customers to our wealth management teams. Our teams across all our businesses have made 4 million referrals to other businesses in the first six months of this year. Next, we drive efficiency and effectiveness, and that's through our operational excellence platform. We continue to invest heavily in the future of our franchise and growth while we also have to manage expenses day to day.\nOur focus on operational excellence has enabled us to hold our expense growth up to 2% year over year, well below the inflation rates. We continue to work to achieve operating leverage as NII stabilizes and begins to grow again. As you look at it and Alastair will explain later, a fair portion in the year-over-year increase in expense is due to the formulaic incentives of wealth management due to the fee growth in that business. And last, our capital strength allows us to deliver for all stakeholders.\nOur capital remained strong as we held our CET1 ratio at 11.9% this quarter. We grew loans, increased our share repurchases to $3.5 billion and paid $1.9 billion in dividends. Average diluted shares dropped below 8 billion shares outstanding. In addition, we also announced our intent to increase our quarterly dividend 8% upon board approval.\nNote that 11.9% CET1 ratio remained a solid excess capital position above -- both above the current regulatory requirements and the increased requirement to 10.7% beginning October as a result of the recent CCAR [Inaudible]. Let's turn to Slide 4. A couple of things to note here. First, we've noted for several quarters that the second-quarter NII would be the trough for this rate cycle.\nWe expect NII to grow in the third quarter and fourth quarter this year. Alastair is going to provide you some points in detail about the path forward. One important contributor to that change is the positive behaviors of our customers. On Slide 4, you'll note that average deposits grew 2% year over year and increased modestly linked quarter.\nThe second quarter in reality is typically a heavy outflow quarter. We have a lot of customers who pay a lot of taxes in that quarter. Quarter-over-quarter increases in rates paid continued to slow again this quarter across all businesses except for wealth management. And we show you that on this page, Slide 4, by line of business.\nWhile wealth business deposit rates have moved higher with continued rotation, we expect those rates to begin to stabilize and the rate of quarterly change to decrease going forward. Turning to Slide 5. In previous calls, many of you have asked questions or comment upon the question about consumer net charge-offs and when would they stabilize in the second half of 2024. That expectation we have remains unchanged as well.\nThis quarter's net charge-offs were 59 basis points. And for context, this is a stabilization of the rate. I would just remind you that prior to this quarter, I have to go all the way back to 2014 to see a charge-off rate that high, and that's near when we were still emerging from the financial crisis. On Slide 4, we highlight the 30- and 90-day-plus credit card delinquency trends, which show delinquencies have plateaued for the second consecutive quarter.\nThis should lead to stabilized net credit losses in credit card in the second half of the year. At the bottom of the page, note a couple of facts. First, on the payment rates. This is the rate of paydown of balances in a given month.\nIt remained 20% above index to the pre-pandemic levels even while our card customers have plenty of capacity to borrow. And importantly, because of our relationship-based businesses, look at the right-hand side at the bottom of Page 5. There, you can see our deposit and investment balances of our customers who also have a card with us remained 25% above their pre-pandemic levels, illustrating continued health of these customers. So, as you think about consumer credit, the card charge-offs drive it and they flattened out in terms of delinquencies, and we expect them to improve in the second half.\nWith regard to commercial real estate, our usual CRE credit exposure slide is included in our appendix. We continue to aggressively work through our loans in our modest CRE office portfolio. We saw a decrease in all the categories, a decrease in reservable criticized loans, a decrease in NPLs, and a decrease in net charge-offs. This supports our previous expectation that net charge-offs in the second half of 2024 will be lower than the first half of 2024.\nOur second-quarter performance highlights Bank of America's ability to generate strong, sustainable growth through a combination of customer-centric strategies, innovation, strategic investments and a commitment to a strong balance of risk and reward. We call that responsible growth. We're confident that focused approach will continue to drive long-term success and create value for you, our shareholders. Now, I will turn it to Alastair for additional thoughts.\nAlastair M. Borthwick -- Chief Financial Officer\nThank you, Brian. And I'm going to start on Slide 6 of the earnings presentation. I'll touch on more highlights noted on Slide 6 as we work through the material. I just wanted to say upfront that we delivered strong returns with return on average assets of 85 basis points and a return on tangible common equity of nearly 14%.\nSo, let's move to the balance sheet on Slide 7, where you can see we ended the quarter at 3.26 trillion of total assets, relatively unchanged from the first quarter. And not much to note here apart from a mix shift of lower securities balances, mostly offset by an increase in reverse repo and modest loan growth as well as global markets client activity. On the funding side, deposits declined 36 billion on an ending basis, reflecting typical seasonal customer payments of income taxes. And as Brian noted, average deposits were still modestly higher.\nLiquidity remained strong with 909 billion of global liquidity sources. That was flat compared to the first quarter. Shareholders' equity was also flat compared to Q1 as earnings were offset by 5.4 billion in capital distributed to shareholders and a 1.9 billion redemption of preferred stock in the quarter. The 5.4 billion of capital contributions included 1.9 billion in common dividends and the repurchase of 3.5 billion in shares.\nAOCI improved modestly in the quarter, and tangible book value per share of $25.37 rose 9% from the second quarter of last year. In terms of regulatory capital, our CET1 level improved to 198 billion, and the CET1 ratio was stable at 11.9%. This 11.9% ratio remained well above our current 10% requirement as well as our new 10.7% requirement as of October 1st, 2024. Risk-weighted assets increased modestly and that was driven by lending activity.\nOur supplemental leverage ratio was 6% versus our minimum requirement of 5%, and that leaves plenty of capacity for balance sheet growth. And our 468 billion of TLAC means our total loss-absorbing capital ratio remains comfortably above our requirements. Brian already covered deposit trends, so let's turn the balance sheet focus to loans, and we'll look at average balances on Slide 8. You can see average loans in Q2 of 1.051 trillion.\nThey improved 1% year over year, driven by 5% credit card growth and modest commercial growth. The modest improvement in overall commercial loans included a 2% increase in our domestic commercial loans and leases, partially offset by a 4% decline in commercial real estate. Middle market lending saw an uptick in the quarter, and we saw good demand in our wealth businesses from custom lending. These areas of growth were largely offset by continued paydowns from our larger corporate clients on interest rate sentiment.\nConsumer growth was driven by credit card borrowing. And while home lending balances were flattish, originations picked up a bit this quarter. Lastly, and on a positive note, loan spreads continued to widen. As we turn our focus then to NII performance and Slide 9, note that we moved the slide we typically use to talk about excess deposits to the appendix on Slide 22.\nSo, you can see that there. Our excess deposit levels above loans remained high at 850 billion and continued to be a good source of value for shareholders. Fifty-two percent of our excess liquidity is now in short-dated cash and available for sale securities. The longer-dated lower-yielding hold-to-maturity book continues to roll off, and we reinvested again this quarter in higher-yielding assets.\nThe blended yield of cash and securities continued to improve in the quarter and is now 160 basis points above our deposit rate paid. Regarding NII, on a GAAP [Technical difficulty]\nQuestions & Answers:\n\nOperator\nTo all locations on hold, please remain online. We're experiencing a technical difficulty. Please remain online. You'll hear music for just a moment.\nAlastair M. Borthwick -- Chief Financial Officer\nWill materialize. And this now includes three interest rate cuts starting in September, another in November, and one more in December. And the waterfall shows an estimated impact of those rate cuts to our quarterly NII. The next couple of categories are a result of natural management of interest rate risk in a balance sheet mixed with fixed rate assets and variable rate assets.\nAnd our balance sheet is split roughly half and half. So, we take in liquidity from customers that we use to fund our assets, and then we store excess liquidity in cash and securities. We have fixed assets that mature and pay down, and those supply cash that then gets put back to work on the balance sheet and reprices over time. And we have two basic categories of fixed assets, the mature and pay off, and those are securities and loans.\nOn securities, you can see we've got about 10 billion a quarter of cash coming off of our securities portfolio. And we gained roughly 300 basis points of improvement on those assets when we put that money back from the balance sheet. On loans between resi mortgage and auto, we've got another roughly 10 billion, which reprices with a little less yield improvement on securities. And between the securities and loans, we expect the fixed rate asset repricing adds about 300 million through our quarterly rate of NII as we get to the fourth quarter.\nOn the variable rate asset side and to protect from down moves in rates, we hedge some of that with cash flow swaps. And those typically roll off in any given quarter and get replaced over time. So, included in the cash flow hedges is an impact of cessation of BSBY as an alternative rate. If you recall, we took a charge in the fourth quarter of '23.\nIt was 1.6 billion, and we said that would come back to us through time. And beginning in November, we started to see the benefit coming back into NII. And in Q4, that's about 200 million. That Q4 partial quarter benefit will grow by a slightly smaller sequential NII benefit in Q1 '25 and then it begins to taper off heading into 2026.\nIn addition, we've got about 150 billion of received fixed cash flow hedges protecting us from short rate moves moving lower. Most are hedging floating rate commercial loans, and the cost of those hedges is reported as contra revenue in commercial loan interest income. These hedges have a weighted average life of just over two years, and they've got an average fixed rate of approximately 250 basis points. So, starting in the second half of 2025, we begin to get some additional NII tailwind because the cash flow hedges with lower fixed rate likes where we receive.\nThose will begin to roll off and will likely replace those at higher current market rates at the time. The actual size of the tailwind we'll get from the expiration of those swaps will obviously be highly dependent on the level and the shape of the yield curve at the time of those maturities, and that stretches out over the course of the next four years. OK. A couple of other points to make.\nYou'll note we don't expect much movement around our modestly liability-sensitive global markets NII activity. And lastly, our forward view has an expectation of low single-digit growth in loans, low single-digit growth in deposits with continued slowing of rate paid movement through the back half of 2024. And you can see our expectation of the combined impact here as well. This last element is the one that has the most potential variability.\nAnd obviously, it will depend upon actual deposit and loan growth and pricing and rotation. OK. Let's turn to expense, and we'll use Slide 11 for the discussion. We reported 16.3 billion of expense this quarter, and that's more than 900 million lower than Q1, which included 700 million for the FDIC special assessment.\nNot including the FDIC assessment, expenses were lower than Q1 by 229 million, driven by seasonally lower payroll tax expense. Compared to Q2 '23, we're up less than 2%, and that increase is equal to the incentives paid for improved fee revenue. Incentives for our GWIM business alone are up 200 million year over year. And that's obviously an expense we're happy to pay when we have a 14% improvement in fees for assets under management.\nOur second-quarter head count number included welcoming a diverse class of nearly 2,000 summer interns, who we hope will join us over the course of the next year or two upon their graduation. And absent those interns, our head count fell by nearly 2,000. In the third quarter, we expect to add approximately 2,500 college graduates for full-time more than -- and that's from more than 120,000 applications received, showing that we remain an employer of choice for talented young people. Expense levels for the rest of 2024 are expected to bounce around the second-quarter level, given the higher fee revenue and investments made for growth.\nSo, let's now move to credit, and we'll turn to Slide 12. There was little change in our asset quality metrics this quarter. Provision expense was 1.5 billion. That was 189 million higher than Q1, driven by a smaller reserve release in Q2.\nNet charge-offs of 1.5 billion were little changed with a small increase in credit card mostly offset by lower commercial real estate office charge-offs. On a weighted basis, we remain reserved for an unemployment rate of nearly 5% by the end of 2025 compared to the most recent 4.1% rate reported. The net charge-off ratio was 59 basis points, largely unchanged from Q1. On Slide 13, we highlight more credit quality metrics for both our consumer and commercial portfolios.\nConsumer net charge-offs increased by a modest 31 million versus the first quarter from the flow-through of higher late-stage credit card delinquencies from Q1. Highlighting the change in direction of delinquencies, consumer 90-day-plus delinquencies declined in 2Q by 57 million. Commercial net charge-offs were relatively flat as lower commercial real estate losses were mostly offset by a small increase in other commercial loans. Our office losses went from 304 million in Q1 to 226 million in Q2.\nOther commercial real estate loan losses were simply one hotel. OK. Let's move to the various lines of business and some brief comments on their results. And I'll start on Slide 14 with consumer banking.\nFor the quarter, consumer earned 2.6 billion on continued strong organic growth. And reported earnings declined 9% year over year as revenue declined from lower deposit balances compared to the second quarter of last year. Customer activity showed another strong quarter, net new checking growth, another strong period of card openings, and investment balances for consumer clients, which climbed 23% year over year to a new record 476 billion. That included 12 months of strong flows at 38 billion in addition to market appreciation over the time.\nAs noted earlier, loans grew nicely year over year from credit card, as well as small business where we remain the industry leader. The team held expense flat year over year, reflecting good work with continued business investments for growth, offset by the operational excellence work to improve processes and move more of our transactions to digital. And as you can see in the appendix, Page 26, digital adoption and engagement continued to improve. And customer satisfaction scores remained near record levels, illustrating customer appreciation of our enhanced capabilities due to our continuous investment.\nMoving to wealth management on Slide 15. We produced good results and those included good organic client activity, market favorability and strong AUM flows. And this quarter also saw good lending results. Our comprehensive suite of investment in advisory services, coupled with our commitment to personalized wealth management planning solutions, has enabled us to meet the diverse needs and aspirations of our clients.\nNet income rose 5% from the second quarter of last year to a little more than a billion. In Q2, we reported revenue of 5.6 billion, growing 6% over the prior year. As Brian noted, strong 14% growth in fee revenue from investment and brokerage services overcame the NII headwind. Expense growth reflects the fee growth and other investments for the future.\nThe business had a 25% margin, and it generated a strong return on capital of more than 22%. Average loans were up 2% year over year, driven by strong growth we're seeing in custom lending and a pickup in mortgage lending. Both Merrill and the Private Bank continued to see good organic growth. And they produced strong assets under management flows of 58 billion since last year's second quarter, which reflects a mix of new client money as well as existing clients putting more of their money to work.\nI also want to highlight the continued digital momentum in this business, and you can find that on Slide 28. On Slide 16, we turn to global banking results. And here, the business produced earnings of 2.1 billion, down 20% year over year, as improved investment banking fees and treasury services revenue were overcome by lower net interest income and higher provision expense. Revenue declined 6%, driven by the impact of interest rates and deposit rotation.\nThe diversified revenue across products and regions reflects the strength of our global banking franchise. In our GTS business, fees for managing the cash of clients offsets a lot of the NII pressure from higher rates. And clients are accessing the capital markets for their capital needs instead of borrowing. Investment banking had a strong quarter, growing fees 29% year over year to nearly 1.6 billion led by debt capital markets fees, mostly in leveraged finance and investment grade.\nAnd we finished the quarter strong, maintaining our No. 3 investment banking fee position globally. A solid start to 2024 has left us in a good position with top three rankings now in North America, Latin America and EMEA and number six in APAC. And we're seeing strong performance in important industry groups as well.\nAn increase in provision expense from last year was driven by the commercial real estate net charge-offs I discussed earlier. And expense increased 3% year over year, including continued investment in the business. Switching to global markets on Slide 17. I'll focus my comments on results excluding DVA, as I normally do.\nThe team had another terrific quarter as we generated good revenue growth and achieved operating leverage and continued to deliver a solid return on capital. Earnings of 1.4 billion grew 19% year over year, and return on average allocated capital was 13%. Revenue, and again, this is ex DVA, improved 10% from the second quarter of '23. Focusing on sales and trading ex DVA, revenue improved 7% year over year to 4.7 billion, and that's the highest second quarter in over a decade.\nFICC was down 1% while equities increased 20% compared to Q2 '23. FICC revenues remained strong and versus Q2 '23. They were modestly lower driven by a weaker macro trading quarter in FX and rates. And that was largely offset by better commodities and mortgage trading.\nEquities was driven by strong trading results in derivatives and cash equities. Year-over-year expenses were up 4% on revenue improvement and continued investment in the business. Finally, on Slide 18. All Other shows a loss of 0.3 billion, and that was little changed year over year as lower expense was offset by lower provision costs as a result of reserve changes.\nOur effective tax rate for the quarter was 9%. And excluding discrete items and the tax credits related to investments in renewable energy and affordable housing, the effective tax rate would have been 25%. And with that, I think we'll stop there, and we'll jump into questions.\nLee McEntire -- Senior Vice President, Investor Relations\nAll right. Alastair and Brian, I just wanted to -- I did hear some feedback that maybe the audio from the call got interrupted for a moment. So, at the point at which it got interrupted, I just want to reiterate a couple of points that Alastair was making. If you go back to Slide 9, where I think we lost the audio, was where we started beginning a discussion about the performance from Q1 to Q2 of net interest income.\nThat was driven by higher funding costs and the rotation of deposits seeking higher yield alternatives. And while higher again in Q2, both the rotation and the rate paid increases did continue to slow down. On the Slide 10, I think the only points that I would make that Alastair began to discuss there was we are just reiterating our expectation that Quarter 2 would be the bottom for the NII in the rate cycle that we have been in. And our trajectory remains the same, the belief that our NII will begin to rise in Q3 compared to Q2 and then rise again in Q4.\nWe provided the range of expectations that Alastair covered. And we expect Q4 NII to be around the 14.5 billion level, plus or minus. That would be approximately 4% to 5% higher than this quarter's NII. And he began that discussion by making sure that you know that we pick up an extra day of net interest income in the Q3, providing about 125 million of additional NII that also carries through into Q4.\nYou see that on the slide. It also assumes that the current forward curve will materialize. Those -- that said, that interest rate cuts will start in September. We will expect another one in November and December in the curve.\nAnd the waterfall includes an estimated impact of those rates to quarterly net interest income. And so, then we started the discussion -- he began the discussion on the fixed asset repricing, which then I think is where the audio picked back up again. And so, we're happy to answer some questions on that. I know you'll have questions, but just wanted to recover that point -- those points for you.\nOperator\n[Operator instructions] We'll take our first question from Glenn Schorr of Evercore.\nGlenn Schorr -- Analyst\nHi. Thanks very much. Hello there. And definitely appreciate Slide 10 a lot.\nI know you would have given us a 2025 NII guide if you wanted to give us one. So, feel free to give that if you want, but that's not my question. My question is, given all the pieces of the puzzle that you gave us, expectations for modest loan and deposit growth and slowing deposit-seeking behavior, if you get that 4% pickup from 2Q to 4Q this year that you're expecting, right now or at least recently, consensus had NII looking flattish with that fourth-quarter number. And that doesn't make a lot of sense, given all the pieces.\nSo, maybe if you can just comment directionally, if you don't want to give the number, of does it make sense to you that we'd collectively be expecting flat NII with your higher fourth-quarter number?\nAlastair M. Borthwick -- Chief Financial Officer\nSo, Glenn, you're right. We're probably not going to give guidance around 2025 for all the reasons that you would expect. What we're trying to do here is reinforce for everyone what we've been saying from the beginning of the year, and that is we think Q2 is the trough. And we believe, from this point, we're in a good position to grow.\nNow, when you look at some of the elements of this bridge, you'll draw your own conclusions with respect to fixed rate asset pricing is going to persist for some period of time. And you'll be able to draw your own conclusions. But I just want to point out, we've been pretty clear on our guidance for Q1 and Q2. We've always felt like this would be the trough.\nWe feel like Q3 and Q4 are likely to be better. You can see our work here; we've laid it all out. Nothing's really changed in terms of that. And the most important thing, I think, for everybody here is we feel like 2024 is a really foundational year.\nIt's this twist period where we just got to get through the last of the deposit rotation, and we're establishing a foundation for growth from here. So, that's what we're trying to convey.\nGlenn Schorr -- Analyst\nMaybe I could just ask a follow-up on deposits within the wealth business. You have 4 trillion of client assets. I'm curious if you break out the split between brokerage and advisory accounts? Can you hear me OK? I'm hearing tons of feedback, sorry. OK, sorry.\nSo, 4 trillion in client assets -- great. Four trillion of client assets in wealth. I'm curious if you could give us the split between brokerage and advisory. And the reason I'm asking is I'm curious how you've been handling rate paid on cash and advisory accounts, and whether we should expect any behavioral changes following the recent Wells news.\nThanks a lot. Sorry for the feedback.\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nLook, Glenn, I'm not sure these things should be the distinction I'd look to. We price -- we've gone through a massive change in cash infused in the economy and withdrawn now under monetary policy. And so, as we stabilize, our instructions to our team are to grow our deposit base a little bit faster than economy. That means you have to price across the board to achieve that.\nAnd what -- if you look at the Slide 4 or 5, where I showed you sort of the change, what you see is the wealth management business takes a little bit longer because those clients have more investment cash with us, not what you're thinking, investment counts, because in their money, how they think about cash is they don't need the daily cash flow and they move that around. That largely is over. And if we look in the last four, six weeks, we're seeing those deposits, that business bounce around the $280-odd billion level, not a lot of movement. And it will keep moving in and out depending on customers paying down, paying their income taxes, taking more risk in the market and all those things.\nBut the deposit pricing changes that we made to ensure that they were on a platform that could grow, having been as high as 350 billion down to 280 billion were made in the quarter and all through the P&L.\nGlenn Schorr -- Analyst\nOK, so [Inaudible] on advisory. Thanks.\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nNext question, operator.\nOperator\nWe'll take our next question from Jim Mitchell of Seaport Global.\nJim Mitchell -- Seaport Global Securities -- Analyst\nHey, good morning. Maybe just a quick follow-up, and I don't mean to beat a dead horse on NII, but can we just -- can you just help us think through the puts and takes on you have rate cuts at the end of the year, forward curve implies more next year. As that cumulative impact starts to hit next year, I guess what gives you confidence that this is sort of the trough? What are all the puts and takes that we should think about in how we model the NII for next year when we think about the forward curve and that impact?\nAlastair M. Borthwick -- Chief Financial Officer\nJim, I think this bridge probably is all the right inputs for any given year. I mean, we've chosen to do it for 2024. We've always resisted going out too far for the very simple reason that there are so many variables, and they start to multiply with one another. If you think about even the rate cut one here, we're using the three cuts, September, November, December.\nIf I did this as of Wednesday of last week, there would have been two. Earlier in the year, there were six. So, since we don't know what that path looks like, it's very challenging then to provide guidance for '25 at this stage. But what we're laying out here is these are the component parts.\nWe're going to get some benefit from fixed rate asset pricing over time. We're going to get some benefit in the immediate term from the BSBY cessation, and that's leading back into the P&L. As that rolls off, we'll get benefit from cash flow hedges repricing. And then we use the forward curves, same as you do, for the rate cuts.\nWe benefit a little bit from global markets' liability sensitivity. And then the final piece is the piece that we're trying to drive in terms of organic growth. We're trying to drive this loan growth, trying to drive the deposit growth. And as Brian pointed out, it's been a pretty unusual period in history where we've had an enormous change in the rate structure and in the fiscal stimulus and the effects now fading away to something more normal.\nBut that last box will come down to your assumptions versus our assumptions. And we will update you as we go through the next couple of quarters, and we'll give you a better sense toward the end of the year.\nJim Mitchell -- Seaport Global Securities -- Analyst\nOK. That's all fair. And maybe just on the growth piece, maybe deposits seem to have bottomed for you guys in the second quarter of last year. You've had good growth.\nI think Brian pointed out, even with the tax headwind this quarter, you grew sequentially. So, good performance, but still pretty modest. How are you thinking about the growth trajectory from here, I guess, as we think about -- is it -- does it accelerate with rate cuts in your view? What are the dynamics are you thinking about as sort of returning to that historical kind of mid-single-digit deposit growth within BofA and the industry?\nAlastair M. Borthwick -- Chief Financial Officer\nWell, I think Brian covered Slide 4. That top-left chart gives a sense for what's going on with the growth that's average growth over time there. We've had four quarters in a row. So, we feel good about that part.\nQ2 does tend to be a slower quarter just with all the tax payments. So, we think deposits will do better over time, particularly as we get past peak Fed funds. We feel like the pricing in rotation is -- you can sort of see in our numbers, they're slowing. So, we're getting toward the end there.\nWe're getting toward the end of Q3. So, we're not quite finished on all of those things yet. I'd be careful about getting too excited about deposit growth, but we feel like we're doing OK so far, and we've just got to keep driving that.\nJim Mitchell -- Seaport Global Securities -- Analyst\nOK. Thanks for taking my questions.\nOperator\nWe'll take our next question from Mike Mayo of Wells Fargo Securities.\nMike Mayo -- Wells Fargo Securities -- Analyst\nHi. I'll start with a simple question. You mentioned loan spreads have improved. Why is that? Where is that? Do you expect that to continue?\nAlastair M. Borthwick -- Chief Financial Officer\nLoan spreads have improved for us, Mike, over the course of the past, I think, it's now eight or nine quarters. It's primarily in the commercial businesses. And it's largely because we have to price the balance sheet for the returns that our shareholders expect. And that's true, I think, for the industry, and we've been quite purposeful in that regard.\nSo, we've tried to balance price spread and growth over the course of time, but it's primarily a commercial phenomenon at this point. And I would expect that to continue for the foreseeable future, but it's a competitive environment. We've got to see.\nMike Mayo -- Wells Fargo Securities -- Analyst\nOK. You gave us Slide 10, a lot of details there. You talked about the September rate cuts, the fixed asset repricing, securities repricing, loans repricing, mortgage and auto, lots maturing November, received fixed cash swaps, and a whole litany of stuff. But I think when you put it all together, what it's led to is the net interest margin of only 1.93%.\nIn fact, I think your yield on your assets is below Fed funds right now. So, would you agree that you're under earning with that NIM of 1.93%? And I know I've asked this question before, but you always have to mark to market. What is a normal NIM? I mean, you were 2.5% in 2017. You were 3% in 2004.\nAnd I know the composition has changed and everything. But what's normal NIM? And what do you think is a normal return on tangible common equity through the cycle? Thanks.\nAlastair M. Borthwick -- Chief Financial Officer\nSo, I'd say right now, in terms of the 1.93, we feel like we are under earning. We feel like that number is going to go up over time. It will go up as net interest income goes up. But additionally, I think the balance sheet is likely to stay kind of flattish here.\nSo, the numerator is going to grow. The denominator is going to stay pretty tight here. So, we think we're under-earning there. We think through a cycle, we've got to get back to a more normal number like 2.30-ish over time.\nThat takes a while. It's a grind, Mike, quarter after quarter. So, that's where we're headed. And in terms of return on allocated capital, right now, we're right around that 14%.\nWe want to be 15% or higher for our shareholder. A lot of it is because we've accrued an awful lot of capital over the time or over the course of time in advance of any potential capital changes. And the other final thing I'll just remind you is we're a little different than some of the regional banks in that we've got an enormous global markets business and that obviously makes an impact on the headline NIM number.\nMike Mayo -- Wells Fargo Securities -- Analyst\nOK. And then just I wasn't clear, you said net charge-offs in the second half should be less than the first half. And I wasn't sure if that related to cards or I wasn't sure what you meant by net charge-offs.\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nMike, that was me. And basically, what I'm saying is we plateaued in terms of the delinquencies, which means the second half is pretty well determined, as you know, because it's just a march from 36 to 90 to 180. And it will be -- the charge-off rate will be flattish. We're kind of back to normal at 3.80 or so.\nThat's -- we underwrite to actually have a higher charge-off rate, quite frankly, in that intolerance, but that 3.80 is kind of where we see it since, 3.80%.\nMike Mayo -- Wells Fargo Securities -- Analyst\nOK. Credit card charge-offs should flatten or decline in the second half relative to the first half?\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nExactly. Remember, if you think about all the charge-offs, that's not -- that's the dominant part of it on the consumer side by a lot. And then the commercial, we spoke to the question of CRE office, which has been -- dropped quarter to quarter. And we expect the second half to be better also.\nMike Mayo -- Wells Fargo Securities -- Analyst\nAll right. Thank you.\nOperator\nWe'll take our next question from Steven Chubak of Wolfe Research.\nSteven Chubak -- Analyst\nHi, good morning.\nAlastair M. Borthwick -- Chief Financial Officer\nGood morning, Steve.\nSteven Chubak -- Analyst\nGood morning, guys. So, I wanted to ask just on -- just building on some of the NIM questions from earlier, a lot of that's been focused on asset repricing, both loans and securities. I was hoping you could speak to the opportunity to potentially optimize some of your higher cost funding. And just given multiple sources of NIM improvement, looking beyond '24, how should we think about the pace of NIM build as we -- I know it's a longer timeline to get to the 2.30 to 2.40, but just how to think about the expectations around the NIM trajectory beyond '24?\nAlastair M. Borthwick -- Chief Financial Officer\nWell, your first point is a question of can we pay down some of the higher cost securities, the answer to that is yes. And that would be an expectation of ours as part of this. We've got some shorter dated CDs that can roll off. We can replace those or not.\nWe have shorter dated debt. We've taken our long-term debt footprint down as we've continued to build the strength of the company. So, there's a lot of different ways. It doesn't have to be securities reinvestment.\nIt can be paying down higher cost liabilities as well. So, we've got a lot of different ways that we can use, quote, the reinvestment, if you like, around the fixed rate. And then what was the second -- the second question was over what time period we expect to build?\nSteven Chubak -- Analyst\nIt's really about the NIM trajectory beyond '24.\nAlastair M. Borthwick -- Chief Financial Officer\nYes. So, look, we're obviously on it right now. We feel like this is the trough. We're trying to build it from here.\nWe'll make meaningful strides on that through 2025. That's where we're going.\nSteven Chubak -- Analyst\nGreat. Thanks for taking my questions.\nAlastair M. Borthwick -- Chief Financial Officer\nWelcome.\nOperator\nWe'll take our next question from Betsy Graseck of Morgan Stanley.\nBetsy Graseck -- Analyst\nHi. Good morning.\nAlastair M. Borthwick -- Chief Financial Officer\nGood morning, Betsy.\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nGood morning, Betsy.\nBetsy Graseck -- Analyst\nSo, yes, another question on NII. Alastair, I did -- I think, hear you correctly when you said that as you go into the second-half of '25, there's going to be incremental benefits coming from swap roll-offs. Did I hear that right?\nAlastair M. Borthwick -- Chief Financial Officer\nYeah, that's correct, second-half '25. So, as we get closer, we'll be able to give you some kind of bridge like this that allows you to see what that looks like. But it's just -- it's a year out right now.\nBetsy Graseck -- Analyst\nYeah, for sure. But I'm just wondering, is there anything that's -- like, I guess what I just would like to understand a little better is how the swap book is impacting Slide 10. And then is it gradual into the second-half of '25 or is it a switch on in 3Q? Just understand how the swap book is playing into this thing.\nAlastair M. Borthwick -- Chief Financial Officer\nYes -- yes. So, the part that's important for Slide 10 around the second half of this year is just the BSBY piece. It's not from cash flow swaps. Any cash flow swaps we have that roll off in the course of the next 12 months really, they're all kind of current coupon-ish, because anything that we did there was to do with LIBOR cessation or whatever.\nAnd so, they all got recoupons. So, I wouldn't worry about that. In the second-half and onwards, some of the older, longer-dated things, they've got the lower coupons. So, that's when, you know, the BSBY number over time will disappear, but in the second half of '25, the cash flow number will begin to appear.\nSo -- and we'll give you a sense for what that looks like over time, Betsy.\nBetsy Graseck -- Analyst\nOK, got it. And then on the far right-hand side of Slide 10, you've got the yellow box, 50 million to 200 million. Could you just give us a sense as to what's the inputs to the 50 versus the 200, just so we can be able to track it as we go through the rest of the next two quarters?\nAlastair M. Borthwick -- Chief Financial Officer\nYeah. We're essentially using four variables. We're thinking, what will the loan growth be? What will the deposit growth look like? What will be the rotation between non-interest bearing and interest-bearing, and what will be any pricing changes we need to make, right? Then rotation pricing are pretty closely interlinked, that you could even call them the same thing. If you use more conservative numbers, you get toward the lower end.\nIf you use slightly more constructive numbers, you get toward the higher. I think the point we're trying to convey is this last part, this yellow box is always the unknowable at the beginning of the quarter, where we're projecting. The pieces in the green, we kind of feel like we know what those look like. That's pretty predictable at this point, but we've got a little more certainty around that.\nSo, the teams, we got 213,000 people, who are working really hard to try and make that dotted yellow box at the higher end. But obviously, it depends on our assumptions and it depends on our actions.\nBetsy Graseck -- Analyst\nSuper. Thank you so much for the color.\nOperator\nWe'll take our next question from Erika Najarian of UBS.\nErika Najarian -- Analyst\nHi, good morning. Just -- my first question is trying to square, what you're telling us on the net interest income trajectory in the setup versus your disclosure. So, Alastair, you told us about, as a response to Glenn's question, the benefit from fixed asset repricing, cash flow hedges repricing in the second-half of '25. And when I look at Table 40 from your queue, in both a parallel shift and a steepener scenario, down 100 is negative to net interest income.\nIs it because this is a 12-month look and like you pointed out, in the second-half of '25, you have underwater cash flow hedges that are rolling off? In other words, as we go through 2025, do you get less asset-sensitive? And additionally, what is the notional on those cash flow hedges that you're talking about?\nAlastair M. Borthwick -- Chief Financial Officer\nYeah. So, the asset sensitivity that we disclose is meant to give a sense for what happens if nothing changes, it's totally static. So, that's one difference. Number two, it's off of the future curve.\nSo, it's a 100 above whatever or below whatever the future curve is. So, I think it's a really helpful thing for sort of short-term moves and rates. Like take, for example, that orange box on Page 10, it's helpful for something like that, but it's less helpful in terms of a predictor of where 2025 NII would be because there's so many other inputs, Erika, over time.\nErika Najarian -- Analyst\nAnd just what's the notional of the cash flow hedges that you're referring to?\nAlastair M. Borthwick -- Chief Financial Officer\nOver time? Let's say, about 150 billion -- about 150 billion.\nErika Najarian -- Analyst\nAnd how much of that starts rolling off in the second half of 2025?\nAlastair M. Borthwick -- Chief Financial Officer\nWell, I think about it like this, you can almost think about it like it's like 10 billion or so every quarter. It's just that the ones that roll off for the first -- next 12 months, they're all kind of current coupons, so they won't really have any impact. Once you get into the second half of 2025, they're a little bit lower rated. So, that's when you begin to get some benefit there.\nAnd then I think probably Lee can give you more of the details following.\nErika Najarian -- Analyst\nGot it. And if I could just slide in one more question on the normalized NIM. Q3 and Q4 clearly is much higher than where you are now. Alastair, you mentioned we should assume a flattish balance sheet, but I think I had conversations with the company before in that half of that path between 1.9-ish to 2.3 to 2.4 has to do with balance sheet efficiency.\nAnd I'm wondering if you could carry out the balance sheet efficiency with -- and keep your balance sheet flattish? In other words, you know, obviously what the market is going to do is take your earning assets today and you know, apply two, three, five and say, OK, over time, whether it's '26 or '27, this is what BofA can earn under a normalized curve? I'm wondering if that's the right math to do, or should we expect some shrinkage of the balance sheet if you can -- that's part of the [Inaudible] for?\nAlastair M. Borthwick -- Chief Financial Officer\nYes. I think what will happen is the underlying growth of the company will still be there, but we have some things that we know, just like Steve asked that question, is there any higher rate, shorter-dated stuff you'd like to pay off? Yes, there will be overtime. So, I think we've got some ability to almost like self-fund the first 100 billion, 150 billion of growth in terms of earning assets. So, that's why we're saying that'll keep the denominator down while we're growing the numerator.\nErika Najarian -- Analyst\nOK, thank you.\nOperator\nWe'll take our next question from Ken Usdin of Jefferies.\nKen Usdin -- Analyst\nHey, thanks. Good morning. Hey, Alastair, I just wanted to ask you a little bit more on the securities portfolio side because you also have 180 billion or so of pay-fixed swaps on the AFS book. And so, we know about the HFS -- HTM maturity schedule.\nBut how do you look at that AFS book and how much are those pay-fixed swaps currently in the money and kind of like how you're just thinking about that side of the portfolio as well? Thanks.\nAlastair M. Borthwick -- Chief Financial Officer\nYeah. Just remember, those are received fixed. So, remember that there -- remember that is when we put the AFS in our portfolio, it's so that we've got a group of securities that are sitting there. They're typically treasuries.\nWe swap them to floating, so that they look like they're cash as far as we're concerned. We don't have to worry about -- in fact, then to regulatory capital flowing through. And they just to us, they just look like cash equivalents. So, that's how we think about it, Ken.\nKen Usdin -- Analyst\nOK. And then just how do you manage that going forward with regards to, like the rate forecasts? Do those come off as the securities book matures or --\nAlastair M. Borthwick -- Chief Financial Officer\nWell, I mean, it's less of an interest rate call for us. It's more of going back to this concept of we've got 1.9 trillion of deposits, and we've got 1.05 trillion of loans. So, we've got 850 billion of excess. So, when the excess comes in, we can do a variety of different things.\nWe'd love to put it in loans, but that's always our first -- that's our first love. But in the absence of that, we're going to put it in cash or we're going to put it in available for sale, probably swap to floating for the most part. And we can choose to put things in hold to maturity if we choose to. But obviously, right now, we feel like we want hold the maturity just continuing to pay down.\nThat's what's been happening over the course of the past 11 quarters. We're just going to keep going with that. So, no particular changes to our philosophy around available for sale.\nKen Usdin -- Analyst\nOK. And a quick one on expenses. I believe you said that costs are kind of hang in here at around the 16.3 that was reported. And so, just kind of any color on puts and takes here, just is that better kind of revenue-related comp against your ongoing efficiencies? And just how do you think about longer-term expense growth again? Thank you.\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nSure, Ken. If it -- I think honestly, the second quarter is sort of emblematic if you think about last year's second quarter. And this year's second quarter, we went from -- we went up by 300 billion -- 300 million, excuse me. As Alastair said, 200 million was just wealth management incentive comp and other growth was really other incentive comp.\nSo, the idea, the pressures we face now are really more due to fee growth in the businesses, which typically have a tighter correlation between fees and expenses and incentive comp related to those fees. So, that -- as Alastair said, that's not a -- that's a good expense growth is what you want. It does grow, and it grows at a good rate. Headcount has basically been bounced around relatively flat.\nWe're 212 this quarter and even adding a bunch of summer teammates. We were 215 last year. This quarter, the same summer teammates included. So, managing headcount, redeploying people, we have the huge -- the cleanup stuff going on.\nWe have the new initiatives going on, or freeing up work and moving it over. So, we feel good about managing the company and that's against inflation rate wages at 3% or 5% going on inflation in all the services we buy in the third-party markets, obviously, that the world experiences. So, we feel good about how we're managing expenses. The key is pretty simple.\nAs you -- all the revenue side equation that, yes, Alastair has been talking about their colleagues on NII and stuff is that lifts and expenses stay relatively flat, you start moving toward positive operating leverage. We were minus 1% or something like that this quarter, kind of hanging in there. And we'll expect that to go back to the five-year track we had all the way up until the pandemic hit and things got thrown in the sun.\nKen Usdin -- Analyst\nThanks, Brian.\nOperator\nWe'll take our next question from Gerard Cassidy of RBC.\nGerard Cassidy -- Analyst\nHi, Brian. Hi, Alastair.\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nHi, Gerard.\nAlastair M. Borthwick -- Chief Financial Officer\nHi there.\nGerard Cassidy -- Analyst\nBrian, you talked -- and Alastair, both of you talked about the excess deposits. I think it was Slide 22 you pointed to. Can you share with us as you go forward and assuming the Federal Reserve does cut interest rates, I know you put, I think, free Fed fund rate cuts in your Slide 10. But as we go out into the end of '25, the forward curve is calling for obviously more rate cuts.\nCould you tell us how you expect to price your deposits as rates continue to follow with this excess deposit level? Can you be more aggressive in lowering your deposit costs?\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nYes. I think that's very business and more importantly, customer-specific views, Gerard. So, we think of our deposit strategies in the context of how our customers utilize our services. And so, if you think about the parts that priced up in Global Banking or the investment-related cash in the consumer business and wealth management, that will come back down as rates come because the short-term equivalents come down.\nSome is absolutely mechanical because it's actually priced to meet a money market fund equivalent that will happen. And so, yes, I think if you think about us being all in, if you look on that slide at 203 basis points, there'll be some pickup as rates come down in those higher things. The zero interest balance accounts are low-interest checking. You know, they don't really move because there's zero interest or low interest, so they'll be kind of static, but they're still extremely valuable in the current context.\nSo, when you think of all the consumer, I think 60-odd basis points or something, that's driven by the fact that we have 40-odd million transactional primary checking accounts that is growing at a million a year, meant, multiple years in a row, 900,000 a million a year that are maturing from $3,000 up to $7,000 or $8,000 in balances as people mature the relationship with us, that's where the tremendous value in the deposit base this company goes. And so, if you think about 1.91 trillion having grown $100 billion almost from the trough, you think about it growing linked quarter, multiple quarters in a row, you think about even as we look now to buy the balances above that amount. Yes, that -- those are good dynamics. So, we think about it, but it will move.\nBut if you remember, part of our deposit pricing is never going to move to zero.\nGerard Cassidy -- Analyst\nRight, right. No, no doubt. And those are the golden deposits. And one other question on Slide 10 and also I think if I recall your first-quarter queue, you guys indicated you were asset-sensitive.\nI would assume that this Slide 10 also shows that with the three rate cuts. Alastair, what would it take to move to a more neutral position on the balance sheet or even a liability-sensitive position should the Fed really get into a rate-cutting environment?\nAlastair M. Borthwick -- Chief Financial Officer\nYeah. So, this is -- this shows that we're asset sensitive. That's why the red box obviously is bigger than the green box. It's the market specifically that's liability sensitive.\nSo, we're still asset-sensitive, Gerard. What it would take for us is either we can have a lot more rotation into interest-bearing, or we could buy some short-dated duration, fixed rate. So, those are the two alternatives. And if you look at the course of time, if you were to go back to our Qs over time, you'd see that we've become less and less rate-sensitive overtime.\nWe've really narrowed the corridor of whether rates go up by 100 or down by 100, what could that outcome look like? Narrowed that pretty substantially over time because we're trying to lock in rates here, recognizing that NII is up 4 billion or 5 billion over the course of the past several years per quarter.\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nYes. The last thing I'd say, Gerard, for a person who's been around this business as many years as you have, this has been a very abnormal rate environment for the last 15 years or so. And if you get to where you have a one Fed funds rate three and a half, which is what our experts predict, it sort of stops out at the ability to bring the asset sensitivity tighter and tighter is there because you actually have room to move down without hitting zero floors and stuff. So, there's -- and so, stability during time periods of which the rate environment doesn't flip around.\nAnd then secondly, a higher nominal rate environment allow you to manage to that outcome because part of the other outcome for us is just as rate -- the rate structure is nominally very low is the zero floors kick-in. And that creates a amount of sensitivity that over time will go away if rate structure is higher. Hope that makes sense to you.\nGerard Cassidy -- Analyst\nYeah. No, it does. Thank you. And just Brian or Alastair, one last quick question.\nI noticed in Slide 25, your home equity loan balance has actually increased. I think that's the first time in maybe over two years or three years. Was there a new program or what are you seeing that drives that? And that -- and should that or can that continue as we go forward into '25? Thank you.\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nYeah. I think it just reflects that the people have locked in low-rate loans and now that they want to borrow. It's an expensive view because they've got a fixed-rate mortgage loan, and they've got a home equity sitting on top of why wouldn't they use it. I like it for it was only two years.\nIt's been four years or five years since that balance went from 30 billion started declining, so it's good to see. I'll note at the bottom of that page, if you look at year-over-year mortgage production 5.7 billion and 5.9 billion and you look at home equity line production, which is new originations in the boxes, solid. But it is nice to finally see that the actual balances have stabilized. And we'll see.\nThey're kind of flattish, they're not really growing, but it's nice to see them not just keep coming down and hopefully, they'll start to be utilized. Our expectation would be -- they will be as consumers over time want to take out part of the equity in their home at a rate that is reasonable but doesn't require to refinance the whole first.\nGerard Cassidy -- Analyst\nGreat. Thank you, again, Brian.\nOperator\nWe'll take our next question from Vivek Juneja of JPMorgan.\nVivek Juneja -- Analyst\nHi, thanks for the questions. Just a little color on noninterest-bearing deposits. When you look at an average basis, the decline has clearly slowed sharply. Period-end was down at a faster rate.\nIs that just the noise around end of 1Q? Or what are you seeing as you look sort of month by month? Is that truly slowing or yes -- and talk to it a little bit by customer segment, if you can, please?\nAlastair M. Borthwick -- Chief Financial Officer\nYeah. I think, Vivek, you're catching two things. First one is it is slowing, that rotation is slowing and we would expect that because at the end of the day, this is mostly cash in motion, it's transactional accounts. That's why it's non-interest bearing.\nAnd the answer why it's a little different this quarter is because of the seasonality of tax payments. For anyone who has a big tax payment due, they frequently just allow it to. They may pull it out of their brokerage account, put it into their -- they may put it into their noninterest-bearing, and then they're wiring it out from there. So, that's, again, an example of money in motion, but that's what's going on this quarter.\nVivek Juneja -- Analyst\nA quick one. Visa B derivative gains, did the -- did you have anything in your equity derivatives trading revenue this quarter?\nAlastair M. Borthwick -- Chief Financial Officer\nNothing to highlight, nothing to note. That's a position we sold years ago, and anything that's happened with Visa would just unwind on the balance sheet. We've recycled it, so it shouldn't have any impact to revenue.\nVivek Juneja -- Analyst\nThank you.\nOperator\nWe'll take a question from Matt O'Connor of Deutsche Bank.\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nGood morning, Matt.\nMatt O'Connor -- Deutsche Bank -- Analyst\nGood morning. How are you guys thinking about kind of targeted capital levels going forward? Obviously, we're still waiting for final rules. Maybe there's a little more volatility in your SCB than you would have thought, but you still got a nice buffer? And then I guess one last piece I was thinking is the remixing of the balance sheet that's been commented kind of throughout this call over time probably causes a little creep in RWAs, right, like loans higher than, say, securities. So, lots of excess capital but some puts and takes.\nAnd how are you thinking about it between now and when we get final guidelines?\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nSo, first off, I think we always want to use the capital to grow the business. So, if we need to use it to support RWA growth for loans or something, that's a good outcome, and that's what we want to do first. Second, we maintain the 11.9% quarter to quarter with a little bit RWA increase, I think that would be emblematic. And we bought 3.5 billion, paid out 1.9 billion in dividends.\nSo, you'd expect that kind of to continue on in terms of that basic idea of we don't need a lot of capital to grow because the RWA demands are met with a fairly straightforward amount. We're earning a nice amount of dollars and we'll deploy it back in the dividend and the buybacks. Well, our job is to maintain -- our view is we will maintain a 50-basis-point type of management buffer to whatever the requirements are. The volatility, well, there's a whole different discussion on that in terms of the wisdom of that.\nBut the reality is the volatility is absorbable because you have time to plan into it and get done within a race we've seen. So, whether we agree with the volatility or not, we've easily absorbed it and the new rule is coming out. We'll see what happens, and we'll adjust. But just think of this as basically, a requirement of 10.7 under the new SCB plus 50 is 11.2.\nMaybe you get a little tighter if you feel you got great insight to what happens next year. And then I think the finalization of all the three will come through. And we'll see what that is and see how that all correlates to the various aspects. But we feel good about where we are and expect that all current earnings are basically available to support the growth we're talking about in the current economic environment.\nThat's relatively modest need, but really the rest of it just goes plowing back to you.\nMatt O'Connor -- Deutsche Bank -- Analyst\nOK. And then just to summarize that, I mean, do you think about bringing down the 11.9 to 11.2 kind of in the near term or to make it obvious, like, wait -- that's a little bit more theoretical and wait for the capital rules to play out?\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nI think we just -- we need to see how the next 60, 90, 120 days play out. We heard a lot of discussion about the timing of a reproposal or not, etc. So, we had a lot of flexibility and -- but we continue to focus on shareholder value creation and all of that. But I think we're in a critical spot for the industry in terms of learning the outcome of a lot of these things over the next short period of time here.\nMatt O'Connor -- Deutsche Bank -- Analyst\nOK, thank you.\nOperator\nThat concludes our question-and-answer session for today. I'd be happy to return the call to Brian Moynihan for closing comments.\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nThank you, operator. Thank all of you for joining us today. Obviously, a lot of focus on NII, and we gave you the Slide 10 to give you the bridge. Alistair answered a lot of the questions.\nLee's here to answer it. The key is to understand what's driving that, which is deposit performance, which is stabilized and starting to grow for like six quarters in a row now, loan growth very low, but just staying positive. Those are going to drive the value of this franchise, and that's organic growth by our customers. That's coupled with strong fee performance this quarter in terms of wealth management fees, investment banking fees, consumer fees, even growing global payment services fees, and, of course, the great work done by our markets team.\nSo, that, leveled with flattish expenses, gives us a chance to start driving operating leverage again in the company. And that generates a lot of earnings, a lot of excess capital, and we put that back in your hands. So, thank you for your time and attention. We look forward to talking next quarter.\nOperator\n[Operator signoff]\nDuration: 0 minutes\nCall participants:\nLee McEntire -- Senior Vice President, Investor Relations\nBrian T. Moynihan -- Chairman and Chief Executive Officer\nAlastair M. Borthwick -- Chief Financial Officer\nAlastair Borthwick -- Chief Financial Officer\nGlenn Schorr -- Analyst\nBrian Moynihan -- Chairman and Chief Executive Officer\nJim Mitchell -- Seaport Global Securities -- Analyst\nMike Mayo -- Wells Fargo Securities -- Analyst\nSteven Chubak -- Analyst\nBetsy Graseck -- Analyst\nErika Najarian -- Analyst\nKen Usdin -- Analyst\nGerard Cassidy -- Analyst\nVivek Juneja -- Analyst\nMatt O'Connor -- Deutsche Bank -- Analyst\nMore BAC analysis\nAll earnings call transcripts\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability.\nBank of America is an advertising partner of The Ascent, a Motley Fool company. The Motley Fool has positions in and recommends Bank of America. The Motley Fool has a disclosure policy.\nBank of America (BAC) Q2 2024 Earnings Call Transcript was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/Bank-America-Bac-Q2-2024-200020909.Html", "Sentiment_Score": 0.0117045678, "Sentiment_Category": "neutral"}, {"Ticker": "BAC", "Time": "2024-07-16T18:03:27.000Z", "Headline": "Morgan Stanley earnings, Trump VP, retail sales: Morning Brief", "Summary": "It's a new day, but the same old stock market. Seana Smith and Brad Smith help investors through the market open and discuss what's moving markets, like June's retail sales data.\nIn this installment of The Morning Brief, Morgan Stanley (MS) and Bank of America (BAC) reported second quarter earnings. Argus Research director of financial services research Stephen Biggar joins the show to discuss the latest Big Bank earnings and what lower interest rates would hold in store for the banking sector.\nAs Apple (AAPL) hopes to inspire a new upgrade cycle in its newest iPhone's AI features — dubbed Apple Intelligence — the tech giant also has its eyes set on the consumer market in India. D.A. Davidson managing director Gil Luria describes the country's consumer prospects as a \"long-term promise\" for Apple.\nOther trending stock tickers on the Yahoo Finance platform include Match Group (MTCH), UnitedHealth Group (UNH), and Shopify (SHOP).\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Morgan-Stanley-Earnings-Trump-Vp-180327703.Html", "Sentiment_Score": 0.0272205397, "Sentiment_Category": "neutral"}, {"Ticker": "BAC", "Time": "2024-07-16T17:45:00.000Z", "Headline": "Three Major Takeaways From Big Banks’ Earnings", "Summary": "Bank of America is among the lenders posting double-digit increases in investment-banking revenue. - Joe Raedle/Getty Images\nWall Street businesses boosted the earnings of big banks in the second quarter.\nInvestment-banking and trading revenue rose at major U.S. banks including Goldman Sachs and JPMorgan Chase. More stable economic conditions gave corporate-banking clients the confidence to use bread-and-butter banking services such as deal advisory and debt offerings.\nMost Read from The Wall Street Journal\nMusk Says He Will Move X and SpaceX Headquarters Out of California\n‘Morning Joe’ Hosts Criticize NBC for Pulling Show After Trump Assassination Attempt\nUsing Your Retirement Account as an Emergency ATM Just Got Easier\nYield-Hungry Wealth Management Clients Are Becoming a Headache for Big Banks\nDow Clinches Best Day in More Than a Year, S&P 500 Hits New Record\nConditions remain fragile, though. An unexpected turn in the economy or geopolitical upheaval could halt progress. And the picture is more complex for big banks with large consumer-lending businesses, such as Bank of America and Wells Fargo, as higher interest rates and inflation hurt lower-income customers.\nHere are the main takeaways from big banks’ earnings reports.\nInvestment Banking Is Rebounding\nGoldman Sachs, JPMorgan Chase, Bank of America, Morgan Stanley, Citigroup and Wells Fargo all posted double-digit increases in investment-banking revenue.\nA clearer outlook on interest rates is giving bankers hope that dealmaking is emerging from a two-year slowdown. Goldman Chief Executive David Solomon said the bank is seeing “the early innings of a capital markets and M&A recovery.”\nGlobal mergers-and-acquisitions volumes, while up about 8% in the second quarter from a year earlier, are still below those of the deal boom coming out of the pandemic.\nM&A activity is unlikely to kick into full gear until interest rates come down, bringing the private-equity firms that typically power dealmaking back into the fold. Bankers including Solomon say they are seeing signs this year of their re-emergence.\nEquity-underwriting volumes are up but are still way off their peaks. On Friday, ticketing-platform StubHub delayed its plans to go public for several months because of a choppy market for initial public offerings, The Wall Street Journal reported.\nStock Market Highs Help Asset and Wealth Management\nMany banks also got a lift from their asset-and-wealth-management businesses thanks in large part to the stock market, which has set repeated highs. These businesses handle investment funds and oversee accounts for institutions and wealthy individuals. Goldman reported a 27% revenue jump from a year ago in its asset-and-wealth-management business. Bank of America, JPMorgan and Wells Fargo each posted 6% increases.\nRevenue in Morgan Stanley’s wealth-management business increased just 2% from a year ago and showed signs of weakness, including a 17% decline in net interest income.\nWall Street-heavy banks such as Goldman and Morgan Stanley are increasingly relying on these types of businesses to generate steady fee revenue to offset lulls in dealmaking and trading. They can also provide an extra boost even when those businesses do well, as they did for Goldman in particular in the second quarter.\nLower-Income Consumers Are Under Pressure\nConsumers have continued to spend and borrow, helped by a strong job market and wage gains. But higher inflation and interest rates have increasingly pressured budgets, especially for lower-income households, some of the largest commercial banks said.\nAt JPMorgan, Wells Fargo, Bank of America and Citi, there were signs that more borrowers carried credit-card balances over from month to month in the second quarter. More also fell behind on payments. JPMorgan and Bank of America stashed away funds for potential consumer-loan losses.\nThere has been particular pressure on the consumers who are already on shaky financial ground. JPMorgan said some lower-income consumers have shifted spending toward nondiscretionary products. Citi said consumers with lower credit scores had seen sharper declines in payment rates and borrowed more.\nBank of America said Tuesday that loan losses on credit cards flattened out during the period from earlier this year and should continue improving. The banks said the figures reflected a return to normal after years of low credit-card balances and delinquency rates.\nThe big picture, JPMorgan Chief Financial Officer Jeremy Barnum said, “is still consistent with quite a healthy consumer.”\nWrite to AnnaMaria Andriotis at annamaria.andriotis@wsj.com, Justin Baer at justin.baer@wsj.com and Gina Heeb at gina.heeb@wsj.com\nMost Read from The Wall Street Journal\nHow Disney Is Trying to Be as Addictive as Netflix\nThree Major Takeaways From Big Banks’ Earnings\nHow Wall Street Keeps Absorbing America’s Borrowing Binge\nTyson Foods CFO Pleads Not Guilty After Drunken-Driving Arrest\nFive Below CEO Joel Anderson Steps Down", "Link": "Https://Finance.Yahoo.Com/News/Bank-America-Profit-Slips-123200796.Html", "Sentiment_Score": -0.068347156, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-16T17:30:00.000Z", "Headline": "Yield-Hungry Wealth Management Clients Are Becoming a Headache for Big Banks", "Summary": "Brokerage customers are still demanding more for their cash. Across several banks with large wealth-management businesses, a common theme in second-quarter earnings reports was continuing to have to pay higher rates to hang on to brokerage customers’ cash that isn’t invested in things like stocks and bonds. Wells Fargo and Morgan Stanley called out increases in some of the rates they pay on certain brokerage account deposit products, and Bank of America noted a rise in rates paid on wealth-management deposits.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/E3862880-1Fa4-3530-84D5-9194B09C27D8/Yield-Hungry-Wealth.Html", "Sentiment_Score": -0.9156010747, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-16T17:19:07.000Z", "Headline": "Unpacking the increase in credit card delinquencies", "Summary": "Credit card delinquencies are on an upward trend, as evidenced by recent bank earnings. Bank of America (BAC), among others, has reported a year-over-year increase in delinquency rates, raising concerns about consumer financial health.\nYahoo Finance banking reporter David Hollerith analyzes this trend, shedding light on its implications for the broader banking landscape and the American consumer.\nFor more expert insight and the latest market action, click here to watch this full episode of Wealth!\nThis post was written by Angel Smith", "Link": "Https://Finance.Yahoo.Com/Video/Unpacking-Increase-Credit-Card-Delinquencies-171907334.Html", "Sentiment_Score": -0.345888257, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-16T15:41:00.000Z", "Headline": "Bank of America Stock Jumps on Results, Outlook", "Summary": "Bank of America's shares jumped Tuesday after the lender reported quarterly results that beat Wall Street estimates and said its income on lending would improve during the second half of the year. The stock rose more than 4% in late morning trading, and was on pace for its biggest one-day gain since December.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/55404B9A-0Fbd-3D62-840F-6Fd27B9Ed939/Bank-Of-America-Stock-Jumps.Html", "Sentiment_Score": -0.076169312, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-16T15:17:00.000Z", "Headline": "Stocks to Watch Tuesday: Match, UnitedHealth, Bank of America, Trump Media", "Summary": "**↗️** **Match (MTCH)**: Hedge fund Starboard Value has built a big stake in the online-dating company and is pushing for a possible sale if a turnaround isn’t successful. Shares of the Tinder parent jumped over 9%.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/38B7368D-Fb24-38Dc-8841-3C8Bd7B13De1/Stocks-To-Watch-Tuesday-.Html", "Sentiment_Score": -0.0020565949, "Sentiment_Category": "neutral"}, {"Ticker": "BAC", "Time": "2024-07-16T14:57:54.000Z", "Headline": "Bank of America's Profit Slips, but Revenue Tops Expectations", "Summary": "The U.S.'s second-largest bank reported a decline in quarterly profit, as higher interest rates continued to weigh on its lending businesses. Here are Bank of America's key second-quarter numbers: + Net income fell 6.8% to $6.9 billion, from $7.4 billion from a year earlier. + BofA’s net interest income, or the difference between what the bank earns on loans and securities and what it pays depositors, fell 3% to $13.7 billion.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/1C92Ce34-068C-3754-99Fc-071C3Bcdb877/Bank-Of-America-S-Profit.Html", "Sentiment_Score": -0.9023789167, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-16T14:23:13.000Z", "Headline": "Why Morgan Stanley is this analyst's top banking pick", "Summary": "Big Banks have kicked off the second-quarter earnings season over the past couple of trading days, Bank of America (BAC) and Morgan Stanley (MS) being the latest financial institutions to report their results.\nBank of America shares are rising on its earnings beat while forecasting its net interest income (NII) to pick up in the fourth quarter of 2024. Topping overall earnings estimates, Morgan Stanley saw its wealth management segment miss net revenue estimates by $70 million.\nThe Morning Brief welcomes Argus Research director of financial services research Stephen Biggar to talk about how he is reacting to Morgan Stanley's quarterly results after naming it a top pick.\n\"A little bit light on the wealth management side for Morgan Stanley today, certainly offset by a terrific performance by investment banking, revenues up 51% there,\" Biggar says. \"So that's been kind of the story broadly with banks and what we expect going into the quarter that we'd have a much better backdrop and environment for investment banking.\"\nBiggar weighs in on the areas interest rate cuts by the Federal Reserve will benefit banks the most.\n\"Lower rates would be a benefit for banks both on the loan growth side — loan growth has been very anemic as high interest rates have curbed loan demand — and also taking some, some pressure off those deposit costs,\" Biggar explains to Yahoo Finance. \"So I think that's why banks are, well, they're very well hedged to whether rates go up or down.\"\nFor more expert insight and the latest market action, click here to watch this full episode of Morning Brief.\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Why-Morgan-Stanley-Analysts-Top-142313075.Html", "Sentiment_Score": 0.0191197414, "Sentiment_Category": "neutral"}, {"Ticker": "BAC", "Time": "2024-07-16T14:12:00.000Z", "Headline": "Bank of America Stock Jumps as Investors Shrug Off Rate-Driven Profit Decline", "Summary": "Bank of America reported a dip in second quarter profits, but the stock still rose because it beat analysts estimates. Wealth management revenue was up 6% to $5.6 billion and net income was up 5% to $1 billion. Bank of America on Tuesday reported second-quarter profit that fell 6.8% from a year ago as higher interest rates for consumers continued to weigh on profitability.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/0F6Ed24B-D0C4-3808-A739-A64Ca2Fd8E3A/Bank-Of-America-Stock-Jumps.Html", "Sentiment_Score": -0.5803126097, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-16T13:57:36.000Z", "Headline": "Bank of America Posts Earnings Beat on Investment Banking Boost", "Summary": "Justin Sullivan / Staff / Getty Images\nMore\n\nKey Takeaways\nBank of America shares rose Tuesday after reporting better second-quarter revenue and profit than analysts had projected.\nNet interest income, however, was lower than the same time last year, as Bank of America joins other banks that recently reported drops to NII in the second quarter.\nThe bank's investment banking operations were a source of growth as consumer banking revenue slipped 3% year-over-year.\n\n\nBank of America (BAC) shares rose Tuesday as second-quarter revenue and profit beat estimates despite slightly lower net interest income (NII) than analysts were anticipating.\nThe bank reported net income of $6.9 billion, or 83 cents per share, below last year's marks but still better than the $6.6 billion, or 79 cents per share, that analysts had projected, according to estimates compiled by Visible Alpha.\nRevenue also beat estimates as it grew about 1% year-over-year to $25.4 billion, which Bank of America credited to higher fees, along with improved sales and trading revenue. However, NII dropped 3% to $13.7 billion, narrowly below the $13.79 billion analysts expected, as Bank of America continued a trend of lower NII that started in last week's bank earnings as greater deposit costs offset the benefit of higher interest rates.\nWealth Management, Investment Banking Drive Growth\nConsumer banking revenue slipped 3% to $10.2 billion, but wealth management revenue grew 6% to $5.6 billion, and investment banking fees surged 29% to $1.6 billion.\nBank of America's rivals JPMorgan Chase (JPM), Goldman Sachs (GS), Wells Fargo (WFC), and Citigroup (C) also reported higher second-quarter revenue from their investment banking activities in recent days.\nBank of America shares rose 3.6% to $43.41 as of 9:55 a.m. ET Tuesday. They are up over 28% in 2024.\nRead the original article on Investopedia.", "Link": "Https://Finance.Yahoo.Com/News/Bank-America-Posts-Earnings-Beat-135736355.Html", "Sentiment_Score": 0.6499872804, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-16T13:51:10.000Z", "Headline": "Bank of America rises, Morgan Stanley falls on Q2 earnings", "Summary": "Bank of America (BAC) and Morgan Stanley (MS) both reported their second quarter results with shares of Bank of America moving to the upside in pre-market trading as it expects net interest income to rise in the fourth quarter. Shares of Morgan Stanley are falling in pre-market trading on Tuesday as the firm's wealth management net revenue missed estimates by $70 million.\nThe Morning Brief anchors Brad Smith and Seana Smith break down the latest earnings figures for these major banks and what it could mean for their stocks moving forward.\nFor more expert insight and the latest market action, click here to watch this full episode of Morning Brief.\nThis post was written by Nicholas Jacobino", "Link": "Https://Finance.Yahoo.Com/Video/Bank-America-Rises-Morgan-Stanley-135110984.Html", "Sentiment_Score": -0.7337567806, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-16T13:30:07.000Z", "Headline": "Compared to Estimates, Bank of America (BAC) Q2 Earnings: A Look at Key Metrics", "Summary": "Bank of America (BAC) reported $25.38 billion in revenue for the quarter ended June 2024, representing a year-over-year increase of 0.7%. EPS of $0.83 for the same period compares to $0.88 a year ago.\nThe reported revenue compares to the Zacks Consensus Estimate of $25.19 billion, representing a surprise of +0.76%. The company delivered an EPS surprise of +5.06%, with the consensus EPS estimate being $0.79.\nWhile investors scrutinize revenue and earnings changes year-over-year and how they compare with Wall Street expectations to determine their next move, some key metrics always offer a more accurate picture of a company's financial health.\nAs these metrics influence top- and bottom-line performance, comparing them to the year-ago numbers and what analysts estimated helps investors project a stock's price performance more accurately.\nHere is how Bank of America performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\nEfficiency Ratio (FTE basis): 63.9% versus the seven-analyst average estimate of 61.8%.\nNet interest income/yield on earning assets - Yield/rate: 1.9% versus 2% estimated by seven analysts on average.\nTotal earning assets - Average balance: $2,887.94 billion versus $2,849.82 billion estimated by seven analysts on average.\nBook value per share of common stock: $34.39 versus $34.29 estimated by seven analysts on average.\nNet charge-off / Average Loans: 0.6% compared to the 0.5% average estimate based on six analysts.\nTotal nonperforming loans, leases and foreclosed properties: $5.69 billion compared to the $6.20 billion average estimate based on five analysts.\nTotal Non-Performing Loans: $5.47 billion versus $6.14 billion estimated by four analysts on average.\nTier 1 Capital Ratio: 13.5% versus the four-analyst average estimate of 13.5%.\nTier 1 Leverage Ratio: 7% compared to the 7.1% average estimate based on three analysts.\nNet Interest Income- Fully taxable-equivalent basis: $13.86 billion versus $13.94 billion estimated by seven analysts on average.\nTotal Noninterest Income: $11.68 billion versus the seven-analyst average estimate of $11.37 billion.\nCard income: $1.58 billion versus $1.56 billion estimated by six analysts on average.\nView all Key Company Metrics for Bank of America here>>>\n\nShares of Bank of America have returned +6% over the past month versus the Zacks S&P 500 composite's +3.8% change. The stock currently has a Zacks Rank #3 (Hold), indicating that it could perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBank of America Corporation (BAC) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Compared-Estimates-Bank-America-Bac-133007733.Html", "Sentiment_Score": 0.0897139311, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-16T15:19:19.000Z", "Headline": "Equity traders fuel US bank profits as stock markets rally", "Summary": "By Saeed Azhar and Tatiana Bautzer\n(Reuters) -Equity traders rode high in the second quarter, propelling earnings across Wall Street giants.\nA buoyant U.S. economy, interest rate bets and rising geopolitical uncertainty have helped to fuel activity across trading desks, executives said as the banks reported second quarter earnings this week.\n\"There's a significant amount of geopolitical and election uncertainty around the world, but that tends to be an environment where clients reposition, and that tends to be a reasonably good environment for our sales and trading business,\" Bank of America's Chief Financial Officer Alastair Borthwick told reporters on a conference call on Tuesday.\nBofA's revenue from equities trading jumped 20% in the second quarter from a year ago to $1.9 billion. It rose because of \"strong client activity\" and a better performance in cash and derivatives, the bank said in a statement.\nAt Morgan Stanley, equity revenue surged 18% to $3 billion.\nThe gains came from across businesses and regions, particularly Asia, helped by stronger client engagement and a \"constructive\" market environment, the bank said.\n\"You could see continued uncertainty based on how the next administration handles the significant macro challenges facing the U.S... That, of course, offers all kinds of opportunities,\" Morgan Stanley CEO Ted Pick told analysts on a conference call.\nFor example, existing client demand in cash derivatives and prime brokerage could lead to potential deal opportunities in investment banking, Pick said. Bond and currency trading could also benefit, he added.\nAt rival Goldman Sachs, equities revenue rose 7% to $3.17 billion during the same period, driven by derivatives, it said on Monday.\nThe business has surged alongside markets this year, Goldman's CFO Denis Coleman told analysts on Monday.\n\"Clients look to us on a holistic basis really across both FICC and equities to ensure that across all of the activities they're doing with us that we're finding some balance between helping them through financing activities, helping them with intermediation,\" he said, referring to fixed income, currencies and commodities.\nJPMorgan's equity markets revenue jumped 21% to $3 billion, Citigroup's increased 37% to $1.5 billion, and Wells Fargo's surged 41% to $558 million, the banks reported on Friday in their second-quarter earnings.\n(Reporting by Saeed Azhar and Tatiana Bautzer in New York; writing by Lananh Nguyen; editing by Rod Nickel and Nick Zieminski)", "Link": "Https://Finance.Yahoo.Com/News/Equity-Traders-Fuel-Us-Bank-131841337.Html", "Sentiment_Score": 0.0823059678, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-16T13:15:21.000Z", "Headline": "Bank earnings, June retail sales, Trump's VP pick: 3 Things", "Summary": "Bank of America (BAC) and Morgan Stanley (MS) are the latest major banks to report second-quarter earnings this week. Bank of America beat earnings estimates while reporting quarter-over-quarter and year-over-over declines in net interest income (NII). Morgan Stanley shares fall in pre-market trading after missing on revenue forecasts.\nJune retail sales data is out this morning, better than expected as overall sales stayed in place for the month when anticipated to fall by 0.3%.\nLastly, former President Donald Trump announced his vice presidential pick while at the Republican National Convention yesterday: Ohio Senator JD Vance (R-Oh.).\nFor more expert insight and the latest market action, click here to watch this full episode of Morning Brief.\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Bank-Earnings-June-Retail-Sales-131521473.Html", "Sentiment_Score": 0.0217823125, "Sentiment_Category": "neutral"}, {"Ticker": "BAC", "Time": "2024-07-16T12:39:00.000Z", "Headline": "BofA (BAC) Gains on Q2 Earnings Beat, IB & Trading Fee Growth", "Summary": "Bank of America’s BAC second-quarter 2024 earnings of 83 cents per share outpaced the Zacks Consensus Estimate of 79 cents. The bottom line compared unfavorably with 88 cents earned in the prior-year quarter.\n\nShares of the company gained more than 2% in the pre-market trading on better-than-expected results. However, a full day’s trading session will depict a clearer picture.\n\nDespite modest loan growth (loan balances rose 0.5% from the prior-year period) and high interest rates, BofA recorded a decline in net interest income (NII) because of higher deposit costs.\n\nNevertheless, BofA witnessed a 1.8% year-over-year increase in total deposit balances at the end of the quarter.\n\nAlso, total IB fees (in the Global Banking division) of $835 million increased 16.3% year over year, driven by growth in underwriting income (up more than 30% year over year). Advisory services revenues witnessed a 3.3% decline in the quarter.\n\nSimilar to the previous quarters, BofA recorded an improvement in trading numbers in second-quarter 2024. Sales and trading revenues (excluding net DVA) grew 6.7% from the prior-year quarter to $4.68 billion. Fixed-income trading fees increased 3%, while equity trading income jumped 19.7%.\n\nOverall, the company’s net income applicable to common shareholders plunged 7.3% from the prior-year quarter to $6.58 billion. Our estimate for the same was $6.34 billion.\nRevenues Improve Marginally, Expenses Rise\nNet revenues were $25.38 billion, which beat the Zacks Consensus Estimate of $25.19 billion. Also, the top line increased marginally from the prior-year quarter.\n\nNII (fully taxable-equivalent basis) fell 3% year over year to $13.86 billion. Our estimate for NII was $14.06 billion.\n\nNet interest yield contracted 13 basis points (bps) year over year to 1.93%.\n\nNon-interest income increased 5.8% from the prior-year quarter to $11.68 billion. The rise was driven by an increase in fees and commissions. We had projected a non-interest income of $11.13 billion.\n\nNon-interest expenses were $16.31 billion, up 1.7% year over year. Our estimate for non-interest expenses was $16.47 billion.\n\nThe efficiency ratio was 64.26%, up from 63.65% in the year-ago quarter. An increase in the efficiency ratio indicates a deterioration in profitability.\nCredit Quality Worsens\nProvision for credit losses was $1.51 billion, up 34% from the prior-year quarter. We estimated the metric to be $1.35 billion.\n\nNet charge-offs jumped 76.4% year over year to $1.53 billion. As of Jun 30, 2024, non-performing loans and leases as a percentage of total loans were 0.52%, up 13 bps year over year.\nCapital Position Strong\nBook value per share as of Jun 30, 2024, was $34.39 compared with $32.05 a year ago. Tangible book value per share as of the second-quarter end was $25.37, up from $23.23.\n\nAt the end of June 2024, the common equity tier 1 capital ratio (advanced approach) was 13.5%, up from 13.2% as of Jun 30, 2023.\nCapital Distribution Update\nIn the reported quarter, the company returned $5.4 billion to shareholders as dividends and share repurchases.\nOur Take\nBofA’s focus on digitizing and expanding operations, decent loan growth, and high interest rates are likely to keep aiding growth. However, elevated expenses, higher funding costs and near-term macroeconomic factors pose major headwinds.\nBank of America Corporation Price, Consensus and EPS Surprise\n Bank of America Corporation Price, Consensus and EPS Surprise\nBank of America Corporation price-consensus-eps-surprise-chart | Bank of America Corporation Quote\nCurrently, BAC carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nPerformance of Other Major Banks\nThe Bank of New York Mellon Corporation’s BK second-quarter 2024 adjusted earnings of $1.51 per share surpassed the Zacks Consensus Estimate of $1.43. Also, the bottom line increased 9.4% from the prior-year quarter.\n\nBK’s results were primarily aided by a rise in fee revenues and lower expenses. The assets under custody and/or administration (AUC/A) and assets under management (AUM) balances grew on a solid market rally. However, a decline in net interest revenues hurt BK’s results to some extent.\n\nHigh interest rates, the resurgence of the investment banking business and solid markets revenues drove JPMorgan’s JPM second-quarter 2024 adjusted earnings to $4.40 per share. The bottom line handily surpassed the Zacks Consensus Estimate of $4.19.\n\nThe results excluded a $2.04 per share net gain related to Visa shares, an 18-cent-per-share donation of Visa shares to pre-fund contributions to the company’s Foundation and net investment securities losses of 14 cents per share. After including these one-time items, earnings were $6.12 per share.\n\nJPM’s equity underwriting fees jumped 56% and debt underwriting fees grew 51%. Also, advisory fees rose 45%. Overall, JPM’s total IB fees were up 50% from the prior-year quarter. \n\nAlso, higher interest rates, decent consumer spending and a decent loan balance (up 2% year over year) supported NII in the quarter.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBank of America Corporation (BAC) : Free Stock Analysis Report\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\nThe Bank of New York Mellon Corporation (BK) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Bofa-Bac-Gains-Q2-Earnings-123900298.Html", "Sentiment_Score": 0.9144907594, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-16T14:50:50.000Z", "Headline": "Bank of America Q2 profits drop as higher interest rates slow down lending", "Summary": "NEW YORK (AP) — Bank of America said its profits fell in the second quarter, as higher interest rates ate into BofA's expenses, including its large consumer banking franchise.\nBut like Goldman Sachs, Bank of America saw a resurgence of activity in its investment banking division which helped make up for some of the weakness in other parts of the bank.\nThe Charlotte, North Carolina-based bank said Tuesday it earned a profit of $6.9 billion, compared with $7.4 billion in the same period a year earlier. On a per share basis, BofA earned 83 cents, beating analysts' estimates.\nWhile Bank of America did see higher loan growth and more return on its assets in the quarter, much of the bank's interest income was eaten up by higher interest expenses. Bank of America traditionally keeps a balance sheet of shorter-term securities, so when the Federal Reserve raised interest rates, BofA had to finance at the higher rate more quickly than its peers.\nThe bank saw fewer credit losses and delinquencies than its competition, only increasing the money it set aside for loan losses by a modest amount.\nBank of America's investment banking division helped make up for the sluggish performance in the consumer bank. The bank had higher sales and trading revenue from its stock and bond trading desks and more advisory revenue from its bankers.\nTotal revenue at the bank was $25.4 billion, up modestly from $25.2 billion in the same period a year earlier.\nIn morning trading, Bank of America Corp. shares rallied 5.2% to $44.09.", "Link": "Https://Finance.Yahoo.Com/News/Bank-America-Q2-Profits-Drop-122918495.Html", "Sentiment_Score": -0.962911427, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-16T20:44:31.000Z", "Headline": "Bank of America leans on Wall Street as high rates pose challenges to Main Street operations", "Summary": "Second quarter profits at Bank of America (BAC) fell 7% from a year ago as its consumer operations wrestled with higher interest rates, but it was able to churn out more investment banking fees and trading revenue.\nThe divergence between the businesses at Bank of America that serve Main Street and Wall Street reinforced a dominant trend this earnings season for the nation’s biggest financial institutions.\nHigher interest rates and elevated deposit costs are eating away at more traditional consumer banking margins, forcing giant banks to lean more heavily on their trading and investment banking as dealmaking shows new signs of life.\n\"The strength and earnings power of our leading consumer banking business is complemented by the growth and profitability of our global Markets, global banking, and wealth management businesses,\" said Bank of America CEO Brian Moynihan.\nBank of America Chairman and CEO Brian Moynihan. (REUTERS/Elizabeth Frantz) (REUTERS / Reuters)\nBank of America’s net income fell to $6.89 billion, which was slightly better than expectations, while rising 3% from the first quarter. Its total revenue of $25.37 billion rose slightly from a year ago.\nA key measure of lending revenue known as net interest income fell more than 3% from a year ago and more than 2% from the previous quarter, to $13.70 billion.\nThis margin — which measures the difference a bank earns by making loans and paying out depositors — has been tightening at many big banks due to higher rates and elevated funding costs.\nThis same measure also fell sequentially at JPMorgan Chase (JPM), Wells Fargo (WFC), and Citigroup (C) as their customers continued migrating to higher-yielding deposit products like CDs.\nThere were other signs of challenges for Bank of America and its consumer borrowers. It set aside more money for future loan losses when compared with a year ago, a sign that it expects credit conditions to worsen.\nIts credit card charge-offs more than doubled from a year earlier and more than 6% from the last quarter, another signal that more of its customers are having trouble paying down their bills. However, the pace of delinquencies slowed.\n\"Delinquencies have plateaued for the second consecutive quarter. This should lead to stabilized net credit losses in credit card in the second half of the year,\" Moynihan told analysts.\nBut there were some bright spots. Bank of America expects net interest income to rise later this year as the Federal Reserve starts to lower interest rates and the bank replaces under-earning bonds and fixed-rate loans with higher-yielding assets.\nIt said it expected fourth quarter net interest income to be $600 million higher than its second quarter figure.\nAnd its Wall Street operations really stood out. Investment banking fees jumped 28% from a year ago while its equities trading rose nearly 20%.\n\"The fundamental trends have been strong capital markets and weak net interest income,\" Portales Partners founder Charlie Peabody told Yahoo Finance Monday, referring to the trends of bank earnings season thus far.\n\"The question is if that spread income is going to reflect positively in the second half of the year.\"\nInvestment banking fees and trading revenue also jumped at JPMorgan Chase, Citigroup, Wells Fargo, and Goldman Sachs.\nBank of America's stock rose more than 5% Tuesday. As of Monday night it was up 20% so far this year.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance", "Link": "Https://Finance.Yahoo.Com/News/Bank-Of-America-Leans-On-Wall-Street-As-High-Rates-Pose-Challenges-To-Main-Street-Operations-122457107.Html", "Sentiment_Score": 0.5517465472, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-16T12:16:12.000Z", "Headline": "BofA projects net interest income improvement later this year", "Summary": "Dive Brief:\nBank of America’s second-quarter profit slipped, as the second-largest U.S. bank felt the squeeze of higher deposit costs and tepid loan demand.\nThe bank also saw a drop in consumer deposits: Although average deposit balances rose 2%, to $1.91 trillion, average deposits in the lender’s consumer banking segment dipped 6%, to $949 billion, according to second-quarter earnings materials.\nBofA executives sought to label the second quarter a low point, forecasting loan and deposit growth in the latter half of the year. On deposits, “the second quarter, in reality, is typically a heavy outflow quarter,” CEO Brian Moynihan said during a conference call Tuesday, citing customer income tax payments made during the quarter.\nDive Insight:\nQuarterly results for the Charlotte, North Carolina-based lender are yet another sign banks are getting bit by higher-for-longer interest rates, as their customers move money into accounts offering higher interest rates. \nMoynihan and CFO Alastair Borthwick noted their expectations for low single-digit loan and deposit growth in the remainder of the year, and pointed to deposit rotation behavior slowing.\nNet interest income fell 3%, to $13.7 billion, impacted by higher deposit costs and meager loan growth. That measure refers to the difference between what a bank pays customers on deposits and the interest the bank collects on loans. Average loans and leases at the bank edged up just 0.5%, to $1.05 trillion. \n“We think Q2 is the trough, and we believe from this point we’re in a good position to grow,” Borthwick said. “We feel like 2024 is a really foundational year. It’s this twist period, where we’ve just got to get through the last of the deposit rotation, and we’re establishing a foundation for growth from here.” \nStill, Borthwick cautioned, “I’d be careful about getting too excited about deposit growth.”\n“We’re doing OK so far,” he added. “We’ve just got to keep driving that.” \nThe bank projects net interest income will rise in the third quarter and again in Q4, where it’s expected to be about $14.5 billion in the final quarter. That’s counting on three rate cuts by the Federal Reserve, according to the bank’s earnings presentation.\nBank of America also set aside more money for souring loans: The lender recorded provision for credit losses of $1.5 billion for the quarter; that figure was $1.3 billion in the first quarter and $1.1 billion in the year-earlier quarter. That also ate into the bank’s quarterly net income, which dropped about 7%, to $6.9 billion. Its revenue net of interest expense rose 1%, to $25.4 billion.\nBofA’s second-quarter results showed similarities to Wells Fargo’s. That lender also noted deposit migration and a decline in net interest income due to higher deposit costs, but got a lift from higher investment-banking fees, which helped fuel an increase in non-interest income. For BofA, investment banking fees jumped 29% for the quarter, to $1.6 billion, as mergers, acquisitions and capital markets activity have picked up. \nOn the expense side, Bank of America’s non-interest expense rose 2%, to $16.3 billion, fueled in part by revenue-related compensation. \n“The pressures we face now are really more due to fee growth in the businesses which typically have a tighter correlation between fees and expenses, and incentive [compensation] related to those fees,” Moynihan said. “That’s a good expense growth.”\nThis story was originally published on Banking Dive. To receive daily news and insights, subscribe to our free daily Banking Dive newsletter.", "Link": "Https://Finance.Yahoo.Com/News/Bofa-Projects-Net-Interest-Income-121612669.Html", "Sentiment_Score": 0.9357204437, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-16T11:55:03.000Z", "Headline": "Bank of America (BAC) Q2 Earnings and Revenues Beat Estimates", "Summary": "Bank of America (BAC) came out with quarterly earnings of $0.83 per share, beating the Zacks Consensus Estimate of $0.79 per share. This compares to earnings of $0.88 per share a year ago. These figures are adjusted for non-recurring items.\nThis quarterly report represents an earnings surprise of 5.06%. A quarter ago, it was expected that this nation's second-largest bank would post earnings of $0.77 per share when it actually produced earnings of $0.83, delivering a surprise of 7.79%.\nOver the last four quarters, the company has surpassed consensus EPS estimates four times.\nBank of America , which belongs to the Zacks Banks - Major Regional industry, posted revenues of $25.38 billion for the quarter ended June 2024, surpassing the Zacks Consensus Estimate by 0.76%. This compares to year-ago revenues of $25.2 billion. The company has topped consensus revenue estimates three times over the last four quarters.\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\nBank of America shares have added about 24.4% since the beginning of the year versus the S&P 500's gain of 18.1%.\nWhat's Next for Bank of America?\nWhile Bank of America has outperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\nAhead of this earnings release, the estimate revisions trend for Bank of America: mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\nIt will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $0.81 on $25.44 billion in revenues for the coming quarter and $3.22 on $101.81 billion in revenues for the current fiscal year.\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Banks - Major Regional is currently in the top 43% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\nOne other stock from the same industry, M&T Bank Corporation (MTB), is yet to report results for the quarter ended June 2024. The results are expected to be released on July 18.\nThis company is expected to post quarterly earnings of $3.50 per share in its upcoming report, which represents a year-over-year change of -31.6%. The consensus EPS estimate for the quarter has been revised 1.7% lower over the last 30 days to the current level.\nM&T Bank Corporation's revenues are expected to be $2.27 billion, down 12.8% from the year-ago quarter.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBank of America Corporation (BAC) : Free Stock Analysis Report\nM&T Bank Corporation (MTB) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Bank-America-Bac-Q2-Earnings-115503638.Html", "Sentiment_Score": 0.7351951599, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-16T11:43:52.000Z", "Headline": "Bank of America's Q2 Earnings: Revenue And EPS Beat, $1.5B Credit Loss Provision, Sees Q4 NII Growth", "Summary": "Bank of America's Q2 Earnings: Revenue And EPS Beat, $1.5B Credit Loss Provision, Sees Q4 NII Growth\nBank of America Corp (NYSE:BAC) reported a second-quarter fiscal 2024 net income of $6.9 billion and EPS of $0.83, beating the analyst consensus estimate of $0.80.\nRevenue, net of interest expense, increased 0.8% year-over-year to $25.54 billion, beating the analyst consensus estimate of $25.22 billion.\nSegment Net income: Consumer Banking $2.595 billion vs. $2.853 billion Y/Y, Global Wealth and Investment Management $1.03 billion vs. $978 million Y/Y, Global Banking $2.12 billion vs. $2.65 billion Y/Y, and Global Markets $1.41 billion vs. $1.18 billion Y/Y.\nAlso Read: US Banks Bump Up Dividends Following Fed's Successful Stress Test\nThe Net interest income was $13.7 billion (-3.0% Y/Y), as higher deposit costs more than offset higher asset yields and modest loan growth. Noninterest income was $11.7 billion (+6.0% Y/Y). Provision for credit losses was $1.5 billion, compared to $1.1 billion a year ago.\nThe efficiency ratio for the quarter was 64%, flat Y/Y. The bank reported a CET1 ratio of 11.9%, up 30 bps from a year ago. The book value per share of $34.39 improved by 7%.\nThe average loan and lease balance was $1.05 trillion (+0.5% Y/Y). Average deposits are up 2% Y/Y to $1.91 trillion.\nBank of America added ~1.0 million credit card accounts during the quarter.\nDividend: From CFO Alastair Borthwick: \"We announced plans for an eight percent increase in our quarterly common stock dividend, to 26 cents per share, pending Board approval.\"\nOutlook: Bank of America anticipates net interest income of ~$14.50 billion in the fourth quarter. It assumes a 25 bps interest rate cut.\nPrice Action: BAC shares are trading higher by 2.41% at $42.90 premarket at the last check Tuesday.\nPhoto Courtesy: Tero Vesalainen On Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Bank of America's Q2 Earnings: Revenue And EPS Beat, $1.5B Credit Loss Provision, Sees Q4 NII Growth originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "Link": "Https://Finance.Yahoo.Com/News/Bank-Americas-Q2-Earnings-Revenue-114352903.Html", "Sentiment_Score": 0.3198325038, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-16T11:27:02.000Z", "Headline": "5 Things to Know Before the Stock Market Opens", "Summary": "News of the day for July 16, 2024\nJaque Silva / SOPA Images / LightRocket via Getty Images\nMore\nBank of America's (BAC) second-quarter results top estimates; Amazon (AMZN) Prime Day is set to take place today and tomorrow, with estimates suggesting the sales event could be the tech giant's biggest ever; shares of Match Group (MTCH) are jumping in premarket trading on a report that activist investor Starboard Value may push for a sale of the online dating group if a revamp doesn't work; shares of Warren Buffett's Berkshire Hathaway (BRK.A, BRK.B) are rising after closing at record highs on Monday; and German fashion house Hugo Boss became the latest to caution of weak consumer demand for luxury goods, cutting its full-year sales outlook. U.S. stock futures are little changed after Federal Reserve Chair Jerome Powell on Monday reiterated previous comments that recent data has shown progress in the fight against inflation and the Dow Jones Industrial Average closed at a record high. U.S. retail sales for June due today may give insight into the health of the American consumer, with economists expecting sales to fall 0.4% over May. Here's what investors need to know today.\n1. Bank of America Gains on Q2 Earnings Beat; NII Drops\nBank of America (BAC) shares are rising about 2% in premarket trading after the lender became the latest big bank to post better-than-expected results on the back of investment banking gains. The bank posted second-quarter earnings per share (EPS) of 83 cents on revenue of $25.4 billion, ahead of analysts' expectations of 79 cents per share on revenue of $25.2 billion, according to Visible Alpha consensus estimates, as its Global Wealth and Investment Management division saw revenue increase 6% year-over-year to $5.6 billion. Like its banking colleagues JPMorgan Chase (JPM), Citigroup (C), and Wells Fargo (WFC), which reported second-quarter earnings last Friday, Bank of America reported lower net interest income (NII)—the difference in interest earned on loans versus those paid out on deposits. NII fell 3% “as higher deposit costs more than offset higher asset yields and modest loan growth.”\n2. Amazon Prime Day Kicks Off\nAmazon (AMZN) Prime Day is set to take place Tuesday and Wednesday, with estimates suggesting this year's sales event could be Amazon's biggest ever, after last year's event produced the largest single-day sales performance in the company's history on the first day. New artificial intelligence (AI)-powered shopping tools could also increase sales, while a revamped distribution model could help the company meet demand, according to JPMorgan analysts. Amazon shares, which are edging higher in premarket trading, are up more than 25% this year.\n3. Match Group Surges as Starboard May Push for Sale\nShares of Match Group (MTCH) are jumping roughly 8% in premarket trading after The Wall Street Journal reported that activist investor Starboard Value owns more than 6.5% of the Tinder owner and is pushing for a potential sale if a revamp isn’t successful. Tinder makes up more than half Match’s total revenue and Starboard believes the online dating app should be improved, and also sees potential for growth in the company's emerging apps like Hinge, according to the report.\n4. Buffett's Berkshire Gains After Hitting All-Time Highs\nShares of Warren Buffett's Berkshire Hathaway (BRK.A, BRK.B) are rising after closing at record highs on Monday, lifted by increases in some of the conglomerate’s key holdings, including Apple (AAPL), American Express, (AXP), Chevron (CVX), and Occidental Petroleum (OXY). Because of Berkshire’s diversification across a broad range of industries, the company, which trades at about 23 times analysts' full-year operating profit projections, is viewed by investors as a proxy for the health of the U.S. economy.\n5. Hugo Boss Latest to Warn of Grim Times for Luxury Sector\nHugo Boss shares are tumbling about 8% in German trading after the luxury fashion retailer became the latest to warn of bad times for the high-end sector. The German fashion house lowered its fiscal 2024 sales outlook to between 4.20 billion euros and 4.35 billion euros from a previous forecast of EUR4.30 billion to EUR4.45 billion. The company attributed its lowered outlook to \"persistent macroeconomic and geopolitical challenges that are dampening global consumer demand,” noting that the U.K. and Chinese market environments are \"particularly challenging.\" Luxury brands have been suffering from a pullback on consumer spending on high-end items as well as China's economic slowdown, with trench coat maker Burberry on Monday replacing Chief Executive Officer (CEO) Jonathan Akeroyd as it warned of slowing demand for luxury goods. \nRead the original article on Investopedia.", "Link": "Https://Finance.Yahoo.Com/News/5-Things-Know-Stock-Market-112702690.Html", "Sentiment_Score": -0.0083217751, "Sentiment_Category": "neutral"}, {"Ticker": "BAC", "Time": "2024-07-16T11:03:12.000Z", "Headline": "Bank of America Earnings Top Estimates. Like the Other Big Banks, High Rates Bite.", "Summary": "Bank of America on Tuesday reported second-quarter net income of $6.9 billion, topping analysts’ estimates of $6.4 billion. That amounted to per-share earnings of 83 cents a share; analysts polled by FactSet had forecast 80 cents.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/Dd9Cb5D6-8887-31Db-8075-Bf4A7Bbc8875/Bank-Of-America-Earnings-Top.Html", "Sentiment_Score": -0.2130792141, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-16T14:48:07.000Z", "Headline": "BofA profit beats expectation on robust investment banking, trading", "Summary": "By Niket Nishant and Saeed Azhar\n(Reuters) -Bank of America's second-quarter profit dropped as higher deposit costs pushed its interest income lower, but the results beat analysts' estimates, boosted by investment banking and trading.\nShares climbed more than 4% after BofA also forecast better-than-expected net interest income (NII) - the difference between what banks earn on loans and pay out on deposits - for the fourth quarter.\nCEO Brian Moynihan cited growth in new consumer checking accounts for the 22nd consecutive quarter in a conference call with analysts. He began the call by wishing former U.S. president Donald Trump speedy recovery after an assassination attempt on Saturday.\nThe bank's new interest income target factors in three potential interest rate cuts by the Federal Reserve of 25 basis points in September, November and December, according to a bank presentation.\nDavid Wagner, a portfolio manager at Aptus Capital Advisors, said Bank of America was able to grow in some areas despite a difficult environment for interest income.\n\"One thing that stood out to me was that BAC's guidance assumes three cuts, while the market is only pricing in two cuts,\" he said.\nINVESTMENT BANKING\nInvestment banks have brought in more underwriting fees as capital markets resurged. A resilient U.S. economy has encouraged companies to raise capital by selling stocks and issuing bonds in recent months.\nMergers and acquisitions are also gaining momentum, boosting advisory fees for investment banks. BofA's investment banking fees jumped 29% to $1.6 billion in the second quarter, echoing results at peers.\nUnderwriting income in the second quarter this year jumped 32%, while fees from syndication surged 77%.\nSales and trading revenue jumped 7% to $4.7 billion, growing for the ninth consecutive quarter year-on-year, as equities jumped.\n\"The interest rate environment has settled down a little bit, and obviously there's a significant amount of geopolitical and election uncertainty around the world, but that tends to be an environment where clients reposition,\" CFO Alastair Borthwick told journalists on a conference call.\n\"That tends to be a reasonably good environment for our sales and trading business.\"\nThe second biggest U.S. lender earned $6.9 billion, or 83 cents per share, in the quarter ended June 30, 7% lower than a year earlier, but above expectations of 80 cents per share, according to LSEG.\nIts wealth and investment management unit also fetched 6% higher revenue and saw 10% growth in client balances to a record of more than $4 trillion.\nSTRONG FORECAST\nThe cost of preventing a deposit outflow has eroded banks' gains from the rising interest they are charging borrowers.\nBanks are shelling out more on deposits as interest rates are at their highest since 2007, which have boosted returns on bonds, making alternatives such as money market funds more attractive.\nBofA's NII fell 3% to $13.7 billion in the second quarter. Provisions for credit losses rose to $1.5 billion from $1.1 billion a year earlier.\nBut executives predicted a recovery in the second half. They forecast net interest income would rise to $14.5 billion in the fourth quarter, above LSEG estimates of $14.4 billion, as the bank reprices mortgage and auto loans.\nThe forecast for increased NII solidifies earlier comments signaling that interest income would reach a trough in the fourth quarter, said Stephen Biggar, banking analyst at Argus Research.\nBofA shares have climbed almost 30% this year, outperforming rivals JPMorgan and Wells Fargo.\n(Reporting by Niket Nishant in Bengaluru and Saeed Azhar in New York; additional reporting by Michelle Price in Washington; editing by Lananh Nguyen, Shinjini Ganguli and Nick Zieminski)", "Link": "Https://Finance.Yahoo.Com/News/Bofas-Profit-Falls-Shrinking-Interest-104753478.Html", "Sentiment_Score": 0.9030157328, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-16T10:45:00.000Z", "Headline": "Bank of America Reports Second Quarter 2024 Financial Results", "Summary": "CHARLOTTE, N.C., July 16, 2024 /PRNewswire/ -- Bank of America reported its second quarter 2024 financial results today. The news release, supplemental filing and investor presentation can be accessed at Bank of America's Investor Relations website at https://investor.bankofamerica.com/quarterly-earnings.\n-\nInvestor Conference Call information:\nChief Executive Officer Brian Moynihan and Chief Financial Officer Alastair Borthwick will discuss the financial results in an investor conference call at 8:30 a.m. ET today. For a listen-only connection to the conference call, dial 1.877.200.4456 (U.S.) or 1.785.424.1732 (international), and the conference ID is 79795.  Please dial in 10 minutes prior to the start of the call.\nInvestors can also listen to live audio of the conference call and view the presentation slides by visiting the Events and Presentations section of the company's Investor Relations website.\nReplay information for Investor Conference Call:\nInvestors can access replays of the investor conference call by visiting the Investor Relations website or by calling 1.800.934.4850 (U.S.) or 1.402.220.1178 (international) from noon on July 16 through 11:59 p.m. ET on July 26.\nBank of America\nBank of America is one of the world's leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 69 million consumer and small business clients with approximately 3,800 retail financial centers, approximately 15,000 ATMs (automated teller machines) and award-winning digital banking with approximately 58 million verified digital users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 4 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and more than 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange.\nFor more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for news email alerts.\nInvestors May Contact:\nLee McEntire, Bank of America\nPhone:  1.980.388.6780\nlee.mcentire@bofa.com\nJonathan Blum, Bank of America (Fixed Income)\nPhone:  1.212.449.3112\njonathan.blum@bofa.com\nReporters May Contact:\nBill Halldin, Bank of America\nPhone: 1.916.724.0093\nwilliam.halldin@bofa.com\nJocelyn Seidenfeld, Bank of America\nPhone: 1.646.743.3356\njocelyn.seidenfeld@bofa.com\n SOURCE Bank of America Corporation", "Link": "Https://Finance.Yahoo.Com/News/Bank-America-Reports-Second-Quarter-104500263.Html", "Sentiment_Score": -0.1111313477, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-16T14:40:08.000Z", "Headline": "Forget Nvidia: Billionaires Are Dumping It and Piling Into These 3 Surprising Value Stocks Instead", "Summary": "For three decades, investors have been patiently waiting for the next great innovation to come along that would rival what the internet did for corporate America. The arrival of artificial intelligence (AI) might be just what the doctor ordered.\nArtificial intelligence allows software and systems to oversee tasks that humans would normally undertake. The key to AI's seemingly limitless potential is that software and systems have the capacity to learn without human intervention. This gives the technology utility in pretty much every facet of the U.S. and global economy.\nThough growth estimates are all over the map, the most eye-popping forecast comes from the analysts at PwC, who believe AI can add an estimated $15.7 trillion to the global economy by the turn of the decade. With dollar figures this immense, it's not a surprise that Wall Street's smartest and richest money managers have been piling into AI stocks.\nImage source: Getty Images.\nBut what might come as a shock is that leading AI company Nvidia (NASDAQ: NVDA), which has gained nearly $3 trillion in market value since the start of 2023, has been a top sell candidate for more than a half-dozen billionaire money managers.\nNvidia has been shown the door by a number of Wall Street's prominent billionaire investors\nThanks to quarterly filed Form 13Fs with the Securities and Exchange Commission, everyday investors have the ability to track what Wall Street's top money managers are buying and selling. The March-ended quarter saw eight billionaires — nine if you include the recently passed Jim Simons of Renaissance Technologies — dump shares of Nvidia stock. However, the three most-prominent billionaire sellers were (total shares sold in parenthesis have been adjusted for Nvidia's 10-for-1 stock split in June):\nPhilippe Laffont of Coatue Management (29,370,600 shares)\nKen Griffin of Citadel Advisors (24,627,160 shares)\nIsrael Englander of Millennium Management (7,200,040 shares)\nWhile profit-taking is a viable reason that could explain why prominent billionaire asset managers sent Nvidia to the chopping block during the first quarter, there are a few other headwinds that may have encouraged this exodus.\nTo begin with, Nvidia will almost certainly face increasing competition in the coming quarters. Advanced Micro Devices is ramping up production of its MI300X graphics processing unit (GPU) for high-compute data centers, and Intel is launching its Gaudi 3 AI-accelerating chip during the current quarter.\nMoreover, Nvidia's four largest customers, which account for approximately 40% of its net sales, are developing in-house AI-GPUs of their own. The problem for Nvidia is that, even if maintains its compute advantages and develops next-generation AI-GPU architecture that outpaces its rivals, the mere presence of other chips reduces data center space for Nvidia's hardware. It also limits the AI-GPU scarcity that's driven its pricing power into the heavens.\nPerhaps the most damning factor of all might just be that no buzzworthy innovation, technology, or trend over the last 30 years has escaped an early stage bubble. History shows that investors always overestimate the uptake and utility of new technologies, which makes it likely that AI will follow suit. If the AI bubble were to burst, Nvidia's stock would likely be hit hard.\nBut while these top billionaire investors were busy sending shares of Nvidia to the chopping block, they were piling into three surprising value stocks.\nImage source: Getty Images.\nPhilippe Laffont: PayPal Holdings (8,014,159 shares purchased)\nNvidia's biggest billionaire seller undeniably had eyes for the leading financial technology (fintech) stock during the first quarter. Coatue Management's 13F notes that the fund picked up more than 8 million shares of PayPal Holdings (NASDAQ: PYPL), which as of March 31 were worth almost $539 million.\nAlthough competition is increasing among digital payment and peer-to-peer payment providers, most of PayPal's important user metrics signal continued growth. Payment transactions grew by 11% in the March quarter to 6.5 billion, while total payment volume has sustained a double-digit growth rate, sans currency movement.\nFurthermore, the company's active accounts are more engaged than ever. Though active account growth has stalled in recent quarters, the average payments completed by active accounts over the trailing-12-month period has increased from 40.9 at the end of 2020 to 60 on the nose, as of the end of March 2024. Since this is primarily a usage-driven platform, higher engagement is a recipe for an increase in gross profit.\nWith Wall Street's consensus calling for nearly 16% annualized earnings growth through 2028, a forward price-to-earnings (P/E) ratio of less than 13 makes PayPal stock quite the deal.\nKen Griffin: Bank of America (22,434,948 shares purchased)\nThe world's most-profitable hedge fund since inception, which is overseen by billionaire Ken Griffin, opted to trade out shares of Nvidia for time-tested financial institution Bank of America (NYSE: BAC).\nAmong America's largest banks by assets, Bank of America is the most sensitive to changes in interest rates. The Federal Reserve's most-aggressive rate-hiking cycle since the early 1980s might not have been well received by borrowers, but it's been a godsend for lenders like BofA. The longer the nation's central bank stands pat on interest rates, the more net-interest income BofA and its peers can collect.\nBank of America also deserves plenty of credit for its technological prowess. While it might not be the first company you think of when it comes fintech innovation, BofA's digitization efforts are paying off. A whopping 76% of consumer households were banking online or via mobile app in the first quarter, and exactly half of all loan sales were completed digitally. Digital transactions are considerably cheaper than in-person interactions and will, over time, improve Bank of America's operating efficiency.\nA forward P/E ratio of a little over 11 suggests that Bank of America stock is still a bargain for investors.\nIsrael Englander: Merck (4,021,500 shares purchased)\nAlthough billionaire Israel Englander is known for his love of fast-paced tech stocks, it's pharmaceutical company Merck (NYSE: MRK) that proved to be the apple of his and his investment team's eye during the March-ended quarter.\nIf there's a primary lure to owning Merck stock, it's Keytruda, the company's world-leading cancer immunotherapy. Improved cancer-screening diagnostics, phenomenal pricing power, increased use in existing indications, and label expansion opportunities have put Keytruda on pace for nearly $28 billion in annual run-rate revenue. With constant-currency sales growth of 24% in the March quarter, there's no reason to believe Keytruda's growth will slow anytime soon.\nAn unsung hero for Merck that doesn't get anywhere near enough attention is its Animal Health segment, which accounts for almost 10% of the company's net sales. Between keeping livestock healthy and the willingness of pet owners to spend a small fortune on the well-being of their furry, feathered, gilled, and scaled family members, Merck's pet division provides a steady growth foundation.\nWith sustained double-digit earnings per share (EPS) growth expected, Merck's forward P/E of 13 continues to look like a value.\nShould you invest $1,000 in Nvidia right now?\nBefore you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $791,929!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Sean Williams has positions in Bank of America, Intel, and PayPal. The Motley Fool has positions in and recommends Advanced Micro Devices, Bank of America, Merck, Nvidia, and PayPal. The Motley Fool recommends Intel and recommends the following options: long January 2025 $45 calls on Intel, short August 2024 $35 calls on Intel, and short September 2024 $62.50 calls on PayPal. The Motley Fool has a disclosure policy.\nForget Nvidia: Billionaires Are Dumping It and Piling Into These 3 Surprising Value Stocks Instead was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/Forget-Nvidia-Billionaires-Dumping-Piling-090600464.Html", "Sentiment_Score": -0.1668744981, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-16T07:53:26.000Z", "Headline": "Bank of America Earnings Are Coming. Like the Other Big Banks, High Rates Will Bite.", "Summary": "Bank of America will be the last of the largest financial institutions to release earnings when it reports on Tuesday, but it will be wrestling with the same issue as the rest. In another sign of high rates eating into big banks’ performance, analysts expect Bank of America's profit and net interest income—the measure investors are watching most closely—to decline from a year ago when the bank reports second-quarter earnings.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/E9Ad2110-Bab5-337A-A6Cc-21F2C5A62Fcf/Bank-Of-America-Earnings-Are.Html", "Sentiment_Score": -0.4183838367, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-15T21:28:06.000Z", "Headline": "Bank earnings, retail sales, Prime Day begins: What to watch", "Summary": "A number of banks will release their latest quarterly reports including: Bank of America (BAC), Morgan Stanley (MS), Charles Schwab (SCHW), PNC Financial Services (PNC), and State Street (STT), as well as UnitedHealth Group (UNH).\nEconomic data in the form of Jun retail sales will be released with current estimates showing a decline of 0.3% month-over-month.\nFederal Reserve Governor Adriana Kugler will speak at the Economic Measurement Seminar at National Association for Business Economics (NABE), in Washington, D.C.\nAmazon's (AMZN) annual sale event, Prime Day, begins and will continue through July 17.\nFor more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime.\nThis post was written by Nicholas Jacobino", "Link": "Https://Finance.Yahoo.Com/Video/Bank-Earnings-Retail-Sales-Prime-212806237.Html", "Sentiment_Score": -0.0213395096, "Sentiment_Category": "neutral"}, {"Ticker": "BAC", "Time": "2024-07-15T21:03:59.000Z", "Headline": "Goldman Sachs earnings prove bank still very cyclical", "Summary": "Among the Big Bank stocks, JPMorgan Chase & Co. (JPM), Wells Fargo (WFC), Citigroup (C), Goldman Sachs (GS), and BlackRock (BLK) have been the first to report second-quarter results this earnings season.\nPortales Partners founder and Wall Street Beats partner Charlie Peabody comes on Market Domination to talk about the prevalent themes emerging in bank earnings, such as net interest income figures\n\"Short term, there's momentum in the capital markets. And so Goldman is a good momentum play, but we argue that their earnings stream remains much more cyclical than the market is valuing them at,\" Peabody states. \"And that's the big debate out there in management as they moved away from their failed consumer banking strategy back to their roots as an investment bank, have been trying to convince the street that there is a core underlying earnings power that's sustainable and stable. And I don't believe them.\"\nPeabody also looks ahead to the bank earnings due out this week, such as Morgan Stanley (MS): \"I think it's going to be more of the same — strong, investment banking with an eye towards a pick up in M&A and IPOs in the second half of the year. And then trading will be driven more by equity trading and less so by fixed income trading.\"\nFor more expert insight and the latest market action, click here to watch this full episode of Market Domination.\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Goldman-Sachs-Earnings-Prove-Bank-210359849.Html", "Sentiment_Score": -0.9227243662, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-14T13:00:36.000Z", "Headline": "Netflix results, retail sales, and a chip update: What to watch this week", "Summary": "The biggest economic event of July has come and gone.\nFor the balance of the month, investors will focus most of their attention on the corporate earnings calendar.\nNetflix (NFLX) will be the first Big Tech company to report quarterly earnings during the current reporting period, with the streaming giant set to release results after the close on Thursday.\nAnd with the AI trade continuing to dominate on Wall Street, investors will pay close attention to results from ASML (ASML) and Taiwan Semiconductor Manufacturing Company (TSM), set for release Wednesday and Thursday, respectively.\nASML is the leading manufacturer of lithography machines, which enable companies to actually imprint their designs onto new chips. TSMC is the world's biggest chip manufacturer.\nElsewhere on the earnings calendar, reports from Goldman Sachs (GS), Morgan Stanley (MS), and Bank of America (BAC) will wrap up results from Wall Street's biggest banks, while Dow members Johnson & Johnson (JNJ), American Express (AXP), UnitedHealth (UNH), and Travelers (TRV) are all expected to report.\nPolitics will also be a top concern for investors after Donald Trump survived an assassination attempt at a rally in Pennsylvania on Saturday. Business leaders were quick to react to the day's events, condemning political violence and praising the former president's \"courage under literal fire [Saturday night].\"\nThe Republican National Convention is set to be held this week in Milwaukee, which will see Trump formally named the Republican nominee for president.\nThe economic data calendar will be sparse, with Tuesday's retail sales report for June serving as the highlight. After May's results showed a surprise slowdown in spending, investors and Fed watchers will monitor the results for signs of further weakness in the US consumer.\nThe team at Oxford Economics expects retail sales to fall 0.4% in June, though this headline drop will be driven by a decline in gas prices. \"We expect a solid 0.3% rise in underlying control group sales, which, with prices declining in June, will translate into a strong rise in real consumption to round out Q2,\" the firm wrote in a note on Friday.\n\"The consumer is still in solid shape, underpinned by a labor market that is cooling, not collapsing, and the strong state of household balance sheets.\"\nThursday's inflation data turned markets upside down, with everything that had been working (read: \"Magnificent Seven\" names) coming under pressure and what had been left behind, most notably small caps, surging. Still, Friday's rally sent stocks into the weekend with another weekly gain across the board.\nJuly ➡️ September\nJune inflation data published last week appeared to almost cement the prospects of the Federal Reserve cutting interest rates beginning in September.\nA multiyear low in annual inflation and the first monthly drop in headline inflation since 2020 pushed the odds north of 85% that rate cuts will start in the fall, data from the CME Group showed.\nIn June, headline inflation fell 0.1% from the prior month and rose 3% against the prior year. On a \"core\" basis, which strips out food and energy costs, consumer prices were up 0.2% from last month and 3.3% from last year.\nThe Fed targets 2% inflation.\nJune's jobs report published earlier this month raised the temperature on the Fed to act in September. The unemployment rate move up to 4.1% signaled the pace of cooling in the labor market appears to be accelerating and puts the labor market back in focus for the central bank after nearly two years of inflation being its primary concern.\nFed Chair Jerome Powell's appearance on Capitol Hill last week made clear the central bank's move this fall will be perceived as a political decision by critics on both sides of the aisle. But the economic basis for a rate cut has only grown clearer in recent weeks.\n\"On balance, the economic data are the most supportive of a rate cut that they have been all year,\" wrote Wells Fargo economists Sarah House and Michael Pugliese in a client note this week.\nAs Yahoo Finance's Jared Blikre noted this week, the unemployment rate is now on the cusp of triggering the Sahm Rule, which measures the rate of increase in the unemployment rate and has been a leading indicator in each of the last nine US recessions.\nOn July 31, Powell will hold a press conference following the conclusion of the Fed's next two-day policy meeting. This event, along with Powell's speech at the Jackson Hole Economic Symposium in late August, will give the chair plenty of opportunity to prime markets for a move come September.\nUS Federal Reserve Chair Jerome Powell testifies before the Senate Banking, Housing, and Urban Affairs Hearings to examine the Semiannual Monetary Policy Report to Congress at Capitol Hill in Washington, DC, on July 9, 2024. (Photo by CHRIS KLEPONIS/AFP via Getty Images) (CHRIS KLEPONIS via Getty Images)\nWeekly calendar\nMonday\nEconomic data: New York Fed Empire State Manufacturing index, July (-6 expected, -6 previously)\nEarnings: Goldman Sachs (GS), BlackRock (BLK)\nTuesday\nEconomic data: Retail sales, June (-0.2% expected, +0.1% previously); Import price index, June (-0.1% expected, -0.4% previously); Export price index, June (-0.1% expected, -0.6% previously); NAHB homebuilder sentiment, July (43 expected, 43 previously)\nEarnings: Bank of America (BAC), Morgan Stanley (MS), UnitedHealth (UNH), Charles Schwab (SCHW), Interactive Brokers (IBKR), Progressive (PGR), PNC Financial (PNC), State Street (STT)\nWednesday\nEconomic data: Housing starts, June (+1.8% expected, -5.5% previously); Building permits, June (-0.6% expected, -3.8% previously); Industrial production, June (+0.4% expected, +0.9% previously); Federal Reserve Beige Book\nEarnings: Johnson & Johnson (JNJ), United Airlines (UAL), ASML (ASML), Discover (DFS), US Bancorp (USB), Citizens Financial (CFG), Ally Financial (ALLY), Synchrony (SYF), Alcoa (AA), Kinder Morgan (KMI), Steel Dynamics (STLD)\nThursday\nEconomic data: Initial jobless claims, July 13 (228,000 expected, 222,000 previously); Continuing jobless claims (1.852 million previously)\nEarnings: TSMC (TSM), Netflix (NFLX), Domino's (DPZ), Blackstone (BX), Alaska Air (ALK), Abbott Labs (ABT), Novartis (NVS), Textron (TXT), Cintas (CTAS), Intuitive Surgical (ISRG), PPG (PPG)\nFriday\nEconomic data: No major economic data set for release.\nEarnings: American Express (AXP), Travelers (TRV), Halliburton (HAL), SLB (SLB), Fifth Third (FITB), Regions Financial (RF)\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance", "Link": "Https://Finance.Yahoo.Com/News/Netflix-Results-Retail-Sales-And-A-Chip-Update-What-To-Watch-This-Week-130036789.Html", "Sentiment_Score": 0.0002914909, "Sentiment_Category": "neutral"}, {"Ticker": "BAC", "Time": "2024-07-14T12:01:31.000Z", "Headline": "Possible Bearish Signals With Bank of America Insiders Disposing Stock", "Summary": "The fact that multiple Bank of America Corporation (NYSE:BAC) insiders offloaded a considerable amount of shares over the past year could have raised some eyebrows amongst investors. When evaluating insider transactions, knowing whether insiders are buying is usually more beneficial than knowing whether they are selling, as the latter can be open to many interpretations. However, when multiple insiders sell stock over a specific duration, shareholders should take notice as that could possibly be a red flag.\nWhile insider transactions are not the most important thing when it comes to long-term investing, we would consider it foolish to ignore insider transactions altogether.\nSee our latest analysis for Bank of America\nBank of America Insider Transactions Over The Last Year\nOver the last year, we can see that the biggest insider sale was by the President of Regional Banking, Dean Athanasia, for US$2.4m worth of shares, at about US$31.49 per share. That means that an insider was selling shares at slightly below the current price (US$41.59). As a general rule we consider it to be discouraging when insiders are selling below the current price, because it suggests they were happy with a lower valuation. However, while insider selling is sometimes discouraging, it's only a weak signal. We note that the biggest single sale was only 18% of Dean Athanasia's holding.\nOver the last year we saw more insider selling of Bank of America shares, than buying. You can see the insider transactions (by companies and individuals) over the last year depicted in the chart below. By clicking on the graph below, you can see the precise details of each insider transaction!\ninsider-trading-volume\nIf you like to buy stocks that insiders are buying, rather than selling, then you might just love this free list of companies. (Hint: Most of them are flying under the radar).\nInsider Ownership\nLooking at the total insider shareholdings in a company can help to inform your view of whether they are well aligned with common shareholders. We usually like to see fairly high levels of insider ownership. Bank of America insiders own 0.1% of the company, currently worth about US$459m based on the recent share price. I like to see this level of insider ownership, because it increases the chances that management are thinking about the best interests of shareholders.\nSo What Do The Bank of America Insider Transactions Indicate?\nThere haven't been any insider transactions in the last three months -- that doesn't mean much. While we feel good about high insider ownership of Bank of America, we can't say the same about the selling of shares. If you are like me, you may want to think about whether this company will grow or shrink. Luckily, you can check this free report showing analyst forecasts for its future.\nOf course, you might find a fantastic investment by looking elsewhere. So take a peek at this free list of interesting companies.\nFor the purposes of this article, insiders are those individuals who report their transactions to the relevant regulatory body. We currently account for open market transactions and private dispositions of direct interests only, but not derivative transactions or indirect interests.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com", "Link": "Https://Finance.Yahoo.Com/News/Possible-Bearish-Signals-Bank-America-120131204.Html", "Sentiment_Score": -0.5857563019, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-14T10:00:00.000Z", "Headline": "This Bank Stock Beat the S&P 500 in the First Half of 2024. Is It Still a Buy?", "Summary": "One of America's largest financial institutions is on a hot streak on Wall Street. Shares of Bank of America (NYSE: BAC) returned an impressive 18% between January and June, exceeding the S&P 500's 15% return.\nThe megabank is a household name and the second-largest holding in the portfolio of investing legend Warren Buffett. It shows that great stock ideas don't necessarily need to come out of nowhere.\nBut the timing of when you buy a stock can matter a lot, so it's fair to question whether Bank of America still has strong return potential over the latter half of 2024.\nManagement's vote of confidence\nBank of America is the country's second-largest bank, with more than $3.2 trillion in total assets. And given that it's a pillar of the U.S. financial system, it's important that it remain in tip-top financial shape. It recently passed its annual stress test, a mandatory annual evaluation established after the Great Recession to ensure that systemically important U.S. banks remain sufficiently capitalized to withstand a severe economic downturn.\nBased on the test results, Bank of America's minimum Tier 1 Capital Ratio will be boosted from its current mandated 10% to 10.7% starting Oct. 1. Its ratio as of March 31 was 11.9% -- well in excess of both figures. In other words, Bank of America is doing more than the regulatory minimum to cushion itself from potential economic trouble.\nIn late June, management also announced plans for an 8% dividend hike that will take effect in Q3. While it won't deliver its Q2 earnings results until mid-July, such a solid hike announced in advance seems like a vote of confidence from management that things are going well.\nInterest rate cuts could benefit Bank of America\nIn 2022, the Federal Open Market Committee began aggressively raising the federal funds rate -- the interest rate banks charge each other for overnight loans -- to cool surging inflation. High inflation is like the grease fire in your grill on July Fourth. Left unchecked, rampant inflation hurts consumers. Rate hikes are the metaphorical fire extinguisher; ideally, they slow the economy enough that inflation decreases to a healthy low-single-digit percentage rate.\nIt has been almost a year since the last of the Fed's rate hikes, and the economic data are showing their impact. Unemployment is creeping higher, the housing market has slowed, and inflation has dropped dramatically.\nUS Existing Home Sales Chart\nThese trends have fueled speculation that the Fed will begin cutting rates in the fall. Why cut rates? The central bank's goal is to tame the fire, not put it out. Keeping rates high for too long risks dragging the economy into recession. All banks are exposed to broad economic conditions -- recessions take a toll on their businesses and their stock prices.\nRate cuts could reduce Bank of America's net interest income (the loan interest it receives minus the interest it pays on deposits). However, lower rates could boost economic activity enough to offset those lost profits -- for example, by loosening up the housing market and boosting mortgage volumes.\nAdditionally, the Fed's rate hikes pushed the value of bonds lower. As a result, Bank of America is now sitting on unrealized losses of more than $100 billion in its bond portfolio. Although it can avoid taking those losses simply by holding all those bonds to maturity -- and it plans to -- it would be less painful if they regained some of their value due to rate cuts. So overall, rate cuts could prove a net positive for Bank of America.\nIs the stock a buy today?\nNobody can know for sure if or when a recession might occur, nor can anyone reliably predict such an event's severity. That's why investors shouldn't buy or sell Bank of America stock based on speculation. Instead, they should pay attention to management's commentary during earnings and look for signs of confidence, such as when a company announces a dividend hike ahead of its usual schedule.\nAssuming the U.S. economy remains stable, is Bank of America a buy today?\nInvestors can value the company based on its earnings and tangible book value. During the past decade, shares have averaged a price-to-earnings ratio of about 15 and a price-to-tangible-book-value ratio of 1.4, and their valuations are on par with those averages today. Additionally, analysts believe Bank of America's earnings will grow by more than 8% annually for the next three to five years.\nBAC PE Ratio Chart\nBased on management's confident dividend raise, a fairly valued stock, healthy earnings estimates, and the potential for rate cuts in the second half of the year, shares still look like a buy.\nIf the stock sticks near its long-term valuation averages, investors could see total annual returns of 10% to 11% from earnings growth and dividend yield. That wouldn't be as impressive as the shares' performance during the past six months, but the stock could still be a strong contributor to your portfolio.\nShould you invest $1,000 in Bank of America right now?\nBefore you buy stock in Bank of America, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Bank of America wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $791,929!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bank of America. The Motley Fool has a disclosure policy.\nThis Bank Stock Beat the S&P 500 in the First Half of 2024. Is It Still a Buy? was originally published by The Motley Fool", "Link": "Https://Finance.Yahoo.Com/News/Bank-Stock-Beat-P-500-100000684.Html", "Sentiment_Score": 0.0785316005, "Sentiment_Category": "bullish"}, {"Ticker": "BAC", "Time": "2024-07-12T21:45:20.000Z", "Headline": "Bank of America (BAC) Stock Sinks As Market Gains: What You Should Know", "Summary": "The latest trading session saw Bank of America (BAC) ending at $41.60, denoting a -0.5% adjustment from its last day's close. This move lagged the S&P 500's daily gain of 0.55%. At the same time, the Dow added 0.62%, and the tech-heavy Nasdaq gained 0.63%.\nShares of the nation's second-largest bank witnessed a gain of 6.5% over the previous month, beating the performance of the Finance sector with its loss of 2.67% and the S&P 500's gain of 4.28%.\nInvestors will be eagerly watching for the performance of Bank of America in its upcoming earnings disclosure. The company's earnings report is set to be unveiled on July 16, 2024. The company's upcoming EPS is projected at $0.79, signifying a 10.23% drop compared to the same quarter of the previous year. At the same time, our most recent consensus estimate is projecting a revenue of $25.19 billion, reflecting a 0.05% fall from the equivalent quarter last year.\nIn terms of the entire fiscal year, the Zacks Consensus Estimates predict earnings of $3.22 per share and a revenue of $101.81 billion, indicating changes of -5.85% and +3.28%, respectively, from the former year.\nInvestors should also take note of any recent adjustments to analyst estimates for Bank of America. These recent revisions tend to reflect the evolving nature of short-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.\nOur research suggests that these changes in estimates have a direct relationship with upcoming stock price performance. To capitalize on this, we've crafted the Zacks Rank, a unique model that incorporates these estimate changes and offers a practical rating system.\nThe Zacks Rank system, stretching from #1 (Strong Buy) to #5 (Strong Sell), has a noteworthy track record of outperforming, validated by third-party audits, with stocks rated #1 producing an average annual return of +25% since the year 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.4% higher. Currently, Bank of America is carrying a Zacks Rank of #3 (Hold).\nValuation is also important, so investors should note that Bank of America has a Forward P/E ratio of 12.97 right now. For comparison, its industry has an average Forward P/E of 11.62, which means Bank of America is trading at a premium to the group.\nOne should further note that BAC currently holds a PEG ratio of 1.59. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The average PEG ratio for the Banks - Major Regional industry stood at 1.59 at the close of the market yesterday.\nThe Banks - Major Regional industry is part of the Finance sector. This industry, currently bearing a Zacks Industry Rank of 103, finds itself in the top 41% echelons of all 250+ industries.\nThe strength of our individual industry groups is measured by the Zacks Industry Rank, which is calculated based on the average Zacks Rank of the individual stocks within these groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nDon't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBank of America Corporation (BAC) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Bank-America-Bac-Stock-Sinks-214520162.Html", "Sentiment_Score": -0.278064549, "Sentiment_Category": "bearish"}, {"Ticker": "BAC", "Time": "2024-07-15T07:21:32.000Z", "Headline": "Stocks to watch this week: Anglo American, Burberry, TSMC and Netflix", "Summary": "Quarterly earnings season is about to quick start again, with key companies across the globe providing insights into how certain sectors are performing.\nInvestors will see updates from the mining world, with our focus staying on Anglo American, while Burberry will provide a gauge on the luxury goods industry after a slowdown in demand from China hit sales.\nIn Asia, semiconductor colossus TSMC is expected to come in above expectations, amid the artificial intelligence craze and ongoing demand for chips.\nAcross the pond, Netflix will try to convince investors it is as popular as ever, with revenue and earnings increases in the cards.\nHere's what to look out for:\nAnglo American (AAL.L) — Reports trading update on Thursday 18 July\nAnglo-American was the target of a takeover bid by rival BHP (BHP.L) and it has announced its own restructuring plans in the aftermath of the failed mining mega-merger. So, investors will be sure to put the company’s first-half figures under the microscope.\nAnglo is aiming to sell or separate its coal, platinum, nickel and diamond mining operations. What’s left will be a streamlined business that contains the company’s prized copper mines (BHP’s main target), its premium iron ore business and the Woodsmith fertiliser project in North Yorkshire.\nAnglo is heavily exposed to copper and the industrial metal’s price is just starting to pull back after a strong run.\nFor the actual earnings report, AJ Bell tells investors to look for any hints on production costs.\n“The details on the balance sheet, cash flow and profit and loss account will come with the actual first-half numbers, although do watch out for any changes in output forecasts and targets, as well as comments on cost of production and capital investment, since all of those will directly influence profits and cash flow,” Russ Mould, investment director, Danni Hewson, head of financial analysis, and Dan Coatsworth, investment analyst, all of AJ Bell, wrote.\nRead more: How FTSE All-Share index listings are changing\n“In the unlikely event that [CEO Duncan] Wanblad discusses annual profits or the dividend ahead of the first-half results in the following week, the current consensus forecast is for earnings before interest, taxes, depreciation and amortisation (EBITDA) to come in broadly flat in 2024, at $9.7bn, while a cut in the dividend to $0.83 per share from $0.96 is expected.”\nThe share price is still around 20% higher than it was before BHP’s interest became public on 25 April.\nBurberry (BRBY.L) — Reports trading update on Friday 19 July\nA model presents a creation during a catwalk presentation for British fashion house Burberry's Spring/Summer 2024 collection, at London Fashion Week in London. (HENRY NICHOLLS via Getty Images)\nTrenchcoat-maker Burberry is not expected to impress investors next week, with retail same-store sales estimated to come in 16% lower in its fiscal first quarter, a slump made even starker by 18% growth in the same period last year.\nUBS expects the focus to be on Chinese sales “as well as any signs of stabilisation/improvement among other consumer groups (i.e. Americans and Europeans)”.\nJP Morgan has warned that the ‘re-acceleration’ of the luxury sector could be slower than anticipated, leading to downside risk for luxury stocks.\n“The troubled times continue for Burberry, which has engaged in a round of sweeping job cuts in order to reduce costs. Sales fell 4% for the year to the end of March, and it looks like demand in the key market of China will continue to weaken,” IG said.\nShares in Burberry are down by more than half over the past year, to take them back to levels last seen in 2010.\nCompared to its five-year average PE of 17 times earnings, Burberry now looks cheap at 11 times earnings. IG analysts warned that while the dividend yield is a solid 7%, investors should be aware that the payout may be cut should the group’s sales outlook continue to worsen.\nFor the year to March 2025, analysts currently expect sales to drop 6% to £2.8bn.\nTSMC (TSM) — Reports quarterly update on Thursday 18 July\nThe AI craze has pushed Nvidia as other Magnificent 7 stocks to new heights but there is no AI without chips. And they are (almost) all being manufactured in Taiwan by TSMC.\nTaiwan Semiconductor’s key tech giant clients such as Nvidia and Apple have almost nowhere else to turn for next-gen chip manufacturing.\nTSMC’s anticipated order for next-generation two-nanometer technology will be a key catalyst in the second half, according to Citi analysts, who see AI and sovereign investment adding upside to the company’s 2030 revenue target of €44bn to €60bn, Bloomberg reported.\nThe Taiwan-based silicon giant disclosed in its latest monthly revenue report that net income for June was NT$207.87bn billion ($6.4bn), an increase of 32.9% compared with a year ago.\nRead more: How to invest in AI as the rally continues\nFigures for May and April were NT$229.62bn ($7.04bn/) and NT$236.02bnn (£5.41bn/$7.24bn), both up on the same period last year. TSMC is projected to grow sales by roughly 21% in FY24 and FY25.\n“Taiwan Semiconductor is one of the most straightforward buy-and-hold options in all of technology alongside the likes of Nvidia and others because chips are the lifeblood of the economy and TSM is the semiconductor manufacturer,” according to Zachs Research.\n“Any near-term pullback down to some of Taiwan Semiconductor stock’s key shorter-dated or longer-dated moving averages could mark a screaming buy signal for long-term investors,” Zachs’ analysts added.\nNetflix (NFLX) — Reports second-quarter results on Thursday 18 July\nSynonymous with streaming services, Netflix will show investors how it is fighting to stay on top and prove it can keep attracting new subscribers amid fierce competition.\nNetflix expects its revenue to increase 16% year-over-year (YoY) to $9.49bn (£7.3bn) in the second quarter of 2024 but analysts predict Netflix's Q2 revenue will be slightly higher at $9.53bn. In the first quarter of 2024, Netflix's revenue was $9.37bn, up 15% from the prior year.\nMorningstar equity analyst Matthew Dolphin provides a guide to what investors should focus on. “We're most interested in details on Netflix's ad-supported service, especially regarding how the firm is coming along in monetising it, as well as an update on the size of the ad-supported user base,\" he said.\n“Generally, we'll be looking to see if subscriber growth is slowing substantially after Netflix passed the tailwind from its password-sharing crackdown, and whether it will stop regularly disclosing this metric in 2025.\n“We will also be interested in international sales and subscriber growth. This will be a key driver for the company when/if domestic growth slows,” he wrote.\nAs AJ Bell writes, Netflix no longer gives specific guidance for quarterly net subscriber additions, although co-chief executive officers Greg Peters and Ted Sarandos did suggest at the first-quarter stage that net adds would come in below the first quarter’s bumper 9.3 million (the best first quarter since the pandemic and lockdowns in Q1 2020). That took the total subscriber base to a fraction under 270 million, up from 233 million in Q1 2023 and 167 million before the pandemic swept the globe.\nMatt Britzman, equity analyst at Hargreaves Lansdown, is also keen to look at subscribers: “One thing to watch for is the number of new paid subscribers in the second quarter. Management has already warned it’ll be lower quarter-on-quarter due to the normal seasonal demand patterns. These have been a little skewed in recent years, but looking at 2018/19 numbers, net new subscribers were down 34% and 70% respectively across the first and second quarters – so don’t be surprised to see something in that range.\n“Best in class content is one of the reasons Netflix has been able to consistently deliver sector leading churn rates. It’s expensive, but Netflix remains the only company set to increase content spend, giving a comparative advantage versus legacy media and its challengers.”\nOther companies reporting next week include:\nMonday 15 July\nRobert Walters (RWA.L)\nOrkla (ORK.OL)\nGoldman Sachs (GS)\nBlackRock (BLK)\nTuesday 16 July\nOcado (OCDO.L)\nIntermediate Capital (ICG.L)\nB&M European Value Retail (BME.L)\nBloomsbury Publishing (BMY.L)\nMcBride (MCB.L)\nRichemont (CFR.SW)\nNCC (NCC.L)\nUnitedHealth (UNH)\nBank of America (BAC)\nMorgan Stanley (MS)\nOmnicom (OMC)\nWednesday 17 July\nRenold (RNO.L)\nHVIVO (HVO.L)\nBHP (BHP.L)\nASML (ASML)\nAssa Abloy (ASSA-B.ST)\nSvenska Handelsbanken (SHB-B.ST)\nJohnson & Johnson (JNJ)\nCSX (CSX)\nUS Bancorp (USBC.VI)\nLas Vegas Sands (LVS)\nCitizens Financial (CZFS)\nUnited Airlines (UAL)\nAlcoa (AA)\nBank OZK (OZK)\nThursday 18 July\nSSE (SSE.L)\nDiploma (DPLM.L)\nDunelm (DNLM.L)\nKier (KIE.L)\nQinetiQ (QQ.L)\nABB (ABBNY)\nAtlas Copco (ATCO-A.ST)\nVolvo (VOLV-A.ST)\nEQT (EQT)\nPublicis (PUB.PA)\nNokia (NOK)\nVolvo Car (VOLCAR-B.ST)\nSKF (SKF-B.ST)\nAbbott Labs (ABL.MU)\nBlackstone (BX)\nDR Horton (DHI)\nTractor Supply (TSCO)\nDomino’s Pizza (DPZ)\nInterpublic (IPG)\nAmerican Airlines (AAL)\nAlaska Airlines (ALK)\nFriday 19 July\nBridgepoint (BPT.L)\nSchindler (SHLRF)\nKone (KNEBV.HE)\nSandvik (SAND.ST)\nSaab (SAABBS.XC)\nElectrolux (ELUXY)\nAmerican Express (AXP)\nSchlumberger (SLB)\nHalliburton (HAL)\nYou can read Yahoo Finance's full calendar here.\nDownload the Yahoo Finance app, available for Apple and Android.", "Link": "Https://Finance.Yahoo.Com/News/Anglo-American-Burberry-Tsmc-Netflix-Stocks-Watch-152336310.Html", "Sentiment_Score": 0.0132057853, "Sentiment_Category": "neutral"}, {"Ticker": "BAC", "Time": "2024-07-12T14:00:00.000Z", "Headline": "3 Long-Term Stocks to Buy Before Interest Rates Drop", "Summary": "Investors seeking long-term stocks to buy and hold may certainly have trouble finding companies with attractive valuations in sectors with enough growth to consider. Various AI stocks are overpriced, and some of the more beaten-down areas of the market are ones many investors are avoiding for a reason. Thus, there’s a real paradox right now among high-performing and under-performing stocks.\nThat said, many of the companies in under-performing areas of the market are those with higher interest rate risk. Rising rates have affected companies to varying degrees. The three listed below are long-term stocks I think can be key beneficiaries of interest rate cuts in the near-future.\nFor those betting on a Fed that’s poised to cut, and may be more aggressive than the market thinks, here are three equities to consider right now.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nBank of America (BAC)\nA photo of the Bank of America (BAC) logo in neon red and blue on a tan wall.\nSource: Tero Vesalainen / Shutterstock.com\nBank of America (NYSE:BAC) has surprised many investors in this era of higher interest rates. The company’s net interest margins have been negatively affected by an inverted yield curve for some time. This fact, along with slowing capital markets activity, certainly should have negatively impacted the company in a big way.\nThe thing is, Bank of America’s size and dominance in the U.S. financial system is notable. When other smaller peers went down due to loan maturity and asset mismatches, Bank of America has been among the banks ready to scoop up assets at discounted prices.\nNow, these rapid rate hikes have led to increased unrealized loan losses for Bank of America. These losses, primarily held in its held-to-maturity portfolio, are expected to recover fully by maturity. Initially concerning, the market has clearly responded positively to the bank’s outlook following the adjustments.\nI think as interest rates come down, and pressures subside for banks in general, BAC stock could be among the outperformers in this space that’s worth pursuing. For those with an investing time horizon of a decade or longer, this could be a stock to pursue right now.\nApple (AAPL)\nApple Stock Should Be Vigilantly Played Moving Forward in 2020\nSource: Shutterstock\nAs one of the top long-term investment choices in the market, Apple (NASDAQ:AAPL) has seen incredible historical stock performance. This growth has led Apple to become the first company to hit a $3.5 trillion valuation, now the most valuable company in the world by market capitalization again.\nThe company’s strong cash reserves of $67 billion provide flexibility in the company’s strategic focus. Of late, Apple has devoted a large amount of resources to its AI-enabled product lineup and generative AI advancements. This has driven positive momentum for its stock price, as investors reconsider the company’s growth trajectory moving forward.\nNotably, Apple’s robust financials include a 26.31% profit margin and 30.74% operating margin, showcasing effective management. AAPL stock has consistently exceeded analyst price target predictions, driven by strong revenue growth and the strategic launch of AI products exclusively with the iPhone 15 Pro. I think this will be a key product that enhances the company’s appeal as one of the top AI, long-term stocks on the market.\nD.R. Horton (DHI)\nIn this photo illustration the D.R. Horton (DRI) logo seen displayed on a smartphone.\nSource: Casimiro PT / Shutterstock.com\nAmerica’s largest home builder by volume, D.R. Horton (NYSE:DHI) has shown robust revenue growth and possibility over the past decade. Based in Texas, its wide presence across the country will meet regional housing demands.  Despite challenges like rising material costs and labor shortages, D.R. Horton has maintained relative resilience.\nOver 45 years, the company successfully constructed and closed over 1 million homes across 33 states. It focused on quality homes for middle-income buyers, including single-family and multi-family rental properties, aligning with the growing investment real estate market. Additionally, it provided mortgage financing, title services and insurance agency services to homebuyers.\nIn FY24 Q2, revenue grew 14% to $9.11 billion, with net earnings up 24% to $1.1 billion ($3.52 per share). Home closings rose 15% to 22,548, and net sales orders increased 14% year-over-year. Strong housing demand in 2024 underscores DHI as a top pick in the home building sector. If interest rates drop, this demand could feasibly increase significantly, further bolstering the company’s outlook moving forward.\nOn the date of publication, Chris MacDonald did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\nOn the date of publication, the responsible editor did not have (either directly or\nindirectly) any positions in the securities mentioned in this article.\nChris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective.\nMore From InvestorPlace\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\nThe post 3 Long-Term Stocks to Buy Before Interest Rates Drop appeared first on InvestorPlace.", "Link": "Https://Finance.Yahoo.Com/News/3-Long-Term-Stocks-Buy-140000228.Html", "Sentiment_Score": -0.000697799, "Sentiment_Category": "neutral"}]}