{"timestamp": "20240719_141439", "data": [{"Ticker": "MS", "Time": "2024-07-18T16:17:47.000Z", "Headline": "Goldman Sachs, Morgan Stanley and Bank of America Continued The Strong Trend With Their Second Quarter Financials", "Summary": "Goldman Sachs, Morgan Stanley and Bank of America Continued The Strong Trend With Their Second Quarter Financials\nOn Monday, bank earnings continued with The Goldman Sachs Group Inc (NYSE: GS), also joining the trend of topped profit and revenue estimates on the back of better-than-expected fixed income results and smaller-than-expected loan loss provisions. On Tuesday, Morgan Stanley (NYSE: MS) and Bank of America (NYSE: BAC) boarded the bank earnings train. Morgan Stanley topped profit and revenue estimates with its second quarter financials on the back of stronger-than-expected trading and investment banking performance. Bank of America also topped estimates with second-quarter revenue and profit that were fueled by rising investment banking and asset management fees.\nGoldman Sachs Justified The High Expectations\nOut of the six biggest banks,  Goldman is the most reliant on investment banking and trading to generate revenue and therefore, expectations were high with the rebound in Wall Street activity.  For the quarter ended on June 30th, revenue grew 17% to $12.73 billion on the back of core trading, advisory, as well as asset and wealth management operations, surpassing Wall Street’s $12.46 billion estimate. Prrofit surged 150% YoY to $3.04 billion, or $8.62 per share; but last year’s financials were dragged down by hamstrung by write-downs from commercial real estate and the sale of a consumer business.\nFixed income was one of the highlights with revenue jumping 17% to $3.18 billion, surassping StreetAccount’s estimate by $220 million, along with the bank’s shrinking exposure to consumer loans as provision for credit losses went down 54% to $282 million, which is quite below StreetAccount’s estimate of $435.4 million. On other fronts, Goldman Sachs was mainly in line with estimates. Equities trading rose 7% to $3.17 billion based on strong activity in derivatives.\nAsset and wealth management division reported growth of 27% as revenue amounted to $3.88 billion. Platform solutions division reported revenue grew 2% to $669 million on the back of rising credit card balances and deposits.\nBut the well-known investment banking business disappointed compared to rivals as investment banking fees rose only 21% to $1.73 billion, slightly brlow StreetAccount’s $1.8 billion estimate, with growth behind far behind rivals JPMOrgan Chase and Citigroup who have reported rises exceeding 50%. Goldman Sachs attributed the miss to weaker-than-expected advisory fees of $688 million.\nMorgan Stanley Benefited From Rebounding Wall Street Activity\nFor the quarter ended on June 30th, Morgan Stanley reported revenue grew 12% YoY to $15.02 billion, topping Wall Street’s $14.3 billion estimate.\nWealth management revenue grew 2% to $6.79 billion, which was short of $6.88 billion estimate. Equity trading reported growth of 18% as revenue amounted to $3.02 billion, surpassing the StreetAccount estimate by about $330 million. Fixed income trading revenue grew by 16% to $1.99 billion, topping the Wall Street estimate by $130 million. Fueled by rising fixed income underwriting activity, investment banking revenue surged 51% to $1.62 billion, exceeding the estimate by $220 million.\nThe bottom line surged 41% YoY as profit amounted to $3.08 billion, or $1.82 per share, helped by a rebound in Wall Street activity..\nInterest income plunged 17% YoY to $1.79 billion as the rate environment pushed rich clients to continue shifting cash into higher-yielding assets, resulting in lower deposit levels. Earnings amounted to $1.82 a share, surpassing LSEG’s estimate of $1.65 a share.\nMorgan Stanley investors value the more steady nature of the wealth management business due to its more predictable nature compared to investment banking and trading. However, its usual dynamic got flupped as institutional securities division earn more revenue compared to its wealth management division.\nBank Of America Promised A NII Rebound\nFor the June quarter, Bank of America reported revenue grew less than 1% to $25.54 billion, surpassing LSEG’s estimate of $25.22 billion. Profit slipped 6.9% YoY to $6.9 billion, or 83 cents a share, also topping LSEG’s estimate of 80 cents.\nInvestment banking fees rose 29% to $1.56 billion while asset management fees grew 14% to $3.37 billion, and wealth management division reported a 6.3% revenue growth of $5.57 billion. Net interest income contracted 3% to $13.86 billion.\nBut net interest income fourth quarter guidance of $14.5 billion gave hope of a turnaround this year. Aided by this guidance, shares grew 5.4%.\nDISCLAIMER: This content is for informational purposes only. It is not intended as investing advice.\nThis article is from an unpaid external contributor. It does not represent Benzinga's reporting and has not been edited for content or accuracy.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Goldman Sachs, Morgan Stanley and Bank of America Continued The Strong Trend With Their Second Quarter Financials originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "Link": "Https://Finance.Yahoo.Com/News/Goldman-Sachs-Morgan-Stanley-Bank-161747656.Html", "Sentiment_Score": 0.9248392582, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-17T20:23:00.000Z", "Headline": "Morgan Stanley to Increase Rate It Pays on Cash in Some Clients’ Accounts", "Summary": "The change comes after Wells Fargo said its wealth management unit had increased the interest it pays on client cash.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/Fcc7A0C0-1475-378B-A7D6-0262Eb1E2568/Morgan-Stanley-To-Increase.Html", "Sentiment_Score": 0.796012342, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-17T20:05:00.000Z", "Headline": "Morgan Stanley Wealth Management Pulse Survey Reveals Mixed Sentiment Amid Hot Market and Cool Inflation", "Summary": "Credit: Morgan Stanley\nNEW YORK, July 17, 2024--(BUSINESS WIRE)--Morgan Stanley Wealth Management today announced results from its quarterly individual investor pulse survey:\nAmid record market highs, bullishness remains elevated. 61% of investors are bullish this quarter–in line with last quarter (60%).\nAnd higher prices continue to be a concern. Inflation remains the top concern for investors (54%), followed by the 2024 election (34%), market volatility (22%), and a recession (20%).\nInvestors are skeptical on rate cuts. Less than half (48%) believe the U.S. economy is healthy enough for the Fed to cut rates this quarter, down from 51% last quarter.\nThough the majority believe cuts are on the horizon. 54% believe the Fed will cut rates in the second half of the year.\nAnd many believe the market will continue to rise before Q4. Over half of investors (59%) predict the market will rise by the end of the third quarter.\n\"It’s understandable to see bullishness remaining steady this quarter as the market pushed higher driven by mega-caps,\" said Chris Larkin, Managing Director, Head of Trading and Investing, E*TRADE from Morgan Stanley. \"On the flipside, the narrow market could make some traders jittery especially when compounded by a higher for longer rate stance from the Fed. So, it’s easy to see how investors can have mixed emotions about where we stand when it comes to the market and the economy.\"\nThe survey explored investor views on sector opportunities for the third quarter of 2024:\nIT – Tech continues to take the leading spot for investor interest, as mega-cap tech names dominate, with the chips and AI space holding its ground.\nEnergy – As oil prices trended higher, positive views of energy stocks mounted this quarter.\nHealth care – Amid political and economic uncertainty, investors continue to look at health care—a traditionally defensive sector, although interest dipped from the previous quarter by 2 percentage points as the market moved higher.\nAbout the Survey\nThis wave of the survey was conducted from July 1 to July 16 of 2024 among an online US sample of 891 self-directed investors, investors who fully delegate investment account management to financial professionals, and investors who utilize both. The survey has a margin of error of ±3.20 percent at the 95 percent confidence level. It was fielded and administered by Dynata. The panel is broken into three investable assets: less than $500k, between $500k to $1 million, and over $1 million. The panel is 60% male and 40% female and self-select as having moderate+ investing experience, with an even distribution across geographic regions, and age bands.\nAbout Morgan Stanley Wealth Management\nMorgan Stanley Wealth Management, a global leader, provides access to a wide range of products and services to individuals, businesses and institutions, including brokerage and investment advisory services, financial and wealth planning, cash management and lending products and services, annuities and insurance, retirement and trust services.\nAbout Morgan Stanley\nMorgan Stanley (NYSE: MS) is a leading global financial services firm providing a wide range of investment banking, securities, wealth management and investment management services. With offices in 42 countries, the Firm’s employees serve clients worldwide including corporations, governments, institutions and individuals. For further information about Morgan Stanley, please visit www.morganstanley.com.\nThis has been prepared for informational purposes only and is not a solicitation of any offer to buy or sell any security or other financial instrument, or to participate in any trading strategy. This material does not provide individually tailored investment advice. It has been prepared without regard to the individual financial circumstances and objectives of persons who receive it. Morgan Stanley recommends that investors independently evaluate particular investments and strategies and encourages investors to seek the advice of a Financial Advisor.\nMorgan Stanley Portfolio Solutions are portfolios available in our Select UMA platform under either Firm Discretionary UMA or Managed Advisory Portfolio Solutions. Please see the Select UMA ADV at www.morganstanley.com/ADV\nPast performance is not a guarantee or indicative of future performance. Historical data shown represents past performance and does not guarantee comparable future results.\nThis material contains forward-looking statements and there can be no guarantee that they will come to pass. Diversification and asset allocation do not guarantee a profit or protect against loss in a declining financial market.\nThis material should not be viewed as investment advice or recommendations with respect to asset allocation or any particular investment.\nMorgan Stanley Wealth Management is the trade name of Morgan Stanley Smith Barney LLC, a registered broker-dealer in the United States.\nMorgan Stanley Smith Barney LLC and Dynata are not affiliates.\n© 2024 Morgan Stanley Smith Barney LLC. Member SIPC.\nReferenced Data\nWhen it comes to the current market are you?\n  Q2’ 24\nQ3’ 24\nBullish\n60%\n61%\nBearish\n40%\n39%\nWhich of the following are you most concerned about when it comes to your portfolio? (Top 2)\n  Q3’24\nInflation\n54%\n2024 election\n34%\nMarket volatility\n22%\nA recession\n20%\nEarnings\n14%\nGeopolitical conflict\n12%\nEnergy costs\n12%\nNarrow market driven by mega-caps\n11%\nFed monetary policy\n10%\nNone\n2%\nPlease rate how much you agree or disagree with the following statements. The U.S. economy is healthy enough for the Fed to cut rates this quarter.\n  Q2’ 24\nQ3’ 24\nAgree (Top 2)\n51%\n48%\nStrongly agree\n16%\n16%\nSomewhat agree\n35%\n32%\nNeither agree nor disagree\n22%\n26%\nSomewhat disagree\n19%\n18%\nStrongly disagree\n8%\n8%\nWhen do you expect the Fed to first cut rates?\n  Q3’24\n2H ‘24\n54%\nQ3 ‘24\n13%\nQ4 ‘24\n41%\nNot until 2025\n30%\nI don’t know\n11%\nI don’t think they will cut rates\n5%\nWhere do you predict the market will end this quarter?\n  Q3’24\nRise (Top 4)\n59%\nRise 20%\n1%\nRise 15%\n6%\nRise 10%\n15%\nRise 5%\n37%\n0/stay where it is\n20%\nDrop – 5%\n14%\nDrop – 10%\n5%\nDrop – 15%\n2%\nDrop – 20%\n0%\nWhat industries do you think offer the most potential this quarter? (Top three)\n  Q2’24\nQ3’24\nInformation technology\n52%\n57%\nEnergy\n43%\n47%\nHealth care\n36%\n34%\nReal estate\n30%\n29%\nFinancials\n27%\n28%\nUtilities\n24%\n25%\nIndustrials\n20%\n20%\nCommunication services\n20%\n19%\nConsumer staples\n20%\n19%\nMaterials\n16%\n14%\nConsumer discretionary\n12%\n10%\n View source version on businesswire.com: https://www.businesswire.com/news/home/20240717163807/en/\nContacts\nMedia Relations: Lynn Cocchiola, Lynn.Cocchiola@morganstanley.com", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanley-Wealth-Management-Pulse-200500313.Html", "Sentiment_Score": -0.9204261899, "Sentiment_Category": "bearish"}, {"Ticker": "MS", "Time": "2024-07-17T19:23:58.000Z", "Headline": "Morgan Stanley Sells $8 Billion of Bonds as Demand Soars", "Summary": "(Bloomberg) -- Morgan Stanley became the latest big Wall Street bank to tap the US investment-grade market Wednesday after reporting earnings, as strong investor demand helps lenders borrow at lower yields than would have been possible at the start of the month.\nMost Read from Bloomberg\nCanada’s Immigration Minister Has a Message for Foreign Students: You Can’t All Stay\nUS Floats Tougher Trade Rules to Rein In China Chip Industry\nHigh-Flying Chipmakers See Worst Plunge Since 2020: Markets Wrap\nBrookfield Lines Up a 36-Year-Old Rising Star as Next Billionaire CEO\nBiden Faces Intensified Calls to Step Aside While Ill With Covid\nThe lender sold $8 billion of bonds in four parts, according to a person with knowledge of the matter. The longest portion of the offering, an 11-year security, yields 1.17 percentage point above Treasuries after initial discussions of around 1.4 percentage point, said the person, who asked not to be identified as the details are private.\nProceeds from the offering will be used for general purposes and Morgan Stanley was the sole underwriter of the deal, added the person. A representative for Morgan Stanley declined to comment.\nThe sale came a day after the bank’s trading business posted the biggest increase among its peers in the second quarter. Morgan Stanley, like its rivals Goldman Sachs Group Inc. and JPMorgan Chase & Co., beat expectations, solidifying the markets business as a hot spot across the industry.\nJPMorgan, Wells Fargo & Co. and Goldman have raised a combined $16.5 billion after reporting second-quarter earnings. Wednesday’s deal by Morgan Stanley turbocharged volume from the six biggest banks past the 10-year July average of roughly $17 billion.\nBlue-chip bond yields have fallen to the lowest in five months as Federal Reserve officials step up signals that they are moving closer to cutting interest rates. The average US high-grade yield-to-worst, a measure of borrowing costs, hit 5.21% on Tuesday, the lowest since Feb. 6.\nFalling yields and strong investor demand have created an attractive playing field for the big banks. Goldman’s $5.5 billion, two-tranche deal on Tuesday garnered $23 billion in peak investor demand, wrote Bloomberg’s Brian Smith.\nThat enabled Goldman to tighten pricing 28 basis points on both tranches, offering investors just 2 basis points to 3 basis point in new issue premium, or the extra yield that high-grade borrowers have to offer to sell new investment-grade debt, wrote Smith.\nWells Fargo’s $2 billion perpetual securities offering, the first preferred stock series by one of the so-called Big Six lenders in the US in almost two months, received more than $8 billion in orders, according to Smith. That enabled the bank to tighten pricing an eye-popping 52.5 basis points from the initial price talk.\nRead more in the IG ANALYSIS: Goldman, Wells Achieve Attractive Funding Levels\n(Updates with pricing details in headline, second paragraph)\nMost Read from Bloomberg Businessweek\nTop Takeaways From Businessweek’s Donald Trump Interview\nWhy the Nobel-Laureate Pioneer of Microfinance Risks Life in Jail\nHow Trader Joe’s Mini Cooler Bags Became a Viral Hit\nInterviewing Trump on His Plans for the US Economy\nWhat Americans Invest In Now\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanley-Selling-Bonds-Investors-135056826.Html", "Sentiment_Score": 0.3452345133, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-17T13:40:00.000Z", "Headline": "Company News for Jul 17, 2024", "Summary": "Shares of Bank of America Corporation (BAC) jumped 5.4% after the company reported second-quarter 2024 earnings of $0.83 per share, beating the Zacks Consensus Estimate of $0.79 per share.\nMorgan Stanley’s (MS) shares gained 0.9% after the company reported second-quarter quarterly earnings of $1.82 per share, surpassing the Zacks Consensus Estimate of $1.65 per share.\nShares of The PNC Financial Services Group, Inc. (PNC) increased 4.7% after the company reported second-quarter 2024 earnings of $3.30 per share, outpacing the Zacks Consensus Estimate of $3 per share.\nFB Financial Corporation’s (FBK) shares soared 8% after the company reported second-quarter 2024 earnings of $0.84 per share, beating the Zacks Consensus Estimate of $0.76 per share.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBank of America Corporation (BAC) : Free Stock Analysis Report\nMorgan Stanley (MS) : Free Stock Analysis Report\nThe PNC Financial Services Group, Inc (PNC) : Free Stock Analysis Report\nFB Financial Corporation (FBK) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Company-News-Jul-17-2024-134000280.Html", "Sentiment_Score": -0.0410035178, "Sentiment_Category": "neutral"}, {"Ticker": "MS", "Time": "2024-07-17T13:10:03.000Z", "Headline": "Improve Your Retirement Income with These 3 Top-Ranked Dividend Stocks", "Summary": "Here's a revealing data point: older Americans are scared more of outliving wealth than of death itself.\nAnd unfortunately, even retirees who have built a nest egg have good reason to be concerned - with the traditional approaches to retirement planning, income may no longer cover expenses. That means retirees are dipping into principal to make ends meet, setting up a race against time between dwindling investment balances and longer lifespans.\nYour parents' retirement investing plan won't cut it today.\nYears ago, investors at or close to retirement could put money into fixed-income assets and depend on appealing yields to generate consistent, solid pay streams to fund a comfortable retirement. 10-year Treasury bond rates in the late 1990s floated around 6.50%, but unfortunately, those days of being able to exclusively rely on Treasury yields to fund retirement income are over.\nThat means if you had $1 million in 10-year Treasuries, the difference in yield between 1999 and today is more than $1 million.\nAnd lower bond yields aren't the only potential problem seniors are facing. Today's retirees aren't feeling as secure as they once did about Social Security, either. Benefit checks will still be coming for the foreseeable future, but based on current estimates, Social Security funds will run out of money in 2035.\nUnfortunately, it looks like the two traditional sources of retirement income - bonds and Social Security - may not be able to adequately meet the needs of present and future retirees. But what if there was another option that could provide a steady, reliable source of income in retirement?\nInvest in Dividend Stocks\nWe feel that these dividend-paying equities - as long as they are from high-quality, low-risk issuers - can give retirement investors a smart option to replace low-yielding Treasury bonds (or other bonds).\nLook for stocks that have paid steady, increasing dividends for years (or decades), and have not cut their dividends even during recessions.\nOne approach to recognizing appropriate stocks is to look for companies with an average dividend yield of 3% and positive average annual dividend growth. Numerous stocks hike dividends over time, counterbalancing inflation risks.\nHere are three dividend-paying stocks retirees should consider for their nest egg portfolio.\nMorgan Stanley (MS) is currently shelling out a dividend of $0.93 per share, with a dividend yield of 3.2%. This compares to the Financial - Investment Bank industry's yield of 0.19% and the S&P 500's yield of 1.53%. The company's annualized dividend growth in the past year was 9.68%. Check Morgan Stanley dividend history here>>>\nTanger (SKT) is paying out a dividend of $0.28 per share at the moment, with a dividend yield of 3.93% compared to the REIT and Equity Trust - Retail industry's yield of 4.17% and the S&P 500's yield. The annualized dividend growth of the company was 12.24% over the past year. Check Tanger dividend history here>>>\nCurrently paying a dividend of $1.9 per share, Virtus Investment Partners (VRTS) has a dividend yield of 3.12%. This is compared to the Financial - Investment Management industry's yield of 2.42% and the S&P 500's current yield. Annualized dividend growth for the company in the past year was 15.15%. Check Virtus Investment Partners dividend history here>>>\nBut aren't stocks generally more risky than bonds?\nIt is true that stocks, as an asset class, carry more risk than bonds, but high-quality dividend stocks not only have the ability to produce income growth over time but more importantly, can also reduce your overall portfolio volatility relative to the broader stock market.\nAn upside to adding dividend stocks to your retirement portfolio: they can help lessen the effects of inflation, since many dividend-paying companies (especially blue chip stocks) generally increase their dividends over time.\nThinking about dividend-focused mutual funds or ETFs? Watch out for fees.\nIf you prefer investing in funds or ETFs compared to individual stocks, you can still pursue a dividend income strategy. However, it's important to know the fees charged by each fund or ETF, which can ultimately reduce your dividend income, working against your strategy. Do your homework and make sure you know the fees charged by any fund before you invest.\nBottom Line\nPursuing a dividend investing strategy can help protect your retirement portfolio. Whether you choose to invest in stocks or through low-fee mutual funds or ETFs, this approach can potentially help you achieve a more secure and enjoyable retirement.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMorgan Stanley (MS) : Free Stock Analysis Report\nTanger Inc. (SKT) : Free Stock Analysis Report\nVirtus Investment Partners, Inc. (VRTS) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Improve-Retirement-Income-3-Top-131003183.Html", "Sentiment_Score": 0.692292273, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-17T06:51:28.000Z", "Headline": "Q2 2024 Morgan Stanley Earnings Call", "Summary": "Participants\nTed Pick; Chief Executive Officer; Morgan Stanley\nSharon Yeshaya; Chief Financial Officer, Executive Vice President; Morgan Stanley\nGlenn Schorr; Analyst; Evercore ISI\nEbrahim Poonawala; Analyst; Bank of America Merrill Lynch\nMike Mayo; Analyst; Wells Fargo\nDan Fannon; Analyst; Jefferies\nBrennan Hawken; Analyst; UBS\nDevin Ryan; Analyst; JMP Securities LLC\nSteven Chubak; Analyst; Wolfe Research, LLC\nGerard Cassidy; Analyst; RBC Capital Markets\nSaul Martinez; Analyst; HSBC\nPresentation\nOperator\nGood morning. Welcome to Morgan Stanley's second-quarter 2024 earnings call. On behalf of Morgan Stanley, I will begin the call with the following information and disclaimers. This call is being recorded. During today's presentation, we will refer to our earnings release and financial supplement, copies of which are available at morganstanley.com.\nToday's presentation may include forward-looking statements that are subject to risks and uncertainties that may cause actual results to differ materially. Morgan Stanley does not undertake to update the forward-looking statements in this discussion. Please refer to our notices regarding forward-looking statements and non-GAAP measures that appear in the earnings release.\nThis presentation may not be duplicated or reproduced without our consent.\nI will now turn the call over to Chief Executive Officer, Ted Pick.\nTed Pick\nGood morning and thank you for joining us. The firm generated $15 billion in revenue, $1.82 in EPS, and a 17.5% return on tangible in the second quarter. Solid earnings and demonstration of operating leverage completes a strong first half of 2024. $30 billion in revenue, $6 billion in earnings, and an 18.6% return on capital.\nIn institutional securities, we're beginning to see the benefits from our continued focus on our world-class investment banking franchise, with revenues up 50% year over year, including a 70% increase year over year in fixed income underwriting.\nIn institutional equities, we are back with a $3 billion quarter. In wealth, we posted margins of 27%. And across wealth and investment management, we've now grown total client assets to $7.2 trillion, on our road to $10 trillion plus. Together, we delivered strong operating leverage.\nFurther, on the back of the annual stress test results, we announced that we will increase the dividend by $0.075 cents for the third year in a row to $0.925 cents, reflecting the growth of our durable earnings over time.\nDuring the quarter, we built $1.5 billion of capital, and at quarter end, our CET1 ratio, is 15.2%, 170 basis points above the forward requirement. Our capital position provides us the flexibility to continue to support dividend growth, support our clients, and buy the stock back opportunistically.\nThe quarter also showed continued balance in both top line and profitability across the major segments. Wealth and institutional securities, produced $6.8 billion and $7 billion in revenue, respectively, with earnings also roughly split between our institutional businesses and wealth and investment management. Our businesses are working closely together to maximize adjacent opportunities across the integrated firm.\nAcross the investment bank, navigating changes in the cycle means being deliberate around risk management and given geopolitical uncertainty where we spend our time, to deliver clients solutions and to capture share.\nIn wealth management, we continue to focus on aggregating assets and delivering strong advice. In investment management, we are investing in secular growth areas, including customization and real assets. Year to date, annualized growth in net new assets and wealth management is over 5%, with another strong quarter of over $25 billion in fee-based flows.\nStrong fee-based flows support daily revenue, which on average continues to be about $100 million each day this year throughout and show the stability and continued growth of the wealth franchise. We are well navigating the continued uncertainty around forward rate path, geopolitics, and now the US political cycle, and expect those to be the themes for the balance of the year.\nWe remain focused on our best-in-class talent and building out best-in-class infrastructure to support ongoing growth across wealth and investment management and institutional securities.\nI wanted to reiterate our strategy, which is clear, to advise individuals and institutions around the world in raising, managing, and allocating capital. World-class execution demands that we deliver strong earnings and returns through the cycle, that we do so while maintaining robust capital levels, and that we deliver on a durable growth narrative across the segments. And that Morgan Stanley executes on this strategy in a first-class way, blue. That's it in a nutshell.\nAnd finally, in reflecting on this weekend's assassination attempt, we share in the hope that in the months to come, we will, as Americans, find ways to unify and preserve our better selves.\nWith that, Sharon will now take us through the quarter in greater detail. Thank you.\nSharon Yeshaya\nThank you, and good morning. In the second quarter, the firm produced revenues of $15 billion. Our EPS was $1.82, and our ROTCE was 17.5%. Results highlight the power and scale of our integrated firm. The resilience of the US economy and a more stable near-term outlook on rates supported conviction amongst clients.\nInstitutional securities drove performance, led by strength in equity and a pickup in investment banking. Wealth management also delivered on our established strategy, reporting record durable asset management fees and strong fee-based flows. Together, improved confidence and higher client engagement, along with our focus on prioritizing investments, yielded operating leverage and profitability.\nThe firm's year-to-date efficiency ratio was 72%, benefiting from scale and reductions in our expense base. Year-to-date expenses benefited from lower litigation expenses, the absence of back-office integration-related costs and severance, as well as our dedicated effort to prioritize our current spend.\nOn prioritization, we remain committed to client and asset growth, technology, and targeted investments to ensure robust infrastructure that supports growth and addresses ongoing regulatory expectations.\nNow to the businesses. Institutional securities revenues of $7 billion increased 23% versus last year, capturing the strength of the integrated investment bank across US and international markets. Higher activity in Asia contributed to results. Strong performance in institutional equity, as well as debt underwriting, demonstrate the breadth of our client franchise. In our markets business, opportunities unfolded on the back of global political events and macroeconomic data.\nInvestment banking revenues were $1.6 billion. The 51% increase from the prior year was broad based. We continue to invest in investment banking across talent and lending, broadening and deepening our global coverage footprint in key sectors, including financials, healthcare, technology, and industrials. These investments are beginning to have an impact as capital markets improve and activity picks up.\nAdvisory revenues were $592 million, reflecting an increase in our completed M&A activity versus the prior year. The pre-announced M&A backlog continues to build and suggests diversification across sectors. Equity underwriting revenues of $352 million improved versus the prior year, driven by increases across most products, but remained below historical averages.\nFrom a geographical perspective, we brought a number of transactions to market in Europe and Asia, demonstrating the importance of having a strong global market footprint. Fixed income underwriting revenues were $675 million, well above five-year historical averages. Results reflect a meaningful increase in non-investment-grade loan and bond issuance, as tighter spreads and strong CLO issuance provided opportunities for refinancing.\nThe investment banking backdrop continues to improve, led by the US. The advisory and underwriting pipelines are healthy across regions and sectors. Inflation data has continued to moderate, which has helped stabilize front-end rates and support boardroom confidence and sponsor re-engagement.\nAs buyers and sellers make progress to close the valuation gap, we expect that we are still in the early innings of an investment banking rebound. Subject to changes in rate pass expectations and geopolitical developments, our integrated investment bank is well-positioned to service our clients.\nTurning to equity. We continue to be a global leader in this business. Equity revenues of over $3 billion, up 18% compared to last year, reflect strong results across business and regions. Higher client engagement, dynamic risk management, and strength in Asia all contributed to performance.\nPrime brokerage revenues were strong and increased from the prior year, as client balances reached new peaks. Regionally, we witnessed higher client activity in Asia and seasonal patterns in Europe. Cash results increased versus last year, reflecting higher volumes across regions.\nDerivative results were up versus last year's second quarter, as client activity was higher, and the business navigated the market environment well. Further, the business benefited from corporate activity on the back of convertible issuances, additional evidence of the integrated firm at work.\nFixed income revenues of $2 billion increased year over year. Macro performance was up versus the prior year. Despite lower realized volatility, clients were engaged around elections and political events in the quarter. Micro results improved year over year, driven by the growth of our more durable revenues as we continue to support our clients with financing solutions. Solid results in commodities were in line with the prior year.\nTurning to ISG lending and provisions. In the quarter, ISG provisions were $54 million, driven by certain individual commercial real estate loans. Net charge-offs were $48 million, primarily related to two commercial real estate loans for which we had previously already taken provisions.\nTurning to wealth management. Wealth management delivered strong results, generating revenues of $6.8 billion, with record asset management fees. Our PBT margin continued to make progress towards our goal, demonstrating our ability to grow and generate operating leverage through the cycle. We are delivering on our differentiated, scaled, multi-channel asset gathering strategy. Wealth management client assets reached $5.7 trillion.\nMoving to our business metrics in the second quarter. Pre-tax profits was $1.8 billion, up year over year, with a reported margin of 26.8%. DCP negatively impacted our margin by approximately 100 basis points. The margin demonstrates the inherent operating leverage of our asset gathering strategy. We are improving the efficiency with which we run our business.\nAsset management revenues of $4 billion were up 16%. That's more than $500 million in fees versus the prior year. That's driven by higher average asset levels and the impact of cumulative positive fee-based flows.\nIn the quarter, fee-based flows of $26 billion were strong, marking the seventh consecutive quarter of over $20 billion, bringing the year-to-date fee-based flows to $52 billion. We are seeing a steady migration of assets from advisor-led brokerage accounts to fee-based accounts, evidence that investments in our client acquisition funnel are paying off.\nFee-based assets now stand at $2 trillion. Net new assets were $36 billion, reflecting headwinds from seasonal tax payments. Year-to-date net new assets are $131 billion, representing 5% annualized growth of beginning period assets.\nNet flows will be lumpy in any given period of time and impacted by both the macroeconomic environment and business-specific factors.\nWe believe both tax-related outflows and increased spending, particularly among high-net-worth clients, impacted flows this quarter. Still, our first-half NNA growth remains solid. Transactional revenues were $782 million. Excluding the impacts of DCP, revenues were up 5% versus last year. The increase was primarily driven by higher equity-related transactions.\nBank lending balances grew by $4 billion to $151 billion, evidence that as the macroeconomic backdrop stabilizes, our lending capabilities can be met and can meet our diversified client needs. Total deposits of $343 billion remain stable, with sweep deposits down approximately $10 billion sequentially, mostly offset by growth in CDs.\nNet interest income was down modestly to $1.8 billion, reflecting the decline in [sweep], which was largely attributed to the seasonality of tax payments. The wealth management business continues to perform well, aggregating assets, generating fees, and benefiting from scale in our differentiated offering, consistently earning approximately $100 million a day.\nIn the third quarter, we intend to make changes to our advisory sweep rates the backdrop of changing competitive dynamics. The impact of these intended changes will be largely offset with the expected gains from the repricing of our investment portfolio. Therefore, third-quarter NII will be primarily driven by the path of sweeps, and NII could decline modestly in the third quarter.\nImportantly, inclusive of these pricing changes, the rate path, and our expectations around client behavior, we believe that NII should inflect higher as you look out into next year. Our wealth management strategy is predicated on gathering assets, meeting our clients' lending needs, and offering advice. Asset management fees, the core of our wealth management strategy, continues to produce strong results, reaching a record this quarter.\nTaken together, we delivered a strong margin, and we continue to work towards 30% margins over time. This quarter, we reached approximately [19 million] in relationships across our three channels, and we continue to invest in order to deepen engagement.\nAI tools are helping advisors grow, and wealth management's partnership with institutional securities is increasing connectivity around our workplace offering. These investments have supported flows to our advisor-led channel, where average client duration is nearly 15 years and growing. The steady progress supports our journey towards $10 trillion plus in total client assets.\nTurning to investment management. Revenues of $1.4 billion increased 8% from the prior second quarter, supported by higher asset management revenues. Asset management and related fees were $1.3 billion, up 6% year over year, reflecting higher average AUM. Total AUM ended the quarter at $1.5 trillion.\nPerformance-based income and other revenues were $44 million, as gains were driven primarily by our infrastructure, US private credit, and US private equity funds, reflecting our investments in secular growth areas. We recorded long-term net outflows of approximately $1 billion. We continue to see strong momentum across areas of strategic focus, namely Parametric.\nConsistent with current industry trends, we saw outflows in our active equity strategies. Our business is well-positioned, given strength in areas of secular growth, such as customization, direct indexing, and private alternatives. Our continued focus on global distribution, combined with our deep structuring and product creation capabilities, should support incremental growth.\nTurning to the balance sheet. Total spot assets decreased $16 billion from the prior quarter to $1.2 trillion. Our standardized CET1 ratio was 15.2%. Client activity was strong, and markets were open. We actively supported clients with a focus on velocity and competitive resources. We also grew our CET1 capital by $1.5 billion, reflecting strong earnings and continued capital distribution.\nThe most recent stress test results reaffirm our durable business model and strong capital position. For the third year in a row, we announced a quarterly dividend increase of $0.075 cents. Having generated over $3.85 of earnings per share, and an 18.6% ROTCE year to date, we entered the back half of the year from a position of strength, with a robust capital base to support clients.\nInvestment banking pipelines are healthy and diverse. Dialogues are active, and markets are open. In wealth management, strong fee-based flows and the realization of operating leverage continue to demonstrate that our strategy is working. As capital markets become more active, we see opportunities for retail clients to engage and over time deploy their cash and cash equivalent balances into fee-based products.\nWith that, we will now open the lineup to questions.\nQuestion and Answer Session\nOperator\n(Operator Instructions) Glenn Schorr, Evercore.\nGlenn Schorr\nI appreciate all the upfront commentary on NII and wealth. I wanted to drill down a little bit on what you said. So if you have $2 trillion in client assets in advisory, and they keep a handful of percent of money in cash, that change you're making in rate paid on advisory -- on deposit and advisory accounts, can add up to like a good amount of money. So I wanted to get a little more sharper focus on what you said 2025 NII, and then what exactly did you say the offset is on the NII. Thanks.\nSharon Yeshaya\nSure. Thanks, Glenn, for the question. Actually, the portion of the sweep balances that are impacted are, as you mentioned, the sweep on the advisor-led channel, which is actually a small portion of the overall BDP that we disclose. So it is a small portion of that overall stack, and the increase in pricing is being offset largely by the repricing of the investment portfolio. So as things mature and that investment portfolio reprices, it's that change in the quarter amount that will offset it when we look ahead.\nGlenn Schorr\nOkay. And is there a particular reason why you only have to focus on repricing in this small portion of the advisor-led channel, meaning not for all?\nSharon Yeshaya\nCertainly. Yeah. What I would note there is that what we think about when we think about sweeps broadly is mainly in transactional accounts, and in those transactional accounts, we have a wide range of choices and products for our clients. And so therefore, they have a lot of options, as you think about their transactional accounts and brokerage.\nOperator\nEbrahim Poonawala, Bank of America.\nEbrahim Poonawala\nMaybe sticking with NII and, more importantly, on pre-tax margins, right? You had an extremely strong quarter. The stock's weaker this morning, and it has to do with the NII drag on wealth, revenues, and margin.\nSo one, I think, Sharon, your level of visibility into NII, lots of moving pieces around client behavior, maybe we get interest rate cuts. Just give us a sense of if you see any guide on what rate cuts would imply for client behavior, or is there cash to assets that you're looking at that gives you comfort around NII potentially stabilizing post 3Q.\nAnd then, maybe for you, a question -- go ahead. Yeah.\nSharon Yeshaya\nYeah. So why don't I take that, and then you can ask your second question. So you are pointing out a great point, Ebrahim, as we look ahead through time, which was the second point of my guidance, is that when we look over the next year, we are seeing, and we expect that we should see an inflection in NII. And that is predicated on the points that you mentioned, which is that, as you see rate cuts, we would expect those balances to stabilize.\nRemember, outside of the tax quarter, this particular quarter, we had been seeing a stabilization in those sweep deposits. So it's important to recognize that that has been happening, reaching that frictional level of transactional cash. So that would likely continue. And then over time, you would also begin to see a benefit as rates were to be cut, that BDP could actually see inflows, which you've seen from a historical perspective.\nBut in addition to that, you have two other factors. One is the repricing of the portfolio, which I've also already mentioned. And the second piece has to do with lending. We look to continue to support our clients with lending products, and you're beginning to also see that potentially reach an inflection. This is the first quarter that we've seen this type of lending growth since the interest rate hikes began.\nWe've seen now use of SBL products rather than just it being offset by paydowns. So those are all encouraging signs when we look ahead over the course of the next year for NII.\nEbrahim Poonawala\nThat's helpful. And I guess my second question was this -- talking to investors, when we look at the 30% pretax margin target, the question is whether this is aspirational, whether the bar is set too high, given how competitive the business is. So remind us in terms of your comfort level on that 30% pretax margin. And to the extent you can, the timeline of when we get there and when we get there, should that be a sustainable pace for the business? Thanks.\nTed Pick\nThanks, Ebrahim. Confidence level high. If you take a step back, there are three pieces to the wealth management line: asset management, transactional, net interest income, as you know. In the asset management context, those are fees that are going to fee-based accounts, advisory led. Those figures are up 4% sequentially and 16% year over year. That is fee-paying advice. Last quarter, the net new assets into that category was $26 billion. So fee-based flows, that continues to be a growth piece of the wealth management story.\nThe second cylinder is transactional. Transactional has been relatively weak, which is a link to general weakness in overall capital markets activity. And as you hear from our bullish commentary with respect to overall corporate finance activity in the investment bank, that will bleed through over time to the transactional line.\nAnd then third, the net interest income line. And as Sharon said, that will inflect and should inflect over the next year. You put those together, the scale of the business, the funnel, and the processing of $100 million of revenues a day that continue to grow, we are going to continue to achieve operating leverage.\nIt's that simple. We're investing in E*TRADE. We're investing in the traditional advisor. And we're spending a lot of time top of house, focused on workplace, which we think is an enormous opportunity across our corporate and sponsor base.\nIn January, I had said, 30% was the goal. We were in the mid-20s. We just printed 27% gap, 28% [ex-TCP]. It's a core stated objective. It will take some quarters to get there, but we intend on achieving it over time as we continue to grow assets and scale in the business.\nOperator\nMike Mayo, Wells Fargo.\nMike Mayo\nHi. Ted, you've said this, and Sharon repeated this, that the industry is only in the early innings of an investment banking rebound. I have to say, we've heard that for a couple of years. And now is this time -- why is this time real? Do you expect the rebound to continue through the normally slow summer period before the election? How many years? What gives you confidence that this is for real? How much is your backlog up quarter over quarter?\nTed Pick\nIt's an excellent question, because you're exactly right that a number of folks have been calling for this, and it has been sort of a delayed shoots, if you will. But I think now we're seeing some tempering of the inflation prints and some normalization rates.\nWe're also beginning along with that to see the market broaden out. You, of course, have seen that over the last number of weeks. And I think we can now expect broader corporate finance activity to quicken, whether that is across the corporate community or sponsors or other institutions. And the early sign of this kind of activity can be seen in the convertibles product. Global convertibles activity is up significantly. And as you know, on the margin ladder, it typically goes converts, IPO, and then M&A.\nIn the context of bake-offs and the like, in some spaces we're seeing bake-offs running at triple plus the year-over-year rate that they were at for sectors and for some of our client groups. We've been seeing now the launch of traditional IPOs, and we're seeing M&A pipeline kicking in. So corporate community, sponsor community, cross-border community, I think we're in the early stages of a multi-year investment banking-led cycle.\nIf you believe the economy is going to hold up, led by the US, you should expect then to see that if there's some regulatory normalization, too, across a whole bunch of the sectors that are typically most active. So we are quite convicted on this call.\nMike Mayo\nAnd just one pushback. I mean, with interest rates so much higher than they've been in the past, don't you think that could get in the way when people are looking to borrow money for deals and the like? Is this a matter of simply waiting for rates to go lower? Or that's not going to get in the way?\nTed Pick\nI mean, it's a fair question. You've written about this in the context of, you know, what was the normal before financial repression. And I would take the view that in the context of the last 15 years, even some normalization, because I don't know that we're going to go into a full-blown rate cycle, to your point, some normalization of rates will still have you at 3% or 4% on the front end, and even some steepening, potentially.\nSo now we're just back to the old weighted average cost of capital of the mid-'90s and most normal economic periods. And the game will have to go on, because there's just been so much activity that has been suppressed by any kind of measure or percentage of asset, of stock, percentage of market cap. And the stickiness that we're seeing in the sponsor community, too, needs to unglue.\nThere is an enormous, as you know, multi-trillion-dollar stockpile between the two sides of sitting on inventory that needs to be released and then dry powder that's been raised. That will act as a competitive weapon against the competitive bid from the corporate community that has to contend with the reality, of a smaller world with real sovereign risk and real cost of capital differences from one jurisdiction to another.\nSo in short, unless you were to tell me we're going to go into full-blown recession, which none of us can call, and that even if we saw rates normalized to something that is along the lines of the historic 4% on the front end, I think you will see over the next number of quarters, and really over the next number of years, a resumption of more normalized M&A activity with the key difference being that the financial sponsor community is now institutionally come of age.\nThey have global reach. They can work the entire capital structure. They will work in concert with corporate partners, as you know. They don't actually have to act as lone wolves, and they can work with us to finance the package.\nSo it's not just the straight M&A advice or the straight IPO. It will also be bespoke offerings in the private-public space. It will also be bespoke offerings in the private-public space, interest rate and foreign exchange hedging and the other ornaments on the investment banking tree that a couple of the leading global investment banks can bring.\nAnd this is really why, over the last couple of years, to the extent we've done so-called front office hiring, it really has been to target several very high-quality investment bankers who typically have spent their entire careers at one firm and have decided to come to the Morgan Stanley platform, and we're seeing the fruits of that across industries.\nSo I am quite blessed. I am quite bullish on it, certainly take your point that it has been a number of quarters sort of on the promise. But I think as we get into 2025 and the election coming, and then the election behind us, we should see that activity continue on a sustainable pace. *\nOperator\nDan Fannon, Jefferies.\nDan Fannon\nGood morning. I was hoping to get a little bit more color on the flows in the quarter within wealth, maybe the breakdown from the channels and contribution. Last quarter, I think we saw family office being an outsized contributor, but hoping to get a little bit more color on where the flows were sourced in 2Q.\nSharon Yeshaya\nSure, I'll take that. It's, we continue to see broad-based sourcing in terms of where those assets are coming from. In this particular quarter, as I mentioned, the biggest offset and drag, though, is really from taxes. So it's, you still have workplace accounts, you still have the advice-based account directly, you still have self-directed, all those places remain contributors.\nWhat continues in my mind to be most interesting, though, isn't just the contribution that you're getting from the three various channels. But the fact that you have in the advice-based channel, it's not just coming from existing clients, but it's split with existing and net new clients. And some of those net new clients are also relationships that are being sourced from workplace.\nSo I would not just directly focus on what channel is it coming from, but how are you seeing those channel and that interplay work. Because that's actually the power of the differentiated platform. Once you have somebody who wants more differentiated advice from self-directed, speaks to an advisor, that advisor sees net new clients bring in assets, and then that's new acquisitions into the funnel and eventually into fee based. So it's really the whole ecosystem that I would call your attention to, rather than just one isolated leg.\nTed Pick\nWhich is part of the reason that workplace is so important, because if workplace can continue to experience success amongst the corporate and sponsor community, that has an affinity effect on the top of the house at those institutions in terms of their own wealth and then potentially other products around it.\nSo it can be an indirect sale, where you aren't necessarily going directly to the prospective client via the FAA, but you could actually work potential clients through the institutionalized effect of workplace, where we do a great job educating on wellness, financial wellness, and then effectively institutionalizing ourselves by overseeing incentive comp through the Morgan Stanley Solium product. And having succeeded on an MS at work mandate, which, as you know, is a durable, sticky asset that effectively is seen by the entire employee base, you can start working your way up the funnel to the senior executives of that firm.\nOperator\nBrennan Hawken, UBS.\nBrennan Hawken\nYeah, good morning, Ted. Thanks for taking my question. I'd like to just drill down a little more, give a second follow-up here on the repricing change that you mentioned in your prepared comments, Sharon. So the repricing that we've seen in the securities book has been slow.\nSo I'm just kind of curious as to why you think that will help offset the repricing actions that you're taking on the deposit side. Is that because it'll be a phased repricing, and therefore, there's an ability to have the phased benefit in the asset side offse. And then just a nitty-gritty question on it, is the switch going to be to money fund sweep rather than higher yielding deposits, and then that way you can just slowly replace that funding as you see fit?\nSharon Yeshaya\nSo thanks, Brennan. I'll take that question. No, all the changes that we'll make will happen -- are expected to happen in the third quarter. And so those different changes will be made, and they'll be based on various competitive dynamics.\nBrennan Hawken\nOkay, got it. And then is this going to be focused on the advisory relationship, similar to what we've seen from some other warehouse competitors? And could you just -- is it the changes that have recently been announced by Wells and BofA? Is that what you mean by competitive dynamics, or is there something else that I'm not aware of?\nSharon Yeshaya\nNope. That's exactly as I stated it, and it will just be limited, as you said, to the sweeps that are dealt with in the advisor-led channel.\nOperator\nDevin Ryan, JMP Securities.\nDevin Ryan\nThe first question, just on -- another one on the GWM flows. Sharon, you mentioned tax season is a factor, which you completely get, but then you also mentioned increased client spending. And I just wanted to drill into that, just whether that's something that could continue, whether it was seasonal or influenced by inflation, just trying to understand that component of the impact on flows.\nSharon Yeshaya\nYeah, I think that's a really interesting question. I did call it out. We've seen increased spending by hundreds. We've seen increased spending by higher net worth. And so higher-income bands are certainly spending. We see that in the data alongside actual spending. We see that in purchases of homes. We see that in various tailored investments.\nSo they are -- that cohort, so to speak, is using its cash in different ways and its various investment in different ways. So I too think that that's an interesting dynamic that's playing out. I know that others have mentioned it within their portfolios as well. It's certainly something we're seeing in our data.\nDevin Ryan\nOkay. Got it. Thank you. And then a follow-up just on the interplay between investment banking and trading, and appreciate the commentary on kind of the improving capital markets backdrop, which is great to hear and kind of the expectation from our end that there's going to be a lot more primary issuance and equities maybe in debt as well as M&A picks up.\nSo just trying to think about what that means for the trading businesses, equities and fixed income, and whether you guys feel like we could maybe sustain around these really high levels or even -- maybe even the wallet could move higher just as you get a stronger primary issuance market.\nTed Pick\nWell, I know that the competitive set will naturally speak to areas where integration can be an asset. Here, we have, we believe, something really special. Insight. We have an asset that's going to be part of our institutional securities business, our so-called integrated investment bank, which has been ongoing for now we're getting on seven or eight years now under Dan Simkowitz direction.\nAnd this is a sort of critical facet of business strategy at our place because you have now the appropriate and important relationships that have been built across fixed income, equities, and banking through our capital markets new issue business. You have those now having been compounded and advanced by the mobilization of some folks from one division to another.\nSo there's real familiarity now with the work product. A lot of the work product, as you know, is not traditional vanilla IPOs. Yes, there are some on the horizon that are quite substantial, and we'd expect that to be an important part of the calendar. But there's also more bespoke product, whether it be convertibles or products in the private area or products that effectively necessitate high-quality structuring and advice.\nAnd that can only be brought to the boardroom if you have world-class investment bankers who can lean on the expertise of their colleagues, not just in the new issue business, but as appropriate in institutional equities and in fixed income.\nAnd if you look at our fixed income business, for example, and fixed income underwriting, you'll see that the share gains have been quite extraordinary and that the year-over-year revenue number, I believe, is up 71%. That speaks to a fine work that's been done by folks, not just in the debt capital markets business, which is housed inside of our new issue business linked to banking, but also working closely with fixed income professionals, whether they are in the securitized products group, in our commodities area, broader credit, or in our macro space, i.e., interest rate and foreign exchange.\nSo when you get into the knitting of ISG, our integrated investment bank, you see that part of the reason that we are bullish on, not just to Mike's earlier question on the denominator, but also on our ability to increase the numerator is not so much because we think there is a need to deploy a lot more capital.\nWe will do so as appropriate when the market's demanded, but that we are able to get the kind of bespoke advice for clients that comes from the familiarity of our people, the quality of the advice that is differentiated. And importantly, that it's global, so that we can bring it to the client base.\nSo that is part of, I think, the secret sauce that we've been working hard on to generate above cost of capital returns inside the investment bank on a standalone basis. And that obviously doesn't include even the synergies that we'd see across the firm into wealth and investment management.\nBut your question is on the investment bank specifically. Yeah. And I feel really good about the way it's structured, the leadership that we have within it, the experience set, and then our ability now to tap into this next cycle, which will be different than the last one.\nRates will be well higher than that of financial repression. We'll be toggling between some bouts of inflation and potential recession. We'll be dealing with the unpredictability going to not only our own cycle, US election cycle, but the world around us. But also the coming of age and the institutionalization of the financial sponsor community, where we have very strong relationships with that leadership group from top to bottom across the investment bank, wealth, and investment management.\nOperator\nSteven Chubak, Wolfe Research.\nSteven Chubak\nSo maybe just starting off with a question just on operating leverage within ISG. Year to date, the incremental margins are quite strong, just north of 80%. You spoke constructively on IB and trading inflecting positively. Just want to better understand what you believe is a sustainable incremental margin as activity steadily builds, especially given some of the growth, at least from here, may skew a little bit more heavily towards investment banking, which tends to be more compensable.\nSharon Yeshaya\nSo when you look at it -- I would really focus, Steve, on the efficiency ratio targets that we've put for the whole firm. We think that the firm can run at or below the 70% over time through a durable cycle. The issue with your specific question, as you yourself highlighted, is it depends on where those different revenues are coming from. So there might be periods of time where it's higher [BCNA-related]. There might be periods of time where you have different jurisdictions associated with it.\nBut broadly speaking, the enterprise, we've given 30% margins as it relates to wealth and the sort of wealth and investment management space, and then you have the ISG space. So by definition, if you're running at 70% efficiency ratio more broadly, you look for an entire enterprise to run at somewhere of a 30% margin.\nTed Pick\nYeah. The only thing I would add to that is, of course, as you know, there's real seasonality in the business. Fixed income tends to have its strongest quarter street-wide in the first quarter. Investment banking typically in the fourth quarter. That's not every year, but that's typically how it shakes out. Third quarter tends to be weaker in the summer months, and then it's sort of all about September. And obviously, this September will be one that will be driven in part by sentiment around the upcoming elections.\nSo that's kind of the seasonality piece. The other is just the scale within the businesses. I'd be remiss, again, not to sort of underscore the importance of having reached $3 billion in the equities business. This has been a leading business where we have been number one or number two for the last dozen years. And we see the clients are much in demand of our services across cash, derivatives, and prime brokerage. And then connecting to investment banking, I think that business has, too, hit an inflection point again where they can continue to prosecute a high-margin business through the cycle.\nAll of this, of course, is dependent on the economy holding up and general asset price levels. But given where we are right now, we're feeling good about that, too.\nSteven Chubak\nNo, thanks for that perspective. And just a follow-up on the deposit discussion. Both you and your Wirehouse peers announced similar actions on deposits, which you noted, Sharon. You mentioned it was informed by competitive dynamics. But I wanted to better understand if there was any feedback you or your peers had received from regulators that prompted the decision. Because from our vantage point, the timing of these pricing actions at this stage of the rate cycle is simply difficult to reconcile.\nSharon Yeshaya\nI'm sorry, Steve. We don't comment, as you know, on regulatory matters.\nSteven Chubak\nOkay. Fair enough. I had to try. Thanks for taking my questions.\nOperator\nGerard Cassidy, RBC.\nGerard Cassidy\nYou gave us good insights into your thinking about what the capital markets could bring, especially in investment banking. And I think you touched on in your comments with trends, or maybe you have, Sharon, that the transactional numbers could benefit from a stronger ECM business. Can you then take the next second derivative and share with us from your experience with [Solium]?\nShould we see that business pick up the workplace channel if more of these maybe private equity sponsor companies go public? Should the workplace channels see stronger revenues potentially? Revenues potentially in a stronger investment banking market over the next 12 or 18 months?\nSharon Yeshaya\nI think that's a great question. I know, Gerard, a few years ago you also asked me about different values of those assets associated with what the underlying is. I completely agree with you.\nAs you have workplace assets rise, the value of those client assets rise, new corporations issue their employees more stock. They also grow their employee base. It should absolutely add participants. It should add new corporates. It will add new net flows.\nAnd now that we have all of, you know, that when you just had Solium, now you also have E*TRADE and Workplace, and the platforms are integrated. So as those flows flow into an E*TRADE account, people can transact on that. And then as Ted said, we can also offer financial wellness. So absolutely, it helps that ecosystem begin to work.\nGerard Cassidy\nVery good. Very good. And just as a follow-up, Ted, if I take a step back, obviously, you guys have done a very good job in the last 10 years of growing organically, but then complementing that growth with acquisitions. Once we get the Basel III endgame final proposal, maybe some G-SIB relief, can you share with us, as you look out over the next two, three years, is there any parts of the picture today that you'd like to enhance possibly with acquisitions? Or are you a good way you are today?\nTed Pick\nI'll take the opportunity to sort of give a brief view on capital, if I could, Gerard, and link that to potential external opportunities. We anticipated or believed it was possible that we could have a tougher annual CCAR test, and indeed it was. And what we've prioritized in potential uses of capital, above all, is that we've prioritized in potential uses of capital above all, things has been dividend policy.\nAnd as you know, we are increasing dividend again to $0.925 cents, which at spot offers a 3.5% current, 3.5% dividend yield. So that is the continued highest priority on use of capital, if you include, of course, use of capital to inorganic opportunity.\nSecond, our clients, we have continued to lean in for clients across the business segment, as appropriate, and you see the operating leverage across the businesses, particularly across the investment bank. But we've also thought about the buyback opportunistically and have been buying stock back and returning capital this past quarter, more than $2 billion between the dividend and the buyback, in a way that has been reflective of offering us that optionality.\nAs we sit here today, we are 170 base points above the buffer. And importantly, we continue to be in the 3.0 G-SIB buffer, which in one context wouldn't normally get much attention, but does get attention in the context of your question, which is sort of forward-looking strategic opportunity. It's worth noting, if we can manage to stay at 3.0, assuming that the framework holds through whatever Basel brings, that will be our buffer in 2026.\nSo we're [170] over, and we accreted $1.5 billion this quarter. External, i.e. inorganic, therefore, is something we can think about. It's just not something we're going to think about in the short term. The reality is we've got our forced hierarchy. The forced hierarchy is dividend first, investing in clients as appropriate, achieving operating returns against that second. And then third, the buyback opportunistically.\nDown the road, two, three, four years out, if opportunities come across the horizon, importantly, after we have some definition around Basel and continued potential refinement of what we understand to be inside CCAR formulation, so just general regulatory uncertainty, sure, we might look at stuff.\nBut I would tell you in the short term, we're very happy with the acquisitions that we've made over the last 10, 12 years, and we are determined to generate operating leverage in each of the two major segments, wealth and investment management and the integrated investment bank, and then to obviously hit our efficiency ratios of 70% and the margins and returns that we've talked about.\nOperator\nSaul Martinez, HSBC.\nSaul Martinez\nSo I wanted to follow up on the earlier question on the outlook for your sales and trading businesses. You've kind of consistently done about $18 billion to $20 billion of annual revenue in post-pandemic period in FIC and equities. And right now, we have a backdrop where we're going to see rate cuts. Markets are strong. Issuance activity may pick up. At the same time, you have perhaps more competition from foreign banks who have lost share.\nSo how do you see -- do you have a view on how you see the wallet evolving for these businesses, your ability to maintain or gain share in this backdrop? And I guess ultimately, do you think you can grow revenues here from a base that is materially higher than what it was pre-pandemic?\nTed Pick\nYeah. I think the answer to that is that we would like to grow share that is durable. We want to grow share in businesses that are connected to the core client base, whether it be the global asset managers, the leading alternative asset managers, private equity and private credit players that come to the fore, and then our lead corporate and sovereign clients.\nThere are products that can be offered. There are very few firms that can do that globally. We continue to have a world-class markets business, for example, in Asia, where I believe we have the largest equities business. We've been growing the business quite assiduously on the continent in the UK, where our senior management has been putting in a lot of time and attention. And as you know, we have a differentiated joint venture with our friends and partners at MUFG in Tokyo.\nSo if you consider the global footprint of the firm, in a world that continues to be equities-based, it continues to be an equities world. You see it in the asset price momentum in the US. You see now the potential for that to broaden to more names and more sectors. And that obviously gives opportunity for folks in the stock picking business, for example, where we've been very strong traditionally in equities, to do the cash, derivatives, and prime brokerage suite that we offer.\nYou could see continued uncertainty based on how the next administration handles the significant macro challenges facing the US, whether you'll see a steeper yield curve where you'll see activity on the front and to the belly of the curve. That of course offers all kinds of opportunities to the rates business and connected to corporate catalyst activity where, on an M&A acquisition, the acquirer may wish to inoculate themselves from rate or foreign exchange risk, and that's a service that we offer.\nAgain, I like the idea of growing durably inside the integrated investment bank. I like the idea that we are working in sandboxes with the appropriate capital controls around that, but that we're allowing enough breathing space so that when our lead clients are looking to engage in a once-in-every-few-years catalyst event that we can fully offer the entirety of the advice and financing spectrum to them on demand.\nSo the answer would be to grow and grow responsibly. I'd like to think we could inch up the numerator along with the denominator, and that you would see that almost imperceptibly over the course of quarters and years.\nSaul Martinez\nThat's helpful. Thank you. Just, I guess, a quick follow-up, related follow-up. The ROE, 14% in ISG in the first half of the year, early on, as you highlighted, in an investment banking cycle. Do you have a view on where the institutional securities ROE can get to as the investment banking cycle kind of plays out? Is there a view on sort of what a normalized ROE would be here?\nTed Pick\nWe're still early. We're still early in the cycle. We're watching it, of course. To the earlier question on when the green shoots come through on the high-margin M&A product, the reality of seasonality, the uncertainty of rate path, geopolitics, US elections. It's hard to put a pin on what the returns will be in a given forward quarter until we kind of see some normalization in those uncertainties, not to mention some of the regulatory stuff that we're dealing with as we speak, Basel, namely.\nBut yes, you're right to point out that we are seeing some real operating leverage in the investment bank, and over the course of a number of years, as we think about not just the integrated firm, but the returns generated inside of wealth and investment management. And then we look at the returns inside the investment bank, we are measuring that, and we're looking to have that contribute to the overall sustainable 70% efficiency of the firm.\nOperator\nThere are no further questions at this time. Ladies and gentlemen, this concludes today's conference call. Thank you, everyone, for participating. You may now disconnect, and have a great day.", "Link": "Https://Finance.Yahoo.Com/News/Q2-2024-Morgan-Stanley-Earnings-065128580.Html", "Sentiment_Score": -0.1439008713, "Sentiment_Category": "bearish"}, {"Ticker": "MS", "Time": "2024-07-16T21:57:23.000Z", "Headline": "Bank earnings, spot ether ETF, US labor data: Market Domination", "Summary": "The weather is sweltering today, but equities are still thriving (^DJI, ^IXIC, ^GSPC) Julie Hyman and Josh Lipton monitor the latest market movements and report on the biggest industry stories heading into Tuesday's market close.\nMizuho US chief economist Steven Ricchiuto joins Market Domination to talk about what he is seeing in US labor and employment data and what it could mean about the supposed cooling economy.\nBank earnings continue to roll out with Bank of America (BAC), Morgan Stanley (MS), and Charles Schwab (SCHW) reporting results today. CFRA director of equity research Ken Leon comes onto the program to discuss prevalent trends in Big Bank earnings and the direction investment banking businesses could head in the latter half of 2024.\nAhead of Netflix's (NFLX) earnings due out on Thursday, July 18, Bloomberg Intelligence senior media analyst Geetha Ranganathan comments on the \"very, very high\" expectations for the streaming giant that it very well could live up to and even surpass for its past quarter.\nOther top trending stocks on the Yahoo Finance platform include UnitedHealth Group (UNH), Warner Bros. Discovery (WBD), Adidas (ADS.DE, ADDYY), and cryptocurrency ethereum (ETH-USD) around the expected launch of spot ether ETF products.\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Bank-Earnings-Spot-Ether-Etf-215723650.Html", "Sentiment_Score": 0.0114147775, "Sentiment_Category": "neutral"}, {"Ticker": "MS", "Time": "2024-07-16T20:50:00.000Z", "Headline": "These Stocks Are Moving the Most Today: UnitedHealth, Trump Media, Schwab, Bank of America, Morgan Stanley, Shopify, Reddit, and More", "Summary": "UnitedHealth stock surges after profit at the health insurer tops estimates, while Trump Media stock falls after the company files for the resale of nearly 38 million common shares. Charles Schwab is down sharply after the brokerage giant issued second-quarter earnings.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/10335B70-120A-36F7-8C82-1B805E2Ca9B0/These-Stocks-Are-Moving-The.Html", "Sentiment_Score": 0.0807099938, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-16T20:38:46.000Z", "Headline": "How long will the investment banking boost last?", "Summary": "With the potential for the Federal Reserve to cut interest rates as soon as this September, there may be added hurdles for investment banking to keep profitability high even after several banks reported positive second quarter results.\nCFRA director of equity research Ken Leon joins Market Domination to discuss the state of investment banking and how these big banks may operate moving forward in current and future interest rate environments.\nOn sustainability of growth for investment banking, Leon comments: \"We hit the trough for investment banking fees last year, probably in July. We're still at just the beginning of a rebound, but saying that, the first quarter, first half of this year had record results for debt cap, debt underwriting. But equity underwriting and IPOs, are still really in early innings of recovery. And keep in mind, there's two major sources for deals: one is obviously corporates, but the one that has not been participating as it tries to figure out valuation with rates is financial sponsors.\"\nFor more expert insight and the latest market action, click here to watch this full episode of Market Domination.\nThis post was written by Nicholas Jacobino", "Link": "Https://Finance.Yahoo.Com/Video/Long-Investment-Banking-Boost-Last-203846171.Html", "Sentiment_Score": 0.0677114949, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-16T19:06:37.000Z", "Headline": "Following Wells, Morgan Stanley plans changes to sweeps policies", "Summary": "Credit: Tada Images - stock.adobe.com\nAmid lawsuits and regulatory scrutiny over the low returns firms sometimes offer on uninvested cash, Morgan Stanley became the latest Wall Street giant to announce changes to its \"cash sweeps\" policies.\nSpeaking on an earnings call Tuesday, Morgan Stanley Chief Financial Officer Sharon Yeshaya said the firm plans to modify its sweep rates for advisor-managed accounts in the third quarter \"against the backdrop of changing competitive dynamics.\" Asked later by Wolfe Research analyst Steven Chubak if the planned changes were in any way prompted by industry regulators, Yeshaya declined to elaborate.\n\"I'm sorry, Steve,\" Yeshaya said. \"We don't comment, as you know, on regulatory matters.\"\nMorgan Stanley's decision to modify its sweeps policies comes after Wells Fargo announced similar changes on Friday. Wells, which has been responding to Securities and Exchange Commission inquiries about its own cash sweeps, said it is raising its yields on uninvested cash. That move is expected to lower its Wealth and Investment Management unit's revenue by $350 million this year.\nSeparately on Tuesday, Bank of America announced that it's making pricing changes on certain deposits held in its Merrill wealth management arm. A Bank of America spokesperson did not immediately respond to a request for elaboration.\nSweeping allegations\n\nThe term \"cash sweeps\" refers to brokerages' practice of taking clients' uninvested money held in brokerage and advisory accounts and moving it into internal and external banks. Those banks then pay interest in return for being able to use the cash as deposits that they can then lend out at higher rates.\nREAD MORE:\nMorgan Stanley clients got 0.01% on uninvested cash. A suit argues it should have been more\nSEC looking into JPMorgan advisory fees, Wells cash sweeps\nAvoiding the 'cash trap': Time to move clients out of money markets?\nThe wealth management industry's $1T conflict of interest\nCash sweeps: Checking the fine print on a conflict of interest\nThe practice has been garnering increasing attention lately from both regulators and lawyers. Much of the scrutiny centers on the question of whether advisors with a fiduciary duty to serve their clients' best interests shouldn't be placing their uninvested cash in better-paying alternatives. Critics of the policies often note that both money markets and high-yield savings accounts offer returns of around 5%.\nMorgan Stanley is the subject of two separate lawsuits questioning its cash-sweeps policies. A class action suit filed on June 14 in a New York federal court questions the firm's practice of offering returns as low as 0.01% on clients' uninvested cash. A separate class action filed in February in a New Jersey federal court alleges that cash held in retirement accounts was being swept into accounts paying unreasonably low interest rates. Bank of America's primary wealth management arm, Merrill, is meanwhile faced with its own suit about its cash-sweeps policies.\nOn Tuesday's earnings call, Yeshaya returned to the idea that the firm's sweep modifications were coming in response to \"competitive dynamics.\" She said the changes will most likely cost the firm some net interest income in its third quarter. Those losses, she said, will be offset partly by gains in its investment portfolio.\nShe said the sweeps changes will only affect uninvested cash held in the firm's advisor-led channel. The bulk of clients' free money is instead in transactional accounts, she said.\n\"And in those transactional accounts, we have a wide range of choices in products for our clients,\" Yeshaya said. \"And so therefore, they have a lot of options as you think about their transactional accounts and brokerage.\"\nA spokesperson for the firm declined to elaborate on her comments.\nWealth management results\n\nMorgan Stanley meanwhile reported that its intake of net new assets fell more than 60% in a quarter that nonetheless saw the Wall Street giant trudging toward its goal of having $10 trillion under management.\nAccording to its earnings release, Morgan Stanley brought in $36.4 billion in net new assets in the three months leading up to June 30. That was down 62% from the previous quarter and 59% from the second quarter of 2023.\nSpeaking with analysts Tuesday, Morgan Stanley CEO Ted Pick noted that even if assets came in at a slower pace in the second quarter, the firm has nonetheless brought in $131 billion in net new assets so far this year.\n\"Year-to-date, annualized growth in net new assets in wealth management is over 5%, with another strong quarter of over $25 billion in fee-based flows,\" he said. \"Strong fee-based flows support daily revenue, which on average has been $100 million each day this year and show the stability and continued growth of the wealth franchise.\"\nThe inflows helped push Morgan Stanley's client assets in its Wealth and Investment Management division to $7.2 trillion. That was up from $7 trillion in the previous quarter and showed slowing progress toward the firm's long-stated plan to eventually have $10 trillion under management.\nThe firm also reported progress on its goal of bringing its pretax margin for its wealth management unit up to 30%. That number, the proportion of revenue the division keeps after subtracting all expenses save taxes, rose by 1 percentage point to 27% in the second quarter.\nThat helped drive the unit's net income up by 7% year over year to $1.4 billion on nearly $6.8 billion in net revenue. For all of its business units, Morgan Stanley reported $3.08 billion in net income on $15 billion in revenue.\nClient assets\n\nThe firm's $7.2 trillion in assets was made up of $1.5 trillion in its investment management unit and nearly $5.7 trillion in wealth management. Of the wealth assets, just over $4.4 trillion was being managed by advisors, $1.25 trillion was held in self-directed E-Trade accounts and $452 billion was in the firm's workplace channel, which helps companies provide services like financial planning and equity compensation to employees.\nOf the assets managed by advisors, $2.2 trillion, or 49% of the total, was in accounts generating fees. That number was up 18% year over year.\nThe firm also reported having 6.6 million participants in stock plans offered through its Morgan Stanley at Work workplace channel. That figure was up 2% year over year.\nWealth profit and revenue\n\nOf the wealth unit's $6.8 billion in net revenue, nearly $4 billion came from managing clients' assets. That figure was up 16% year over year.\nYeshaya said in an earnings call that the firm's asset management fees, \"the core of our wealth management strategy,\" climbed to a record high in the quarter.\n\"Our wealth management strategy is predicated on gathering assets, meeting our clients' lending needs and offering advice,\" Yeshaya said.\nThat was offset, though, by a 17% drop to $1.8 billion in net interest income, or NII. Glenn Schorr, an analyst at Evercore ISI, noted the NII figure was also down by 3% from the previous quarter.\n\"Seasonally softer net new asset growth and 3% quarter-over-quarter lower NII in wealth were the only real issues we saw,\" Schorr wrote in a note reported on by Bloomberg. \"Our gut is tax season is mostly to blame and the rest of results were pretty darn good amidst this improving capital markets backdrop.\"\nExpenses\n\nMorgan Stanley reported $4.95 billion in noninterest expenses from its wealth management unit, a figure up 2% year over year. Of that, $3.6 billion went to compensation and benefits, a number up 3% year over year.\nMorgan Stanley no longer reports how many advisors it has on staff. Its expenses related to compensation and benefits came to 53% of its net revenues for the quarter.\nRemark\n\nYeshaya said she and other executives believe the flow of net new assets was down primarily because clients were setting aside money in the second quarter to pay taxes.\n\"Net flows will be lumpy in any given period of time and impacted by both the macroeconomic environment and business-specific factors,\" she said. \"We believe both tax-related outflows and increased spending, particularly among high net worth clients, impacted flows this quarter. Still, our first half (net new asset) growth remains solid.\"", "Link": "Https://Finance.Yahoo.Com/News/Following-Wells-Morgan-Stanley-Plans-190637086.Html", "Sentiment_Score": 0.0394795872, "Sentiment_Category": "neutral"}, {"Ticker": "MS", "Time": "2024-07-16T18:03:27.000Z", "Headline": "Morgan Stanley earnings, Trump VP, retail sales: Morning Brief", "Summary": "It's a new day, but the same old stock market. Seana Smith and Brad Smith help investors through the market open and discuss what's moving markets, like June's retail sales data.\nIn this installment of The Morning Brief, Morgan Stanley (MS) and Bank of America (BAC) reported second quarter earnings. Argus Research director of financial services research Stephen Biggar joins the show to discuss the latest Big Bank earnings and what lower interest rates would hold in store for the banking sector.\nAs Apple (AAPL) hopes to inspire a new upgrade cycle in its newest iPhone's AI features — dubbed Apple Intelligence — the tech giant also has its eyes set on the consumer market in India. D.A. Davidson managing director Gil Luria describes the country's consumer prospects as a \"long-term promise\" for Apple.\nOther trending stock tickers on the Yahoo Finance platform include Match Group (MTCH), UnitedHealth Group (UNH), and Shopify (SHOP).\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Morgan-Stanley-Earnings-Trump-Vp-180327703.Html", "Sentiment_Score": 0.0272205397, "Sentiment_Category": "neutral"}, {"Ticker": "MS", "Time": "2024-07-16T17:45:00.000Z", "Headline": "Three Major Takeaways From Big Banks’ Earnings", "Summary": "Investment-banking and trading revenue rose at major U.S. banks including Goldman Sachs and JPMorgan Chase More stable economic conditions gave corporate-banking clients the confidence to use bread-and-butter banking services such as deal advisory and debt offerings. A clearer outlook on interest rates is giving bankers hope that dealmaking is emerging from a two-year slowdown.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/6F788B05-0Db6-36Cb-A339-63Dbc2D2744D/Three-Major-Takeaways-From.Html", "Sentiment_Score": -0.068347156, "Sentiment_Category": "bearish"}, {"Ticker": "MS", "Time": "2024-07-16T17:30:06.000Z", "Headline": "Morgan Stanley (MS) Q2 Earnings: How Key Metrics Compare to Wall Street Estimates", "Summary": "For the quarter ended June 2024, Morgan Stanley (MS) reported revenue of $15.02 billion, up 11.6% over the same period last year. EPS came in at $1.82, compared to $1.24 in the year-ago quarter.\nThe reported revenue compares to the Zacks Consensus Estimate of $14.18 billion, representing a surprise of +5.95%. The company delivered an EPS surprise of +10.30%, with the consensus EPS estimate being $1.65.\nWhile investors closely watch year-over-year changes in headline numbers -- revenue and earnings -- and how they compare to Wall Street expectations to determine their next course of action, some key metrics always provide a better insight into a company's underlying performance.\nSince these metrics play a crucial role in driving the top- and bottom-line numbers, comparing them with the year-ago numbers and what analysts estimated about them helps investors better project a stock's price performance.\nHere is how Morgan Stanley performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\nBook value per common share: $56.80 versus the five-analyst average estimate of $56.16.\nReturn on average common equity: 13% compared to the 11.8% average estimate based on four analysts.\nWealth Management - Total client assets: $5,690 billion compared to the $5,520.24 billion average estimate based on two analysts.\nTotal assets under management: $1,518 billion versus the two-analyst average estimate of $1,513.86 billion.\nRevenues- Investment banking: $1.39 billion compared to the $1.48 billion average estimate based on four analysts. The reported number represents a change of +20% year over year.\nRevenues- Commissions and fees: $1.18 billion versus the four-analyst average estimate of $1.15 billion. The reported number represents a year-over-year change of +8.5%.\nNet revenues- Investment Management: $1.39 billion versus $1.41 billion estimated by four analysts on average. Compared to the year-ago quarter, this number represents a +8.2% change.\nNet revenues- Institutional Securities: $6.98 billion versus the four-analyst average estimate of $6.23 billion. The reported number represents a year-over-year change of +23.5%.\nNet interest Revenue: $2.07 billion compared to the $1.91 billion average estimate based on four analysts. The reported number represents a change of +2.8% year over year.\nRevenues- Other: $322 million versus the four-analyst average estimate of $575.06 million. The reported number represents a year-over-year change of -34%.\nRevenues- Asset management: $5.42 billion versus $5.30 billion estimated by four analysts on average. Compared to the year-ago quarter, this number represents a +57.1% change.\nRevenues- Wealth Management- Asset management: $3.99 billion compared to the $3.85 billion average estimate based on three analysts. The reported number represents a change of +15.6% year over year.\nView all Key Company Metrics for Morgan Stanley here>>>\n\nShares of Morgan Stanley have returned +8.5% over the past month versus the Zacks S&P 500 composite's +3.8% change. The stock currently has a Zacks Rank #3 (Hold), indicating that it could perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMorgan Stanley (MS) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanley-Ms-Q2-Earnings-173006807.Html", "Sentiment_Score": 0.0239973217, "Sentiment_Category": "neutral"}, {"Ticker": "MS", "Time": "2024-07-16T17:30:00.000Z", "Headline": "Yield-Hungry Wealth Management Clients Are Becoming a Headache for Big Banks", "Summary": "Brokerage customers are still demanding more for their cash. Across several banks with large wealth-management businesses, a common theme in second-quarter earnings reports was continuing to have to pay higher rates to hang on to brokerage customers’ cash that isn’t invested in things like stocks and bonds. Wells Fargo and Morgan Stanley called out increases in some of the rates they pay on certain brokerage account deposit products, and Bank of America noted a rise in rates paid on wealth-management deposits.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/E3862880-1Fa4-3530-84D5-9194B09C27D8/Yield-Hungry-Wealth.Html", "Sentiment_Score": -0.9156010747, "Sentiment_Category": "bearish"}, {"Ticker": "MS", "Time": "2024-07-16T15:29:00.000Z", "Headline": "Morgan Stanley Stock Hits Record High as Earnings Rise, Wealth Disappoints", "Summary": "UBS analyst Brennan Hawken said the results told “a tale of two segments,” with impressive institutional securities results and weaker performance in wealth. The company reported a drop in the net flow of new assets into the bank’s wealth management business: $36.4 billion for the quarter compared with $89.5 billion for the same period last year. Morgan Stanley on Tuesday reported a 41% jump in profit from a year ago as signs that investment-banking work is coming back boosted the firm.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/38B23A69-88F8-3D76-9A61-D74D4Cc8B11F/Morgan-Stanley-Stock-Hits.Html", "Sentiment_Score": 0.8179971576, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-16T15:17:00.000Z", "Headline": "Stocks to Watch Tuesday: Match, UnitedHealth, Bank of America, Trump Media", "Summary": "**↗️** **Match (MTCH)**: Hedge fund Starboard Value has built a big stake in the online-dating company and is pushing for a possible sale if a turnaround isn’t successful. Shares of the Tinder parent jumped over 9%.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/38B7368D-Fb24-38Dc-8841-3C8Bd7B13De1/Stocks-To-Watch-Tuesday-.Html", "Sentiment_Score": -0.0020565949, "Sentiment_Category": "neutral"}, {"Ticker": "MS", "Time": "2024-07-16T15:05:34.000Z", "Headline": "Morgan Stanley Stock Jumps After Better-Than-Expected Q2 Earnings", "Summary": "Michael Nagle / Bloomberg via Getty Images\nMore\n\nKey Takeaways\nMorgan Stanley posted second quarter earnings per share of $1.82 on revenue of $15.02 billion, beating analysts' expectations.\nWealth management revenue growth was relatively modest, while net new assets were down year-over-year.\nOther big banks have also managed to beat top- and bottom-line expectations this quarter.\n\n\nMorgan Stanley (MS) posted strong second-quarter top- and bottom-line results despite sluggish growth in the bank's wealth-management business Tuesday.\nThe bank reported second-quarter earnings per share (EPS) of $1.82 on revenue of $15.02 billion, topping analysts’ expectations of $1.64 per share and $14.26 billion, respectively, per consensus compiled by Visible Alpha. Revenue rose 12% year-over-year.\nMorgan Stanley’s wealth management division posted a 2% increase in revenue year-over-year to $6.79 billion. The bank added $36.4 billion in net new assets, well below the $89.5 billion added in the year-ago quarter.\nThe shares gained in recent trading, with Morgan Stanley stock up nearly 3%. The KBW Nasdaq Bank Index (BKX) was up about 2.6%.\nRevenue from equity trading jumped 18% to $3.02 billion. Fixed-income revenue rose 16% to $1.99 billion and investment-banking revenue rocketed 51% to $1.62 billion. \nMorgan Stanley is the latest big bank to beat expectations on both profit and revenue, joining Citigroup (C), JPMorgan Chase (JPM), Wells Fargo (WFC) and Goldman Sachs (GS).\nRead the original article on Investopedia.", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanley-Stock-Jumps-Better-150534328.Html", "Sentiment_Score": 0.4863696694, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-16T14:38:35.000Z", "Headline": "Morgan Stanley's investment banking surge solidifies Wall Street dealmaking revival", "Summary": "An investment banking surge at Morgan Stanley (MS) solidified a dealmaking revival across Wall Street, but the company’s wealth management unit fell short of analyst expectations.\nFees from investment banking jumped 51% from a year ago, the second-largest leap among big banks after Citigroup (C).\nInvestment banking fees also jumped at JPMorgan Chase (JPM), Wells Fargo (WFC), Goldman Sachs (GS), and Bank of America (BAC) as dealmaking showed new signs of life following a two-year drought.\nWhen asked Tuesday about the investment banking rebound, Morgan Stanley CEO Ted Pick told analysts \"a number of folks have been calling for this.\"\nHe referenced earlier industry talk of \"green shoots\" that failed to show up after some false starts in 2023.\n\"It has been sort of a delayed shoots, if you will,\" he said.\nThe pick-up in investment banking and an increase in trading helped Morgan Stanley push its net profit up by 41% from a year earlier, to $3.07 billion. Its total net revenue of $15.02 billion rose 12%.\nBoth figures exceeded what analysts expected.\nMorgan Stanley CEO Ted Pick. (REUTERS/Jeenah Moon) (REUTERS / Reuters)\nThe stock rose nearly 1% Tuesday. As of late Monday, the stock was up nearly 13% since the beginning of January, trailing rises for some of its other big-bank rivals.\nOne challenge that emerged Tuesday was Morgan Stanley’s recent performance in wealth management, the business of providing financial advice to higher-net-worth individuals.\nNet new assets in that division fell 59% from a year ago and 62% from the last quarter, to $36.4 billion. Revenues were $6.79 billion, a 2% increase from a year ago but a 1.28% decrease from the last quarter.\nBoth measures were weaker than analysts expected.\n\"The firm delivered another strong quarter in an improving capital markets environment,\" Pick said in a press release.\n\"We continue to execute on our strategy and remain well positioned to deliver growth and long-term value for our shareholders.\"\nCorrection: A previous version of this article misstated Morgan Stanley's second quarter revenue. We regret the error.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanleys-Investment-Banking-Surge-Solidifies-Wall-Street-Dealmaking-Revival-143835560.Html", "Sentiment_Score": 0.9071925282, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-16T14:23:13.000Z", "Headline": "Why Morgan Stanley is this analyst's top banking pick", "Summary": "Big Banks have kicked off the second-quarter earnings season over the past couple of trading days, Bank of America (BAC) and Morgan Stanley (MS) being the latest financial institutions to report their results.\nBank of America shares are rising on its earnings beat while forecasting its net interest income (NII) to pick up in the fourth quarter of 2024. Topping overall earnings estimates, Morgan Stanley saw its wealth management segment miss net revenue estimates by $70 million.\nThe Morning Brief welcomes Argus Research director of financial services research Stephen Biggar to talk about how he is reacting to Morgan Stanley's quarterly results after naming it a top pick.\n\"A little bit light on the wealth management side for Morgan Stanley today, certainly offset by a terrific performance by investment banking, revenues up 51% there,\" Biggar says. \"So that's been kind of the story broadly with banks and what we expect going into the quarter that we'd have a much better backdrop and environment for investment banking.\"\nBiggar weighs in on the areas interest rate cuts by the Federal Reserve will benefit banks the most.\n\"Lower rates would be a benefit for banks both on the loan growth side — loan growth has been very anemic as high interest rates have curbed loan demand — and also taking some, some pressure off those deposit costs,\" Biggar explains to Yahoo Finance. \"So I think that's why banks are, well, they're very well hedged to whether rates go up or down.\"\nFor more expert insight and the latest market action, click here to watch this full episode of Morning Brief.\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Why-Morgan-Stanley-Analysts-Top-142313075.Html", "Sentiment_Score": 0.0191197414, "Sentiment_Category": "neutral"}, {"Ticker": "MS", "Time": "2024-07-16T13:51:10.000Z", "Headline": "Bank of America rises, Morgan Stanley falls on Q2 earnings", "Summary": "Bank of America (BAC) and Morgan Stanley (MS) both reported their second quarter results with shares of Bank of America moving to the upside in pre-market trading as it expects net interest income to rise in the fourth quarter. Shares of Morgan Stanley are falling in pre-market trading on Tuesday as the firm's wealth management net revenue missed estimates by $70 million.\nThe Morning Brief anchors Brad Smith and Seana Smith break down the latest earnings figures for these major banks and what it could mean for their stocks moving forward.\nFor more expert insight and the latest market action, click here to watch this full episode of Morning Brief.\nThis post was written by Nicholas Jacobino", "Link": "Https://Finance.Yahoo.Com/Video/Bank-America-Rises-Morgan-Stanley-135110984.Html", "Sentiment_Score": -0.7337567806, "Sentiment_Category": "bearish"}, {"Ticker": "MS", "Time": "2024-07-16T13:46:26.000Z", "Headline": "Morgan Stanley Traders, Bankers Top Estimates as Wealth Lags", "Summary": "(Bloomberg) -- Morgan Stanley’s traders joined the party across Wall Street in the second quarter even as the firm’s larger wealth business fell short of expectations.\nMost Read from Bloomberg\nBlackRock Says Gunman From Trump Rally Appeared in Firm’s Ad\nAmazon Sold a Used Diaper. It Tanked a Mom-and-Pop Business\nFrom Elon Musk to David Sacks, Silicon Valley’s Trump Backers Cheer Vance as VP Pick\nTrump Security Tightened on Iran Plot Intelligence, No Known Link to Rally Shooting\nTrump Shooting Changes Biden’s Plan to Revive 2024 Campaign\nThe bank’s trading business posted the biggest increase among its peers in the second quarter. Morgan Stanley, like its rivals Goldman Sachs Group Inc. and JPMorgan Chase & Co., beat expectations, solidifying the markets business as a hot spot across the industry. Investment-banking fees also increased, soaring 51% from a year earlier.\nStill, Morgan Stanley’s wealth unit, the firm’s biggest growth driver in recent years, fell short of expectations, with $6.79 billion in revenue. Net new assets in that business, a key metric for Morgan Stanley watchers, totaled $36.4 billion, short of the pace needed for the bank to reach its annual target, while net interest income slumped.\nMorgan Stanley is trying to rev up enthusiasm for its stock, which has underperformed all its major competitors this year, by persuading investors it can meet ambitious goals for its wealth-management machine. Meanwhile, the bank is fighting for its share of an investment-banking revival that has been a boon to Wall Street businesses.\nShares of Morgan Stanley declined 0.8% to $104.45 at 9:43 a.m. in New York. They’ve climbed 12% this year, well behind the pace set by the biggest US banks.\n“The market’s not always right in the short term,” Chief Financial Officer Sharon Yeshaya said in an interview, echoing her longtime former boss James Gorman. “I don’t know how one can apologize for an ROTCE for 17.5%,” she said, referring to the firm’s return on tangible common equity.\nYeshaya touted returns that were stronger than those of most competitors, and said that over time the stock will catch up with the earnings growth.\n‘Balanced Business’\n“We have both sides working,” she said, pointing to improvements in the firm’s money-management business as well as its Wall Street operations. “It’s really about the balanced business model.”\nOverall, Morgan Stanley posted $3.08 billion in net income for the quarter on $15 billion in revenue.\n“Seasonally softer net new asset growth and 3% quarter-over-quarter lower NII in wealth were the only real issues we saw,” Evercore ISI analyst Glenn Schorr wrote in a note to clients. “Our gut is tax season is mostly to blame and the rest of results were pretty darn good amidst this improving capital markets backdrop.”\nIn May, the bank said Gorman will cede his role as Morgan Stanley chairman at the end of the year. He had handed over the chief executive officer role to Ted Pick at the start of 2024.\nFixed-income trading was up 16% to $2 billion and the equity business climbed 18% to $3.02 billion. The combined gain outstripped the pace set at the other big US banks.\nThe firm earned $592 million in fees from advising on deals, while analysts had expected $523 million. Equity-underwriting fees came in at $352 million as a return of public listings and secondary offerings has raised banker hopes for a fuller reopening of those markets. Debt underwriting totaled $675 million.\n“Backlog continues to improve,” Yeshaya said. She also batted down the idea of the looming US election cutting into the revival in the dealmaking business. “There isn’t evidence that it stops deals from happening or changes the calendar all that much.”\nPretax margin in the wealth-management business, another closely watched metric, came in at 26.8% that was just behind estimates. The bank has said it’s goal is to lift that to 30%, and Yeshaya said that “we have steadily increased margin over the course of the quarter.”\nAcross its wealth- and investment-management units, the banks oversees about $7.2 trillion in assets and has said it’s working toward growing that to $10 trillion, a move that it has said will yield durable fee growth.\n(Updates with share price in fifth paragraph.)\nMost Read from Bloomberg Businessweek\nTop Takeaways From Businessweek’s Donald Trump Interview\nHere’s How to Create a Social Safety Net With Bipartisan Support\nWhy the Nobel-Laureate Pioneer of Microfinance Risks Life in Jail\nInterviewing Trump on His Plans for the US Economy\nHow Rivian Became the Anti-Tesla\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanley-Traders-Bankers-Beat-114837814.Html", "Sentiment_Score": -0.7394904494, "Sentiment_Category": "bearish"}, {"Ticker": "MS", "Time": "2024-07-16T13:20:00.000Z", "Headline": "Morgan Stanley (MS) Q2 Earnings Beat on Robust IB & Trading", "Summary": "Morgan Stanley’s MS second-quarter 2024 earnings of $1.82 per share handily outpaced the Zacks Consensus Estimate of $1.65. The bottom line also compared favorably with $1.24 per share reported in the prior-year quarter.\n\nShares of the company plunged more than 3% in the pre-market trading on subdued wealth management performance.\n\nLike Wall Street peers, Morgan Stanley’s investment banking (IB) business rebounded. Advisory fees surged 30% year over year. Further, underwriting fees witnessed solid momentum in the quarter. Specifically, equity underwriting income jumped 56% and fixed income underwriting income was up 71%. So, total IB fees (in the Institutional Securities division) grew 51% to $1.62 billion. We had projected it to be $1.24 billion.\n\nThe company also posted a solid trading performance. Equity trading revenues increased 18% year over year and fixed-income trading income was up 16%.\n\nLower provisions were another tailwind for Morgan Stanley.\n\nHowever, despite a 24% increase in interest income, the company’s net interest income (NII) witnessed modest growth due to higher interest expenses. Also, an increase in total non-interest expenses was a headwind.\n\nFurther, weakness in the wealth management business was a drag.\n\nNet income applicable to common shareholders (GAAP) was $2.94 billion, up 44% from the year-ago quarter. Our estimate for the metric was $2.26 billion.\nRevenues Up, Expenses Rise\nQuarterly net revenues were $15.02 billion, up 12% from the prior-year quarter. The top line beat the Zacks Consensus Estimate of $14.18 billion.\n\nNII was $2.07 billion, up 3%. We had projected NII of $1.83 billion.\n\nTotal non-interest revenues of $12.95 billion increased 13%. Our estimate for the metric was $12.11 billion.\n\nTotal non-interest expenses were $10.87 billion, up 4%. Our estimate for the metric was $10.34 billion.\n\nProvision for credit losses was $76 million, down 53% from the prior-year quarter.\nQuarterly Segment Performance\nInstitutional Securities: Pre-tax income was $2.05 billion, jumping 109% from the prior-year quarter. Our estimate for the same was $1.5 billion.\n\nNet revenues were $6.98 billion, up 23% year over year. The upside resulted from increased advisory fees, underwriting income and trading revenues. We had projected revenues of $6 billion.\n\nWealth Management: Pre-tax income totaled $1.82 billion, up 8% year over year. Our estimate for the metric was $1.89 billion.\n\nNet revenues were $6.79 billion, up 2%, driven by higher asset management revenues and transactional revenues. We had projected revenues of $6.78 billion.\n\nTotal client assets were $5.69 trillion as of Jun 30, 2024, up 16% year over year. We had projected the metric to be $5.41 trillion.\n\nInvestment Management: Pre-tax income was $222 million, jumping 31% from the year-ago quarter. Our estimate for the same was $276. million.\n\nNet revenues were $1.39 billion, up 8%. The improvement was largely attributable to a rise in asset management and related fees. We had projected revenues the same as the reported number.\n\nAs of Jun 30, 2024, total assets under management or supervision were $1.52 trillion, up 8% year over year. Our estimate for the metric was $1.5 trillion.\nCapital Position Solid\nAs of Jun 30, 2024, the book value per share was $56.80, up from $55.24 in the corresponding period of 2023. The tangible book value per share was $42.30, up from $40.79 as of Jun 30, 2023.\n\nMorgan Stanley’s Tier 1 capital ratio (advanced approach) was 17.1% compared with 17.8% in the year-ago quarter. The common equity Tier 1 capital ratio was 15.3%, down from 15.8% a year ago.\nShare Repurchase Update\nIn the reported quarter, Morgan Stanley repurchased 8 million shares for $750 million.\n\nAdditionally, the company reauthorized a multi-year repurchase program of up to $20 billion of shares without any expiration date.\nDividend Hike\nConcurrently, Morgan Stanley announced a quarterly cash dividend of 92.5 cents per share, marking an 8.8% hike from the prior payout. The dividend will be paid out on Aug 15 to shareholders on record as of Jul 31.\nOur View\nElevated expenses due to investments in franchises will likely continue to hurt Morgan Stanley’s profits. The challenging operating backdrop makes us apprehensive. Yet, the company’s increased focus on the wealth management business will likely keep aiding revenues. Further, a solid rebound in the IB business will act as a tailwind.\nMorgan Stanley Price, Consensus and EPS Surprise\nMorgan Stanley Price, Consensus and EPS Surprise\nMorgan Stanley price-consensus-eps-surprise-chart | Morgan Stanley Quote\nCurrently, Morgan Stanley carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nPerformance of Other Banks\nThe Goldman Sachs Group, Inc.’s GS second-quarter 2024 earnings per share of $8.62 surpassed the Zacks Consensus Estimate of $8.52. This compares favorably with $3.08 reported in the year-earlier quarter.\n\nResults benefited from the strength in Fixed Income, Currency and Commodities Client Execution financing revenues, IB and consumer banking business. Further, a decline in expenses and provisions acted as a tailwind for GS.\n\nCitigroup Inc.’s C second-quarter 2024 net income per share of $1.52 surpassed the Zacks Consensus Estimate of $1.40. The metric increased 14.3% from the year-ago quarter’s levels.\n\nC witnessed a rise in total loans in the quarter. The company’s total revenues rose, driven by solid IB business performance. However, deposits declined on a year-over-year basis.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\nMorgan Stanley (MS) : Free Stock Analysis Report\nCitigroup Inc. (C) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanley-Ms-Q2-Earnings-132000210.Html", "Sentiment_Score": 0.5041478872, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-16T13:17:42.000Z", "Headline": "Morgan Stanley Q2 Earnings: Higher Profits As Investment Banking Activity Rebounds, On Track To Reach $10T Client Assets", "Summary": "Morgan Stanley Q2 Earnings: Higher Profits As Investment Banking Activity Rebounds, On Track To Reach $10T Client Assets\nTuesday, Morgan Stanley (NYSE:MS) reported second-quarter EPS of $1.82, up from $1.24 a year ago and beating the consensus of $1.65.\nThe U.S. bank reported second-quarter sales of $15.02 billion, up 11.6% year over year, beating the consensus of $14.30 billion.\nThe sales were balanced across Wealth Management and Institutional Securities.\nCNBC noted that Morgan Stanley’s Wall Street-focused business model paid off this quarter. A rebound in trading and investment banking drove higher revenue in its institutional securities division than in its wealth management division, reversing the usual trend.\nInstitutional Securities reported net revenues of $6.98 billion compared with $5.7 billion a year ago, reflecting strong performance across the franchise, with strength in Equity, driven by higher client activity, and in Investment Banking on robust debt underwriting results.\nInvestment Banking revenues were up 51% from a year ago to $1.62 billion. Advisory revenues increased to $592 million due to the higher number of completed M&A transactions.\nEquity net revenues reached $3.02 billion, up 18% from a year ago. This reflects strong performance across business lines and regions, particularly in Asia, based on stronger client engagement and a constructive market environment.\nFixed-income trading revenue rose 16% to $1.99 billion. Provision for credit losses decreased on lower provisions on corporate loans compared to the prior-year quarter.\nWealth Management reported net revenues of $6.8 billion in the current quarter compared with $6.7 billion a year ago.\n“The firm delivered another strong quarter in an improving capital markets environment,” CEO Ted Pick said in the release. “We continue to execute on our strategy and remain well positioned to deliver growth and long-term value for our shareholders.”\nMorgan Stanley’s CFO on the company conference call said the bank is on track to reach a $10 trillion client asset target and that the Investment Banking business is in the early innings of recovery.\nPrice Action: At last check Tuesday, MS shares were down 2.92% at $102.19 during the premarket session.\nRead Next:\nJPMorgan Attracts Over $15B In Tax Strategy Business From Wealthy Clients As It Looks To Catch Up To Rivals: Report.\nImage Credits – Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Morgan Stanley Q2 Earnings: Higher Profits As Investment Banking Activity Rebounds, On Track To Reach $10T Client Assets originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanley-Q2-Earnings-Higher-131742837.Html", "Sentiment_Score": 0.8852306604, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-16T13:15:21.000Z", "Headline": "Bank earnings, June retail sales, Trump's VP pick: 3 Things", "Summary": "Bank of America (BAC) and Morgan Stanley (MS) are the latest major banks to report second-quarter earnings this week. Bank of America beat earnings estimates while reporting quarter-over-quarter and year-over-over declines in net interest income (NII). Morgan Stanley shares fall in pre-market trading after missing on revenue forecasts.\nJune retail sales data is out this morning, better than expected as overall sales stayed in place for the month when anticipated to fall by 0.3%.\nLastly, former President Donald Trump announced his vice presidential pick while at the Republican National Convention yesterday: Ohio Senator JD Vance (R-Oh.).\nFor more expert insight and the latest market action, click here to watch this full episode of Morning Brief.\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Bank-Earnings-June-Retail-Sales-131521473.Html", "Sentiment_Score": 0.0217823125, "Sentiment_Category": "neutral"}, {"Ticker": "MS", "Time": "2024-07-16T13:05:02.000Z", "Headline": "Morgan Stanley sees 41% profit jump, but wealth management teeters", "Summary": "Profit at Morgan Stanley jumped 41% in the second quarter, to $3.1 billion, from $2.2 billion a year earlier, the bank reported Tuesday.\nInvestment-banking fees, up 51% to $1.6 billion, drove some of the success.\nUnless there’s a recession, “I think you will see over the next number of quarters, and really over the next number of years, a resumption of more normalized [merger and acquisition] activity,” Morgan Stanley CEO Ted Pick said, according to the Financial Times.\nMorgan Stanley’s gains on fees mirror those of its investment-bank rivals. JPMorgan saw a 46% increase on that front in the second quarter. Citi’s fees jumped 60%. Goldman Sachs’s fees rose 21%.\n\"We're in the early stages of a multi-year investment banking-led cycle,\" Pick said, according to Reuters.\nCFO Sharon Yeshaya echoed that, saying Morgan Stanley’s investment-banking business is in the \"early innings of recovery.\"\n\"Investment banking pipelines are healthy and diverse, dialogs are active, and markets are open,\" she told analysts on the bank’s earnings call Tuesday.\nOverall, Morgan Stanley saw a 12% jump in revenue, to just over $15 billion. But, broken down by segment, disappointment — arguably — came from an area in which the bank is usually a powerhouse.\nRevenue at Morgan Stanley’s wealth management unit grew 2%, to $6.8 billion, in the second quarter — down from 16% a year earlier. The bank reported $36.4 billion in net new assets — far below the $89.5 billion Morgan Stanley drew in 2023’s second quarter. Wall Street, too, had expected more — roughly $57.5 billion.\nCombined with totals from the first quarter, Morgan Stanley has generated its lowest net new assets in wealth across the first half of any year since 2020, the Financial Times reported.\nYeshaya jumped to the bank’s defense. “We have both sides working,” she said of wealth and investment banking.\n“It’s really about the balanced business model,” Yeshaya said, according to Bloomberg. “I don’t know how one can apologize for [a return on tangible common equity of] 17.5%.”\nWithin wealth management, interest income fell 17% from a year earlier to $1.79 billion.\nYeshaya said higher client tax payments during the quarter — the tax deadline for U.S. customers was in April — served as a disruptor for the bank.\n“We believe both tax-related outflows and increased spending, particularly among high-net-worth clients, impacted flows this quarter,” Yeshaya told analysts. \nElsewhere, fixed-income trading jumped 16% to $2 billion, and the equity business as a whole rose 18% to just over $3 billion.\nMorgan Stanley earned $592 million in fees from advising on deals, a 30% increase. The bank notched $352 million in equity underwriting fees — a 56% jump — as initial public offerings and private stock sales saw a comeback.\nDebt underwriting increased 71% to $675 million.\n\"We saw fast growth in non-investment-grade issues,\" Yeshaya said.\nThis story was originally published on Banking Dive. To receive daily news and insights, subscribe to our free daily Banking Dive newsletter.", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanley-Sees-41-Profit-130502299.Html", "Sentiment_Score": -0.5221598148, "Sentiment_Category": "bearish"}, {"Ticker": "MS", "Time": "2024-07-16T12:40:04.000Z", "Headline": "Morgan Stanley (MS) Q2 Earnings and Revenues Surpass Estimates", "Summary": "Morgan Stanley (MS) came out with quarterly earnings of $1.82 per share, beating the Zacks Consensus Estimate of $1.65 per share. This compares to earnings of $1.24 per share a year ago. These figures are adjusted for non-recurring items.\nThis quarterly report represents an earnings surprise of 10.30%. A quarter ago, it was expected that this investment bank would post earnings of $1.69 per share when it actually produced earnings of $2.02, delivering a surprise of 19.53%.\nOver the last four quarters, the company has surpassed consensus EPS estimates four times.\nMorgan Stanley , which belongs to the Zacks Financial - Investment Bank industry, posted revenues of $15.02 billion for the quarter ended June 2024, surpassing the Zacks Consensus Estimate by 5.95%. This compares to year-ago revenues of $13.46 billion. The company has topped consensus revenue estimates four times over the last four quarters.\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\nMorgan Stanley shares have added about 12.9% since the beginning of the year versus the S&P 500's gain of 18.1%.\nWhat's Next for Morgan Stanley?\nWhile Morgan Stanley has underperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\nAhead of this earnings release, the estimate revisions trend for Morgan Stanley: mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\nIt will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $1.61 on $14.15 billion in revenues for the coming quarter and $6.75 on $57.77 billion in revenues for the current fiscal year.\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Financial - Investment Bank is currently in the top 38% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\nBGC Group (BGC), another stock in the same industry, has yet to report results for the quarter ended June 2024. The results are expected to be released on July 30.\nThis brokerage company is expected to post quarterly earnings of $0.23 per share in its upcoming report, which represents a year-over-year change of +15%. The consensus EPS estimate for the quarter has remained unchanged over the last 30 days.\nBGC Group's revenues are expected to be $545 million, up 10.5% from the year-ago quarter.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMorgan Stanley (MS) : Free Stock Analysis Report\nBGC Group, Inc. (BGC) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanley-Ms-Q2-Earnings-124004726.Html", "Sentiment_Score": 0.8153355122, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-16T20:44:31.000Z", "Headline": "Bank of America leans on Wall Street as high rates pose challenges to Main Street operations", "Summary": "Second quarter profits at Bank of America (BAC) fell 7% from a year ago as its consumer operations wrestled with higher interest rates, but it was able to churn out more investment banking fees and trading revenue.\nThe divergence between the businesses at Bank of America that serve Main Street and Wall Street reinforced a dominant trend this earnings season for the nation’s biggest financial institutions.\nHigher interest rates and elevated deposit costs are eating away at more traditional consumer banking margins, forcing giant banks to lean more heavily on their trading and investment banking as dealmaking shows new signs of life.\n\"The strength and earnings power of our leading consumer banking business is complemented by the growth and profitability of our global Markets, global banking, and wealth management businesses,\" said Bank of America CEO Brian Moynihan.\nBank of America Chairman and CEO Brian Moynihan. (REUTERS/Elizabeth Frantz) (REUTERS / Reuters)\nBank of America’s net income fell to $6.89 billion, which was slightly better than expectations, while rising 3% from the first quarter. Its total revenue of $25.37 billion rose slightly from a year ago.\nA key measure of lending revenue known as net interest income fell more than 3% from a year ago and more than 2% from the previous quarter, to $13.70 billion.\nThis margin — which measures the difference a bank earns by making loans and paying out depositors — has been tightening at many big banks due to higher rates and elevated funding costs.\nThis same measure also fell sequentially at JPMorgan Chase (JPM), Wells Fargo (WFC), and Citigroup (C) as their customers continued migrating to higher-yielding deposit products like CDs.\nThere were other signs of challenges for Bank of America and its consumer borrowers. It set aside more money for future loan losses when compared with a year ago, a sign that it expects credit conditions to worsen.\nIts credit card charge-offs more than doubled from a year earlier and more than 6% from the last quarter, another signal that more of its customers are having trouble paying down their bills. However, the pace of delinquencies slowed.\n\"Delinquencies have plateaued for the second consecutive quarter. This should lead to stabilized net credit losses in credit card in the second half of the year,\" Moynihan told analysts.\nBut there were some bright spots. Bank of America expects net interest income to rise later this year as the Federal Reserve starts to lower interest rates and the bank replaces under-earning bonds and fixed-rate loans with higher-yielding assets.\nIt said it expected fourth quarter net interest income to be $600 million higher than its second quarter figure.\nAnd its Wall Street operations really stood out. Investment banking fees jumped 28% from a year ago while its equities trading rose nearly 20%.\n\"The fundamental trends have been strong capital markets and weak net interest income,\" Portales Partners founder Charlie Peabody told Yahoo Finance Monday, referring to the trends of bank earnings season thus far.\n\"The question is if that spread income is going to reflect positively in the second half of the year.\"\nInvestment banking fees and trading revenue also jumped at JPMorgan Chase, Citigroup, Wells Fargo, and Goldman Sachs.\nBank of America's stock rose more than 5% Tuesday. As of Monday night it was up 20% so far this year.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance", "Link": "Https://Finance.Yahoo.Com/News/Bank-Of-America-Leans-On-Wall-Street-As-High-Rates-Pose-Challenges-To-Main-Street-Operations-122457107.Html", "Sentiment_Score": 0.5517465472, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-16T11:41:00.000Z", "Headline": "Morgan Stanley's Profit Jumps Over 40%", "Summary": "Morgan Stanley reported its second-quarter earnings. Here are the highlights: + Profit increased 41% from a year earlier to $3.08 billion. + Revenue was $15 billion, up 12% from a year earlier . + Investment banking revenue rose 51% from a year earlier to $1.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/Bd95D4Bd-2281-3B63-8273-Ca101E894823/Morgan-Stanley-S-Profit-Jumps.Html", "Sentiment_Score": 0.7351484299, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-16T16:32:28.000Z", "Headline": "Morgan Stanley profit surges on investment banking, trading, while wealth lags", "Summary": "By Tatiana Bautzer and Manya Saini\n(Reuters) -Morgan Stanley's second-quarter profit beat expectations on Tuesday, driven by a surge in investment banking and trading revenues that overcame muted results in wealth management.\nThe bank joined other Wall Street lenders, including Bank of America and JPMorgan in reporting higher investment banking revenue, fueled by growing confidence in the U.S. economy that prompted companies to raise more money and strike deals.\nMorgan Stanley shares rose almost 2%, reversing earlier losses, as CEO Ted Pick expressed confidence in its dealmaking prospects. He said the bank is on track to reaching its goal of a 30% pre-tax margin in the wealth business, a key performance target.\nInstitutional securities revenue grew 23% in the quarter to $7 billion, buoyed by investment banking revenue, which soared 51% to $1.62 billion.\n\"We're in the early stages of a multi-year investment banking-led cycle,\" Pick told analysts on a conference call.\nChief Financial Officer Sharon Yeshaya reinforced his view, saying \"pipelines are healthy and diverse, dialogs are active, and markets are open.\"\nEquity underwriting revenue jumped 56% to $352 million, driven by a rebound in initial public offerings and private stock sales, while fixed income underwriting surged 71% to $675 million.\nAdvisory revenues climbed 30% to $592 million as the company closed more deals.\nPick was optimistic about Morgan Stanley's equity trading business, citing a key milestone of revenue exceeding $3 billion, growing 18% from a year earlier.\nThe company is investing in trading in Asia and the UK, he said, adding that macroeconomic and geopolitical uncertainties are creating opportunities for clients.\nRevenue growth in wealth management slowed to 2% in the second quarter, compared with a 16% jump a year earlier. Net new assets came in at $36.4 billion, below last year's $89.5 billion.\nNet income rose to $3.1 billion, or $1.82 per share, in the three months ended June 30, from $2.2 billion, or $1.24 per share, a year earlier. Analysts on average had expected $1.65, according to LSEG.\nMorgan Stanley said it would raise its quarterly dividend to $0.925 per share, up 7.5 cents. Dividend payments were the bank's highest-priority use of capital, Pick said.\nAnalysts were generally upbeat on the results, although some underscored weaker growth in wealth.\n“Morgan Stanley’s strong Q2 results were primarily driven by an industry-wide rebound in investment banking activity, while wealth and asset management remained steady contributors on the back of a robust equities market,\" said Mike Taiano, senior analyst at Moody’s Ratings.\nThe earnings were a \"tale of two segments,\" with impressive results in institutional securities offset by a mixed performance in wealth, UBS analyst Brennan Hawken wrote.\nWEALTH MANAGEMENT SLOWS\nWealth management flourished under Morgan Stanley's former CEO James Gorman, generating stable revenue from fees when markets were volatile. He set a target of managing $10 trillion in client assets, which stood at $7.2 trillion in the second quarter.\nMorgan Stanley executives told analysts the wealth unit is growing within the bank's expected range of 5% to 7% annually, even as net asset inflows slowed.\nWhile the bank is not considering acquisitions in the short term, it could consider opportunities in two to four years, Pick said.\nGoldman Sachs, JPMorgan Chase and Citi also reported robust investment banking revenue.\n(Reporting by Manya Saini in Bengaluru and Tatiana Bautzer in New York; editing by Lananh Nguyen, Devika Syamnath and Rod Nickel)", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanleys-Profit-Jumps-Investment-113258891.Html", "Sentiment_Score": -0.8537629247, "Sentiment_Category": "bearish"}, {"Ticker": "MS", "Time": "2024-07-16T11:32:03.000Z", "Headline": "Midday movers: Bank of America, Match rise; Charles Schwab falls", "Summary": "(Updated - July 16, 2024 11:28 AM EDT)\nInvesting.com -- U.S. stock futures were mixed Tuesday, with the Dow and S&P 500 gaining, while Nasdaq treaded water as investors shied away from megacap tech stocks.\nHere are some of the biggest U.S. stock movers today:\nBank of America (BAC) stock rose 5% after the lender reported second-quarter revenue and profit topping expectations on rising investment banking and asset management fees.\nMorgan Stanley (MS) stock rose 2.6% after the investment bank reported its profit rose in the second quarter with investment banking activity rebounding, as some of its peers had outperformed.\nCharles Schwab (NYSE:SCHW) (SCHW) stock fell 7.3% after the financial services company reported results largely in line with expectations, failing to beat guidance like many of its peers.\nTesla (NASDAQ:TSLA) stock rose 0.1% after a report CEO Elon Musk planned to commit around $45 million a month to a new pro-Trump super political action committee.\nMatch (MTCH) stock rose 8% following a report activist investor Starboard has a stake of more than 6.5% in the Tinder owner and was pushing for a possible sale if a turnaround wasn't successful.\nTrump Media&Technology (DJT) stock fell 9.1%, pulling back after closing up 31% a day earlier amid a broader rally in the so-called Trump trade across markets.\nUnitedHealth (NYSE:UNH) stock rose 6% despite the health insurer raising its estimates for a hit to earnings this year from a February hack at its tech unit, as it rolls out loans to healthcare providers and records higher expenses from notifying affected customers.\nPalantir Technologies (NYSE:PLTR) stock fell 1% after analysts downgraded its investment stance on the big data analytics software maker to ‘underperform’ from ‘neutral’, saying its rich valuation is becoming “hard to justify.”\nShopify (NYSE:SHOP) stock rose 7.6% after analysts upgraded its stance on the e-commerce platform to ‘buy’ from ‘neutral’, saying the “company has turned a corner on balanced growth and margin, under new CFO Jeff Hoffmeister.”\nStarbucks (NASDAQ:SBUX) stock rose 1% despite analysts downgrading the coffee chain to ‘in line’ from ‘outperform’, saying soft trends are continuing.\nNVIDIA (NASDAQ:NVDA) and AMD (NASDAQ:AMD) were down 1.6% and 2.4%, respectively, as investors sold high-flying, megacap tech stocks in favor of small caps names, with iShares Russell 2000 ETF (IWM) rising 2.3%.\n\nAdditional reporting by Louis Juricic\nRelated Articles\nMidday movers: Bank of America, Match rise; Charles Schwab falls\nPro Research: Wall Street dives into Boeing's flight path\nUnitedHealth expects bigger hit to profit from tech unit hack", "Link": "Https://Finance.Yahoo.Com/News/Bank-America-Tesla-Match-Rise-080849436.Html", "Sentiment_Score": 0.4495038688, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-16T11:30:00.000Z", "Headline": "Morgan Stanley Second Quarter 2024 Earnings Results", "Summary": "Morgan Stanley Reports Net Revenues of $15.0 Billion, EPS of $1.82 and ROTCE of 17.5%\nNEW YORK, July 16, 2024--(BUSINESS WIRE)--Morgan Stanley (NYSE: MS) today reported net revenues of $15.0 billion for the second quarter ended June 30, 2024 compared with $13.5 billion a year ago. Net income applicable to Morgan Stanley was $3.1 billion, or $1.82 per diluted share,1 compared with net income of $2.2 billion, or $1.24 per diluted share,1 for the same period a year ago.\nTed Pick, Chief Executive Officer, said, \"The Firm delivered another strong quarter in an improving capital markets environment, resulting in first half 2024 revenues of $30.2 billion, EPS of $3.85 and an ROTCE of 18.6%. Total client assets grew to $7.2 trillion on our road to $10+ trillion. We announced an increase of our quarterly common stock dividend to $0.925 per share while maintaining robust capital levels with a CET1 ratio of 15.2%, reflecting the durability of our business model. We continue to execute on our strategy and remain well positioned to deliver growth and long-term value for our shareholders.\"\nFinancial Summary2,3\nFirm ($ millions, except per share data)\n2Q 2024\n2Q 2023\nHighlights\nNet revenues for the second quarter were $15.0 billion, balanced across Wealth Management and Institutional Securities.\nThe Firm delivered ROTCE of 17.5%.2,4\nThe Firm expense efficiency ratio was 72% for both the second quarter and the first half of the year benefiting from our scale and intentional expense management.3,8\nDuring the quarter, the Firm accreted $1.5 billion of Common Equity Tier 1 capital while supporting our clients and executing capital actions, and ended the quarter with a Standardized Common Equity Tier 1 capital ratio of 15.2%.16\nNet revenues\n$15,019\n$13,457\nProvision for credit losses\n$76\n$161\nCompensation expense\n$6,460\n$6,262\nNon-compensation expenses\n$4,409\n$4,222\nPre-tax income6\n$4,074\n$2,812\nNet income app. to MS\n$3,076\n$2,182\nExpense efficiency ratio8\n72%\n78%\nEarnings per diluted share1\n$1.82\n$1.24\nBook value per share\n$56.80\n$55.24\nTangible book value per share4\n$42.30\n$40.79\nReturn on equity\n13.0%\n8.9%\nReturn on tangible common equity4\n17.5%\n12.1%\nInstitutional Securities\nInstitutional Securities net revenues of $7.0 billion reflect strong performance across the franchise, with notable strength in Equity, driven by higher client activity, and in Investment Banking on robust debt underwriting results.\nNet revenues\n$6,982\n$5,654\nInvestment Banking\n$1,619\n$1,075\nEquity\n$3,018\n$2,548\nFixed Income\n$1,999\n$1,716\nWealth Management\nWealth Management delivered a pre-tax margin of 26.8% for the quarter.7 Net revenues were $6.8 billion on record asset management revenues driven by cumulative fee-based asset flows and a positive market environment. Fee-based asset flows were $26 billion for the quarter and $52 billion for the first half of the year.10 The business added net new assets of $36 billion in the quarter and $131 billion in the first half of the year.11\nNet revenues\n$6,792\n$6,660\nFee-based client assets ($ billions)9\n$2,188\n$1,856\nFee-based asset flows ($ billions)10\n$26.0\n$22.7\nNet new assets ($ billions)11\n$36.4\n$89.5\nLoans ($ billions)\n$150.9\n$144.7\nInvestment Management\nInvestment Management results reflect net revenues of $1.4 billion, primarily driven by increased asset management revenues on higher long-term average AUM.12\nNet revenues\n$1,386\n$1,281\nAUM ($ billions)12\n$1,518\n$1,412\nLong-term net flows ($ billions)13\n$(1.2)\n$1.1\nSecond Quarter Results\nInstitutional Securities\nInstitutional Securities reported net revenues for the current quarter of $7.0 billion compared with $5.7 billion a year ago. Pre-tax income was $2.0 billion compared with $1.0 billion a year ago.6\nInvestment Banking revenues up 51% from a year ago:\nAdvisory revenues increased from a year ago on higher completed M&A transactions.\nEquity underwriting revenues increased from a year ago driven by private placements and higher revenues in IPOs and convertible offerings.\nFixed income underwriting revenues increased significantly from a year ago primarily driven by higher non-investment grade issuances.\nEquity net revenues up 18% from a year ago:\nEquity net revenues increased from a year ago reflecting strong performance across business lines and regions, particularly in Asia, on stronger client engagement and a constructive market environment.\nFixed Income net revenues up 16% from a year ago:\nFixed Income net revenues increased from a year ago driven by higher results in credit reflecting strong financing revenues and in foreign exchange on higher client engagement.\nOther:\nOther revenues for the quarter increased from a year ago primarily driven by higher net interest income and fees and lower mark-to-market losses on corporate loans, inclusive of loan hedges.\n($ millions)\n2Q 2024\n2Q 2023\nNet Revenues\n$6,982\n$5,654\nInvestment Banking\n$1,619\n$1,075\nAdvisory\n$592\n$455\nEquity underwriting\n$352\n$225\nFixed income underwriting\n$675\n$395\nEquity\n$3,018\n$2,548\nFixed Income\n$1,999\n$1,716\nOther\n$346\n$315\nProvision for credit losses\n$54\n$97\nTotal Expenses\n$4,882\n$4,580\nCompensation\n$2,291\n$2,215\nNon-compensation\n$2,591\n$2,365\nProvision for credit losses:\nProvision for credit losses decreased on lower provisions on corporate loans compared to the prior year quarter.\nTotal Expenses:\nCompensation expense increased from a year ago on higher revenues, partially offset by lower severance costs.\nNon-compensation expenses increased from a year ago on higher execution-related expenses.\nWealth Management\nWealth Management reported net revenues of $6.8 billion in the current quarter compared with $6.7 billion a year ago. Pre-tax income of $1.8 billion6 in the current quarter resulted in a pre-tax margin of 26.8%.7\nNet revenues up 2% from a year ago:\nRecord asset management revenues reflect higher asset levels from a year ago and the cumulative impact of positive fee-based flows.\nTransactional revenues increased 5% excluding the impact of mark-to-market on investments associated with DCP.5,14 The increase was primarily driven by higher equity related transactions.\nNet interest income decreased from a year ago on lower average sweep deposits reflecting the cumulative effect of cash redeployments by clients in a higher interest rate environment.\nProvision for credit losses:\nProvision for credit losses decreased on lower provisions in the commercial real estate sector compared to the prior year quarter.\nTotal Expenses:\nCompensation expense increased from a year ago on higher compensable revenues, partially offset by lower expenses related to DCP and lower severance costs.\nNon-compensation expenses decreased from a year ago on lower professional services and the absence of integration-related expenses in the current quarter.\n($ millions)\n2Q 2024\n2Q 2023\nNet Revenues\n$6,792\n$6,660\nAsset management\n$3,989\n$3,452\nTransactional14\n$782\n$869\nNet interest\n$1,798\n$2,156\nOther\n$223\n$183\nProvision for credit losses\n$22\n$64\nTotal Expenses\n$4,949\n$4,915\nCompensation\n$3,601\n$3,503\nNon-compensation\n$1,348\n$1,412\nInvestment Management\nInvestment Management net revenues were $1.4 billion compared with $1.3 billion a year ago. Pre-tax income was $222 million compared with $170 million a year ago.6\nNet revenues up 8% from a year ago:\nAsset management and related fees increased from a year ago on higher average AUM driven by higher market levels.\nPerformance-based income and other revenues increased from a year ago primarily due to higher accrued carried interest in our private funds, partially offset by mark-to-market losses on investments associated with DCP versus gains in the prior year.\nTotal Expenses:\nCompensation expense increased from a year ago on higher compensation associated with carried interest.\nNon-compensation expenses increased from a year ago, primarily driven by continued investments in technology and infrastructure to support business growth.\n($ millions)\n2Q 2024\n2Q 2023\nNet Revenues\n$1,386\n$1,281\nAsset management and related fees\n$1,342\n$1,268\nPerformance-based income and other\n$44\n$13\nTotal Expenses\n$1,164\n$1,111\nCompensation\n$568\n$544\nNon-compensation\n$596\n$567\nOther Matters\nThe Firm repurchased $0.8 billion of its outstanding common stock during the quarter as part of its Share Repurchase Program.\nThe Firm reauthorized a multi-year repurchase program of up to $20 billion of outstanding common stock without a set expiration date.\nThe Board of Directors declared a $0.925 quarterly dividend per share, an increase of 7.5 cents, payable on August 15, 2024 to common shareholders of record on July 31, 2024.\nThe effective tax rate for the current quarter was 23.5%.\n2Q 2024\n2Q 2023\nCommon Stock Repurchases\nRepurchases ($MM)\n$750\n$1,000\nNumber of Shares (MM)\n8\n12\nAverage Price\n$95.96\n$83.86\nPeriod End Shares (MM)\n1,619\n1,659\nTax Rate\n23.5%\n21.0%\nCapital15\nStandardized Approach\nCET1 capital16\n15.2%\n15.5%\nTier 1 capital16\n17.0%\n17.4%\nAdvanced Approach\nCET1 capital16\n15.3%\n15.8%\nTier 1 capital16\n17.1%\n17.8%\nLeverage-based capital\nTier 1 leverage17\n6.8%\n6.7%\nSLR18\n5.5%\n5.5%\nMorgan Stanley (NYSE: MS) is a leading global financial services firm providing a wide range of investment banking, securities, wealth management and investment management services. With offices in 42 countries, the Firm’s employees serve clients worldwide including corporations, governments, institutions and individuals. For further information about Morgan Stanley, please visit www.morganstanley.com.\nA financial summary follows. Financial, statistical and business-related information, as well as information regarding business and segment trends, is included in the financial supplement. Both the earnings release and the financial supplement are available online in the Investor Relations section at www.morganstanley.com.\nNOTICE:\nThe information provided herein and in the financial supplement, including information provided on the Firm’s earnings conference calls, may include certain non-GAAP financial measures. The definition of such measures or reconciliation of such measures to the comparable U.S. GAAP figures are included in this earnings release and the financial supplement, both of which are available on www.morganstanley.com.\nThis earnings release may contain forward-looking statements, including the attainment of certain financial and other targets, objectives and goals. Readers are cautioned not to place undue reliance on forward-looking statements, which speak only as of the date on which they are made, which reflect management’s current estimates, projections, expectations, assumptions, interpretations or beliefs and which are subject to risks and uncertainties that may cause actual results to differ materially. For a discussion of risks and uncertainties that may affect the future results of the Firm, please see \"Forward-Looking Statements\" preceding Part I, Item 1, \"Competition\" and \"Supervision and Regulation\" in Part I, Item 1, \"Risk Factors\" in Part I, Item 1A, \"Legal Proceedings\" in Part I, Item 3, \"Management’s Discussion and Analysis of Financial Condition and Results of Operations\" in Part II, Item 7 and \"Quantitative and Qualitative Disclosures about Risk\" in Part II, Item 7A in the Firm’s Annual Report on Form 10-K for the year ended December 31, 2023 and other items throughout the Form 10-K, the Firm’s Quarterly Reports on Form 10-Q and the Firm’s Current Reports on Form 8-K, including any amendments thereto.\n1 Includes preferred dividends related to the calculation of earnings per share for the second quarter of 2024 and 2023 of approximately $134 million and $133 million, respectively.\n2 The Firm prepares its Consolidated Financial Statements using accounting principles generally accepted in the United States (U.S. GAAP). From time to time, Morgan Stanley may disclose certain \"non-GAAP financial measures\" in the course of its earnings releases, earnings conference calls, financial presentations and otherwise. The Securities and Exchange Commission defines a \"non-GAAP financial measure\" as a numerical measure of historical or future financial performance, financial position, or cash flows that is subject to adjustments that effectively exclude, or include amounts from the most directly comparable measure calculated and presented in accordance with U.S. GAAP. Non-GAAP financial measures disclosed by Morgan Stanley are provided as additional information to analysts, investors and other stakeholders in order to provide them with greater transparency about, or an alternative method for assessing our financial condition, operating results, or capital adequacy. These measures are not in accordance with, or a substitute for U.S. GAAP, and may be different from or inconsistent with non-GAAP financial measures used by other companies. Whenever we refer to a non-GAAP financial measure, we will also generally define it or present the most directly comparable financial measure calculated and presented in accordance with U.S. GAAP, along with a reconciliation of the differences between the non-GAAP financial measure we reference and such comparable U.S. GAAP financial measure.\n3 Our earnings releases, earnings conference calls, financial presentations and other communications may also include certain metrics which we believe to be useful to us, analysts, investors, and other stakeholders by providing further transparency about, or an additional means of assessing, our financial condition and operating results.\n4 Tangible common equity is a non-GAAP financial measure that the Firm considers useful for analysts, investors and other stakeholders to allow comparability of period-to-period operating performance and capital adequacy. Tangible common equity represents common equity less goodwill and intangible assets net of allowable mortgage servicing rights deduction. The calculation of return on average tangible common equity, also a non-GAAP financial measure, represents full year or annualized net income applicable to Morgan Stanley less preferred dividends as a percentage of average tangible common equity. The calculation of tangible book value per common share, also a non-GAAP financial measure, represents tangible common shareholder’s equity divided by common shares outstanding.\n5 \"DCP\" refers to certain employee deferred cash-based compensation programs. Please refer to \"Management’s Discussion and Analysis of Financial Condition and Results of Operations – Other Matters – Deferred Cash-Based Compensation\" in the Firm’s Annual Report on Form 10-K for the year ended December 31, 2023.\n6 Pre-tax income represents income before provision for income taxes.\n7 Pre-tax margin represents income before provision for income taxes divided by net revenues.\n8 The expense efficiency ratio represents total non-interest expenses as a percentage of net revenues.\n9 Wealth Management fee-based client assets represent the amount of assets in client accounts where the basis of payment for services is a fee calculated on those assets.\n10 Wealth Management fee-based asset flows include net new fee-based assets (including asset acquisitions), net account transfers, dividends, interest, and client fees, and exclude institutional cash management related activity.\n11 Wealth Management net new assets represent client asset inflows, inclusive of interest, dividends and asset acquisitions, less client asset outflows, and exclude the impact of business combinations/divestitures and the impact of fees and commissions.\n12 AUM is defined as assets under management or supervision.\n13 Long-term net flows include the Equity, Fixed Income and Alternative and Solutions asset classes and excludes the Liquidity and Overlay Services asset class.\n14 Transactional revenues include investment banking, trading, and commissions and fee revenues.\n15 Capital ratios are estimates as of the press release date, July 16, 2024.\n16 CET1 capital is defined as Common Equity Tier 1 capital. The Firm’s risk-based capital ratios are computed under each of the (i) standardized approaches for calculating credit risk and market risk risk-weighted assets (RWAs) (the \"Standardized Approach\") and (ii) applicable advanced approaches for calculating credit risk, market risk and operational risk RWAs (the \"Advanced Approach\"). For information on the calculation of regulatory capital and ratios, and associated regulatory requirements, please refer to \"Management’s Discussion and Analysis of Financial Condition and Results of Operations – Liquidity and Capital Resources – Regulatory Requirements\" in the Firm’s Annual Report on Form 10-K for the year ended December 31, 2023.\n17 The Tier 1 leverage ratio is a leverage-based capital requirement that measures the Firm’s leverage. Tier 1 leverage ratio utilizes Tier 1 capital as the numerator and average adjusted assets as the denominator.\n18 The Firm’s supplementary leverage ratio (SLR) utilizes a Tier 1 capital numerator of approximately $80.5 billion and $78.4 billion, and supplementary leverage exposure denominator of approximately $1.47 trillion and $1.42 trillion, for the second quarter of 2024 and 2023, respectively.\nConsolidated Income Statement Information\n(unaudited, dollars in millions)\nQuarter Ended\nPercentage Change From:\nSix Months Ended\nPercentage\nChange\nJun 30, 2024\nMar 31, 2024\nJun 30, 2023\nMar 31, 2024\nJun 30, 2023\nJun 30, 2024\nJun 30, 2023\nRevenues:\nInvestment banking\n$\n1,735\n$\n1,589\n$\n1,155\n9\n%\n50\n%\n$\n3,324\n$\n2,485\n34\n%\nTrading\n4,131\n4,852\n3,802\n(15\n%)\n9\n%\n8,983\n8,279\n9\n%\nInvestments\n157\n137\n95\n15\n%\n65\n%\n294\n240\n23\n%\nCommissions and fees\n1,183\n1,227\n1,090\n(4\n%)\n9\n%\n2,410\n2,329\n3\n%\nAsset management\n5,424\n5,269\n4,817\n3\n%\n13\n%\n10,693\n9,545\n12\n%\nOther\n322\n266\n488\n21\n%\n(34\n%)\n588\n740\n(21\n%)\nTotal non-interest revenues\n12,952\n13,340\n11,447\n(3\n%)\n13\n%\n26,292\n23,618\n11\n%\nInterest income\n13,529\n12,930\n10,913\n5\n%\n24\n%\n26,459\n20,893\n27\n%\nInterest expense\n11,462\n11,134\n8,903\n3\n%\n29\n%\n22,596\n16,537\n37\n%\nNet interest\n2,067\n1,796\n2,010\n15\n%\n3\n%\n3,863\n4,356\n(11\n%)\nNet revenues\n15,019\n15,136\n13,457\n(1\n%)\n12\n%\n30,155\n27,974\n8\n%\nProvision for credit losses\n76\n(6\n)\n161\n*\n(53\n%)\n70\n395\n(82\n%)\nNon-interest expenses:\nCompensation and benefits\n6,460\n6,696\n6,262\n(4\n%)\n3\n%\n13,156\n12,672\n4\n%\nNon-compensation expenses:\nBrokerage, clearing and exchange fees\n995\n921\n875\n8\n%\n14\n%\n1,916\n1,756\n9\n%\nInformation processing and communications\n1,011\n976\n926\n4\n%\n9\n%\n1,987\n1,841\n8\n%\nProfessional services\n753\n639\n767\n18\n%\n(2\n%)\n1,392\n1,477\n(6\n%)\nOccupancy and equipment\n464\n441\n471\n5\n%\n(1\n%)\n905\n911\n(1\n%)\nMarketing and business development\n245\n217\n236\n13\n%\n4\n%\n462\n483\n(4\n%)\nOther\n941\n857\n947\n10\n%\n(1\n%)\n1,798\n1,867\n(4\n%)\nTotal non-compensation expenses\n4,409\n4,051\n4,222\n9\n%\n4\n%\n8,460\n8,335\n1\n%\nTotal non-interest expenses\n10,869\n10,747\n10,484\n1\n%\n4\n%\n21,616\n21,007\n3\n%\nIncome before provision for income taxes\n4,074\n4,395\n2,812\n(7\n%)\n45\n%\n8,469\n6,572\n29\n%\nProvision for income taxes\n957\n933\n591\n3\n%\n62\n%\n1,890\n1,318\n43\n%\nNet income\n$\n3,117\n$\n3,462\n$\n2,221\n(10\n%)\n40\n%\n$\n6,579\n$\n5,254\n25\n%\nNet income applicable to nonredeemable noncontrolling interests\n41\n50\n39\n(18\n%)\n5\n%\n91\n92\n(1\n%)\nNet income applicable to Morgan Stanley\n3,076\n3,412\n2,182\n(10\n%)\n41\n%\n6,488\n5,162\n26\n%\nPreferred stock dividend\n134\n146\n133\n(8\n%)\n1\n%\n280\n277\n1\n%\nEarnings applicable to Morgan Stanley common shareholders\n$\n2,942\n$\n3,266\n$\n2,049\n(10\n%)\n44\n%\n$\n6,208\n$\n4,885\n27\n%\nNotes:\n–\nIn the first quarter of 2024, the Firm implemented certain presentation changes that impacted interest income and interest expense but had no effect on net interest income. These changes were made to align the accounting treatment between the balance sheet and the related interest income or expense, primarily by offsetting interest income and expense for certain prime brokerage-related customer receivables and payables that are currently accounted for as a single unit of account on the balance sheet. The current and previous presentation of these interest income and interest expense amounts are acceptable and the change does not represent a change in accounting principle. These changes were applied retrospectively to the income statement in 2023 and accordingly, prior period amounts were adjusted to conform with the current presentation.\n–\nFirm net revenues excluding mark-to-market gains and losses on deferred cash-based compensation plans (DCP) were: 2Q24: $15,073 million, 1Q24: $14,949 million, 2Q23: $13,343 million, 2Q24 YTD: $30,022 million, 2Q23 YTD: $27,707 million.\n–\nFirm compensation expenses excluding DCP were: 2Q24: $6,405 million, 1Q24: $6,447 million, 2Q23: $6,084 million, 2Q24 YTD: $12,852 million, 2Q23 YTD: $12,301 million.\n–\nThe End Notes are an integral part of this presentation. Refer to pages 12 - 17 of the Financial Supplement for Definition of U.S. GAAP to Non-GAAP Measures, Definitions of Performance Metrics and Terms, Supplemental Quantitative Details and Calculations, and Legal Notice.\nConsolidated Financial Metrics, Ratios and Statistical Data\n(unaudited)\nQuarter Ended\nPercentage Change From:\nSix Months Ended\nPercentage\nChange\nJun 30, 2024\nMar 31, 2024\nJun 30, 2023\nMar 31, 2024\nJun 30, 2023\nJun 30, 2024\nJun 30, 2023\nFinancial Metrics:\nEarnings per basic share\n$\n1.85\n$\n2.04\n$\n1.25\n(9\n%)\n48\n%\n$\n3.89\n$\n2.98\n31\n%\nEarnings per diluted share\n$\n1.82\n$\n2.02\n$\n1.24\n(10\n%)\n47\n%\n$\n3.85\n$\n2.95\n31\n%\nReturn on average common equity\n13.0\n%\n14.5\n%\n8.9\n%\n13.8\n%\n10.7\n%\nReturn on average tangible common equity\n17.5\n%\n19.7\n%\n12.1\n%\n18.6\n%\n14.5\n%\nBook value per common share\n$\n56.80\n$\n55.60\n$\n55.24\n$\n56.80\n$\n55.24\nTangible book value per common share\n$\n42.30\n$\n41.07\n$\n40.79\n$\n42.30\n$\n40.79\nFinancial Ratios:\nPre-tax margin\n27\n%\n29\n%\n21\n%\n28\n%\n23\n%\nCompensation and benefits as a % of net revenues\n43\n%\n44\n%\n47\n%\n44\n%\n45\n%\nNon-compensation expenses as a % of net revenues\n29\n%\n27\n%\n31\n%\n28\n%\n30\n%\nFirm expense efficiency ratio\n72\n%\n71\n%\n78\n%\n72\n%\n75\n%\nEffective tax rate\n23.5\n%\n21.2\n%\n21.0\n%\n22.3\n%\n20.1\n%\nStatistical Data:\nPeriod end common shares outstanding (millions)\n1,619\n1,627\n1,659\n—\n%\n(2\n%)\nAverage common shares outstanding (millions)\nBasic\n1,594\n1,601\n1,635\n—\n%\n(3\n%)\n1,597\n1,640\n(3\n%)\nDiluted\n1,611\n1,616\n1,651\n—\n%\n(2\n%)\n1,614\n1,657\n(3\n%)\nWorldwide employees\n79,066\n79,610\n82,006\n(1\n%)\n(4\n%)\nThe End Notes are an integral part of this presentation. Refer to pages 12 - 17 of the Financial Supplement for Definition of U.S. GAAP to Non-GAAP Measures, Definitions of Performance Metrics and Terms, Supplemental Quantitative Details and Calculations, and Legal Notice.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240715048014/en/\nContacts\nMedia Relations: Wesley McDade 212-761-2430\nInvestor Relations: Leslie Bazos 212-761-5352", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanley-Second-Quarter-2024-113000020.Html", "Sentiment_Score": -0.1741151065, "Sentiment_Category": "bearish"}, {"Ticker": "MS", "Time": "2024-07-15T21:56:46.000Z", "Headline": "Trump picks JD Vance for VP, Big Bank earnings: Market Domination", "Summary": "It's that final trading hour, and stocks (^DJI, ^IXIC, ^GSPC) are still abuzz. Julie Hyman and Josh Lipton walk investors through the last sixty minutes in Monday's session as markets continue to digest the news of an attempted assassination attempt on former President Trump's life over the weekend.\nAt the Republican National Convention (RNC) in Milwaukee, WI, today, Trump announced his vice presidential running mate: Senator JD Vance (R-Oh.) Fletcher School of Law and Diplomacy lecturer and “Picking Presidents” author Gautam Mukunda speaks on what Trump's choice in Vance may signify about past messaging of unity.\nPortales Partners founder and Wall Street Beats partner Charlie Peabody joins the program to discuss what the latest slew of Big Bank earnings may signify about the industry.\nOther trending tickers on the Yahoo Finance platform include bitcoin (BTC-USD), Apple (AAPL), and Macy's (M).\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Trump-Picks-Jd-Vance-Vp-215646628.Html", "Sentiment_Score": 0.0462526754, "Sentiment_Category": "neutral"}, {"Ticker": "MS", "Time": "2024-07-15T21:28:06.000Z", "Headline": "Bank earnings, retail sales, Prime Day begins: What to watch", "Summary": "A number of banks will release their latest quarterly reports including: Bank of America (BAC), Morgan Stanley (MS), Charles Schwab (SCHW), PNC Financial Services (PNC), and State Street (STT), as well as UnitedHealth Group (UNH).\nEconomic data in the form of Jun retail sales will be released with current estimates showing a decline of 0.3% month-over-month.\nFederal Reserve Governor Adriana Kugler will speak at the Economic Measurement Seminar at National Association for Business Economics (NABE), in Washington, D.C.\nAmazon's (AMZN) annual sale event, Prime Day, begins and will continue through July 17.\nFor more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime.\nThis post was written by Nicholas Jacobino", "Link": "Https://Finance.Yahoo.Com/Video/Bank-Earnings-Retail-Sales-Prime-212806237.Html", "Sentiment_Score": -0.0213395096, "Sentiment_Category": "neutral"}, {"Ticker": "MS", "Time": "2024-07-15T12:59:00.000Z", "Headline": "IB, Trading to Support Morgan Stanley's (MS) Q2 Earnings", "Summary": "The performance of Morgan Stanley’s MS trading business (constituting a significant portion of its top line) is expected to have been decent in the second quarter of 2024, supported by increased client activity. Thus, the company’s trading numbers are likely to have provided some support to its quarterly results, slated to be announced before the opening bell on Jul 16.\n\nIn the to-be-reported quarter, the likelihood of a soft landing of the U.S. economy, gradually cooling inflation and clarity on the interest rate path drove client activity. While volatility was low in equity markets and other asset classes, including commodities, bonds and foreign exchange, Morgan Stanley is likely to have recorded growth in trading revenues, supported by increased client activity.\n\nThe Zacks Consensus Estimate for the company’s equity trading revenues is pegged at $2.61 billion, suggesting a rise of 2.3% from the prior-year quarter’s reported number. The consensus estimate for fixed-income trading revenues of $2 billion indicates a year-over-year rise of 16.6%.\n\nOur estimates for second-quarter equity trading revenues and fixed-income trading revenues are $2.60 billion and $1.93 billion, respectively.\nOther Key Factors at Play\nInvestment Banking (IB) Income: Following the weakness in 2022 and 2023, global mergers and acquisitions witnessed a rebound in the second quarter of 2024. Both deal value and volume witnessed a remarkable comeback, driven by solid financial performance, fading recession risks, buoyant markets and expected rate cuts this year. Yet, tough scrutiny by antitrust regulators and lingering geopolitical tensions were headwinds.\n\nThus, Morgan Stanley’s position as one of the leading players in the space is likely to have offered support to advisory fees in the quarter.\n\nThe Zacks Consensus Estimate for advisory fees is pegged at $498 million, suggesting a year-over-year rise of 9.5%. Our estimate for the same is pinned at $488.7 million, indicating a 7.4% rise.\n\nThe IPO market activity was decent in the second quarter, given the impressive equity market performance. This also drove solid activity in follow-up equity issuances. Further, bond issuance volumes were boosted by lower yields, a better operating backdrop than last year, election-related uncertainty and a resurgence in M&As. Hence, Morgan Stanley’s underwriting fees are expected to have improved in the quarter on a year-over-year basis.\n\nThe consensus estimate for fixed-income underwriting fees is pegged at $490 million, suggesting a rise of 24.1% from the year-ago reported figure. The Zacks Consensus Estimate for equity underwriting fees of $363 million indicates an increase of 61.3%. The consensus estimate for total underwriting fees of $853 million implies a rise of 37.6% from the year-ago quarter’s actual.\n\nOur estimate for fixed-income underwriting fees is $451.7 million, whereas the same for equity underwriting fees is $296.1 million.\n\nThus, growth in total IB income is likely to have been impressive, driven by the expected rise in underwriting revenues, as well as advisory fees. The Zacks Consensus Estimate for IB income of $1.43 billion indicates a year-over-year rise of 32.8%. Our estimate for IB income is pegged at $1.24 billion.\n\nNet Interest Income (NII): Given the clarity on the Fed’s interest rate path for the year and the likelihood of a soft landing of the U.S. economy, the lending scenario improved in the second quarter. Per the Fed’s latest data, the demand for commercial and industrial, real estate and consumer loans was decent in the quarter.\n\nHowever, as the Federal Reserve kept interest rates steady in the quarter (at a 22-year high of 5.25-5.5%), Morgan Stanley is less likely to have recorded significant improvement in NII. Also, the inverted yield curve in the June-ended quarter and high funding costs are expected to have weighed on NII growth.\n\nThe Zacks Consensus Estimate for NII is pegged at $1.91 billion, suggesting a decline of 4.9% on a year-over-year basis. Our estimate for NII is $1.83 billion, implying a dip of 9.2%.\n\nExpenses: Cost reduction, which has long been the main strategy of Morgan Stanley to remain profitable, is unlikely to have provided major support in the June-ended quarter. As the company has been investing in franchises, overall costs are anticipated to have been elevated.\n\nWe expect second-quarter total non-interest expenses of $10.34 billion.\nWhat Our Quantitative Model Predicts\nAccording to our proven model, the chances of Morgan Stanley beating the Zacks Consensus Estimate for earnings this time are low. This is because it does not have the right combination of the two key ingredients — a positive Earnings ESP and Zacks Rank #3 (Hold) or better — to increase the odds of an earnings beat.\n\nYou can uncover the best stocks to buy or sell before they are reported with our Earnings ESP Filter.\n\nEarnings ESP: The Earnings ESP for Morgan Stanley is -0.83%.\n\nZacks Rank: The company currently carries a Zacks Rank of 3. \n\nThe Zacks Consensus Estimate for the company’s second-quarter earnings has been unchanged at $1.66 per share over the past 30 days. The estimate suggests a 33.9% rise from the year-ago reported number.\nMorgan Stanley Price and EPS Surprise\n Morgan Stanley Price and EPS Surprise\nMorgan Stanley price-eps-surprise | Morgan Stanley Quote\nThe consensus estimate for sales is pegged at $14.22 billion, which indicates a year-over-year rise of 5.7%.\nStocks to Consider\nA couple of finance stocks, which have the right combination of elements to post an earnings beat in the upcoming releases per our model, are Capital One Financial Corporation COF and Moody's Corporation MCO.\n\nThe Earnings ESP for COF is +1.52% and it carries a Zacks Rank #3 at present. The company is slated to report second-quarter 2024 results on Jul 23.\n\nMCO is scheduled to release second-quarter 2024 earnings on Jul 23. The company, which carries a Zacks Rank #2 (Buy) at present, has an Earnings ESP of +6.44%. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMorgan Stanley (MS) : Free Stock Analysis Report\nMoody's Corporation (MCO) : Free Stock Analysis Report\nCapital One Financial Corporation (COF) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Ib-Trading-Support-Morgan-Stanleys-125900810.Html", "Sentiment_Score": 0.4784428477, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-15T12:17:37.000Z", "Headline": "How To Earn $500 A Month From Morgan Stanley Stock Ahead Of Q2 Earnings Report", "Summary": "How To Earn $500 A Month From Morgan Stanley Stock Ahead Of Q2 Earnings Report\nMorgan Stanley (NYSE:MS) will release its financial results for the second quarter, before the opening bell on Tuesday, July 16.\nAnalysts expect the New York-based company to report quarterly earnings at $1.65 per share, up from $1.24 per share in the year-ago period. Morgan Stanley expects to post revenue of $14.3 billion. It posted $13.08 billion a year earlier, according to data from Benzinga Pro.\nOn July 9, UBS analyst Brennan Hawken maintained Morgan Stanley with a Neutral rating. Hawken also increased the price target from $100 to $105.\nWith the recent buzz around Morgan Stanley, some investors may be eyeing potential gains from the company's dividends. As of now, Morgan Stanley has a dividend yield of 3.27%. That’s a quarterly dividend of 85 cents a share ($3.40 a year).\nTo figure out how to earn $500 monthly from Morgan Stanley, we start with the yearly target of $6,000 ($500 x 12 months).\nNext, we take this amount and divide it by Morgan Stanley's $3.40 dividend: $6,000 / $3.40  = 1,765 shares\nSo, an investor would need to own approximately $183,719 worth of Morgan Stanley, or 1,765 shares to generate a monthly dividend income of $500.\nAssuming a more conservative goal of $100 monthly ($1,200 annually), we do the same calculation: $1,200 / $3.40 = 353 shares, or $36,744 to generate a monthly dividend income of $100.\nView more earnings on MS\nAlso Read: Top 4 Tech And Telecom Stocks That May Rocket Higher In July\nNote that dividend yield can change on a rolling basis, as the dividend payment and the stock price both fluctuate over time.\nThe dividend yield is calculated by dividing the annual dividend payment by the current stock price. As the stock price changes, the dividend yield will also change.\nFor example, if a stock pays an annual dividend of $2 and its current price is $50, its dividend yield would be 4%. However, if the stock price increases to $60, the dividend yield would decrease to 3.33% ($2/$60).\nConversely, if the stock price decreases to $40, the dividend yield would increase to 5% ($2/$40).\nFurther, the dividend payment itself can also change over time, which can also impact the dividend yield. If a company increases its dividend payment, the dividend yield will increase even if the stock price remains the same. Similarly, if a company decreases its dividend payment, the dividend yield will decrease.\nMS Price Action: Shares of Morgan Stanley fell 0.5% to close at $104.09 on Friday.\nRead More:\nAround $10M Bet On This Tech & Telecom Stock? Check Out These 3 Stocks Insiders Are Buying\n\nThis content is not available due to your privacy preferences.\nUpdate your settings here to see it.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article How To Earn $500 A Month From Morgan Stanley Stock Ahead Of Q2 Earnings Report originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "Link": "Https://Finance.Yahoo.Com/News/Earn-500-Month-Morgan-Stanley-121737608.Html", "Sentiment_Score": 0.0160427261, "Sentiment_Category": "neutral"}, {"Ticker": "MS", "Time": "2024-07-15T08:28:35.000Z", "Headline": "Saudi Wealth Fund Picks JPMorgan, Morgan Stanley for Nupco IPO", "Summary": "(Bloomberg) -- Saudi Arabia’s sovereign wealth fund has picked banks for the planned initial public offering of the kingdom’s largest medical procurement firm, as it hunts for cash to finance the crown prince’s ambitious economic agenda.\nMost Read from Bloomberg\nTrump Shooting Changes Biden’s Plan to Revive 2024 Campaign\nBlackRock Says Gunman From Trump Rally Appeared in Firm’s Ad\nTrump Emerges Defiant From Rally Attack Set to Shake Up ’24 Race\nBold and Bloodied Trump Seizes the Moment After Being Shot\nTrump Classified Documents Case Dismissed by Florida Judge\nJPMorgan Chase & Co., Morgan Stanley and SNB Capital have been hired to work on Nupco’s IPO, according to people familiar with the matter. The deal could come as soon as this year, the people said, asking not to be identified as the information isn’t public.\nThe Public Investment Fund could raise close to $1 billion by selling a 30% stake in the firm, according to one of the people. Bloomberg News has previously reported that the deal was likely to raise less than $1 billion.\nRepresentatives for the PIF, JPMorgan, Morgan Stanley and SNB Capital declined to comment.\nNew from Bloomberg: Get the Mideast Money newsletter, a weekly look at the intersection of wealth and power in the region.\nSaudi Arabia is considering cutting spending on some of its biggest development projects as it grapples with the scale of Crown Prince Mohammed Bin Salman’s Vision 2030 agenda, Bloomberg News reported last week. That’ll put additional pressure on the PIF, which is the main entity tasked with driving the multi-trillion-dollar economic diversification plan.\nThe $925 billion wealth fund has listed several of its portfolio companies in recent years and is becoming an active debt issuer.\nSaudi Arabia has been a busy market for share sales over the past few years, together with other Gulf countries, as governments sought to raise funds to reduce their reliance on the energy sector while encouraging private firms to list to develop their capital markets.\nFounded in 2009, Nupco seeks to raise the level of health services in the kingdom, improve the efficiency of government spending for the purchase of medical supplies and increase the effectiveness of supply chains in the public health-care sector, according to its website.\nHealth care is one of the main focus areas of Vision 2030 as the country seeks to develop its drug industry. Dr Soliman Abdel Kader Fakeeh Hospital Co. raised $763 million in a Riyadh IPO in June, but its shares have risen just 2% from their offer price.\n(Updates with details on valuation in 3rd paragraph)\nMost Read from Bloomberg Businessweek\nHow Rivian Became the Anti-Tesla\nLooser Visa Rules for Indian Travelers Stoke a Tourism Boom\nAsia Is The New Hot Destination for Luxury Travel\nUkraine Is Fighting Russia With Toy Drones and Duct-Taped Bombs\nFrench Elections Result Is Least Worst Outcome for Business\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Saudi-Wealth-Fund-Picks-Jpmorgan-064138113.Html", "Sentiment_Score": 0.0621188432, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-12T21:50:20.000Z", "Headline": "Morgan Stanley (MS) Stock Sinks As Market Gains: Here's Why", "Summary": "In the latest market close, Morgan Stanley (MS) reached $104.09, with a -0.53% movement compared to the previous day. The stock trailed the S&P 500, which registered a daily gain of 0.55%. Elsewhere, the Dow saw an upswing of 0.62%, while the tech-heavy Nasdaq appreciated by 0.63%.\nComing into today, shares of the investment bank had gained 9.9% in the past month. In that same time, the Finance sector lost 2.67%, while the S&P 500 gained 4.28%.\nAnalysts and investors alike will be keeping a close eye on the performance of Morgan Stanley in its upcoming earnings disclosure. The company's earnings report is set to go public on July 16, 2024. The company is predicted to post an EPS of $1.66, indicating a 33.87% growth compared to the equivalent quarter last year. Meanwhile, our latest consensus estimate is calling for revenue of $14.23 billion, up 5.74% from the prior-year quarter.\nFor the entire fiscal year, the Zacks Consensus Estimates are projecting earnings of $6.81 per share and a revenue of $57.77 billion, representing changes of +24.73% and +6.69%, respectively, from the prior year.\nIt's also important for investors to be aware of any recent modifications to analyst estimates for Morgan Stanley. These latest adjustments often mirror the shifting dynamics of short-term business patterns. Consequently, upward revisions in estimates express analysts' positivity towards the company's business operations and its ability to generate profits.\nOur research suggests that these changes in estimates have a direct relationship with upcoming stock price performance. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\nRanging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Over the past month, there's been a 0.35% fall in the Zacks Consensus EPS estimate. Morgan Stanley presently features a Zacks Rank of #3 (Hold).\nIn terms of valuation, Morgan Stanley is presently being traded at a Forward P/E ratio of 15.37. This represents a discount compared to its industry's average Forward P/E of 17.23.\nOne should further note that MS currently holds a PEG ratio of 1.28. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Financial - Investment Bank industry currently had an average PEG ratio of 1.06 as of yesterday's close.\nThe Financial - Investment Bank industry is part of the Finance sector. This industry, currently bearing a Zacks Industry Rank of 89, finds itself in the top 36% echelons of all 250+ industries.\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nRemember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMorgan Stanley (MS) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanley-Ms-Stock-Sinks-215020433.Html", "Sentiment_Score": -0.4451200664, "Sentiment_Category": "bearish"}, {"Ticker": "MS", "Time": "2024-07-12T20:05:00.000Z", "Headline": "Eaton Vance Municipal Bond Fund Announces Measurement Period for Initial Conditional Tender Offer", "Summary": "BOSTON, July 12, 2024--(BUSINESS WIRE)--Eaton Vance Municipal Bond Fund (NYSE American: EIM) (the \"Fund\") announced that, in connection with the recent close of the Fund’s cash tender offer on July 9, 2024, the Fund has commenced a four-month measurement period, beginning July 9, 2024 through November 8, 2024, whereby if, during such period, the Fund’s common shares trade at an average discount to net asset value (\"NAV\") of more than 7.5% (based upon the average of the difference between its volume-weighted average market price and NAV each business day during the period) (the \"First Trigger Event\"), the Fund will conduct a tender offer (the \"Initial Conditional Tender Offer\") within 20 business days of the date on which the First Trigger Event occurs. The Initial Conditional Tender Offer will be for up to 5% of the Fund’s then-outstanding common shares at 98% of NAV per share as of the close of regular trading on the New York Stock Exchange on the date the tender offer expires.\nIf the conditions of the First Trigger Event are met, then additional terms and conditions of the Initial Conditional Tender Offer will be set forth in the Fund’s offering materials filed with the U.S. Securities and Exchange Commission (the \"SEC\"), which will be distributed to the Fund’s common shareholders, and in additional press releases, as applicable. If the number of common shares tendered in the Initial Conditional Tender Offer exceeds the maximum amount of the Initial Conditional Tender Offer, the Fund will purchase shares from tendering shareholders on a pro-rata basis (disregarding fractional common shares). Accordingly, there is no assurance that the Fund will purchase all of a shareholder’s common shares tendered in the Initial Conditional Tender Offer. The Fund may determine not to accept shares tendered in the Initial Conditional Tender Offer under various circumstances, as will be set forth in the offering materials. Further information about the Initial Conditional Tender Offer will be announced in future press releases and the Fund’s offering materials.\nAbout the Fund\nExcept for sales of shares pursuant to a tender offer, common shares of the Fund are available for purchase or sale only through secondary market trading at their current market price. Shares of closed-end funds (such as the Fund) often trade at a discount from their NAV. The market price of Fund shares may vary from NAV based on factors affecting the supply and demand for shares, such as Fund distribution rates relative to similar investments, investors’ expectations for future distribution changes, the clarity of the Fund’s investment strategy and future return expectations, and investors’ confidence in the underlying markets in which the Fund invests. Fund shares are subject to investment risk, including possible loss of principal invested. Fund shares are not FDIC-insured and are not deposits or other obligations of, or guaranteed by, any bank. The Fund is not a complete investment program and you may lose money investing in the Fund. An investment in the Fund may not be appropriate for all investors. Before investing in the Fund, prospective investors should consider carefully the Fund’s investment objective, strategies, risks, charges and expenses.\nEaton Vance is part of Morgan Stanley Investment Management, the asset management division of Morgan Stanley.\nAbout Morgan Stanley Investment Management\nMorgan Stanley Investment Management, together with its investment advisory affiliates, has more than 1,300 investment professionals around the world and $1.5 trillion in assets under management or supervision as of March 31, 2024. Morgan Stanley Investment Management strives to provide outstanding long-term investment performance, service, and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations and individuals worldwide. For further information about Morgan Stanley Investment Management, please visit www.morganstanley.com/im.\nAbout Morgan Stanley\nMorgan Stanley (NYSE: MS) is a leading global financial services firm providing a wide range of investment banking, securities, wealth management and investment management services. With offices in 42 countries, the Firm's employees serve clients worldwide including corporations, governments, institutions and individuals. For more information about Morgan Stanley, please visit www.morganstanley.com.\nImportant Notice\nThis announcement is not a recommendation, an offer to purchase or a solicitation of an offer to sell shares of the Fund. The Initial Conditional Tender Offer will not be conducted unless the prescribed conditions are met. If the conditions of the First Trigger Event are met, the Initial Conditional Tender Offer will be made only by an offer to purchase, a related letter of transmittal and other documents filed with the SEC as exhibits to a tender offer statement on Schedule TO, with all such documents available on the SEC’s website at www.sec.gov. The Fund will then also make available to shareholders without charge the offer to purchase and the letter of transmittal. Shareholders should read these documents carefully, as they will contain important information about the Initial Conditional Tender Offer.\nThis press release is for informational purposes only and is not intended to, and does not, constitute an offer to purchase or sell shares of the Fund. Additional information about the Fund, including performance and portfolio characteristic information, is available at eatonvance.com.\nStatements in this press release that are not historical facts are \"forward-looking statements\" as defined by the U.S. securities laws. You should exercise caution in interpreting and relying on forward-looking statements because they are subject to uncertainties and other factors which are, in some cases, beyond the Fund’s control and could cause actual results to differ materially from those set forth in the forward-looking statements. All forward-looking statements are as of the date of this release only; the Fund undertakes no obligation to update or review any forward-looking statements.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240712570518/en/\nContacts\nInvestor Contact: (800) 262-1122", "Link": "Https://Finance.Yahoo.Com/News/Eaton-Vance-Municipal-Bond-Fund-200500566.Html", "Sentiment_Score": 0.0283106454, "Sentiment_Category": "neutral"}, {"Ticker": "MS", "Time": "2024-07-12T15:50:07.000Z", "Headline": "A Wall Street revival is carrying big banks as Main Street struggles", "Summary": "A Wall Street revival provided a second quarter boost to big banks at a time of rising challenges for their Main Street consumer operations.\nInvestment banking fees jumped at JPMorgan Chase (JPM), Citigroup (C), and Wells Fargo (WFC) from a year ago as dealmaking showed more signs of life following a two-year slump. Trading revenue was also up for all three institutions.\n\"We are happy to see the progress,\" JPMorgan CFO Jeremy Barnum told analysts.\nStocks of all three banks fell, however, as higher interest rates and elevated deposit costs ate away at more traditional consumer banking margins. The banks also set aside more money for future loan losses when compared with a year ago, a sign that they expect credit conditions to worsen.\nWhat attracted a lot of attention from investors Friday was more weakness in a key measure of lending revenue known as net interest income. It fell sequentially at JPMorgan, Wells Fargo, and Citigroup as their customers continued migrating to higher-yielding deposit products like CDs.\nRead more: How CDs work and how to choose the right ones for you\nNet interest income is a central driver of profit for any bank because it accounts for the difference between what banks earn from their loans and pay out on their deposits.\nThis measure at JPMorgan declined 1% from the prior quarter. If not for an $8 billion one-time accounting gain tied to an exchange of shares in credit card giant Visa (V), JPMorgan’s overall net profit would have declined 9% from a year ago.\nIts stock fell more than 1% Friday.\nThe decline in net interest income at Wells Fargo was deeper than analysts anticipated, helping to push its stock down 6%.\nSeveral analysts hoped Wells Fargo might offer a higher revision to its net interest income guidance for the full year. Instead, the bank seemed more comfortable in a lower range, predicting it would fall between 8% and 9%.\nBut even Wells Fargo benefited from more Wall Street activity. Its investment banking revenues surged 38% to $430 million.\nAt JPMorgan, investment banking rose 50% from last year to $2.35 billion. At Citigroup, those fees jumped 63% in the second quarter to $935 million.\n'Green shoots'\nWall Street has been waiting two years for this moment, enduring repeated false starts.\nLast year was supposed to be the year things turned around as executives touted a string of IPOs and merger announcements. Instead, 2023 was the worst year for dealmaking in a decade as clients turned cautious about everything from the direction of interest rates to relations with China to the larger US economy.\nSome executives even had to walk back their talk of \"green shoots\" after the hoped-for surge in deals failed to materialize.\nSo far this year, things are looking up despite lingering concerns about the path of inflation, geopolitical tensions, and an uncertain presidential election outcome.\nThe Wall Street performances of JPMorgan and Citigroup were also a good sign for other investment banking heavyweights such as Goldman Sachs (GS), Morgan Stanley (MS), and Bank of America (BAC) that are due to report earnings next week.\nDespite the improvement, Barnum of JPMorgan was careful Friday not to get too excited as he cited potential headwinds. One potential barrier to new deals is an antitrust focus in Washington, which some market observers say is depressing deal activity.\n\"The dialogue on M&A is robust, I would say, a little bit more elevated,” Barnum said. However, \"there's a little bit of a chilling effect on M&A because of the regulatory environment, and that remains the case.”\nJPMorgan CEO Jamie Dimon also offered some general caution in a press release, saying that \"while market valuations and credit spreads seem to reflect a rather benign economic outlook, we continue to be vigilant about potential tail risks.\"\nJamie Dimon, CEO of JPMorgan Chase. (Aaron Schwartz/Xinhua via Getty Images) (Xinhua News Agency via Getty Images)\nHe referenced geopolitical tensions and persistent inflationary forces, adding that \"inflation and interest rates may stay higher than the market expects.\"\nDimon did not attend JPMorgan’s second quarter earnings conference calls with reporters or analysts Friday.\nThe reason given by bank executives: a travel conflict.\nThe bank’s spokesman told reporters Dimon was flying back from Germany after helping to celebrate the bank’s 100th anniversary in that country.\nThe bank CFO, Barnum, told reporters, \"It's a travel conflict, that's it. There's literally nothing more to it.”\nBarnum said Dimon almost always attends the calls and “that should continue to be the expectation.”\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance", "Link": "Https://Finance.Yahoo.Com/News/A-Wall-Street-Revival-Is-Carrying-Big-Banks-As-Main-Street-Struggles-112142298.Html", "Sentiment_Score": 0.1330864429, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-12T15:45:08.000Z", "Headline": "Are You Looking for a High-Growth Dividend Stock?", "Summary": "All investors love getting big returns from their portfolio, whether it's through stocks, bonds, ETFs, or other types of securities. But for income investors, generating consistent cash flow from each of your liquid investments is your primary focus.\nCash flow can come from bond interest, interest from other types of investments, and of course, dividends. A dividend is that coveted distribution of a company's earnings paid out to shareholders, and investors often view it by its dividend yield, a metric that measures the dividend as a percent of the current stock price. Many academic studies show that dividends account for significant portions of long-term returns, with dividend contributions exceeding one-third of total returns in many cases.\nMorgan Stanley in Focus\nBased in New York, Morgan Stanley (MS) is in the Finance sector, and so far this year, shares have seen a price change of 12.21%. The investment bank is paying out a dividend of $0.85 per share at the moment, with a dividend yield of 3.25% compared to the Financial - Investment Bank industry's yield of 0.81% and the S&P 500's yield of 1.57%.\nIn terms of dividend growth, the company's current annualized dividend of $3.40 is up 4.6% from last year. Morgan Stanley has increased its dividend 4 times on a year-over-year basis over the last 5 years for an average annual increase of 28.06%. Future dividend growth will depend on earnings growth as well as payout ratio, which is the proportion of a company's annual earnings per share that it pays out as a dividend. Morgan Stanley's current payout ratio is 59%, meaning it paid out 59% of its trailing 12-month EPS as dividend.\nLooking at this fiscal year, MS expects solid earnings growth. The Zacks Consensus Estimate for 2024 is $6.81 per share, with earnings expected to increase 24.73% from the year ago period.\nBottom Line\nInvestors like dividends for a variety of different reasons, from tax advantages and decreasing overall portfolio risk to considerably improving stock investing profits. But, not every company offers a quarterly payout.\nHigh-growth firms or tech start-ups, for example, rarely provide their shareholders a dividend, while larger, more established companies that have more secure profits are often seen as the best dividend options. Income investors must be conscious of the fact that high-yielding stocks tend to struggle during periods of rising interest rates. With that in mind, MS is a compelling investment opportunity. Not only is it a strong dividend play, but the stock currently sits at a Zacks Rank of 3 (Hold).\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMorgan Stanley (MS) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Looking-High-Growth-Dividend-Stock-154508578.Html", "Sentiment_Score": 0.0638847351, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-15T07:21:32.000Z", "Headline": "Stocks to watch this week: Anglo American, Burberry, TSMC and Netflix", "Summary": "Quarterly earnings season is about to quick start again, with key companies across the globe providing insights into how certain sectors are performing.\nInvestors will see updates from the mining world, with our focus staying on Anglo American, while Burberry will provide a gauge on the luxury goods industry after a slowdown in demand from China hit sales.\nIn Asia, semiconductor colossus TSMC is expected to come in above expectations, amid the artificial intelligence craze and ongoing demand for chips.\nAcross the pond, Netflix will try to convince investors it is as popular as ever, with revenue and earnings increases in the cards.\nHere's what to look out for:\nAnglo American (AAL.L) — Reports trading update on Thursday 18 July\nAnglo-American was the target of a takeover bid by rival BHP (BHP.L) and it has announced its own restructuring plans in the aftermath of the failed mining mega-merger. So, investors will be sure to put the company’s first-half figures under the microscope.\nAnglo is aiming to sell or separate its coal, platinum, nickel and diamond mining operations. What’s left will be a streamlined business that contains the company’s prized copper mines (BHP’s main target), its premium iron ore business and the Woodsmith fertiliser project in North Yorkshire.\nAnglo is heavily exposed to copper and the industrial metal’s price is just starting to pull back after a strong run.\nFor the actual earnings report, AJ Bell tells investors to look for any hints on production costs.\n“The details on the balance sheet, cash flow and profit and loss account will come with the actual first-half numbers, although do watch out for any changes in output forecasts and targets, as well as comments on cost of production and capital investment, since all of those will directly influence profits and cash flow,” Russ Mould, investment director, Danni Hewson, head of financial analysis, and Dan Coatsworth, investment analyst, all of AJ Bell, wrote.\nRead more: How FTSE All-Share index listings are changing\n“In the unlikely event that [CEO Duncan] Wanblad discusses annual profits or the dividend ahead of the first-half results in the following week, the current consensus forecast is for earnings before interest, taxes, depreciation and amortisation (EBITDA) to come in broadly flat in 2024, at $9.7bn, while a cut in the dividend to $0.83 per share from $0.96 is expected.”\nThe share price is still around 20% higher than it was before BHP’s interest became public on 25 April.\nBurberry (BRBY.L) — Reports trading update on Friday 19 July\nA model presents a creation during a catwalk presentation for British fashion house Burberry's Spring/Summer 2024 collection, at London Fashion Week in London. (HENRY NICHOLLS via Getty Images)\nTrenchcoat-maker Burberry is not expected to impress investors next week, with retail same-store sales estimated to come in 16% lower in its fiscal first quarter, a slump made even starker by 18% growth in the same period last year.\nUBS expects the focus to be on Chinese sales “as well as any signs of stabilisation/improvement among other consumer groups (i.e. Americans and Europeans)”.\nJP Morgan has warned that the ‘re-acceleration’ of the luxury sector could be slower than anticipated, leading to downside risk for luxury stocks.\n“The troubled times continue for Burberry, which has engaged in a round of sweeping job cuts in order to reduce costs. Sales fell 4% for the year to the end of March, and it looks like demand in the key market of China will continue to weaken,” IG said.\nShares in Burberry are down by more than half over the past year, to take them back to levels last seen in 2010.\nCompared to its five-year average PE of 17 times earnings, Burberry now looks cheap at 11 times earnings. IG analysts warned that while the dividend yield is a solid 7%, investors should be aware that the payout may be cut should the group’s sales outlook continue to worsen.\nFor the year to March 2025, analysts currently expect sales to drop 6% to £2.8bn.\nTSMC (TSM) — Reports quarterly update on Thursday 18 July\nThe AI craze has pushed Nvidia as other Magnificent 7 stocks to new heights but there is no AI without chips. And they are (almost) all being manufactured in Taiwan by TSMC.\nTaiwan Semiconductor’s key tech giant clients such as Nvidia and Apple have almost nowhere else to turn for next-gen chip manufacturing.\nTSMC’s anticipated order for next-generation two-nanometer technology will be a key catalyst in the second half, according to Citi analysts, who see AI and sovereign investment adding upside to the company’s 2030 revenue target of €44bn to €60bn, Bloomberg reported.\nThe Taiwan-based silicon giant disclosed in its latest monthly revenue report that net income for June was NT$207.87bn billion ($6.4bn), an increase of 32.9% compared with a year ago.\nRead more: How to invest in AI as the rally continues\nFigures for May and April were NT$229.62bn ($7.04bn/) and NT$236.02bnn (£5.41bn/$7.24bn), both up on the same period last year. TSMC is projected to grow sales by roughly 21% in FY24 and FY25.\n“Taiwan Semiconductor is one of the most straightforward buy-and-hold options in all of technology alongside the likes of Nvidia and others because chips are the lifeblood of the economy and TSM is the semiconductor manufacturer,” according to Zachs Research.\n“Any near-term pullback down to some of Taiwan Semiconductor stock’s key shorter-dated or longer-dated moving averages could mark a screaming buy signal for long-term investors,” Zachs’ analysts added.\nNetflix (NFLX) — Reports second-quarter results on Thursday 18 July\nSynonymous with streaming services, Netflix will show investors how it is fighting to stay on top and prove it can keep attracting new subscribers amid fierce competition.\nNetflix expects its revenue to increase 16% year-over-year (YoY) to $9.49bn (£7.3bn) in the second quarter of 2024 but analysts predict Netflix's Q2 revenue will be slightly higher at $9.53bn. In the first quarter of 2024, Netflix's revenue was $9.37bn, up 15% from the prior year.\nMorningstar equity analyst Matthew Dolphin provides a guide to what investors should focus on. “We're most interested in details on Netflix's ad-supported service, especially regarding how the firm is coming along in monetising it, as well as an update on the size of the ad-supported user base,\" he said.\n“Generally, we'll be looking to see if subscriber growth is slowing substantially after Netflix passed the tailwind from its password-sharing crackdown, and whether it will stop regularly disclosing this metric in 2025.\n“We will also be interested in international sales and subscriber growth. This will be a key driver for the company when/if domestic growth slows,” he wrote.\nAs AJ Bell writes, Netflix no longer gives specific guidance for quarterly net subscriber additions, although co-chief executive officers Greg Peters and Ted Sarandos did suggest at the first-quarter stage that net adds would come in below the first quarter’s bumper 9.3 million (the best first quarter since the pandemic and lockdowns in Q1 2020). That took the total subscriber base to a fraction under 270 million, up from 233 million in Q1 2023 and 167 million before the pandemic swept the globe.\nMatt Britzman, equity analyst at Hargreaves Lansdown, is also keen to look at subscribers: “One thing to watch for is the number of new paid subscribers in the second quarter. Management has already warned it’ll be lower quarter-on-quarter due to the normal seasonal demand patterns. These have been a little skewed in recent years, but looking at 2018/19 numbers, net new subscribers were down 34% and 70% respectively across the first and second quarters – so don’t be surprised to see something in that range.\n“Best in class content is one of the reasons Netflix has been able to consistently deliver sector leading churn rates. It’s expensive, but Netflix remains the only company set to increase content spend, giving a comparative advantage versus legacy media and its challengers.”\nOther companies reporting next week include:\nMonday 15 July\nRobert Walters (RWA.L)\nOrkla (ORK.OL)\nGoldman Sachs (GS)\nBlackRock (BLK)\nTuesday 16 July\nOcado (OCDO.L)\nIntermediate Capital (ICG.L)\nB&M European Value Retail (BME.L)\nBloomsbury Publishing (BMY.L)\nMcBride (MCB.L)\nRichemont (CFR.SW)\nNCC (NCC.L)\nUnitedHealth (UNH)\nBank of America (BAC)\nMorgan Stanley (MS)\nOmnicom (OMC)\nWednesday 17 July\nRenold (RNO.L)\nHVIVO (HVO.L)\nBHP (BHP.L)\nASML (ASML)\nAssa Abloy (ASSA-B.ST)\nSvenska Handelsbanken (SHB-B.ST)\nJohnson & Johnson (JNJ)\nCSX (CSX)\nUS Bancorp (USBC.VI)\nLas Vegas Sands (LVS)\nCitizens Financial (CZFS)\nUnited Airlines (UAL)\nAlcoa (AA)\nBank OZK (OZK)\nThursday 18 July\nSSE (SSE.L)\nDiploma (DPLM.L)\nDunelm (DNLM.L)\nKier (KIE.L)\nQinetiQ (QQ.L)\nABB (ABBNY)\nAtlas Copco (ATCO-A.ST)\nVolvo (VOLV-A.ST)\nEQT (EQT)\nPublicis (PUB.PA)\nNokia (NOK)\nVolvo Car (VOLCAR-B.ST)\nSKF (SKF-B.ST)\nAbbott Labs (ABL.MU)\nBlackstone (BX)\nDR Horton (DHI)\nTractor Supply (TSCO)\nDomino’s Pizza (DPZ)\nInterpublic (IPG)\nAmerican Airlines (AAL)\nAlaska Airlines (ALK)\nFriday 19 July\nBridgepoint (BPT.L)\nSchindler (SHLRF)\nKone (KNEBV.HE)\nSandvik (SAND.ST)\nSaab (SAABBS.XC)\nElectrolux (ELUXY)\nAmerican Express (AXP)\nSchlumberger (SLB)\nHalliburton (HAL)\nYou can read Yahoo Finance's full calendar here.\nDownload the Yahoo Finance app, available for Apple and Android.", "Link": "Https://Finance.Yahoo.Com/News/Anglo-American-Burberry-Tsmc-Netflix-Stocks-Watch-152336310.Html", "Sentiment_Score": 0.0132057853, "Sentiment_Category": "neutral"}, {"Ticker": "MS", "Time": "2024-07-12T15:11:59.000Z", "Headline": "US Consumer Sentiment Falls to Eight-Month Low on High Prices", "Summary": "(Bloomberg) -- US consumer sentiment unexpectedly declined to the lowest level in eight months in early July as high prices continued to weigh on Americans’ views of their finances and the economy.\nMost Read from Bloomberg\nTrump ‘Fine’ After Being Shot In Ear at Rally, Shooter Is Dead\nMusk Donates to Trump, Tapping Fortune to Swing 2024 Race\nCanada Said to Have Mapped Out Secret Chinese Police Operations\nGiuliani’s Bankruptcy Dismissed With $150 Million Still Owed\nBiden Self-Belief Collides With Democrat Angst in 2024 Struggle\nThe sentiment index fell to 66 in July from 68.2, according to the preliminary reading from the University of Michigan. The median estimate in a Bloomberg survey of economists called for a slight increase to 68.5.\nConsumers’ expectations for inflation over the next year fell for a second month, to 2.9%, data Friday showed. They saw costs rising at an annual rate of 2.9% over the next 5 to 10 years, also edging down from the prior month.\n“Despite expecting inflation to ease, consumers remain vociferously frustrated at the persistence of high prices,” Joanne Hsu, director of the survey, said in a statement. “Almost half of consumers spontaneously expressed complaints that high prices are eroding their living standards, matching the all-time high reached two years ago.”\nThe University of Michigan also released a special report on inflation expectations, a point of recent concern among economists. It found a divergence between average and median long-run expectations was driven by a small number of consumers and “unlikely to reflect a fundamental deterioration in consumers’ inflation expectations.”\nData earlier this week showed inflation cooled broadly in June, with a measure of underlying price trends posting its smallest advance since 2021. That bolstered the case for the Federal Reserve to cut interests rates in coming months.\nWhile a separate report Friday showed a firmer-than-expected rise in wholesale inflation, details of the report pointed to underlying softness in the Fed’s preferred price gauge, the personal consumption expenditures price index. Analysts at Morgan Stanley and Capital Economics shaved their estimates for core PCE after the PPI release.\nThe recent downward path for inflation has provided some welcome relief to consumers who felt squeezed by the post-Covid spike in inflation. Goods prices have led the way, actually declining over most of the past year.\nAt the same time, the labor market, which has powered consumer spending, has showed signs of cooling, a trend that could help dampen sentiment if it continues. Unemployment rose to 4.1% in June, its highest mark since late 2021.\nElection Worries\nThe current conditions gauge fell to 64.1 from 65.9, its lowest since December 2022. A measure of expectations also declined to 67.2, an eight-month low, from 69.6 in June.\nBuying conditions for durable goods dropped to 85, the lowest in just over a year. Consumers’ perception of their financial situation now and in the future deteriorated in July, with each falling to the lowest level since October.\nThe report noted the November presidential election may be weighing on consumers’ expectations for the economy.\n“With the upcoming election, consumers perceived substantial uncertainty in the trajectory of the economy, though there is little evidence that the first presidential debate altered their economic views,” Hsu said.\n--With assistance from Chris Middleton and Matthew Boesler.\n(Updates with PPI Friday data in sixth paragraph.)\nMost Read from Bloomberg Businessweek\nHow Rivian Became the Anti-Tesla\nAsia Is The New Hot Destination for Luxury Travel\nUkraine Is Fighting Russia With Toy Drones and Duct-Taped Bombs\nFrench Elections Result Is Least Worst Outcome for Business\nLooser Visa Rules for Indian Travelers Stoke a Tourism Boom\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Us-Consumer-Sentiment-Falls-Eight-140000384.Html", "Sentiment_Score": -0.9483283758, "Sentiment_Category": "bearish"}, {"Ticker": "MS", "Time": "2024-07-12T13:16:35.000Z", "Headline": "US Producer Prices Move Higher as Service Provider Margins Climb", "Summary": "(Bloomberg) -- US producer prices climbed in June by slightly more than forecast on a pickup in margins at service providers, offsetting a second month of declines in the cost of goods.\nMost Read from Bloomberg\nMusk Donates to Trump, Tapping Fortune to Swing 2024 Race\nGiuliani’s Bankruptcy Dismissed With $150 Million Still Owed\nBiden Vows to Stay in 2024 Race Even as NATO Gaffes Risk His Campaign\nAT&T Data Hack Prompts FCC Probe, Raises Broad Security Concerns\nBiden’s Putin-Zelenskiy Gaffe Deals Fresh Blow to Campaign\nThe producer price index for final demand rose 0.2% from a month earlier, according to Bureau of Labor Statistics data published Friday. Compared with a year ago, the PPI rose 2.6%.\nThe report on wholesale inflation follows the more closely watched consumer price index, which showed the first decline since the onset of the pandemic and put the Federal Reserve on track to start lowering interest rates as soon as September.\nThe PPI report showed services costs increased 0.6%, with nearly all of the advance tied to a 1.9% jump in margins at wholesalers and retailers. Goods prices fell 0.5%.\nStripping out food, energy and trade, a less-volatile measure favored by many economists, prices were unchanged. Compared with a year ago, the gauge moderated to a 3.1% rate.\nCategories in the PPI report that are used to calculate the Fed’s preferred inflation measure — the personal consumption expenditures price index — were mixed. Still, analysts at Morgan Stanley and Capital Economics shaved their core PCE price estimates after the PPI release.\nAmong those categories, physician care costs edged up 0.2%, the cost of hospital outpatient care rose 0.1% and inpatient care climbed 0.5% — all more modest advances than in May. At the same time, airfares increased 1.1% and prices for portfolio management services climbed 1%. The June PCE price gauge is due later this month.\n“The PPI components that feed into the Fed’s preferred PCE deflator inflation measure were significantly lower than expected for June and it looks like May’s PCE gain could be revised down too, albeit only slightly,” Paul Ashworth, chief North America economist at Capital Economics, said in a note.\nCosts of processed goods for intermediate demand, which reflect prices earlier in the production pipeline, fell 0.2% — the third decline in the last four months.\n(Adds graphic)\nMost Read from Bloomberg Businessweek\nHow Rivian Became the Anti-Tesla\nUkraine Is Fighting Russia With Toy Drones and Duct-Taped Bombs\nAsia Is The New Hot Destination for Luxury Travel\nLooser Visa Rules for Indian Travelers Stoke a Tourism Boom\nFrench Elections Result Is Least Worst Outcome for Business\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Us-Producer-Prices-Rise-Slightly-124915824.Html", "Sentiment_Score": 0.8991276622, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-12T13:00:10.000Z", "Headline": "Morgan Stanley (MS) is Attracting Investor Attention: Here is What You Should Know", "Summary": "Morgan Stanley (MS) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nShares of this investment bank have returned +9.9% over the past month versus the Zacks S&P 500 composite's +4.3% change. The Zacks Financial - Investment Bank industry, to which Morgan Stanley belongs, has gained 5.3% over this period. Now the key question is: Where could the stock be headed in the near term?\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\nRevisions to Earnings Estimates\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nFor the current quarter, Morgan Stanley is expected to post earnings of $1.66 per share, indicating a change of +33.9% from the year-ago quarter. The Zacks Consensus Estimate has changed -0.7% over the last 30 days.\nThe consensus earnings estimate of $6.81 for the current fiscal year indicates a year-over-year change of +24.7%. This estimate has changed -0.4% over the last 30 days.\nFor the next fiscal year, the consensus earnings estimate of $7.54 indicates a change of +10.7% from what Morgan Stanley is expected to report a year ago. Over the past month, the estimate has changed -2.3%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Morgan Stanley is rated Zacks Rank #3 (Hold).\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\n12-month consensus EPS estimate for MS _12MonthEPSChartUrl\nProjected Revenue Growth\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nFor Morgan Stanley, the consensus sales estimate for the current quarter of $14.23 billion indicates a year-over-year change of +5.7%. For the current and next fiscal years, $57.77 billion and $60.76 billion estimates indicate +6.7% and +5.2% changes, respectively.\nLast Reported Results and Surprise History\nMorgan Stanley reported revenues of $15.14 billion in the last reported quarter, representing a year-over-year change of +4.3%. EPS of $2.02 for the same period compares with $1.70 a year ago.\nCompared to the Zacks Consensus Estimate of $14.47 billion, the reported revenues represent a surprise of +4.6%. The EPS surprise was +19.53%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nMorgan Stanley is graded D on this front, indicating that it is trading at a premium to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Morgan Stanley. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMorgan Stanley (MS) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Morgan-Stanley-Ms-Attracting-Investor-130010854.Html", "Sentiment_Score": 0.0583612695, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-11T20:27:00.000Z", "Headline": "Eaton Vance Municipal Bond Fund Announces Final Results of Tender Offer", "Summary": "BOSTON, July 11, 2024--(BUSINESS WIRE)--Eaton Vance Municipal Bond Fund (NYSE American: EIM) (the \"Fund\") announced today the final results of the Fund’s cash tender offer for the following amount of its outstanding common shares (the \"Tender Offer\"). The Tender Offer expired at 5:00 p.m. Eastern Time on July 9, 2024.\nThe final results of the Tender Offer based on a count by Equiniti Trust Company, LLC, the depositary for the Tender Offer, are provided in the table below.\nCommon\nShares Offered\nto Purchase\nPursuant to the\nTender Offer\nCommon\nShares\nProperly\nTendered\nCommon\nShares to be\nPurchased\nPro-\nRation\nFactor*\nPurchase\nPrice**\nNumber of\nOutstanding\nCommon Shares\nafter Giving Effect\nto Tender Offer\n14,230,637\n29,738,009\n14,230,637\n47.85333%\n$11.0913\n56,922,547\n* The number of common shares to be purchased divided by the number of common shares properly tendered. The pro-ration factor is subject to rounding adjustment to avoid the purchase of fractional shares.\n** Equal to 98% of the relevant Fund’s net asset value (\"NAV\") per share as of the close of regular trading on the New York Stock Exchange (NYSE) on July 9, 2024 (the date the Tender Offer expired).\nUnder the terms and conditions of the Tender Offer, if the number of common shares properly tendered exceeded the number of common shares offered to purchase, the Fund will purchase common shares properly tendered on a pro-rata basis (disregarding fractional shares). As indicated above, the Fund will purchase 47.85333% of the common shares properly tendered. The Fund will purchase the common shares accepted for payment as promptly as practicable.\nThe information agent for the Tender Offer is EQ Fund Solutions, LLC. Any questions with regard to the Tender Offer may be directed to the information agent toll-free at 1-877-732-3614.\nAbout the Fund\nExcept for sales of shares pursuant to a tender offer, common shares of the Fund are available for purchase or sale only through secondary market trading at their current market price. Shares of closed-end funds (such as the Fund) often trade at a discount from their NAV. The market price of Fund shares may vary from NAV based on factors affecting the supply and demand for shares, such as Fund distribution rates relative to similar investments, investors’ expectations for future distribution changes, the clarity of the Fund’s investment strategy and future return expectations, and investors’ confidence in the underlying markets in which the Fund invests. Fund shares are subject to investment risk, including possible loss of principal invested. Fund shares are not FDIC-insured and are not deposits or other obligations of, or guaranteed by, any bank. The Fund is not a complete investment program and you may lose money investing in the Fund. An investment in the Fund may not be appropriate for all investors. Before investing in the Fund, prospective investors should consider carefully the Fund’s investment objective, strategies, risks, charges and expenses.\nEaton Vance is part of Morgan Stanley Investment Management, the asset management division of Morgan Stanley.\nAbout Morgan Stanley Investment Management\nMorgan Stanley Investment Management, together with its investment advisory affiliates, has more than 1,300 investment professionals around the world and $1.5 trillion in assets under management or supervision as of March 31, 2024. Morgan Stanley Investment Management strives to provide outstanding long-term investment performance, service, and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations and individuals worldwide. For further information about Morgan Stanley Investment Management, please visit www.morganstanley.com/im.\nAbout Morgan Stanley\nMorgan Stanley (NYSE: MS) is a leading global financial services firm providing a wide range of investment banking, securities, wealth management and investment management services. With offices in 42 countries, the Firm's employees serve clients worldwide including corporations, governments, institutions and individuals. For more information about Morgan Stanley, please visit www.morganstanley.com.\nImportant Notice\nThis announcement is not a recommendation, an offer to purchase or a solicitation of an offer to sell shares of the Fund. The Tender Offer was made only by an offer to purchase, a related letter of transmittal and other documents filed with the U.S. Securities and Exchange Commission (\"SEC\") as exhibits to a tender offer statement on Schedule TO, with all such documents available on the SEC’s website at www.sec.gov. The Fund has also made available to shareholders without charge the offer to purchase and the letter of transmittal. Shareholders should read these documents carefully, as they contain important information about the Tender Offer.\nThis press release is for informational purposes only and is not intended to, and does not, constitute an offer to purchase or sell shares of the Fund. Additional information about the Fund, including performance and portfolio characteristic information, is available at eatonvance.com.\nStatements in this press release that are not historical facts are \"forward-looking statements\" as defined by the U.S. securities laws. You should exercise caution in interpreting and relying on forward-looking statements because they are subject to uncertainties and other factors which are, in some cases, beyond the Fund’s control and could cause actual results to differ materially from those set forth in the forward-looking statements. All forward-looking statements are as of the date of this release only; the Fund undertakes no obligation to update or review any forward-looking statements.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240711577526/en/\nContacts\nInvestor Contact: (800) 262-1122", "Link": "Https://Finance.Yahoo.Com/News/Eaton-Vance-Municipal-Bond-Fund-202700362.Html", "Sentiment_Score": 0.0370662957, "Sentiment_Category": "neutral"}, {"Ticker": "MS", "Time": "2024-07-11T12:35:09.000Z", "Headline": "Octagos Health gains funding from Morgan Stanley", "Summary": "Morgan Stanley Expansion Capital has led the $43m Series B funding round for Octagos Health, a provider of AI-driven cardiac device monitoring solutions.\nThe Series B funding round was led by funds managed by Morgan Stanley Expansion Capital, with continued participation from Mucker Capital and other strategic investors. It will help Octagos use AI to evolve cardiac care and provide patient monitoring services.\n“By combining AI, patient services, and bidirectional EHR integration, the Octagos Health platform enables cardiologists to efficiently monitor patients, improve patient care, and enhance clinic economics. The funding will help us accelerate our growth across the US and expand into other critical areas of cardiac care including ambulatory monitors, consumer wearables, and sleep. Our goal is to build a comprehensive AI-based clinical decision support engine for healthcare. We are thrilled to have Morgan Stanley Expansion Capital as our lead investor and the continued support of Mucker Capital. In a short period, we have grown from first servicing my cardiology clinic to becoming one of the largest Cardiac Remote Monitoring companies that provides software and services\" said Dr. Shanti Bansal, cardiologist, CEO of Octagos Health and Houston Heart Rhythm.\n“This investment will enable us to accelerate enhancements to our platform in addition to scaling our commercial team and operations. We are currently the only company to help cardiac clinics migrate their historical data from legacy software providers and fully integrate with any EHR system, while enabling customized reporting and patient and clinic operating analytics,” commented Eric Olsen, COO of Octagos Health.\n\"We are excited to partner with Octagos Health and support their vision of transforming cardiac care,\" added Melissa Daniels, Managing Director of Morgan Stanley Expansion Capital. \"Octagos Health has demonstrated exceptional growth and innovation in a critical area of healthcare. We believe their platform and vertically integrated software and services significantly improve patient care and streamline cardiac monitoring processes for healthcare providers.\"\n“Octagos Health is poised for scale – industry leading gross margins, very sticky product that doctors and clinical staff love, and a market ready for disruption with artificial intelligence. This is the new wave for diagnostic care,” noted Will Hsu, Co-Founder and Partner at Mucker Capital. “This funding will help Octagos Health continue to add additional data sources from various diagnostic and consumer devices and further differentiate their offering.”\n\"Octagos Health gains funding from Morgan Stanley\" was originally created and published by Private Banker International, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/Octagos-Health-Gains-Funding-Morgan-123509484.Html", "Sentiment_Score": 0.9098483324, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-11T10:29:32.000Z", "Headline": "Japan’s 40-Year Government Bond Yields Hit 3% for First Time", "Summary": "(Bloomberg) -- Japan’s 40-year government bond yield touched 3% for the first time since this maturity was first issued in 2007.\nMost Read from Bloomberg\nSaudis Warned G-7 Over Russia Seizures With Debt Sale Threat\nSaudi Prince’s Trillion-Dollar Makeover Faces Funding Cutbacks\nModi’s Embrace of Putin Irks Biden Team Pushing Support for Kyiv\nArchegos’ Bill Hwang Convicted of Fraud, Market Manipulation\nStocks See Big Rotation as Yields Sink on Fed Bets: Markets Wrap\nAs domestic life insurers who are usually big buyers stayed cautious ahead of the Bank of Japan’s July 31 policy decision, selling pressure came from market players including overseas investors.\nWhile the most recently-issued 40-year bond’s yield stayed below 3%, three older JGBs with that tenor saw their yields rise to that level on Wednesday, and the rates have shown few signs of falling on Thursday in thin trading. The yen’s relentless weakening is increasing speculation that the BOJ will take further steps to normalize monetary policy soon, and major investors including life insurers are showing reluctance about parking their money in the debt.\nAdding to the market’s bearishness, foreign investors sold Japanese medium- to long-term bonds on a net basis last week for the fourth consecutive week, matching the longest streak in about a year, according to Ministry of Finance data released Thursday. They also sold the most 10-year JGB futures in a month in the last week of June.\nThe yen’s slide to near fresh 38-year lows against the dollar is prompting some traders to bet that the BOJ will reduce bond buying and raise interest rates at the same time at its July 30-31 policy meeting, to support the home currency. But even that may not be enough to slow the yen’s decline, while it may push up bond yields, leading to even more debt selling by overseas investors.\nJapan’s super-long bonds are “too cheap” now relative to overseas peers, but uncertainties about what kind of debt-buying reduction plan the BOJ will unveil at the end of the month are making it hard to buy the securities, said Tadashi Matsukawa, head of PineBridge Investments’ fixed income management department.\nThe BOJ likely won’t cut bond buying and raise rates at the same time considering that it’s avoided sudden bold moves in the past, going through the trouble of talking to market participants and taking a month and a half to make a decision, said Naomi Muguruma, chief fixed income strategist at Mitsubishi UFJ Morgan Stanley Securities.\nMost Read from Bloomberg Businessweek\nLooser Visa Rules for Indian Travelers Stoke a Tourism Boom\nUkraine Is Fighting Russia With Toy Drones and Duct-Taped Bombs\nHow Rivian Became the Anti-Tesla\nAt SpaceX, Elon Musk’s Own Brand of Cancel Culture Is Thriving\nHow Digital Money Really Works\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Japan-40-Government-Bond-Yields-075111311.Html", "Sentiment_Score": 0.8219239712, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-10T22:00:18.000Z", "Headline": "Here's Why Morgan Stanley (MS) Gained But Lagged the Market Today", "Summary": "The latest trading session saw Morgan Stanley (MS) ending at $103.46, denoting a +0.83% adjustment from its last day's close. The stock lagged the S&P 500's daily gain of 1.02%. At the same time, the Dow added 1.09%, and the tech-heavy Nasdaq gained 1.18%.\nThe investment bank's shares have seen an increase of 7.52% over the last month, surpassing the Finance sector's loss of 5.14% and the S&P 500's gain of 4.44%.\nThe upcoming earnings release of Morgan Stanley will be of great interest to investors. The company's earnings report is expected on July 16, 2024. The company is forecasted to report an EPS of $1.66, showcasing a 33.87% upward movement from the corresponding quarter of the prior year. In the meantime, our current consensus estimate forecasts the revenue to be $14.23 billion, indicating a 5.74% growth compared to the corresponding quarter of the prior year.\nLooking at the full year, the Zacks Consensus Estimates suggest analysts are expecting earnings of $6.83 per share and revenue of $57.84 billion. These totals would mark changes of +25.09% and +6.83%, respectively, from last year.\nFurthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Morgan Stanley. These recent revisions tend to reflect the evolving nature of short-term business trends. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability.\nEmpirical research indicates that these revisions in estimates have a direct correlation with impending stock price performance. To capitalize on this, we've crafted the Zacks Rank, a unique model that incorporates these estimate changes and offers a practical rating system.\nThe Zacks Rank system, stretching from #1 (Strong Buy) to #5 (Strong Sell), has a noteworthy track record of outperforming, validated by third-party audits, with stocks rated #1 producing an average annual return of +25% since the year 1988. Within the past 30 days, our consensus EPS projection has moved 0.1% lower. Morgan Stanley is holding a Zacks Rank of #3 (Hold) right now.\nLooking at valuation, Morgan Stanley is presently trading at a Forward P/E ratio of 15.03. This represents a discount compared to its industry's average Forward P/E of 17.96.\nWe can also see that MS currently has a PEG ratio of 1.25. The PEG ratio bears resemblance to the frequently used P/E ratio, but this parameter also includes the company's expected earnings growth trajectory. As of the close of trade yesterday, the Financial - Investment Bank industry held an average PEG ratio of 1.16.\nThe Financial - Investment Bank industry is part of the Finance sector. This industry currently has a Zacks Industry Rank of 70, which puts it in the top 28% of all 250+ industries.\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nYou can find more information on all of these metrics, and much more, on Zacks.com.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMorgan Stanley (MS) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Heres-Why-Morgan-Stanley-Ms-220018202.Html", "Sentiment_Score": 0.4397612214, "Sentiment_Category": "bullish"}, {"Ticker": "MS", "Time": "2024-07-10T21:36:21.000Z", "Headline": "Saudi Aramco Sells $6 Billion of Bonds Amid Fierce Demand", "Summary": "(Bloomberg) -- Saudi Aramco pulled in more than $31 billion of orders for its $6 billion bond sale, its first dollar-debt offering in three years.\nMost Read from Bloomberg\nSaudis Warned G-7 Over Russia Seizures With Debt Sale Threat\nArchegos’ Bill Hwang Convicted of Fraud, Market Manipulation\nBiden Aides to Meet Senators After Pelosi Remarks Deal Blow\nNATO Singles Out China Over Its Support for Russia in Ukraine\nDistressed Property Buyers Seek Out ‘Exceptional Bargains’\nBids peaked above $11 billion for both the oil giant’s 10- and 30-year notes, according to a person with knowledge of the matter. Aramco also sold 40-year bonds in the deal that priced Wednesday.\nThe strong demand — final order books topped $23 billion — allowed the company to cut spreads offered on each of the tranches by at least 35 basis points. The deal was its first dollar debt sale since a $6 billion offering in 2021.\nHere are the details of Wednesday’s offering:\nAn Aramco spokesperson didn’t comment on the size of the transaction, and referred Bloomberg to a company statement earlier this week announcing that it planned to sell notes. The deal is extending the oil-rich kingdom’s debt spree as it looks to fund projects.\n“Aramco is extending maturities as it will continue to gradually leverage up given their expansion plans and capex needs,” according to Apostolos Bantis, managing director of fixed income advisory at Union Bancaire Privee Ubp SA.\nSaudi Arabia’s government and affiliated companies have borrowed vast amounts this year, and as of June had topped China as the biggest issuer of international debt among emerging markets. The state, which needs funds to help cover an expected budget shortfall resulting from an ambitious economic diversification plan, has accounted for more than half of the total debt sold by Saudi entities this year.\nAramco is a big part of the kingdom’s cash flow plans. In June, the Saudi government offloaded a stake in the company that eventually brought in $12.35 billion, while the company’s massive dividend payouts — the biggest in the world — also help fill state coffers.\nAramco maintained its $31 billion quarterly dividend to the Saudi government and other investors in May despite lower profit. Its free cash flow — funds from operations minus capital expenditure — of $22.8 billion in the period was less than the total payout.\nAramco sold its first dollar bond in 2019, and followed it with a 50-year debt offering in 2020. It issued dollar-denominated Islamic notes in 2021, data compiled by Bloomberg show.\nThe company hired banks including Citigroup Inc., Goldman Sachs Group Inc., HSBC Holdings Plc, JPMorgan Chase & Co., Morgan Stanley and SNB Capital to manage the latest bond sale.\nAramco is likely to use the funds to refinance existing borrowings and contribute to its investment program. The company is expanding natural gas production at home including $25 billion of contracts for the Jafurah project. It’s spending billions to maintain oil output and pursuing acquisitions overseas, including tapping into LNG supply in the US and agreeing to take a share in an automotive joint venture.\nChief Financial Officer Ziad Al-Murshed said in February that the company would sell long-dated debt this year as financial markets improve and the company looks to boost leverage on its balance sheet. The plan to issue long-maturity bonds shows Aramco is confident it can remain relevant well past the middle of the century even as the energy transition raises questions over future oil demand.\n--With assistance from Olivia Raimonde and Archana Narayanan.\n(Adds final pricing and order book in the second and third paragraphs.)\nMost Read from Bloomberg Businessweek\nLooser Visa Rules for Indian Travelers Stoke a Tourism Boom\nAt SpaceX, Elon Musk’s Own Brand of Cancel Culture Is Thriving\nUkraine Is Fighting Russia With Toy Drones and Duct-Taped Bombs\nHow Digital Money Really Works\nPsychedelics Are Now Legal in Australia—With a Catch\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Saudi-Aramco-Kicks-Off-First-080218892.Html", "Sentiment_Score": 0.0282020569, "Sentiment_Category": "neutral"}]}