{"timestamp": "20240719_152817", "data": [{"Ticker": "BP", "Time": "2024-07-19T07:35:44.000Z", "Headline": "BP p.l.c. (BP): Why Is Bluebell Capital Partners Targeting This Stock Right Now?", "Summary": "We recently compiled a list of the 10 Stocks Targeted by Activist Investors Right Now. In this article, we are going to take a look at where BP p.l.c. (NYSE:BP) stands against the other stocks targeted by activist investors.\nActivist investors play an important role in deploying various strategies to try and unlock value in stocks they believe are trading below their fair value. By paying millions and even billions of dollars to buy stakes in companies, they accrue significant power and the right to lobby for changes they believe will help bolster share price and shareholder value. Therefore, it does not come as a surprise that the top 10 stocks targeted by activist investors right now have also seen their leadership targeted as one of the ways of engineering changes to unlock value.\nLast year alone, companies faced a record number of activist campaigns as shareholders tried to insert optimum pressure to oust directors of companies struggling amid deteriorating macro conditions. Some activist investors went to the extent of pushing for the sale of businesses whose shares had tumbled significantly.\nConsequently, there were 252 activist campaigns globally in 2023, a 7% increase from the previous year. The fact that the top 10 stocks targeted by activist investors now also include blue-chip businesses underlines that no one is safe from scrutiny.\nThe significant increase in activist campaigns came from geopolitical instability and economic uncertainty. Nevertheless, activist investors shrugged off these concerns as they showed their resilience in pushing for corporate changes and operational efficiency in the race to unlock shareholder value.\nSimilarly, investors closely watch activist investors' moves in the market as they help shed light on some of the best-undervalued opportunities worth exploring. A report of 550 activist campaigns has already shown that activist investors often outperform the overall market by 6.3% through their campaigns. The report by Álvaro & Marshal clearly shows why it is essential to closely watch activist investors' moves when trying to uncover high-risk reward opportunities in the market.\nAdditionally, activist campaigns focused on operational demands to change how companies operate to generate value often outperform the market by 9.4% on average. The outperformance stems from activist investors installing their preferred directors on the board of directors to try and influence how a company operates in its push to unlock shareholder value.\nOne trend that is becoming increasingly clear is that activist campaigns are becoming increasingly regional and dynamic. With the US equities outperforming the overall market over the past few years, activist investors are increasingly targeting stocks in other underperforming regions. Consequently, the activist investors launched 69 campaigns in Europe last year, focusing on pushing for mergers and acquisitions. Equities in Asia Pacific were not spared either, going by the 44 new campaigns.\nWhile the UK recorded a 71% increase in activist campaigns to 29 campaigns and the US recorded a 20% drop to 109 campaigns in 2024, Canada saw a 171% increase in shareholder activism to 19 campaigns. Nevertheless, US-based activist investors continue to account for the most significant share of global activist campaigns. For instance, three of the busiest US-based activist investors launched 14% of the worldwide activist campaigns.\nOver the years, activist campaigns have been dominated by high-profile hedge funds, including Icahn Enterprises, Jana Partners and Trian Partners. Elliott Investment Management is one activist hedge fund that stands out when it comes to unlocking value in under two years.\nThe trend is slowly changing, with new, more aggressive funds pushing to make their mark. For instance, more than 40% of campaigns last year were spearheaded by hedge funds for the first time, especially in Europe. The change of guard stems from the barrier of entry being lowered, giving shareholders the ability to launch more campaigns.\nIt is one of the best times to watch the 10 stocks targeted by activist Investors right now, as the campaigns are highly successful. The double-digit returns posted by activist investors in 2023 in one of the most challenging environments amid the high interest rates underscores the effectiveness of some campaigns.\nFor instance, activist investors who pushed for management changes and the streamlining of operations enjoyed an average return of 20.2% in 2023, a significant improvement from an average loss of 16% in 2022. Even as the S&P 500 gained 24%, activist investors like Mason Morfit's ValueAct Capital came out on top, posting a 39% return, while Bill Ackman's Pershing Square holdings delivered a 27% gain. Healthcare-focused hedge fund Caligan Partners posted a 37% gain as Engaged Capital topped the S&P 500 gain with a 29% gain.\nThe activist campaigns were mainly helped by a rising stock market and focused on some of the most prominent stock picks on a roll, like Nvidia for AI and cloud computing powerhouse Salesforce. The campaigns also turned out to be a great success for the activist investors pushing for cost cuts, strategic alternatives, and management changes to navigate the high interest rate environment.\nIn the first half of 2024, activist investors launched a record number of campaigns, 147 of which topped the previous 143 set in 2018. In the second quarter, they launched 86 campaigns, with Elliott Capital emerging as the busiest, launching 11 campaigns and investing $11 billion in the capital in a bid to enhance its influence in its targets\nThe surge in activist campaigns in 2024 threatens to trigger costly boardroom battles as the activist investor pushes for management changes, spin-offs, and outright sales.\nOur Methodology\nA closer look at how shareholders push for optimum value shows that activist investors are not planning to go slow anytime soon. Instead, they are ready to push companies harder for changes, including accelerating board changes to unlock value. Consequently, we have compiled a list of the most recent activist campaigns and ranked them based on their recent market capitalization. At Insider Monkey, we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter's strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA large turbine generating power from natural gas, smoke rising in the background.\nBluebell Capital Partners at the BP p.l.c. (NYSE:BP)\nMarket Cap: $78.79 Billion\nBluebell Capital Partners' Equity Stake: N/A\nBP p.l.c. (NYSE:BP) is one of the top 10 stocks targeted by activist investors right now on the belief that the oil and gas company is undervalued. Bluebell Capital Partners has already launched an activist campaign against BP p.l.c. (NYSE:BP), insisting management take several steps to ensure it remains on its path to generating shareholder value.\nThe changes include the company slowing its commitment to reduce oil and gas production by 25% by 2030 to reduce carbon emissions. The activist investor is also challenging BP p.l.c. (NYSE:BP)' s plan to focus on its transition businesses, including charging, renewables and hydrogen.\n\"primarily due to an ill-conceived strategy aimed at drastically shrinking BP's core business (oil and gas), on the one hand, and rapidly promoting a risky diversification into sectors with lower targeted returns and where BP has 'no right to win,\" Bluebell Capital said in a statement.\nAccording to the activist investor, BP p.l.c. (NYSE:BP)' s push to diversify away from its core oil and gas business into renewables and other projects lowers returns on capital and reduces value generation for shareholders.\nOverall BP ranks 3rd on our list of the stocks targeted by activist investors right now. You can visit 10 Stocks Targeted by Activist Investors Right Now to see the other stocks that are on hedge funds’ radar. While we acknowledge the potential of BP as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than BP but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n READ NEXT: 20 Countries with the Highest Purchasing Power Parity in the World in 2024  and 10 Very High Yield Dividend Stocks With Upside Potential.\n Disclosure: None. This article is originally published at Insider Monkey.", "Link": "Https://Finance.Yahoo.Com/News/Bp-P-L-C-Bp-073544688.Html", "Sentiment_Score": -0.082267195, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-07-18T13:00:11.000Z", "Headline": "Investors Heavily Search BP p.l.c. (BP): Here is What You Need to Know", "Summary": "BP (BP) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term.\nOver the past month, shares of this oil and gas company have returned +0.1%, compared to the Zacks S&P 500 composite's +2.1% change. During this period, the Zacks Oil and Gas - Integrated - International industry, which BP falls in, has lost 1.1%. The key question now is: What could be the stock's future direction?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRevisions to Earnings Estimates\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nBP is expected to post earnings of $1.09 per share for the current quarter, representing a year-over-year change of +22.5%. Over the last 30 days, the Zacks Consensus Estimate has changed -7.4%.\nFor the current fiscal year, the consensus earnings estimate of $4.46 points to a change of -6.7% from the prior year. Over the last 30 days, this estimate has changed -6.3%.\nFor the next fiscal year, the consensus earnings estimate of $5.18 indicates a change of +16% from what BP is expected to report a year ago. Over the past month, the estimate has changed -5.5%.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #4 (Sell) for BP.\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\n12-month consensus EPS estimate for BP _12MonthEPSChartUrl\nRevenue Growth Forecast\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\nFor BP, the consensus sales estimate for the current quarter of $62.44 billion indicates a year-over-year change of +26.2%. For the current and next fiscal years, $239.78 billion and $256.49 billion estimates indicate +12.6% and +7% changes, respectively.\nLast Reported Results and Surprise History\nBP reported revenues of $49.96 billion in the last reported quarter, representing a year-over-year change of -12.3%. EPS of $0.97 for the same period compares with $1.66 a year ago.\nCompared to the Zacks Consensus Estimate of $61.77 billion, the reported revenues represent a surprise of -19.12%. The EPS surprise was -5.83%.\nThe company could not beat consensus EPS estimates in any of the last four quarters. The company could not beat consensus revenue estimates in any of the last four quarters.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nBP is graded A on this front, indicating that it is trading at a discount to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nConclusion\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about BP. However, its Zacks Rank #4 does suggest that it may underperform the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Investors-Heavily-Search-Bp-P-130011160.Html", "Sentiment_Score": 0.0072026365, "Sentiment_Category": "neutral"}, {"Ticker": "BP", "Time": "2024-07-17T14:36:00.000Z", "Headline": "BP Secures Funding for Advanced Green Hydrogen Plant in Germany", "Summary": "BP Plc BP has secured funding to advance the development of a groundbreaking green hydrogen plant at its Lingen refinery, marking the first fully owned and operated green hydrogen facility by the U.K. oil major.\nThe project is poised to significantly contribute to Germany's ambitious energy transition plans by reducing the reliance on natural gas and coal.\nThe innovative hydrogen plant will utilize a 100-MW electrolyzer capable of producing 10-11 kilotons of green hydrogen annually. This hydrogen will be generated through the electrolysis of water using renewable electricity, primarily sourced through an offshore wind power purchase agreement.\nThe green hydrogen produced will be utilized at BP’s Lingen refinery and supplied to local industries, including steel and chemical producers, aiding in the decarbonization of their production processes.\nThe project, which was initially outlined in 2020 in collaboration with Orsted A/S, has now been expanded to a 100-MW capacity. Although Orsted has since withdrawn, BP has proceeded with the development, receiving vital funding from the Lower Saxony regional government and Germany’s Economy Ministry. This support is part of the European Union’s IPCEI Hy2Infra initiative, aimed at fostering the hydrogen economy across Europe.\nThe green hydrogen initiative at Lingen is a milestone for BP and the broader energy sector in Germany. By replacing traditional fossil fuels with green hydrogen, the project will contribute to a cleaner, more sustainable energy future. This aligns with Germany’s broader objectives to pivot away from natural gas and coal, thereby supporting industrial decarbonization.\nBP's green hydrogen project at Lingen surpasses similar projects, such as Shell Plc’s SHEL Rheinland refinery, which launched a 10-MW electrolyzer in 2021. Shell aims to become a top supplier of green hydrogen for industrial and transport customers in Germany.\nAdditionally, BP is exploring green hydrogen production at its Castellon refinery in Spain, further emphasizing its commitment to sustainable energy solutions. With a history spanning more than 70 years, BP's Lingen refinery has been a cornerstone of energy supply for the German industry. The transition to green hydrogen marks a new chapter in its legacy, positioning BP at the forefront of the energy transition in Germany and Europe.\nBP’s Lingen green hydrogen project is set to play a crucial role in developing a hydrogen economy, serving as a building block for a sustainable energy transition. As Germany and Europe strive to reduce carbon emissions and enhance energy security, initiatives like BP’s green hydrogen plant at Lingen will be instrumental in shaping a cleaner and greener future.\nZacks Rank & Stocks to Consider\nCurrently, BP carries a Zacks Rank #3 (Hold).\nInvestors interested in the energy sector may look at some better-ranked companies mentioned below. The companies presently sport a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nSunoco LP SUN is a leading wholesale motor fuel distributor in the United States, boasting a vast distribution network spanning 40 states. With long-term contracts servicing more than 10,000 convenience stores, it distributes more than 10 fuel brands, ensuring a stable revenue stream. SUN currently has a Value and Growth Score of A.\nThe Zacks Consensus Estimate for 2024 and 2025 earnings per unit is pegged at $7.29 and $7.17, respectively. The partnership has witnessed upward earnings estimate revisions for 2024 and 2025 in the past 60 days.\nSM Energy Company SM is set to expand its oil-centered operations in the coming years, with an increasing focus on crude oil, especially in the Permian Basin and Eagle Ford regions. The company’s attractive oil and gas investments should create long-term shareholder value.\nThe Zacks Consensus Estimate for SM’s 2024 and 2025 earnings per unit is pegged at $7.15 and $8.79, respectively. The company has a Zacks Style Score of A for Value. It has witnessed upward earnings estimate revisions for 2025 in the past 30 days.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nSunoco LP (SUN) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Bp-Secures-Funding-Advanced-Green-143600183.Html", "Sentiment_Score": 0.9167374969, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-17T13:11:00.000Z", "Headline": "Saipem (SAPMF) Wins Major Subsea Contract Offshore Azerbaijan", "Summary": "Saipem S.p.A SAPMF, an Italian oilfield services provider, has entered into a framework agreement with an oil major, BP plc BP, to provide subsea services in Azerbaijani waters. The agreement was signed between BP and a consortium consisting of Saipem, BOS Shelf and BOS Shelf International FZCO.\nThe contract involves carrying out offshore activities in the Caspian Sea, using the SCV Khankendi vessel, which is an advanced subsea construction vessel owned by the Shah Deniz consortium.\nWhile Saipem will operate the vessel and provide the crew for the execution of subsea activities in the Shah Deniz and Azeri-Chirag-Gunashli fields, the consortium will carry out the engineering, procurement, construction and installation of subsea infrastructures. The consortium is also responsible for providing life-of-field services.\nThe framework agreement has an aggregate value of $300 million, which includes the value of the services that the consortium can provide upon the customer’s request, of which Saipem’s share is $250 million. The initial duration of the contract is three years, with an option to extend it by another two years.\nThe recent contract between BP and Saipem reinforces their long-term commitment to work together in the region.  The SCV Khankendi vessel was alloted to Saipem for operational management under an agreement with BP (in 2016). This agreement involved the execution of offshore activities in the Shah Deniz field.\nZacks Rank and Other Key Picks\nCurrently, SAPMF carries a Zacks Rank #2 (Buy).\nSome other top-ranked stocks in the energy sector areSM Energy SM and Hess Corporation HES. SM Energy presently sports a Zacks Rank #1 (Strong Buy), while Hess Corporation carries a Zacks Rank #2. You can see the complete list of today’s Zacks #1 Rank stocks here.\nSM Energy is an upstream energy firm operating in the prolific Midland Basin and the South Texas regions. For 2024, the company expects its production to increase from the prior-year reported figure, signaling a bright production outlook.\nHess is a leading upstream energy company with its operations focused on the prolific resources offshore Guyana. The company has made significant oil discoveries in the Stabroek Block, off the coast of Guyana. Hess is currently in the process of being acquired by energy supermajor Chevron in an all-stock deal that will result in the creation of an energy behemoth with a massive portfolio of producing assets.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nHess Corporation (HES) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nSaipem (SAPMF) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Saipem-Sapmf-Wins-Major-Subsea-131100933.Html", "Sentiment_Score": 0.9340666533, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-16T12:51:00.000Z", "Headline": "3 Energy Giants Team Up for Ruwais LNG Project in Abu Dhabi", "Summary": "The world's energy needs are changing. While we still rely on traditional resources, the focus is shifting toward cleaner, more sustainable solutions. This trend is exemplified by the recently announced Ruwais liquefied natural gas (LNG) project in Abu Dhabi, marking a significant collaboration between the Abu Dhabi National Oil Company (“ADNOC”) and three leading European energy companies, namely Shell plc SHEL, BP plc BP and TotalEnergies SE TTE.\nSHEL, BP and TTE have secured a 10% stake each in the Ruwais LNG project. This strategic partnership positions ADNOC, the state-owned oil company of the United Arab Emirates, and these energy giants at the forefront of developing one of the world's lowest carbon-intensive LNG facilities.\nSituated in Al Ruwais Industrial City, the Ruwais LNG project will be the first LNG export facility in the Middle East and North Africa region to use clean power for its operations. By leveraging cutting-edge technology and artificial intelligence (AI), the project is aimed at minimizing emissions and maximizing operational efficiency, with a total capacity of 9.6 million tons per annum (mtpa).\nThe Ruwais LNG project is set to greatly enhance the United Arab Emirates’ LNG export capacity. Scheduled to begin operations in the latter half of 2028, it is expected to strengthen the country’s status as a key player in the global LNG market.\nAs per agreements, ADNOC will have a controlling 60% stake in the Ruwais LNG project and take the lead as its developer and operator. However, SHEL, BP and TTE are also positioned to gain from their investments.\nExpanding LNG Portfolio: The project should allow the aforementioned companies to further grow their world-leading LNG portfolios. As Wael Sawan, Shell's CEO, mentioned, \"In line with our strategy to create more value with less emissions, we are investing in additional LNG capacity and further growing our world-leading LNG portfolio with energy-efficient and carbon-competitive projects.\"\nShell, which carries a Zacks Rank #3 (Hold) at present, also announced that its deal includes an offtake agreement to purchase 1 mtpa of LNG. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nReducing Carbon Intensity: The Ruwais LNG facility is designed to be one of the world's lowest carbon-intensive LNG plants, leveraging clean power and the latest technologies to minimize emissions. This aligns with the companies' decarbonization goals. As TotalEnergies' CEO Patrick Pouyanné highlighted, \"With Ruwais LNG, we are implementing this principle by establishing one of the world's lowest-carbon intensity LNG plants, enabling natural gas to effectively serve as a transitional fuel.\"\nThis France-based multi-energy company produces and markets oil and biofuels, natural gas, green gases, renewables, and electricity in the rest of Europe, North America, Africa and internationally. The Zacks Rank #3 (Hold) company aims to be a net-zero carbon emission company by 2050 and has taken the necessary steps to achieve this goal.\nStrengthening Partnerships: The investments deepen the strategic partnerships between these major European companies and ADNOC. This allows for knowledge sharing, collaboration on innovation and potential opportunities.\nThe CEO of BP remarked, “BP is proud to be joining ADNOC in its plans for Ruwais LNG, deepening our long-standing strategic partnership. This is a further example of our investment in gas growth in the Middle East as we continue to strengthen our LNG business globally.” This Zacks Rank #3 company aims for a 25 mtpa of LNG portfolio by 2025.\nAccessing Growth Markets: The project positions the companies to capitalize on the growing global demand for natural gas as a transitional fuel. By participating in this major LNG project in the Middle East, they gain a strategic foothold in a key growth market.\nBoosting Local Industrial Development: The Ruwais LNG project is expected to accelerate the development of the Al Ruwais Industrial City, creating skilled private sector jobs for the UAE nationals and supporting the local industrial ecosystem. This also aligns with the country’s economic diversification goals.\nThe partnership also highlights Abu Dhabi's attractiveness as an investment destination for international energy players, as emphasized by His Highness Sheikh Khaled bin Mohamed bin Zayed Al Nahyan, the Crown Prince of Abu Dhabi. The UAE's focus on driving efficiency, enhancing workforce capabilities and investing in clean energy solutions has created a favorable environment for such strategic collaborations.\nADNOC has also signed several new long-term LNG sales commitments with SHEL and Tokyo-based Mitsui & Co., taking the committed Ruwais LNG production capacity to 70%. This demonstrates the growing global demand for natural gas as a transitional fuel and the UAE's positioning as a key player in meeting this demand.\nIn conclusion, the Ruwais LNG investment allows Shell, BP and TotalEnergies to expand their LNG portfolios, reduce carbon intensity, strengthen key partnerships, access growth markets and contribute to local industrial development — all of which provide long-term strategic and commercial benefits for these major energy companies.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nTotalEnergies SE Sponsored ADR (TTE) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/3-Energy-Giants-Team-Ruwais-125100478.Html", "Sentiment_Score": 0.2172399461, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-16T07:20:00.000Z", "Headline": "TotalEnergies Expects Output at High End of Guidance, Warns on Weak Refining Margins", "Summary": "TotalEnergies said it expected its second-quarter oil-and-gas output at the high end of its guidance range, but warned that weak refining margins would hamper downstream results.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/4598044A-Efe9-3626-B2Fd-0046F56606Fd/Totalenergies-Expects-Output.Html", "Sentiment_Score": -0.9363443255, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-07-15T22:00:00.000Z", "Headline": "Big Auto Eyes $2B in Govt Grants to Boost EV Production", "Summary": "The Biden administration is awarding nearly $2B in grants to General Motors (NYSE:GM), Stellantis (NYSE:STLA) and other carmakers to help restart or expand electric vehicle manufacturing and assembly sites in eight states.\nThe Energy Department will issue grants totaling $1.7 billion to create or retain thousands of union jobs and support auto-based communities in the three presidential battleground states of Michigan, Pennsylvania and Georgia as well Ohio, Illinois, Indiana, Maryland, and Virginia.\nAccording to Biden, the grants-- paid for by the landmark IRA of 2022--will help deliver on Washington’s commitment to ensure the future of the auto industry is made in America by American union workers.\n“There is nothing harder to a manufacturing community than to lose jobs to foreign competition and a changing industry,” said U.S. Secretary of Energy Jennifer M. Granholm. “Even as our competitors invest heavily in electric vehicles, these grants ensure that our automotive industry stays competitive--and does it in the communities and with the workforce that have supported the auto industry for generations,’’ she added.\nLast week, GM announced it has received a $500 million federal grant to help the company convert an assembly plant in Lansing, Michigan to produce EVs. GM has already invested over $12 billion in its North American EV manufacturing and supply chain since 2020.\nRelated: Houthis Showcase Drone Boat as Another Merchant Ship Falls Victim\nThe grants were hotly contested, with the DoE revealing it received four times as many applicants as grant recipients. DoE says all projects that were awarded funding currently employ Americans working in union jobs in the U.S.\nThe selected projects will create more than 2,900 jobs and help ensure that about 15,000 union workers are retained across all 11 facilities, the White House has said. According to the DoE, the new grants complement $177 billion in private sector investment in EV and battery manufacturing since Biden took office.\nThe UAW has, however, warned that a too rapid transition from ICE to EVs could put thousands of jobs at risk in key states such as Michigan, Ohio, Illinois and Indiana.\nUAW President Shawn Fain has applauded the announcement, saying the grants and loans \"makes clear to employers that the EV transition must include strong union partnerships with the high pay and safety standards that generations of UAW members have fought for and won.\"\nImpact On Oil Demand\nWith the year at the midpoint, the EV boom shows no signs of slowing down.\nEV sales globally have now hit 18% of all new vehicle sales, with BEV sales up by 14% YoY in April, while plugin hybrids jumped 51% YoY. A big driver of the EV megatrend is falling costs, with Tesla Inc.’s (NASDAQ:TSLA) most affordable model now $6,500 cheaper than its ICE peer, the cheapest BMW 3 Series, according to Bloomberg. Meanwhile, Gartner has predicted that EVs will be cheaper to produce than ICE vehicles of the same size in only three years, thanks in large part to improvements in manufacturing methods with production costs dropping faster than battery costs.\n“New OEM incumbents want to heavily redefine the status quo in automotive. They brought new innovations that simplify production costs such as centralized vehicle architecture or the introduction of gigacastings that help reduce manufacturing cost and assembly time, which legacy automakers had no choice to adopt to survive, ”Pedro Pacheco, vice president of research at Gartner, has said.\nRapid EV adoption has elicited dire predictions for the oil sector. Last year, Bloomberg predicted that global demand for road fuel will peak in 2027 at 49 million barrels per day driven by the rapid adoption of electric vehicles, ever-improving fuel efficiency, and shared mobility. Just a week ago, British Oil & Gas giant BP Plc (NYSE:BP) predicted that global oil demand will peak next year while wind and solar capacity will continue to grow rapidly.\nIn its latest edition of its annual Energy Outlook, BP has published a study of the evolution of the global energy system to 2050.  BP has modeled its predictions on two key scenarios: The Current Trajectory and Net Zero. BP has predicted that oil demand will peak by 2025 at around 102 million barrels per day (bpd) under both scenarios.\nHowever, the rate of decline thereafter will be determined primarily by the pace of falling oil use in road transport. In the Current Trajectory, BP sees oil consumption gradually declining over the second half of the outlook to around 75 million bpd in 2050. The drop is, however, much more pronounced in Net Zero, with demand falling somewhere between 25 million and 30 million bpd by 2050.\nBy Alex Kimani for Oilprice.com\nMore Top Reads From Oilprice.com\nU.S. Oil, Gas Drilling Activity Continues To Drop\nSuriname’s Mega Oil Boom Is Back on Track\nBrent Tops $86 on Hopes of Fed Cut in September\nRead this article on OilPrice.com", "Link": "Https://Finance.Yahoo.Com/News/Big-Auto-Eyes-2B-Govt-220000775.Html", "Sentiment_Score": 0.909973979, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-15T13:01:00.000Z", "Headline": "BP Ups Oil & Gas Demand Forecasts Amid Slow Clean Energy Shift", "Summary": "BP plc (BP) has projected that the global oil demand will peak next year, with wind and solar capacity set to expand rapidly under both main scenarios outlined in its annual Energy Outlook. The report, which studies the evolution of the global energy system up to 2050, suggests significant shifts in energy consumption patterns and carbon emissions. The energy giant highlighted these projections in its annual outlook, cautioning that a delay in the shift to renewable power could prove \"costly.\"\nScenarios and Emissions\nBP's Energy Outlook presents two scenarios — the Current Trajectory and the Net Zero scenario. Both scenarios predict that carbon emissions, predominantly from fossil fuels, will peak in the mid-2020s. The Current Trajectory scenario is based on existing climate policies and carbon reduction commitments. In contrast, the Net Zero scenario assumes stricter climate policies aligned with the Paris Agreement, aiming for a 95% reduction in carbon emissions by mid-century.\nIn the Current Trajectory scenario, primary energy demand continues to rise until the mid-2030s, then stabilizes. By 2050, energy demand is projected to be around 5% higher than in 2022. Conversely, the Net Zero scenario sees energy demand peaking mid-decade and declining thereafter, with a 25% reduction by 2050 compared to 2022.\nOil and Natural Gas\nAccording to the outlook, oil demand is expected to peak around 102 million barrels per day (bpd) in 2025 under both scenarios. However, the rate of decline varies.\nIn the Current Trajectory, oil consumption is expected to drop to around 75 million bpd by 2050, while in the Net Zero scenario, the decline is likely to be in the range of 25-30 million bpd. Oil demand is expected to reach approximately 97.8 million barrels per day (b/d) by 2035, based on the current global energy system trajectory. This figure marks an upward revision of more than 5% compared to last year's forecast when BP had significantly reduced its growth expectations for both oil and gas.\nNatural gas demand shows contrasting trends in the two scenarios. Under the Current Trajectory, demand should increase around 20% by 2050, driven by substantial growth in emerging economies. In the Net Zero scenario, gas demand is expected to peak mid-decade and then halve by 2050, with 80% of consumption abated through carbon capture and storage (CCS) technology. BP's forecast for natural gas demand in 2035 has also risen 3% compared to last year's projection.\nThe last increase in oil demand projections for 2030 occurred in 2022, while gas projections were previously raised in 2018. Despite the increased demand for fossil fuels, BP anticipates that CO2 emission levels will be lower by 2050 under both the current trajectory and net zero scenarios.\nRenewable Energy\nBoth scenarios predict a substantial increase in renewable energy capacity. Wind and solar power are expected to grow eight-fold by 2050 in the Current Trajectory scenario and 14-fold in the Net Zero scenario. Until 2035, China and developed economies will lead the expansion, each contributing 30-45% of new capacity.\nLNG Demand\nLiquefied natural gas (LNG) demand is anticipated to grow rapidly until 2030, with a 40% and 30% increase in the Current Trajectory and the Net Zero scenarios, respectively, compared to the 2022 levels. Post-2030, LNG demand will continue to rise by more than 25% in the Current Trajectory, necessitating additional liquefaction capacity. However, the Net Zero scenario forecasts a reversal in gains post-2030, with global LNG trade dropping 40% below 2022 levels by 2050.\nConclusion\nBP's Energy Outlook highlights the critical transitions facing the global energy landscape. While the report did not explicitly state the reasons for the revised forecasts, it noted that under the current trajectory, the decline in oil use for road transport is balanced by its increasing use in the petrochemicals industry.\nIn emerging economies, growing prosperity and rising living standards are expected to support robust oil demand. BP's latest outlook indicates a complex and evolving energy landscape, where the pace of the transition to renewable energy sources must accelerate to meet global targets and mitigate the potential costs of delay.\nZacks Rank & Key Picks\nBP currently carries a Zack Rank #3 (Hold).\nInvestors interested in the energy sector may look at some better-ranked stocks like Hess Corporation HES, Sunoco LP SUN and SM Energy Company SM, each sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.\nHess is a leading oil and natural gas exploration and production company that made several world-class oil discoveries in the Stabroek Block, located off the coast of Guyana. The company is currently in the process of being acquired by supermajor Chevron in an all-stock deal worth $53 billion. The merger will likely result in the creation of an energy behemoth with a massive portfolio of producing assets.\nThe Zacks Consensus Estimate for HES’ 2024 EPS is pegged at $10.52. The company has a Zacks Style Score of B for Growth. It has witnessed upward earnings estimate revisions for 2024 and 2025 in the past seven days.\nSunoco is a leading wholesale motor fuel distributor in the United States, boasting a vast distribution network spanning 40 states. With long-term contracts servicing more than 10,000 convenience stores, it distributes over 10 fuel brands, ensuring a stable revenue stream. SUN currently has a Value Score of A.\nThe Zacks Consensus Estimate for 2024 and 2025 earnings per unit is pegged at $7.29 and $7.17, respectively. The partnership has witnessed upward earnings estimate revisions for 2024 and 2025 in the past 60 days.\nSM Energy is set to expand its oil-centered operations in the coming years, with an increasing focus on crude oil, especially in the Permian Basin and Eagle Ford regions. The company’s attractive oil and gas investments should create long-term value for shareholders.\nThe Zacks Consensus Estimate for SM’s 2024 EPS is pegged at $7.15. The company has a Zacks Style Score of A for Value. It has witnessed upward earnings estimate revisions for 2025 in the past 30 days.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nHess Corporation (HES) : Free Stock Analysis Report\nSunoco LP (SUN) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Bp-Ups-Oil-Gas-Demand-130100727.Html", "Sentiment_Score": 0.6771891117, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-15T12:45:13.000Z", "Headline": "Audi and BP team up for Formula 1 from 2026", "Summary": "Audi’s F1 team will compete from the 2026 season (BP)\nLondon-listed oil major BP is teaming up with Audi as rhe German carmaker prepares to enter a term in Formula 1..\n The Audi team will race from the 2026 season, when new technical regulations will come into force covering increased use of electrification and sustainable fuels.\n Greenhouse gas emissions from the new fuels must be cut by at least 65% compared with fossil-derived petrol.\n BP will offer its expertise in this area, and has been engineering suitable fuels for two years. There are also  specialist lubricants from BP’s Castrol brand. They will include a range of fluids for the electrical components in Audi’s F1 power unit and its V6 turbo engine.\n Both aim to “enable maximum performance from the Audi F1 Power Unit,” BP said today.\n The deal makes BP the first official partner of Audi’s F1 team. There will be marketing and branding rights for BP and its Castrol and Aral brands, with Aral its fuel and retail arm in Germany.\n BP has already worked with Audi in other forms of motorsport, including the World Rally Championship and the Le Mans 24 Hour Race.\n Adam Baker, CEO of Audi Formula Racing said:\n “This partnership is of great importance to us. There will be strong competition in the field of sustainable fuels in Formula 1 from 2026.\n “In view of the high performance potential, it was important for us to start our fuel testing at the end of 2022 with BP as our partner. The combustion process is highly complex and can only be optimized by developing the engine in combination with the fuel properties.”\n BP’s Nicola Buck said: “We are already making great progress … as we seek to innovate and unlock maximum engine performance for the Audi F1 Power Unit.”", "Link": "Https://Finance.Yahoo.Com/News/Audi-Bp-Team-Formula-1-124513360.Html", "Sentiment_Score": 0.1346771568, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-14T23:00:00.000Z", "Headline": "Oil and Gas Are Here To Stay", "Summary": "The energy transition is showing signs of losing momentum over the past few months. EV sales are slowing, wind and solar capacity additions are not expanding fast enough, and electricity is getting more instead of less expensive.\nWith those signs, others have been flashing red, too. Despite the push against oil and gas, these are here to stay for the long haul—and demand won’t even decline that much after peaking, according to the latest energy outlook of BP.\nThe supermajor, which used to compile the Statistical Review of World Energy, now does its own review. And according to its latest edition, oil demand will peak next year. And it’s not the first time it’s called the peak for oil demand.\nThe last time its statistical review said that demand growth had peaked—in 2019—it turned out to be very wrong. In reality, oil demand soared after the end of the pandemic lockdowns to reach new all-time highs.\nNow, BP has noted that over the past five years, oil demand has been growing at an average of half a million barrels daily since 2019, but that is about to end, with demand on the decline over the next couple of decades. But here’s the thing. Before, BP forecast that this decline would be quite substantial. Now, it expects that in 2035, the world will still consume 97.8 million barrels of oil per day in 2035, which would be a relatively minor decline from the current rate of consumption, which is about 100 million barrels daily, which may rise above that this year if demand strengthens in the second half.\nIn other words, BP acknowledges that the human civilization’s dependence on hydrocarbons will not be so easy to shake simply by embracing alternative energy sources. What’s more, primary energy demand is still on an upward trajectory, and hydrocarbons will be the energy sources to respond to much of that—until we start needing less energy.\nIt is energy demand that is key to the success of the transition to energy sources that leave a lot to be desired in areas such as energy density and storage costs. To make them work, we need to consume less rather than more energy. Indeed, if governments and the business world suddenly find all the money and regulatory support that the transition needs, energy demand growth will peak by next year under BP’s Net Zero scenario.\nUnlike that perfect-case scenario, the Current Trajectory scenario points to energy demand growth continuing until the middle of the next decade before peaking and then plateauing—because the developing world would continue to need more energy.\nThe BP outlook essentially outlines a deepening divide between the developed world, which is where the transition push began and where it has been the strongest, and the developing world, where access to energy is still a luxury in many places. Yet as developing economies grow, this luxury would become accessible to more people, and these people would be consuming ever more energy until they hit a peak.\nThe fact that the developing world is driving the increase in oil and gas demand while the developed world has seen a minor decline in its own demand for these—at the significant expense of deindustrialization—highlights a contradiction in one of the most popular transition arguments. It states that the transition will ensure abundant and affordable energy for everyone. However, the current state of the world is proof enough this is wishful thinking at best: the facts suggest that energy abundance lies with the energy sources the transition wants to do away with and replace.\nThat is how the developing world increases overall global oil demand while the developed world tries to consume less of it and mostly fails. And that is why BP has forecast continued dominance for oil—and gas—over the long term, with the decline mostly the result of improving energy efficiency, per its outlook. Interestingly, under its Current Trajectory scenario, strong oil demand remains despite a twofold increase in wind and solar deployments by 2050, to give those two, along with geothermal and biogas, a share of about 25% in total primary energy by that year.\nThis suggests that the current trajectory of energy policies, which has seen a veritable surge in wind and solar deployments, EV sales, and all sorts of other transition-related activities, is falling hopelessly behind the targets of the net-zero plan. It is something many transition advocates have been warning about, the IEA being among the most vocal ones. If the transition to net zero is to happen, the world needs to move faster, harder, and with even more urgency.\nYet this is not how things are moving on. There is that gap between the wealthy developed world, which is getting less wealthy as it directs ever-growing cash flows to the transition, and the poor developing world, which is getting wealthier because it is consuming more and more hydrocarbon energy—and it likes it. That’s how oil and gas will continue to dominate the global energy landscape in the future. The developing world is a big place.\nBy Irina Slav for Oilprice.com\nMore Top Reads From Oilprice.com\nRussian Oil Product Shipments Slipped in June\nInternational Oil Companies Caught in Kurdish Smuggling Web\nBanks Still Play a Major Role in Oil and Gas Funding\nRead this article on OilPrice.com", "Link": "Https://Finance.Yahoo.Com/News/Oil-Gas-Stay-230000623.Html", "Sentiment_Score": 0.0675206035, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-12T16:23:13.000Z", "Headline": "BP sees global oil demand peaking next year", "Summary": "Energy giant bp has said that global oil demand will peak as early as 2025, with renewable energy sources growing rapidly as the desire for hydrocarbons subsidies.\nThe company, which has recently pondered a move away from its own renewable ventures, estimated that the peak would start to bring an end to rising global carbon emissions by the middle of the 2020s.\nAccording to the company’s annual Energy Outlook study, which assesses the global energy system to 2050, oil use will rise by two million barrels a day (mbbl/d) to peak in 2025, hitting 102mbbl/d.\nThe company has put forward two scenarios: the world’s current energy transition trajectory and the road to meeting net zero targets by 2050.\nIn both cases, carbon emissions will reach a peak in the middle of the decade as both solar and wind projects see enormous growth around the world, with set-up and operational costs falling.\nHowever, in terms of natural gas, in the report’s net-zero scenario its usage would peak around the middle of this decade before halving by 2050 compared with current levels.\nThe current trajectory model estimates that gas demand will continue to grow, expanding by around a fifth by 2050.\nAll this comes as bp CEO Murray Auchincloss recently initiated a hiring freeze and suspended offshore wind projects, according to sources at the company, as he places focus on oil and gas to boost revenues.\nHe is reportedly looking to halt large, fixed capital investments in offshore wind as they are not expected to deliver returns for years.\nIts earnings for the first quarter of 2024 were $2.7bn (£2.1bn), down 45% from the same period in 2023, due to lower energy prices and a US refinery outage, despite an increase in oil and gas production.\nBP’s adjusted earnings before interest, taxes, depreciation and amortisation were $10.3bn, while underlying replacement cost profit stood at $2.72bn.\nThe company’s upstream production grew by 2.1% compared with the previous year, with the new Azeri Central East platform launched in the Caspian Sea.\n\"BP sees global oil demand peaking next year\" was originally created and published by Power Technology, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/Bp-Sees-Global-Oil-Demand-162313086.Html", "Sentiment_Score": 0.5364069939, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-12T14:53:00.000Z", "Headline": "BP Partners With Simon to Expand EV Charging Network Across US", "Summary": "BP plc BP, the British energy major, has partnered with Simon Property Group Inc. SPG to expand its global EV charging business, bp pulse. Simon Property Group is a real estate investment trust involved in acquiring, owning and leasing of shopping, dining, entertainment and mixed-use destinations.\nbp pulse has announced a deal for the installation of EV charging Gigahubs across 75 sites in collaboration with Simon, which will offer more than 900 super-fast charging bays for its customers. The EV charging sites across all locations are expected to be compatible with nearly every model of EVs available in the market at present.\nThis deal highlights BP’s focus on expanding its EV charging network and delivering charging infrastructure to locations as per the needs and convenience of its customers. In its latest effort to expand its EV charging network across the United States, bp pulse will be adding EV charging stations across Simon destinations.\nBP had previously expanded its Gigahub network near airports and major metropolitan areas, thereby enhancing accessibility for its customers. Additionally, the company has also integrated EV charging into its branded convenience stores and TravelCenters of America.\nSimon’s portfolio supports bp pulse’s broader objective to deploy ultra-fast charging infrastructure across the United States, per BP’s statement. Through this collaboration, bp pulse will be able to provide EV drivers access to an extensive range of retail offerings at SPG's impressive destinations.\nSimon is enthusiastic about expanding EV charging options across its portfolio through the collaboration with bp pulse. SPG highlights that it is committed to providing the best-in-class experience for all its customers and the community.\nBP is working closely with key partners who share a similar long-term commitment to providing electrification solutions for its customers, which includes real estate partners who facilitate the deployment of EV charging infrastructure to locations where EV drivers need and utility firms that ensure the availability of adequate site power. Utilities also assist in acquiring the necessary approvals and permits needed to scale up the infrastructure as per consumer demand.\nZacks Rank and Key Picks\nBP and SPG carry a Zacks Rank #3 (Hold) each at present.\nSome better-ranked stocks in the energysector are SM Energy SM and Hess Midstream Partners LP HESM. SM Energy presently sports a Zacks Rank #1 (Strong Buy), while Hess Midstream carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nSM Energy is an upstream energy firm operating in the prolific Midland Basin and the South Texas regions. For 2024, the company expects its production to increase from the prior-year reported figure, signaling a bright production outlook.\nHess Midstream owns, operates, develops and acquires a wide range of midstream assets, providing services to Hess Corporation and other third-party customers. The partnership has a stable fee-based revenue model secured via long-term commercial contracts. Since Hess Midstream operates through 100% fee-based contracts, it is exposed to minimal commodity price risks.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nSimon Property Group, Inc. (SPG) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nHess Midstream Partners LP (HESM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Bp-Partners-Simon-Expand-Ev-145300885.Html", "Sentiment_Score": 0.8925135136, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-11T13:38:00.000Z", "Headline": "BP to Invest $48.5M in Chinese Biofuels Amid SAF Mandate Talks", "Summary": "BP plc (BP) has announced a significant investment of Yuan 353 million ($48.54 million) to acquire a 15% stake in Lianyungang Jiaao New Energy, a leading producer of renewable diesel and sustainable aviation fuel (SAF), owned by Zhejiang-based Jiaao Enprotech. This strategic move, reported by S&P Global on Wednesday, marks BP's commitment to enhancing its portfolio in renewable energy.\nLianyungang Jiaao New Energy, under its parent company Jiaao Enprotech, boasts a production capacity of 100,000 metric tons of SAF per year. This deal aligns with the increasing anticipation of China introducing SAF mandates, which could significantly boost the demand for sustainable aviation fuel in the near future.\nIn 2023, global consumption of SAF surged to 450,000-500,000 tons, almost double the previous year’s level. However, this still represents a mere 0.1% of total jet fuel consumption. Projections suggest that by 2050, total jet fuel consumption will reach 2.1 million barrels per day, with SAF displacing nearly a quarter of global jet fuel demand.\nDespite this investment, BP has been scaling back its plans for new SAF and renewable diesel projects at its existing sites. This includes halting the development of new biofuel projects at its Lingen refinery in Germany and Cherry Point refinery in Washington state, and reassessing three other projects.\nBP’s investment in Jiaao New Energy represents a strategic move to position itself ahead of anticipated SAF mandates in China. As global demand for SAF continues to rise, driven by policy support and the urgent need for sustainable aviation solutions, BP’s investment could play a crucial role in the evolution of the biofuel market.\nZacks Rank & Key Picks\nBP currently carries a Zack Rank #3 (Hold).\nInvestors interested in the energy sector may look at some better-ranked stocks like Hess Corporation HES, Sunoco LP SUN and SM Energy Company SM, each sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.\nHess is a leading oil and natural gas exploration and production company that made several world-class oil discoveries in the Stabroek Block, located off the coast of Guyana. The company is currently in the process of being acquired by supermajor Chevron in an all-stock deal worth $53 billion. The merger will likely result in the creation of an energy behemoth with a massive portfolio of producing assets.\nThe Zacks Consensus Estimate for HES’ 2024 EPS is pegged at $10.28. The company has a Zacks Style Score of B for Growth. It has witnessed upward earnings estimate revisions for 2024 and 2025 in the past 30 days.\nSunoco is a leading wholesale motor fuel distributor in the United States, boasting a vast distribution network spanning 40 states. With long-term contracts servicing more than 10,000 convenience stores, it distributes over 10 fuel brands, ensuring a stable revenue stream. SUN currently has a Value Score of A.\nThe Zacks Consensus Estimate for 2024 and 2025 earnings per unit is pegged at $7.29 and $7.17, respectively. The partnership has witnessed upward earnings estimate revisions for 2024 and 2025 in the past 60 days.\nSM Energy is set to expand its oil-centered operations in the coming years, with an increasing focus on crude oil, especially in the Permian Basin and Eagle Ford regions. The company’s attractive oil and gas investments should create long-term value for shareholders.\nThe Zacks Consensus Estimate for SM’s 2024 EPS is pegged at $6.95. The company has a Zacks Style Score of A for Value. It has witnessed upward earnings estimate revisions for 2025 in the past seven days.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nHess Corporation (HES) : Free Stock Analysis Report\nSunoco LP (SUN) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Bp-Invest-48-5M-Chinese-133800436.Html", "Sentiment_Score": 0.8074741364, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-11T13:12:00.000Z", "Headline": "TotalEnergies (TTE) Inks Partnership Deal in Ruwais LNG Project", "Summary": "TotalEnergies SE TTE announced that it has joined Abu Dhabi’s Ruwais liquefied natural gas (LNG) project. ADNOC, the national company, has 60% interest in the project, with TTE, Shell plc SHEL, BP plc BP and Mitsui holding 10% each.\n\nLast year, at COP28, TotalEnergies and ADNOC pledged to lead the Oil & Gas Decarbonization Charter to lower the greenhouse gas emissions of the sector. TTE is putting this idea into effect with Ruwais LNG, one of the LNG facilities with the lowest carbon intensity in the world, enabling natural gas to reach its full potential as a transition fuel.\nKey Details of the Project\nThe Ruwais LNG project, started by ADNOC in June 2024, is situated in Abu Dhabi's Al Ruwais Industrial City. Two liquefaction trains with a combined capacity of 9.6 million tons per year (Mtpa) are part of the project, which is anticipated to be launched in the second half of 2028.\n\nThe initiative sets the benchmark for cutting down on emissions. Its full-electric liquefaction trains will be supplied with clean power by the UAE’s grid, making it one of the world’s lowest-carbon-intensity LNG plants. The plant will also utilize the newest advancements to improve safety, increase efficiency and reduce emissions.\nFocus of TotalEnergies in the LNG Chain\nTTE benefits from an integrated position across the LNG value chain, including production, transportation, access to more than 20 Mtpa of regasification capacity in Europe, trading and LNG bunkering.\n\nTotalEnergies’ global LNG portfolio was 44 Mtpa in 2023, owing to its interests in liquefaction plants in all geographies. The company continues to expand its LNG operation through acquisitions, partnerships and agreements. Its large fleet of LNG tankers and reserved capacity in several regasification terminals make it a perfect partner for the development of LNG projects globally.\n\nTTE’s expanding LNG operation is in sync with its long-term ambition to increase the share of natural gas in its sales mix to approximately 50% by 2030, reduce carbon emissions and eliminate methane emissions associated with the gas value chain.\nDemand for LNG is on the Rise\nThe Institute for Energy Economics and Financial Analysis has released a report indicating that the worldwide LNG market is about to experience an unparalleled surge of new liquefaction projects, starting late 2024.\n\nThis surge is expected to be the quickest expansion in the history of the global LNG sector, marking a 40% rise over a span of five years. The sector is poised to increase its liquefaction capacity nearly five times during 2025-2028 compared with the preceding four-year span.\n\nAlong with TTE, the rising demand for LNG will also boost the prospects of companies like Cheniere Energy LNG, Shell and BP, as these play a vital role in the supply of LNG worldwide. These companies are committed to ensuring that the world has access to a reliable and affordable source of energy as it transitions to a cleaner future.\n\nThe Zacks Consensus Estimate for Cheniere’s 2024 sales and EPS indicates a year-over-year decrease of 24.1% and 79.5%, respectively. The company delivered an average earnings surprise of 58.9% in the last four quarters.\n\nSHEL’s long-term (three- to five-year) earnings growth rate is 4.64%. The Zacks Consensus Estimate for 2024 sales indicates a year-over-year increase of 10.6%.\n\nBP’s long-term earnings growth rate is 4%. The Zacks Consensus Estimate for 2024 sales indicates a year-over-year increase of 13.5%.\nPrice Performance\nIn the past six months, shares of TotalEnergies have risen 2.7% against the industry’s 0.5% decline.\n Zacks Investment Research\n\nImage Source: Zacks Investment Research\nZacks Rank\nThe company currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nCheniere Energy, Inc. (LNG) : Free Stock Analysis Report\nTotalEnergies SE Sponsored ADR (TTE) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Totalenergies-Tte-Inks-Partnership-Deal-131200346.Html", "Sentiment_Score": 0.8992014527, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-10T16:29:00.000Z", "Headline": "bp signs deal with Simon® to expand ultra-fast EV charging network in US", "Summary": "Ultra-fast bp pulse Gigahubs to be rolled out at 75 Simon® locations, adding over 900 charging bays across the US.\nbp pulse continues to leverage its leading global network and expertise to pursue disciplined growth in key markets like the US.\nHOUSTON, July 10, 2024 /PRNewswire/ -- Today, bp (NYSE: bp) announced a deal for bp's global EV charging business, bp pulse, to install and operate EV charging Gigahubs on 75 sites with Simon (Simon Property Group, NYSE: SPG), a real estate investment trust engaged in the ownership of premier shopping, dining, entertainment and mixed-use destinations.\nbp signs deal with Simon® to expand ultra-fast EV charging network in US.\nThis deal will deliver over 900 ultra-fast charging bays that support nearly every make and model of EVs on the market today across all locations, with the first locations opening to the public in early 2026.\nRichard Bartlett, CEO bp pulse said: \"We're pleased to complete this deal with Simon and expand our ultra-fast charging network footprint in the US. The Simon portfolio aligns with bp pulse's strategy to deploy ultra-fast charging across the West Coast, East Coast, Sun Belt and Great Lakes, and we are thrilled to team up with Simon so that EV drivers have a range of retail offerings at their impressive destinations.\"\nChip Harding, Executive Vice President, Simon Brand Ventures said: \"Simon is committed to offering best-in-class brands, amenities, experiences and sustainable practices to our shoppers and the communities that we serve. We look forward to expanding our EV charging options across the Simon portfolio with bp pulse.\"\nThis deal is part of the company's focus on delivering charging infrastructure in the locations customers want and need, through collaboration and new-to-industry builds. Simon destinations are just the latest sites identified for the bp pulse EV charging network in the US, following earlier announcements including the build out of the Gigahub network near airports and major metropolitan areas, and by installing EV charging across bp's significant branded convenience store and TravelCenters of America network.\nSujay Sharma, CEO bp pulse Americas said: \"As a committed long term infrastructure player with a global network of EV charging solutions, bp pulse intends to continue to seek and build transformative industry collaborations in real estate required to scale our network and match the demand of current and future EV drivers.\"\nbp pulse is supported by key partners who also have long-term commitments to enabling electrification solutions for consumers. These relationships include real estate partners who bring charging to where EV drivers need it, and utilities who ensure site power and permit approvals match the pace and scale of consumer demand.\nThe charging stations will be found via the Simon electric vehicle charging webpage, all major map platforms, and the bp pulse app. bp pulse's proprietary energy management solution, Omega, will optimize energy usage on site.\nNote to Editors:\nEV charging is one of bp's five transition growth engines, helping drive its transformation to an integrated energy company while also investing in today's energy system. bp pulse is focusing on four core markets that have the largest EV car parcs: Germany, the US, the UK and China, as well as several joint ventures and other countries with potential for future growth. Worldwide, bp pulse has a network of over 33,900 charging bays and aims to roll out more than 100,000 by 2030.  In 2023 the number of charge points in the bp pulse network grew by 35% year-on-year.\nAbout Simon®\nSimon® is a real estate investment trust engaged in the ownership of premier shopping, dining, entertainment and mixed-use destinations and an S&P 100 company (Simon Property Group, NYSE: SPG). Our properties across North America, Europe and Asia provide community gathering places for millions of people every day and generate billions in annual sales.\nContact: Nicole Kennon, Director, PR & Communications, nkennon@simon.com, 704-804-1960\nbp media Contact\nbp press office, US: uspress@bp.com\nbp press office, London: bppress@bp.com\nFor more information visit bp.com\nAbout bp pulse\nbp pulse is bp's electric vehicle (EV) charging business. Focused on fast and reliable charging, bp pulse deploys charging points for EV drivers and commercial fleets on the go; at destination hubs, at the depot and bp retail sites.\nAround the world bp pulse is partnering with some of the world's biggest businesses, while developing the Gigahub™ network, a series of large EV high-speed charging hubs in high-demand locations.\nElectric vehicle charging is one of five growth engines of bp's transformation into an integrated energy company. The company has already installed more than 33,900 charge points and aims to expand its network of public EV charging stations to more than 100,000 worldwide by 2030.\nFor more information on bp, visit bp.com.\nBP Logo (PRNewsfoto/BP)\nCision\nView original content to download multimedia:https://www.prnewswire.com/news-releases/bp-signs-deal-with-simon-to-expand-ultra-fast-ev-charging-network-in-us-302193822.html\nSOURCE bp pulse", "Link": "Https://Finance.Yahoo.Com/News/Bp-Signs-Deal-Simon-Expand-162900610.Html", "Sentiment_Score": 0.8934141397, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-10T13:00:00.000Z", "Headline": "Shell, BP and TotalEnergies Invest in Major Abu Dhabi LNG Project", "Summary": "European energy giants Shell, BP and TotalEnergies have signed deals to invest in Abu Dhabi’s Ruwais liquefied natural-gas project, set to boost the Gulf nation’s export capacity significantly as it pushes into global LNG markets.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/8A265901-38D1-3F44-81Ae-E77Fec17784F/Shell-Bp-And-Totalenergies.Html", "Sentiment_Score": 0.1671319753, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-10T12:56:00.000Z", "Headline": "BP Faces $3B Hit in 2Q24 Amid Refining Challenges & Low Demand", "Summary": "BP plc BP is bracing for a substantial financial setback as it prepares to report its second-quarter 2024 results. The company anticipates a $3-billion (£2.3 billion) hit due to reduced demand for fuels, which has affected its refining business.\nBP has warned investors of significantly lower realized refining margins, which could slash its earnings by $500-$700 million for the quarter. This decline is attributed to weak diesel prices and narrower North American heavy crude oil differentials, which have particularly impacted BP’s large refinery in Whiting, IN. Despite a high level of refinery maintenance in the quarter, the resumption of operations at the Whiting refinery is expected to provide an earnings uplift of $500 million.\nAdding to its financial challenges, BP plans to take a $2-billion write-down as it scales back its refining operations at the Gelsenkirchen refinery in Germany. The company aims to reduce operations by a third starting next year in response to weaker demand. This strategic move underscores BP’s efforts to streamline its operations amid a challenging market environment.\nDespite these setbacks, investors expect BP's second-quarter underlying replacement cost profit, which the company defines as net income, to reach $3.13 billion, according to LSEG data. Earlier this year, BP implemented a hiring freeze and paused renewable energy projects as part of CEO Murray Auchincloss’ plan to enhance returns and cut costs by $2 billion.\nBP’s upstream production in the second quarter is projected to remain broadly flat compared with the prior three months, with oil and gas production standing at 2.38 million barrels of oil equivalent per day (Boe/d) in the first quarter. This stability follows the start-up of fields in Azerbaijan and the United States. Additionally, higher realized oil prices in the second quarter are expected to boost profits by $100-$300 million.\nBP is not alone in facing challenges. The British oil and gas multinational Shell plc SHEL is also expected to take an impairment charge of up to $2 billion in its upcoming results. This follows Shell's decision to halt work on Europe’s largest sustainable aviation fuel project in Rotterdam and sell off a refinery in Singapore. Shell plans to shift its focus from low-carbon investments to expanding its gas business, with plans to develop a gas field east of Trinidad and Tobago.\nAs BP prepares to release its second-quarter results, the company is navigating a complex landscape of lower refining margins, strategic operational adjustments and efforts to enhance profitability. While the anticipated financial hit is significant, BP’s measures to cut costs and adjust its operational focus highlight its strategic response to current market conditions.\nZacks Rank & Key Picks\nBP currently carries a Zack Rank #3 (Hold).\nInvestors interested in the energy sector may look at some better-ranked stocks like SM Energy Company SM and The Williams Companies, Inc. WMB, each currently sporting a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nSM Energy is set to expand its oil-centered operations in the coming years, with an increasing focus on crude oil, especially in the Permian Basin and Eagle Ford regions. The company’s attractive oil and gas investments should create long-term value for shareholders.\nThe Zacks Consensus Estimate for SM’s 2024 and 2025 EPS is pegged at $7.15 and $8.79, respectively. The company has a Zacks Style Score of A for Value and Momentum. It has witnessed upward earnings estimate revisions for 2024 and 2025 in the past seven days.\nWilliams Companies is a premier energy infrastructure provider in North America. The company’s core operations include finding, producing, gathering, processing and transportation of natural gas and natural gas liquids.WMB is paying its shareholders an attractive dividend yielding around 5%.\nThe Zacks Consensus Estimate for WMB’s 2024 and 2025 EPS is pegged at $1.79 and $2.03, respectively. The company has a Zacks Style Score of B for Growth and A for Momentum. It has witnessed upward earnings estimate revisions for 2024 and 2025 in the past 30 days.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nWilliams Companies, Inc. (The) (WMB) : Free Stock Analysis Report\nBP p.l.c. (BP) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Bp-Faces-3B-Hit-2Q24-125600573.Html", "Sentiment_Score": -0.9386878014, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-07-10T03:53:00.000Z", "Headline": "BP to Book Up to $2 Billion Impairment, Warns of Lower Refining Margins", "Summary": "BP’s shares fell after the company warned that its result would be hit by after-tax asset impairments. - phil noble/Reuters\nBP expects to book an impairment of up to $2 billion for the second quarter, and warned that weak oil trading and lower refining margins would hurt earnings.\nThe British energy company said Tuesday that it expects its second-quarter results to be hit by after-tax asset impairments and one-off contract provisions of between $1 billion and $2 billion, including charges relating to a review of its Gelsenkirchen refinery in Germany.\nMost Read from The Wall Street Journal\nUAW President Faces Allegations of Demanding Benefits for Domestic Partner\nPowell Inches the Fed Closer to Cutting Rates\nFBI Probing Rape Allegations Against Star Real-Estate Brokers\nAmerica’s Biggest Nonalcoholic Beer Brand Doubles Its Valuation\nChristian Dior’s $57 Handbags Have a Hidden Cost: Reputational Risk\nBP said in March that it planned to close a third of the crude-processing refinery’s 265,000-barrels-a-day capacity due to a weakened demand outlook. The London-based company also took a $1.34 billion impairment related to the refinery last year due to a change in the economic outlook, it said in its annual report.\nThe company expects its customers and products segment result to weaken from the previous quarter as it takes a $500-million-to-$700-million hit from significantly lower realized refining margins. The division booked $1.29 billion in underlying replacement-cost profit before interest and tax in the first quarter.\nThe warning echoes a similar message from BP’s U.S. peer Exxon Mobil on Monday, when it said lower refining margins across the industry would hurt its second-quarter profits.\nBP’s refining margins were mainly harmed by weaker middle distillates margins and narrower North American heavy crude-oil differentials, it said.\nVolatile refining results could occur more frequently in the future for oil companies and refiners as they grapple with falling demand for traditional fuels as renewables grow in popularity, XTB research director Kathleen Brooks said in market comment.\nMeanwhile, its gas marketing and trading is expected to be average, it said. In the first quarter, BP reported $1.66 billion in the gas and low-carbon energy division.\nTuesday’s update should bring down earnings estimates around 20%, mainly due to the lower trading contribution in both gas and oil and negative revisions in refining, Jefferies analysts said in a research note.\nAnalysts currently expect the company to book $3.01 billion in underlying RC profit—a metric similar to net income used by U.S. oil companies—according to a consensus polled by FactSet.\nHowever, BP’s upstream volumes look stronger than anticipated, offsetting some of the weakness seen elsewhere, RBC Capital Markets analysts wrote in a note.\nIts quarterly upstream production—the extraction of crude oil and natural gas—is expected to be broadly flat on the first quarter, when it produced 2.38 million barrels of oil-equivalent a day. Oil production will be stable on quarter, while gas and low-carbon energy production is set to fall slightly, BP said.\nThe announced impairments come after its London rival Shell last week warned of non-cash charges, also up to $2 billion, after pausing construction of a major biofuels plant in the Netherlands and relating to the sale of its chemicals plant in Singapore.\nBP shares were down 4.3% Tuesday, bringing the shares to a 2.5% fall in the year so far.\nBP’s second-quarter results are scheduled to be released on July 30.\nWrite to Christian Moess Laursen at christian.moess@wsj.com\nMost Read from The Wall Street Journal\nFinancial Stocks Lift S&P 500 to Fresh Record\nThe Hard Lessons of Lifetime Subscriptions\nNew Hollywood Mogul David Ellison Tackles Daunting To-Do List After Paramount Deal\nBP to Book Up to $2 Billion Impairment, Warns of Lower Refining Margins\nUPS Names Brian Dykes as Finance Chief", "Link": "Https://Finance.Yahoo.Com/News/Bp-Book-2-Billion-Impairment-105500883.Html", "Sentiment_Score": -0.8146038651, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-07-09T16:16:12.000Z", "Headline": "BP Stock Drops After Warning of Weaker Refining Margins", "Summary": "The London-based oil company said Tuesday that its earnings would take a hit of up to $700 million from “significantly lower” refining margins. The warning echoed a similar message from Exxon Mobil on Monday, when the U.S. company said that lower refining margins across the industry would hurt its quarterly profits.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/E687A6Ee-B4C1-32Fb-B3C7-9668Ff13D434/Bp-Stock-Drops-After-Warning.Html", "Sentiment_Score": -0.9352778196, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-07-09T15:58:10.000Z", "Headline": "Biden hosts NATO summit, Tesla's rally, oil: Morning Brief", "Summary": "It's a new day, but the same old stock market. Seana Smith and Brad Smith help investors start their trading session off right, guiding them into the market open and detailing some of the biggest industry stories and market movers.\nPresident Biden is hosting world leaders for the annual NATO summit (North Atlantic Treaty Organization) — on the international alliance's 75th anniversary — with all eyes on the sitting US president, at a time when his own party is asking him to resign from the 2024 presidential race, and newly elected foreign officials.\nTesla's (TSLA) rally spanning nine-straight sessions has lifted up the stock significantly, reversing its downward momentum and erasing the EV maker's 2024 year-to-date losses. Morningstar equities strategist Seth Goldstein comes onto the program to discuss Tesla's growth timeline and what he expects from the company's second-quarter earnings due out on July 23.\nCrude oil (CL=F, BZ=F) prices dip as Tropical Storm Beryl makes landfall in Texas. Vanda Insights Founder and CEO Vandana Hari weighs in on what hurricane season and geopolitical tensions in the Middle East could mean for oil output in the summer months.\nOther top trending tickers on the Yahoo Finance platform include pharmaceutical titans Novo Nordisk (NVO) and Eli Lilly (LLY), Nvidia (NVDA), and oil producer BP (BP).\nThis post was written by Luke Carberry Mogan.", "Link": "Https://Finance.Yahoo.Com/Video/Biden-Hosts-Nato-Summit-Teslas-155810907.Html", "Sentiment_Score": 0.0385331437, "Sentiment_Category": "neutral"}, {"Ticker": "BP", "Time": "2024-07-09T15:43:36.000Z", "Headline": "FTSE 100 Live 09 July: BP shares weigh on index, Page warns amid slower jobs market", "Summary": "FTSE 100 Live (Evening Standard)\nBP shares are struggling after the oil major warned of big provisions in second quarter results.\nIn other trading updates, Vistry backed its partnerships model following a strong first half.\nAnd weaker profit guidance by PageGroup has led to heavy selling of recruitment sector shares.\nFTSE 100 Live Tuesday\nWeak BP guidance hits shares\nRecruiter Page Group slashes jobs\nVistry backs home building target\nFTSE 100 closes lower as BP shares lose energy and Burberry falls out of fashion with investors\n16:43 , Michael Hunter\nEye-catching falls for two big name stocks stood out in closing trade, as the FTSE 100 fell back on Tuesday.\nBP was down 19p, or just over 4%, at 455p after it warned of a $2 billion hit to profits and weaker refining margins.\nFashion house Burberry was also out of vogue with investors, on talk of looming job cuts and reports of a cost-cutting drive at the high-end fashion house.\nOverall, the main London stock index fell 58 points to 8135.41 in late trade. That was a drop of 0.7%.\nTech stocks help New York stocks rise as Fed watch continues for traders\n14:56 , Michael Hunter\nWall Street’s S&P 500 is higher in early trade, with investors buying back into the tech sector, the main driver of the markets recent record-breaking peaks.\nThe gains come as investors stay tuned into potential signals on the timing of interest rate cuts from the Federal Reserve, with the US central bank’s chairman, Jerome Powell, due to testify on monetary policy to lawmakers on Capitol Hill.\nNew York’s broad index rose by 13 points to 5638.75.\nWall Street markets set for positive start as techs rise and Fed steps into the spotlight\n14:06 , Michael Hunter\nNew York’s S&P 500 is expected to tick higher in opening trade,\nFutures trade is pointing to an opening gain of around 6 points. Traders were tuning in for two days of testimony from the Federal Reserve’s chairman, Jerome Powell. His appearance on Capitol Hill will be scrutinised for clues on when interest rates will be cut by the world’s most powerful central bank.\nIn the meantime, tech stocks were back on the up having driven the Wall Street stock markets to its recent record highs. Invidia and Intel, chipmakers well-placed for to benefit from the artificial intelligence revolution, were up by about 2% each, on course for the second day of gains.\nMulberry chief out -- now\n12:26 , Simon English\nThe chief executive of Mulberry paid the price for the slowdown in the sales of luxury goods, heading for the exit with immediate effect.\nThierry Andretta, the boss since 2015, is being replaced by Andrea Baldo who was most recently in charge of Ganni.\nAndretta, paid at least £1 million a year, can expect compensation for the nature of his departure.\nA brusque statement to the stock market gave no reason for the sudden switch, merely noting that Andretta was stepping down from the board and leaving the company immediately.\nBaldo does not start his new job until September 1.\nLast May, Mulberry reported a 4% fall in annual sales. His message then was downbeat, telling shareholders:\n“Mulberry has not been immune to the broader downturn in luxury spending experienced in recent months, particularly in the UK and Asia. This decline was partially offset by positive trading in the US, where we have benefited from increased brand awareness.\n“Looking ahead, the trading environment in the UK and China remains challenging and we do not expect this to change in the short-term.”\nWhile fans of the brand include the Princess of Wales and Cara Delevigne, that has not been enough.\nLuxury bosses say they in particular suffer from high VAT – a “tourist tax” that makes it cheaper t buy high end goods in Paris or elsewhere.\nChris Roberts, chairman, said: \"I am pleased to be able to announce the appointment of Andrea Baldo. Following our search process, it was clear that Andrea's international fashion brand expertise, creativity and strategic thinking meant he was absolutely the right person for this role. I'd also like to thank Thierry for his contribution to the business.\"\nAndrea Baldo said: \"I am thrilled to join Mulberry at such a pivotal moment and to build upon the strong sustainability credentials of this iconic luxury brand. I look forward to leading the business and its talented team into the next chapter.\"\nMulberry shares fell 6% to 96p which leaves the business valued at just £58 million. The stock is down 65% in the last five years.\nBP down 3% in FTSE 100, upgrade boosts B&Q owner Kingfisher\n10:24 , Graeme Evans\nBP shares are down 3.5% or 16.6p to 458p after an update by the oil giant caused City analysts to rip up forecasts for results later this month.\nThe second quarter guidance included flat oil and gas production on the previous quarter, alongside negative revisions to refining margins.\nBP added that results on 30 July will include one-off items of up to $2 billion, including from an ongoing review of its Gelsenkirchen refinery in Germany.\nShell shares rose half a penny to 2835.5p, but falls by BP and other heavyweights including HSBC limited the FTSE 100 index to a rise of 14.97 points at 8208.46.\nOne of the best FTSE 100 performances was by B&Q owner Kingfisher, despite the British Retail Consortium (BRC) reporting poor sales of DIY and gardening equipment amid June’s poor weather.\nKingfisher rallied 9.9p to 475.5p after Deutsche Bank switched to a Buy stance.\nOther stocks from the sector struggled on the back of the BRC update as Next fell 86p to 8924p and Marks & Spencer weakened 4.6p to 292.5p.\nIn the FTSE All-Share, Capita shares jumped by a fifth or 3.2p to 18.7p after selling its public sector software business in a £200 million deal with Orchard Information Systems.\nAffordable homes specialist Vistry backs Labour's building ambition but shares slip\n10:10 , Michael Hunter\nVistry, the developer specialising in affordable housing, said it would complete 18,000 homes this year and hailed the commitment in Downing Street to get Britain building.\nThe chief executive of the Kent-based firm, Greg Fitzgerald, said:\n\"We look forward to working with the new government to address the country's housing crisis and are extremely well placed to support its ambition of delivering the biggest boost to affordable housing in a generation.\"\nVistry, which is known for its commitment to mixed-tenure and social housing, backed Labour’s move to resurrect what is in effect a quota system for local authorities to address the UK’s shortage of properties.\nThe company said it was “supportive” of “plans to introduce mandatory housing targets, reform the national planning policy framework, add new planning officers and prioritise brownfield and 'grey belt' land.”\nLabour has said it wants to build 1.5 million homes in its current five-year term.\nVistry said today it finished 7,750 homes in the first half of 2024, over 600 more year-on-year. It said 75% of them were “partner funded”, from social housing providers including local authorities and housing associations.\nIts shares slipped 22p to 1269p, taking it off recently touched two-month highs.\nRecruiter Page Group slashes jobs\n09:01 , Simon English\nPAGE Group shares crashed 10% today as it warned over earnings and said it has has to cut more of its own staff.\nThe recruiter says the global jobs market has weakened, with the US, France, China and the UK all suffering.\nProfit for the second quarter was down 12% to £224 million.\nIts own headcount is down by 153 to 5598, with the European arm taking the worst hit.\nIts non-operations workforce fell by 2.4%, or 49, in the quarter.\nPageGroup shed more than 1,000 fee earner roles in 2023 but said it would look to “broadly hold” numbers at current levels “to ensure we are well placed to take advantage of opportunities as sentiment and confidence improve”.\nThe shares fell 43p to 379p.\nCEO Nicholas Kirk said: \"We continued to see challenging market conditions throughout the Group in Q2 and we experienced a softening in activity levels through the quarter, particularly in terms of new jobs registered and number of interviews. The conversion of interviews to accepted offers is the most significant area of challenge, as candidate and client confidence remains subdued.”\nBegbies on the up as insolvencies rise\n08:51 , Simon English\nInsolvency specialist Begbies Traynor is on the up and expects to keep doing well from changes in government policy.\nWhile the insolvency arm, 60% of the business, is strong as small firms continue to struggle with higher interest rates, it is the property arm that excites him most.\nChairman Ric Traynor said: “We have a new government bent on growth and construction that is looking pretty good for us.”\nHe was talking as the firm reported a tenth year of growth and a seventh year of dividend growth.\nProfit before tax for the year to April was up from £20.7 million to £22 million. A dividend of 4p, up from 3.8p, will be paid.\nRevenue rose from £122 million to £137 million.\nTraynor expects a “pronounced” level of insolvencies for the next year or two as small firms that have battled on so far finally fail.\nHe thinks that within two years the level of company insolvencies should steady at around 20,000 a year. That’s more than when interest rates were near zero, but about typical for an economy in growth.\n“With small businesses it doesn’t take much to knock them over. They have taken bounce back loans which they now can’t repay. More sizeable businesses have weathered the storm and have a better relationship with their banks.”\nHe added: “From the point of view of the economy, the government is talking sensibly and we should get some stability.”\nBegbies has 1200 staff across the UK. Aside from insolvency work they advise commercial lenders on property valuations. They say there is an increasing amount of work in the education sector as they work to ensure buildings are safe.\nBegbies Traynor shares fell 2.3p to 97.1p today, leaving the business valued at £154 million. It did four acquisitions this year of rival firms to boost its presence.\nBegbies, along with many other firms, hopes the new Labour government’s focus on infrastructure spending should bring plenty of opportunities.\nBP shares drag on FTSE 100, PageGroup down 12% in FTSE 250\n08:19 , Graeme Evans\nBP shares are down 3% or 15.8p to 458.85p after the oil giant warned of second quarter asset impairments and contract provisions between $1 billion and $2 billion.\nThe share price decline put pressure on the FTSE 100 index, which stands broadly unchanged at 8194.79.\nVistry shares rose 10p to 1302p after the affordable house builder stuck to completion targets and said this year’s adjusted profits should rise by about 7% to £186 million.\nIn the FTSE 250, PageGroup shares slid 12% or 50.6p to 372p after the recruitment firm downgraded full-year profit expectations. Rival Hays also weakened 4%.\nOil services firm Hunting moved the other way, up 16p to 445p after it said a strong order book supported earnings visibility well into 2025.\nCapita sells is public sector software unit in £200 million deal\n07:36 , Michael Hunter\nOutsourcing firm Capital has announced the sale of its public sector software business in a £200 million deal with Orchard Information Systems.\nCapita said the move “follows an evaluation of certain activities” which it decided were “not core to the Group's future strategy”.\nOrchard is part of MRI Software.\nCapita, best known in London for running the Congestion Charge.\nIts CEO, Adolfo Hernandez, said this morning:\n“Capita's strategy is to become a more focused company, prioritising businesses where we can deliver material opportunities in the future, with greater simplification and cost reduction.\n\"Capita One is a high-quality business that has performed exceptionally well. Under its new owner, it is well positioned to benefit from investment in its strategic growth.”\nVistry confident on 18,000 new homes target\n07:30 , Graeme Evans\nPartnerships-led housebuilder Vistry today said it was on track to meet a target to deliver more than 18,000 new homes in 2024.\nThe Bovis Homes business reported an 8% rise in half-year completions to about 7750, with forward sales up 21% on the prior year at £5.1 billion.\nThe FTSE 100-listed group is focused on meeting the UK’s need for affordable mixed tenure housing.\nChief executive Greg Fitzgerald said the half-year update showed the company’s partnership model is “significantly outperforming the broader housebuilding market”.\nHe added:: “We look forward to working with the new Government to address the country’s housing crisis and are extremely well placed to support its ambition of delivering the biggest boost to affordable housing in a generation.”\nBP says second quarter production to be 'flat'\n07:27 , Michael Hunter\nBP has said this morning that second-quarter upstream oil production will be “flat”, while it will be “slightly lower” in “gas and low carbon”\nThe oil giant’s output rose 2.1% year-on-year in the first quarter.\nEnergy majors have been in the spotlight for returning to traditional production and slowing moves toward sustainable energy after the disruption in markets which followed Russia invasion of Ukraine.\nBP said today:\n“ In the gas & low carbon energy segment, realizations, compared to the prior quarter, are expected to have an adverse impact of around $0.1 billion.”\nIndex seen higher, Japan stocks hit fresh record\n07:08 , Graeme Evans\nA surge for technology stocks including SoftBank today helped the Nikkei 225 jump by more than 2% to set a new record at 41,769.\nThe boost followed a decent session for Wall Street’s megacap stocks, with chip giant Nvidia up 2% and the Nasdaq Composite in positive territory.\nTraders will now be looking to Federal Reserve chair Jerome Powell's testimony to Congress for further clues about the timing of future interest rate cuts.\nEuropean markets struggled yesterday following France’s election result, with the CAC 40 closing 0.6% lower at the end of an uncertain session.\nThe FTSE 100 index closed 0.1% lower yesterday but is forecast to open today’s session about 18 points higher.", "Link": "Https://Finance.Yahoo.Com/News/Ftse-100-Live-09-July-060854824.Html", "Sentiment_Score": -0.793184936, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-07-09T15:30:00.000Z", "Headline": "BP Shares Plummet on $2 Billion Impairment Warning", "Summary": "Shares in BP fell by as much as four percent this morning after it warned it was expected to post an impairment of up to $2bn (1.6bn) and was operating under “significantly” lower refining margins.\nThe FTSE 100 oil major, which in April surprised investors with a better-than-expected oil and gas trading performance in the first three months of the year, maintained much of its momentum in the second quarter, but said that “onerous contract provisions” meant it was setting aside up between between $1bn (£780m) and $2bn (£1.6bn).\nBP shares were down 3.5 percent in early market trading at 9 30am BST.\nIn a trading update published this morning, the company said upstream production was flat compared to the prior quarter, and realised oil prices had a favourable impact on its bottom line.\nHowever, BP was still hit by “significantly” lower realised refining margins—which had been unexpectedly healthy in the first quarter—due to narrower North American heavy crude oil differentials and weaker middle distillate margins.\nThe energy giant expects these to have an adverse impact of up to $0.7bn (£0.55bn).\nBP also said its second-quarter results expected on July 30 will include the post-tax adverse adjustments from the firm’s ongoing review of its Gelsenkirchen refinery in Germany.\nAnalysts at Jeffries said the trading update should result in an earnings downgrade of approximately 20 percent, “mainly driven by a lower trading contribution” and the negative revisions in refining.\nBy CityAM\nMore Top Reads From Oilprice.com\nStrong Fundamentals Suggest Oil Prices Will Continue to Climb\nNew Technology Could Revolutionize Solar Power\nTexas Energy Industry Starts Restoring Operations After Beryl\nRead this article on OilPrice.com", "Link": "Https://Finance.Yahoo.Com/News/Bp-Shares-Plummet-2-Billion-153000607.Html", "Sentiment_Score": -0.9478289485, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-07-09T13:38:46.000Z", "Headline": "Oil giant BP warns of Q2 profit decline due to weak refining", "Summary": "BP (BP) shares dip in pre-market trading after the energy giant anticipates its weak oil refining output to affect its second-quarter profits. BP's forecast comes after ExxonMobil (XOM) warns its own refinery profits could decline by up to $1.5 billion.\nThe Morning Brief team examines the oil (CL=F, BZ=F) giant's profit warning ahead of its earnings expected on July 30.\nFor more expert insight and the latest market action, click here to watch this full episode of Morning Brief.\nThis post was written by Luke Carberry Mogan.\nVideo Transcript\nIt's time for some trending takers.\nFirst up, we've got BP shares are off just around 4.5% this morning.\nNow the oil and gas producer expecting weak margins in its refining business.\nAnd they're saying that that is going to dent their second quarter profit by up to $700 million.\nWe take a look at this release some of the expectations, how they have shifted.\nThey also mentioned that they're expecting a 1 to $2 billion write down of a plant in Germany.\nThe results from oil and trading are expected to be weak, so, as a result here, also planning to scale back the refining operations in the country of Germany due to higher costs and declining demand for fuel.\nSo this all sets up for what could be a maybe weaker than expected quarter for BP?\nYes, exactly.\nAnd this is really pointing back to their customers and product segment as well.\nStronger fuel margins and convenience performance and seasonally higher volumes.\nUh, so that's one of the factors impacting that segment and then, on the products significantly lower realised refining margins as you were expecting that half a billion to 0.7 billion, uh, impact adversely, unfortunately, uh, and mainly relating to weaker middle distillate margins and narrow North American heavy crude oil differentials, Uh, and then a higher level of turnaround activity they're talking about as well.\nIt was actually more interesting as well in the gas and low carbon energy segment.\nFor those who have those hats at home who are ultimately tracking what they're expecting, this adverse ultimate impact of about $1.1 billion including declines in non Henry hub natural gas make marker prices here.\nSo, uh, all of this anticipated here impacting shares of BP and it kind of signals and is in alignment As you were mentioning what we had heard from Exxon coming into this Yeah, we're also seeing some analysts lower their expectations.\nOn the heels of this update, you've got cities saying that they're now lowering their Q two earnings, our EPS estimate by 9%.\nJeffrey Also adjusting their expectations, they now think that it's going to result in a 20% earnings downgrade there.\nSo some figures to keep in mind ahead of this report.\nAbsolutely.\nThe full report is going to be published on July 30th, so we'll be staying tuned for the rest of the financials in tandem with this\nView Comments", "Link": "Https://Finance.Yahoo.Com/Video/Oil-Giant-Bp-Warns-Q2-133846686.Html?_Fsig=Jla6Rppa_Sdzqmrcbjinja--%7Ea", "Sentiment_Score": -0.9575859308, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-07-09T13:01:00.000Z", "Headline": "BP Stock Slips. It Joins Exxon Mobil in Warning About Weaker Margins.", "Summary": "The British supermajor said that it expects weak refining margins to hit its second-quarter earnings by between $500 million and $700 million, also flagging impairment charges of up to $2 billion. Its American depositary receipts slipped 4.1% ahead of the opening bell, while U.K.-listed shares fell 3.7%. BP bad news comes less than 24 hours after Exxon Mobil said that weaker refining margins could lower its own profits by between $1.1 billion and $1.5 billion for the three months ending June 30.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/6D8A9Af0-57Cd-3696-88F6-F21E8Cab8B0C/Bp-Stock-Slips-It-Joins.Html", "Sentiment_Score": -0.9474237561, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-07-09T12:34:57.000Z", "Headline": "BP Slides After Projecting Up To $2B in Q2 Impairment Charges", "Summary": "BP, Exxon both say weak refining margins likely to hit earnings\nPeter Dazeley / Contributor / Getty Images\nMore\n\n\nKey Takeaways\nBP ADRs slid in premarket trading Tuesday after the energy giant said its second-quarter earnings will likely be impacted by lower refining margins.\nThe company also expects to take an impairment charge of between $1 billion and $2 billion related to a review of one of its German refineries.\nExxon also said refining margins would negatively impact its second-quarter earnings on Monday.\n\n\nBP (BP) American depositary receipts (ADRs) fell in premarket trading Tuesday after the energy giant said that it expects lower refining margins and an impairment charge of up to $2 billion will impact its second-quarter results.\nThe British oil and gas company said Tuesday that \"significantly lower realized refining margins\" are projected to have a negative impact between $500 million to $700 million when it reports second-quarter earnings at the end of the month.\nBP Joins Exxon in Warning About Refining Margins\nBP, which expects to take an impairment charge between $1 billion and $2 billion related to a review of one of its German refineries, is not the only one in the industry warning about potential hits to second-quarter results.\nExxon Mobil (XOM) on Monday said that lower refining margins would cause its second-quarter profits to be between $1.1 billion to $1.5 billion lower. The company also expects lower natural gas prices to cause a hit of about $300 million to $700 million when it reports earnings later this month.\nBP ADRs, as well as its shares traded on the London Stock Exchange, were each down around 4% as of 8:30 a.m. ET Tuesday.\nRead the original article on Investopedia.", "Link": "Https://Finance.Yahoo.Com/News/Bp-Slides-Projecting-2B-Q2-123457940.Html", "Sentiment_Score": -0.881898284, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-07-09T11:34:01.000Z", "Headline": "Midday movers: Nvidia, Eli Lilly rise; BP, Novo Nordisk fall", "Summary": "(Updated - July 9, 2024 11:31 AM EDT)\nInvesting.com -- U.S. stock futures edged higher Tuesday following the start of two-day testimony from Fed chief Jerome Powell to Congress. Powell said the economy has made considerable progress toward the Federal Reserve's 2 percent inflation goal, and labor market conditions have cooled while remaining strong.\nHere are some of the biggest U.S. stock movers today:\nIntel (NASDAQ:INTC) stock fell 0.1% after gaining over 6% in the previous session, while Nvidia (NASDAQ:NVDA) rose 3% and Marvell (NASDAQ:MRVL) was down 1.2%, as stocks linked with AI were mixed.\nPfizer (NYSE:PFE) (PFE) stock fell 2% after it announced its chief scientific officer Mikael Dolsten would step down after a more than 15-year career at the drugmaker.\nEli Lilly (NYSE:LLY) stock rose 0.8% and Novo Nordisk (NYSE:NVO) stock fell 1.8% after the publication of a data analysis showing Eli Lilly's treatment Mounjaro leads to faster and greater weight loss than Novo’s popular obesity drug Wegovy.\nLucid Group (NASDAQ:LCID) stock fell 3% after the EV manufacturer will have to recall over 5,000 of its 2022-2023 Air luxury sedans due to a software error that could cause a loss of power.\nBP (NYSE:BP) ADRs fell 4.1% after the energy giant warned that its second-quarter results will be hit by lower refining margins and it also expects to post an impairment of up to $2 billion.\nHelen of Troy (HELE) stock slumped 30% after the consumer products company reported disappointing first-quarter results and slashed its full-year outlook, amid particular weakness in its beauty and wellness business.\nUiPath Inc. (NYSE:PATH) fell 7% after it announced plans to cut around 10% of its global workforce.\nServiceNow (NYSE:NOW) declined 3.5%, extending yesterday's fall, after analysts downgraded the stock to \"sell\" due to concerns about risks to its business in the second half of the year.\n\nAdditional reporting by Louis Juricic\nRelated Articles\nMidday movers: Nvidia, Eli Lilly rise; BP, Novo Nordisk fall\nSemi stocks premium valuations are justified says Raymond James\nFifth Third is fined by US CFPB over fake bank accounts, auto repossessions", "Link": "Https://Finance.Yahoo.Com/News/Intel-Nvidia-Eli-Lilly-Rise-075423601.Html", "Sentiment_Score": 0.7096965909, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-09T11:29:04.000Z", "Headline": "BP faces $2bn hit from switch to electric cars", "Summary": "Gelsenkirchen refinery has capacity to process around 265,000 barrels of crude oil a day - Martin Meissner/AP\nBP’s decision to scale back its oil production operations in Germany contributed to a $2bn (£1.56bn) writedown last quarter, as the energy giant reacts to the growing shift to electric cars.\nIn a trading statement issued on Tuesday, the company signalled charges relating to its refinery in Gelsenkirchen, which is responsible for turning oil into petrol and diesel.\nThe impairment reflects the impact of net zero on oil and gas giants, as they scale back production in response to the growing take-up of EVs among motorists.\nInvestors reacted badly to Tuesday’s update, as the company’s share price fell more than 4pc in early trading.\nBP began a review of the Gelsenkirchen refinery’s future earlier this year after describing it as uncompetitive.\nThe review included plans to reduce crude oil processing capacity at the site by around a third from 2025.\nThat was partly owing to projected weaker demand but also because it wanted to rationalise the plant, boost efficiency and increase the production of biofuels, especially sustainable aviation fuel.\nBP operates an oil refinery and a petrochemical site in Gelsenkirchen with around 2,000 employees and 160 trainees. It has told staff that the review will lead to some job losses.\nThe site is able to process around 265,000 barrels of crude oil (12m tonnes) every day, which is then turned into petrol, diesel, jet fuel, and more than 50 other chemical products.\nHowever, its age and size make it expensive to run compared with global competitors.\nBP said: “The second quarter results are expected to include post-tax adverse adjusting items relating to asset impairments and associated onerous contract provisions in the range of $1bn to $2bn.\n“This includes charges relating to the ongoing review of our Gelsenkirchen refinery in Germany.”\nThe latest impairment comes after an early £1.34bn writedown on the refinery last year which it blamed on “changes in economic assumptions”.\nThe capacity reduction comes as other European refiners face increasing pressure from stringent environmental regulations, growing overseas competition and rising EV sales.\nIn January, Shell announced it would shut down its oil refinery in Wesseling, Germany, by 2025. It plans to convert the site to produce lubricant feedstock as part of its carbon emissions reduction.", "Link": "Https://Finance.Yahoo.Com/News/Bp-Faces-2Bn-Hit-Switch-112904285.Html", "Sentiment_Score": -0.3110913038, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-07-09T08:31:32.000Z", "Headline": "BP warns over hit of up to £1.6bn, sending shares lower", "Summary": "Oil giant BP’s shares have come under pressure after it warned of an impairment charge of up to 2 billion US dollars (£1.6 billion) in its second quarter.\nThe group said it is bracing for a hit of between a billion and 2 billion US dollars (£781 million to £1.6 billion), relating to “post-tax asset impairments and associated onerous contract provisions”.\nThis includes a blow from previously announced moves to review its refining operations in Germany from 2025.\nBP added that oil trading earnings will also be knocked by lower refining margins, which will impact second quarter results by between 500 million and 700 million US dollars (£391 million to £547 million).\nShares in the FTSE 100 firm fell more than 3% in early trading on Tuesday.\nIn its update, BP also said that upstream production – BP’s activities in oil and natural gas exploration as well as low-carbon energy – is expected to be broadly flat quarter-on-quarter.\nIt had previously expected a slight fall.\nThe figures follow a warning from rival Shell last week over a hit of up to 2 billion US dollars (£1.6 billion) after it suspended construction work on one of Europe’s largest planned biofuel plants and sold a refinery in Singapore.\nJefferies analysts said they expect BP’s latest update to lead to an earnings downgrade of around 20% for the second quarter.\nBut Derren Nathan, head of equity research at Hargreaves Lansdown, said BP would be supported by rising oil prices.\nThe firm said the cost of crude averaged 84.97 US dollars per barrel in the second quarter, up from 83.16 US dollars in the previous three months.\nMr Nathan said: “BP’s focus has been a little scattergun of late, but it’s likely to remain an important part of the energy mix for some time to come.\n“It still has one eye on the energy transition, and there appears to be little downward pressure on the oil price in the immediate future.\n“This should keep both cash flow and generous distributions to investors flowing.”", "Link": "Https://Finance.Yahoo.Com/News/Bp-Warns-Over-Hit-1-081932123.Html", "Sentiment_Score": -0.9422808886, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-07-09T08:31:21.000Z", "Headline": "Trending tickers: Intel, Chipotle, BP and Wizz Air", "Summary": "Intel (INTC)\nIntel was the number one trending stock in pre-market trading on Tuesday after Melius Research listed the company as among the top contenders for the AI \"catch-up\" trade in the second half of 2024.\nShares climbed more than 6% to a two-month high on Monday and were up by 2.4% in pre-market trading after Melius Research noted that Advanced Micro Devices (AMD), Apple (AAPL) and Intel could start catching up with AI winners such as Nvidia (NVDA) in the second half of the year.\n\"We are believers in a 'catch-up' trade for some in semis, hardware and even software — those with lower expectations,\" said Melius' analyst Ben Reitzes.\nSeparately, Mizuho Securities' analyst Jordan Klein noted that there was '\"a clear short cover trade underway” in chipmakers like Intel.\nHowever, the analyst noted that no long-only investors like or want to buy Intel, adding that, \"so a true rebound beyond mid $30s is unlikely in my view in coming months.\"\nRead more: LIVE: FTSE 100 muted and European markets lower as traders look to Powell speech\nThe chipmaker's share price also got a boost due to excitement surrounding upcoming processors that could strengthen the company's position in the AI space and gaming hardware market.\nIntel is gearing up to launch a new graphics processing unit (GPU) that is set to be fabricated by Taiwan Semiconductor Manufacturing (TSM).\nIntel Corporation (INTC)\nView quote details\nNasdaqGS - Nasdaq Real Time Price (USD)\n33.10-1.76(-5.06%)\nAs of 10:25AM EDT.Market open.\n1D5D1M6MYTD1Y5YMax\nFull screen\nChipotle (CMG)\nInvestor excitement over the Mexican fast-food chain’s 50-for-1 stock split appears to be fading as the company fell over 5% in Monday’s session and made only shy gains in pre-market trading.\nChipotle Mexican Grill’s first-ever stock split is one of the largest in the history of the New York Stock Exchange. Before the split, one share of CMG stock cost more than $3,200. Now, investors can buy shares for $59 each.\nIn a hit to the share price, Wedbush recently downgraded the stock to \"neutral\" with a new price target of $3,200, while TD Cowen and Baird maintained their positive ratings with targets of $3,600 and $3,500, respectively.\nRead more: Stocks that are trending today\nChipotle and other companies have lately been accused of “shrinkflation” — the idea of getting less for the same price.\nA study by Wells Fargo analyst Zachary Fadem brought to light substantial inconsistencies in Chipotle’s portion sizes. Fadem’s team ordered the same burrito bowl 75 times from various locations in New York City, revealing significant variation in weights, with some bowls weighing under 15 ounces and others over 21 ounces.\nBP (BP.L)\nBP expects to book an impairment of up to $2bn (£1.6bn) for the second quarter, and warned that its oil-trading earnings will take a hit of up to $700m from lower refining margins.\nIn a trading statement, the oil giant said its second quarter results would show “post-tax adverse reporting items” relating to its ageing refining operations in Germany.\n“The second quarter results are expected to include post tax adverse adjusting items relating to asset impairments and associated onerous contract provisions in the range of $1bn to $2bn.\n“This includes charges relating to the ongoing review of our Gelsenkirchen refinery in Germany,” BP said.\nRead more: Is the Bank of England expected to cut interest rates in August?\nThe company said it anticipates weak refining margins and oil trading performance will weigh on its second-quarter results, due out on 30 July. The hit is estimated between $500m to $700m.\nLast week, rival energy giant Shell (SHEL.L) similarly announced that it expects to record a post-tax impairment hit of up to $2bn, mainly linked to its Singapore and Rotterdam plants.\nWizz Air (WIZZ.L)\nWizz Air expects further delays in deliveries of Airbus (AIR.PA) planes, but the budget carrier remains confident it can increase its capacity over the next few years, its chief executive Jozsef Varadi told Reuters.\nJozsef Varadi said the Hungarian carrier insisted the delays will not impact capacity, even as it is already grappling with 45 of its planes being grounded for inspections amid concerns over their Pratt and Whitney engines. Another 35 planes will be grounded next summer.\nRead more: Top five pensions priorities for the new Labour government\n\"We are making assumptions that Airbus will have delivery delays, but they already have six-month delivery delays,\" he told Reuters. \"The real impact will be fairly limited,\" Varadi added.\nThe European plane maker cut its targets last month as it faces ongoing supply disruptions.\nVaradi said the airline is still expecting continuous deliveries of about three aircraft a month, with 20% growth in capacity next year and 20% to 25% the following year.\nDownload the Yahoo Finance app, available for Apple and Android.", "Link": "Https://Finance.Yahoo.Com/News/Intel-Chipotle-Bp-Wizz-Air-Trending-Tickers-083121206.Html", "Sentiment_Score": 0.007119406, "Sentiment_Category": "neutral"}, {"Ticker": "BP", "Time": "2024-07-09T08:10:37.000Z", "Headline": "BP Drops After Warning of Weaker Oil Refining, Writedowns", "Summary": "(Bloomberg) -- BP Plc dropped in London trading after it warned of “significantly lower” refining margins and predicted a writedown on the value of a plant in Germany of $1 billion to $2 billion.\nMost Read from Bloomberg\nMicrosoft Orders China Staff to Use iPhones for Work and Drop Android\nSaudis Warned G-7 Over Russia Seizures With Debt Sale Threat\nBiden’s Biggest Donors Left Powerless to Sway Him to End Bid\nHurricane Beryl Makes a Mockery of Texas Climate Deniers\nStocks Hold Near Peak on Powell’s ‘Balanced’ Tone: Markets Wrap\nLower profits from making fuels such as diesel and higher levels of maintenance will have an adverse impact on BP’s second-quarter earnings from oil products of $500 million to $700 million, the company said in a statement on Tuesday. Results from oil trading are expected to be weak, it said.\nShares of the company fell 3.5% to 458.15 pence as of 9:02 a.m.\nBP’s post-tax impairment charge relates to the review of the Gelsenkirchen refinery in Germany, which was announced earlier this year. The company plans to scale back its refining operations in the country due to high costs and declining demand for fuels.\nEuropean refiners face increasing competition from fuel imports originating in the Middle East and Asia, where capacity is being increased. The Gelsenkirchen complex will become the second German plant to reduce crude consumption starting 2025, with Shell Plc working on a similar move at a nearby facility. The UK’s Grangemouth site is also set to close, while other facilities such as TotalEnergies SE’s Grandpuits are moving toward biofuels and plastics recycling.\nBP also said on Tuesday that upstream production in the second quarter is now expected to be “broadly flat” compared with the prior quarter. This an improvement on previous guidance for output to be slightly lower, RBC analyst Biraj Borkhataria said in a note.\nHowever, this is offset by weakness elsewhere, notably the “average” performance seen gas marketing and trading, he said.\nBP’s results are expected to be published July 30.\n--With assistance from Rachel Graham and Veronika Gulyas.\n(Updates with analyst comment in sixth paragraph.)\nMost Read from Bloomberg Businessweek\nAt SpaceX, Elon Musk’s Own Brand of Cancel Culture Is Thriving\nPsychedelics Are Now Legal in Australia—With a Catch\nThe Rich Investor Club Is Getting Crowded\nHow Stocks Became the Game That Record Numbers of Americans Are Playing\nHow to Invest During a High Interest Rate Era\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Bp-Drops-Warning-Weaker-Oil-074429100.Html", "Sentiment_Score": -0.9483895302, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-07-09T03:37:17.000Z", "Headline": "BP p.l.c. (BP): Why are Hedge Funds Bullish on This FTSE Dividend Stock Right Now?", "Summary": "We recently compiled a list of the 10 Best FTSE Dividend Stocks To Buy Now. In this article, we are going to take a look at where BP p.l.c. (NYSE:BP) stands against the other FTSE dividend stocks.\nThe first half of 2024 has been notable for the UK equity market, as the FTSE 100, the benchmark index for UK company shares, hit a record high. However, stocks tumbled in the first week of June as financial shares mirrored broader losses in European markets. That was mainly due to the political uncertainty that unsettled investors and a slump in industrial mining stocks further dragged down the market. That said, with some time remaining in the general elections, there is still some potential for additional developments and surprises within the UK market. The index is up by nearly 6% this year so far, compared with a 14.3% return of the broader US market\nThe Bank of England (BoE) was one of the first central banks to begin increasing interest rates after the peak of the COVID pandemic. From December 2021 to August 2023, it raised the bank rate by 515 basis points to a 16-year high of 5.25% in order to address rising inflationary pressures in the economy. According to a Reuters poll of economists, the BoE is expected to begin cutting interest rates in August. Most economists also anticipate at least one more rate reduction this year, despite ongoing high inflation in wages and services. Yael Selfin, chief UK economist at KPMG, made the following comment on the situation:\n\"While we are seeing some tentative signs of cooling in the labor market, service sector inflation remains persistently high and it is likely the MPC would want to wait until the next set of forecasts and a few more data points before it embarks on its first rate cut.\"\nOverall, UK inflation is expected to remain slightly above the BoE’s target of 2.0% in every quarter until at least the end of 2025, according to the poll. Median forecasts indicated that inflation would average 2.5% this year and 2.2% next year.\nAfter reaching new highs in 2024, the FTSE 100 may attract more investors, particularly those focused on income accumulation. The projected dividend yield of 3.8% for 2024 and 4.1% for 2025 is appealing, especially since these yields surpass the current inflation rate. Analysts predict that the ten largest dividend-paying companies in the UK will return £43.9 billion to shareholders, accounting for 55% of the total dividends from the FTSE 100. The top 20 companies are expected to contribute £57.4 billion, making up 72% of the total dividends.\nIn 2023, UK dividend growth of 5.4% aligned with the global average, according to a report by Janus Henderson. This increase was driven by substantial dividend increases from banks and oil producers, although it was tempered by lower payouts from mining companies. The report further mentioned that annual dividends in the UK grew to $86 billion in 2023 from over $63 billion in 2020.\nWhile investors gravitate toward American dividend stocks, some of the best FTSE dividend stocks also offer similar investment opportunities.\nOur Methodology:\nFor this article, we scanned through the list of FTSE stocks and picked dividend stocks from the list. From the resultant dataset, we picked the 10 best FTSE dividend stocks with the highest number of hedge fund investors tracked by Insider Monkey as of Q1 2024. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points. (see more details here).\nA large turbine generating power from natural gas, smoke rising in the background.\nBP p.l.c. (NYSE:BP)\nNumber of Hedge Fund Holders: 40\nBP p.l.c. (NYSE:BP) ranks fourth on our list of the best FTSE dividend stocks. The British multinational oil industry company reported growth in its net debt to $24 billion in the first quarter of 2024, from $21.2 billion in the prior-year period. Its debt-to-capitalization also grew to 22% from 19.6%. Due to this, S&P Global downgraded the stock's credit outlook to stable from positive. The company's CEO has devised a solution to address its debt by proposing to allocate 80% of excess cash toward dividends and share buybacks. Moreover, the company has announced $1.75 billion in share buybacks. Though this could be good news for income investors, S&P stated that this approach is unlikely to reduce debt, contrary to their previous expectations, despite the current favorable market conditions. The company is trying to improve its cash position as it generated over $5 billion in operating cash flow during the quarter.\nThat said, Citigroup stated that BP p.l.c. (NYSE:BP) is surpassing most of its oil peers in the oil and gas industry. They believe that the company is perceived as a potential leader in Europe's new energy landscape, particularly after right-wing parties demonstrated significant influence in the recent European Union elections. Citi added that they see the emergence of a profitable and scalable transition business within the company, which could establish the benchmark for the integration of a modern European energy company into progressive equity portfolios.\nBP p.l.c. (NYSE:BP)'s adoption of modern technology is evident in its electric vehicle charging division, which is actively seeking to acquire Tesla's supercharging stations across the US. In addition to the infrastructure, BP has committed $1 billion to expand its EV charging network, including hiring the personnel associated with these sites.\nBP p.l.c. (NYSE:BP) has a forward P/E of 7.43, which appears low, considering analysts' projections of a 10% annual growth in the company's EPS until the end of 2026. It is one of the best FTSE dividend stocks on our list as the company has been regularly paying dividends to shareholders since 1998. It currently pays an interim dividend of $0.4362 per ADS and its stock has a dividend yield of 4.88%.\nBP p.l.c. (NYSE:BP) was a part of 40 hedge fund portfolios, which held in aggregate $2 billion worth of shares at the end of March.\nOverall BP ranks 4th on our list of the best FTSE dividend stocks to buy. You can visit 10 Best FTSE Dividend Stocks To Buy Now to see the other FTSE dividend stocks that are on hedge funds’ radar. While we acknowledge the potential of BP as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than BP but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n READ NEXT: Michael Burry Is Selling These Stocks and Jim Cramer is Recommending These Stocks.\n Disclosure: None. This article is originally published at Insider Monkey.", "Link": "Https://Finance.Yahoo.Com/News/Bp-P-L-C-Bp-033717122.Html", "Sentiment_Score": -0.0901555941, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-07-05T07:20:30.000Z", "Headline": "Shell and BP Among Big Firms Taking Stakes in Adnoc’s LNG Plant", "Summary": "(Bloomberg) -- Four international companies have agreed to invest in Abu Dhabi National Oil Co.’s next liquefied natural gas export project, according to people with knowledge of the matter.\nMost Read from Bloomberg\nKamala Harris Is Having a Surprise Resurgence as Biden’s Campaign Unravels\nSingapore Couples Are Marrying Earlier to Buy Homes, Leading Some to Regret\nBiden’s Fourth of July Shrouded by Pressure to Drop 2024 Bid\nSingapore Is Making Life Tougher for Global Talent\nNasdaq 100 Up 1% as US Yields Tumble on Fed Wagers: Markets Wrap\nShell Plc, TotalEnergies SE, BP Plc and Mitsui & Co. will each take a 10% stake in the Ruwais LNG plant, said the people, who asked not to be named as the information isn’t public. Agreements may be signed as soon as next week, the people said.\nRepresentatives for Adnoc, Shell and TotalEnergies declined to comment. BP didn’t respond to a request for comment, and a spokesperson for Mitsui said that no decision has been made.\nBy investing in Ruwais, the energy majors are betting on long-term demand for natural gas even though many countries intend to switch to greener alternatives. While fuel prices have eased from the stratospheric heights reached two years ago, they remain elevated, boosting the appeal of new supply projects.\nThe UAE currently has just 5.8 million tons of LNG export capacity, the smallest of the region’s producers. The 9.6-million-ton-per year Ruwais plant will boost its capacity to the second-largest in the Middle East behind only Qatar.\nAdnoc decided to proceed with the Ruwais project and signed a $5.5 billion contract for its construction before securing investments from the four international companies. Three of them — Mitsui, BP and TotalEnergies — are also partners in the UAE’s only existing LNG export plant located on Das Island.\nThe project is part of the UAE’s push into global LNG markets both at home and abroad. Adnoc recently signed deals to invest in similar projects in the US and Mozambique. Gas is one of several areas Adnoc has decided to focus its investment on as part of its deal-making spree.\n“We’ve made it very clear that we’re interested in key sectors when it comes to low carbon solutions, renewables, natural gas and chemicals,” Musabbeh Al Kaabi, Adnoc’s executive director for international growth, said in an interview in May.\n--With assistance from Stephen Stapczynski and Anthony Di Paola.\nMost Read from Bloomberg Businessweek\nDragons and Sex Are Now a $610 Million Business Sweeping Publishing\nFor Tesla, a Smaller Drop in Sales Is Something to Celebrate\nThe Fried Chicken Sandwich Wars Are More Cutthroat Than Ever Before\nOnline Shopping Warehouses Are Reshaping Rural America\n©2024 Bloomberg L.P.", "Link": "Https://Finance.Yahoo.Com/News/Shell-Total-Others-Said-Stakes-072030547.Html", "Sentiment_Score": 0.0946317762, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-07-04T10:01:19.000Z", "Headline": "BP (LON:BP.) Might Have The Makings Of A Multi-Bagger", "Summary": "What are the early trends we should look for to identify a stock that could multiply in value over the long term? Typically, we'll want to notice a trend of growing return on capital employed (ROCE) and alongside that, an expanding base of capital employed. Basically this means that a company has profitable initiatives that it can continue to reinvest in, which is a trait of a compounding machine. Speaking of which, we noticed some great changes in BP's (LON:BP.) returns on capital, so let's have a look.\nWhat Is Return On Capital Employed (ROCE)?\nFor those who don't know, ROCE is a measure of a company's yearly pre-tax profit (its return), relative to the capital employed in the business. The formula for this calculation on BP is:\nReturn on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities)\n0.10 = US$20b ÷ (US$275b - US$82b) (Based on the trailing twelve months to March 2024).\nTherefore, BP has an ROCE of 10%. By itself that's a normal return on capital and it's in line with the industry's average returns of 10%.\nSee our latest analysis for BP\nroce\nAbove you can see how the current ROCE for BP compares to its prior returns on capital, but there's only so much you can tell from the past. If you'd like to see what analysts are forecasting going forward, you should check out our free analyst report for BP .\nThe Trend Of ROCE\nBP is showing promise given that its ROCE is trending up and to the right. The figures show that over the last five years, ROCE has grown 33% whilst employing roughly the same amount of capital. So it's likely that the business is now reaping the full benefits of its past investments, since the capital employed hasn't changed considerably. On that front, things are looking good so it's worth exploring what management has said about growth plans going forward.\nThe Bottom Line On BP's ROCE\nTo bring it all together, BP has done well to increase the returns it's generating from its capital employed. Since the stock has only returned 16% to shareholders over the last five years, the promising fundamentals may not be recognized yet by investors. So with that in mind, we think the stock deserves further research.\nOn a separate note, we've found 2 warning signs for BP you'll probably want to know about.\nIf you want to search for solid companies with great earnings, check out this free list of companies with good balance sheets and impressive returns on equity.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com", "Link": "Https://Finance.Yahoo.Com/News/Bp-Lon-Bp-Might-Makings-100119746.Html", "Sentiment_Score": 0.0467727408, "Sentiment_Category": "neutral"}, {"Ticker": "BP", "Time": "2024-06-28T13:18:00.000Z", "Headline": "TotalEnergies (TTE) to Sell West of Shetland Assets to Prax Group", "Summary": "TotalEnergies SE TTE announced that it has signed an agreement to sell its entire interest in West of Shetland assets in the United Kingdom to The Prax Group. The transaction is subject to approval from the relevant authorities.\n\nCurrently, TotalEnergies' portion of these mature assets produces around 7,500 barrels of oil equivalent per day (boe/d), 90% of which is gas.\nAcquisition & Divestiture in Oil and Energy Space\nTotalEnergies continues with its strategic acquisitions in high-potential areas and sells non-core assets to achieve its long-term objective of improving production by focusing on the promising hydrocarbon-producing regions of the world.\n\nThis deal is in line with TTE's plan to focus on its most promising assets and aggressively manage its portfolio by monetizing its older holdings. The recent announcement followed TotalEnergies’ previous communication regarding an agreement with Hibiscus Petroleum Berhad to sell its subsidiary TotalEnergies EP (Brunei) B.V. for $259 million.\n\nIn first-quarter 2024, TTE acquired and sold assets worth $1.07 billion and $1.57 billion, respectively. These strategic initiatives should assist the company to further expand its operations across the globe.\n\nAlong with TTE, other oil and gas companies like Petrobras PBR, BP plc BP and Murphy Oil Corporation MUR are also divesting non-core assets and making strategic acquisitions to further expand operations and benefit from core operations.\n\nIn April 2024, Petrobras announced a significant divestment move. The company sold its entire stake in the Cherne and Bagre fields, located in the shallow waters of Brazil’s Campos basin, to Perenco Petróleo e Gás do Brasil Ltda for $10 million. This divestment aligns with Petrobras’ overarching strategy of optimizing its portfolio and directing investments toward assets that better resonate with its long-term objectives.\n\nPBR’s long-term (three- to five-year) earnings growth rate is 26.94%. The Zacks Consensus Estimate for 2024 earnings per share (EPS) indicates a year-over-year decrease of 17%.\n\nBP is focused on selling non-core assets to streamline its operations, lower its debt burden and fund investments in sustainable energy projects. This year, the British energy giant anticipates to generate $2-$3 billion from divestments and other proceeds. Alongside its first-quarter results announcement, BP stated that since the second quarter of 2020, it has realized $18.2 billion in divestment and other proceeds. The energy major is confident about its ability to achieve its goal of $25 billion in divestment and other proceeds between the latter half of 2020 and 2025.\n\nBP’s long-term earnings growth rate is 4%. The Zacks Consensus Estimate for 2024 sales indicates a year-over-year increase of 13.5%.\n\nIn 2023, Murphy Oil’s subsidiary closed the divestment of certain non-core-operated Kaybob Duvernay assets and all of its non-operated Placid Montney assets in Canada. The company received cash proceeds of nearly $104 million. MUR intends to utilize the proceeds from non-core asset divestitures in its new business in Côte d’Ivoire and development in Vietnam.\n\nThe Zacks Consensus Estimate for MUR’s 2024 sales indicates a year-over-year decrease of 2.2%. The company delivered an average earnings surprise of 3.3% in the last four quarters.\nPrice Performance\nIn the past three months, shares of TotalEnergies have lost 3.3% compared with the industry’s 7.9% decline.\n Zacks Investment Research\n\nImage Source: Zacks Investment Research\nZacks Rank\nThe company currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP): Free Stock Analysis Report\nPetroleo Brasileiro S.A.- Petrobras (PBR): Free Stock Analysis Report\nMurphy Oil Corporation (MUR): Free Stock Analysis Report\nTotalEnergies SE Sponsored ADR (TTE): Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Totalenergies-Tte-Sell-West-Shetland-131800915.Html", "Sentiment_Score": 0.0222736429, "Sentiment_Category": "neutral"}, {"Ticker": "BP", "Time": "2024-06-27T15:46:31.000Z", "Headline": "BP ponders shifting focus away from renewables, say sources", "Summary": "BP’s CEO Murray Auchincloss has reportedly initiated a hiring freeze and suspended offshore wind projects, according to sources at the company, as he places focus on oil and gas to boost revenues.\nHe is looking to halt large, fixed capital investments in offshore wind as they are not expected to deliver returns for years.\nAuchincloss, who became bp head at the start of the year, appears to be bowing to shareholder discontent over the returns available on non-hydrocarbon production and the switch to green energy.\nA spokesperson told a UK-based news provider that bp is still committed to becoming an integrated energy company.\nHowever, the change in emphasis will help bp become a better focused organisation. The decision marks a stark change in direction for the British energy giant, which looked to pivot to renewables under its previous CEO, Bernard Looney.\nBP’s move into green energy, although welcomed by a large proportion of shareholders, has pulled down the value of shares over recent months. They are currently valued at 475 pence on the London Stock Exchange, having hit 567 pence in February 2023. Shares were as low as 364 pence in July 2022.\nHowever, profits related to oil and gas have soared over recent years, thanks in part to Russia’s invasion of Ukraine and the continuing recovery from the global pandemic.\nIn February this year, bp reported its second-highest annual profit in a decade, despite it halving from the previous year.\nIts net profit in 2023 showed a steep decline to $13.8bn from the previous year’s $27.7bn. The company also announced a $1.5bn share buyback programme. Auchincloss will now prioritise the acquisition of new oil and gas assets, with a focus on the Gulf of Mexico and US onshore shale basins, especially where bp has existing operations, company sources told Reuters, with multiple other UK news outlets also reporting the move.\nThey added that bp will also invest in biofuels and low-carbon businesses that can generate cash quickly. Earlier this week, it purchased Bunge, a biofuels producer in Brazil, out of a joint venture for $1.4bn (£1.11bn).\nBP’s acquisition is expected to meet the company’s bioenergy return threshold of over 15% and fits within its financial framework, including capital expenditure targets of around $16bn for both 2024 and 2025.\nEarlier this month, John Browne, the former head of bp, backed a Labour Party pledge to end North Sea oil and gas exploration, saying that plans for the region and the “energy transition” would be important issues at the next election.\nBrowne said the next government should “call a halt” to new North Sea oil and gas projects. Making such a move, he claimed, would help “reinforce our intention to get to net zero and show timely leadership”.\nThe UK Government is aiming to reduce all direct emissions from public sector buildings by 50% and 75% by 2032 and 2037, respectively, with all UK emissions reaching net zero by 2050.\nBP’s website still claims the company will have developed 50GW of renewable generating capacity to final investment decision by 2030.\n“We are building a diversified renewable portfolio, including a global position in offshore wind,” it added.\nIn a statement seen by Reuters, BP said it introduced six priorities “to deliver as a simpler, more focused and higher value company”, which will usher in “the next wave of efficiencies and BP's growth projects”.\n“The actions we are taking are part of delivering this, and of course are all in service of our aim of growing the value of BP,” it said.\n\"BP ponders shifting focus away from renewables, say sources\" was originally created and published by Offshore Technology, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/Bp-Ponders-Shifting-Focus-Away-154631039.Html", "Sentiment_Score": 0.0852673724, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-06-27T08:44:13.000Z", "Headline": "BP halts offshore wind projects", "Summary": "Offshore wind projects may not generate profit for years - Andy Buchanan/AFP via Getty Images\nBP has put all new offshore wind projects on pause as the oil company’s new chief executive seeks to focus more heavily on fossil fuels.\nMurray Auchincloss, who became permanent head of the business at the start of the year, has also frozen hiring in the offshore wind division.\nThe move, which was first reported by Reuters, follows investor discontent over the company’s switch to green energy.\nHowever, it is likely to trigger a backlash from climate campaigners who have waged a years-long campaign to push BP into clean energy.\nMr Auchincloss is seeking to slow down investments in big budget, low-carbon projects, particularly in offshore wind, that are not expected to generate cash for years.\nIt suggests he is reversing the policies of Bernard Looney, his disgraced predecessor, who tried to move away from fossil fuels before quitting over inappropriate relationships last autumn.\nThe shift to greener energy has weighed on BP’s shares as returns from renewables shrank, while profits from oil and gas soared. The global recovery from the pandemic and then Russia’s invasion of Ukraine both drove prices to new highs.\nMr Auchincloss and chief financial officer Kate Thomson have prioritised investing in and even acquiring new oil and gas assets, particularly in the Gulf of Mexico and US onshore shale basins, where BP already has large operations, company sources briefed on the matter said.\nBP will still consider investing in biofuels and some low-carbon businesses that can generate returns in the short term.\nThis week, BP agreed to buy grain trader Bunge’s 50pc stake in Brazilian sugar and ethanol joint venture for $1.4bn (£1.1bn).\nIt is also expected to make some job cuts in renewables, although no specific targets have been given, sources told Reuters. They added that BP has imposed a company-wide hiring freeze, with only a few exceptions such as frontline and safety personnel.\nMr Auchincloss has promised a pragmatic approach since taking over in January, four months after Looney resigned.\nHe announced a $2bn cost-saving drive by the end of 2026 relative to 2023. The 53-year-old also cut his executive leadership team from 11 to 10 members.\nBP said in a statement to Reuters that Mr Auchincloss introduced six priorities “to deliver as a simpler, more focused and higher value company”.\nThe priorities include delivering “the next wave of efficiencies and BP’s growth projects”.\nIt said: “The actions we are taking are part of delivering this – and of course are all in service of our aim of growing the value of BP.”\nShares in BP have underperformed rivals in recent months, raising speculation that it could be a takeover target.\nThat has piled pressure on Mr Auchincloss as he seeks to reassure investors who are juggling the need to decarbonise the global economy with rising near-term demand for fossil fuels.\nBP spent $2.5bn on renewables, hydrogen, electric car charging and biofuels in 2023, out of a total investment budget of $16bn.\nBP is the only major oil company with targets to reduce its production of oil and gas. Shell last year shifted its strategy to focus on high-return business, scaling back investments in many renewables and low-carbon energy businesses.", "Link": "Https://Finance.Yahoo.Com/News/Bp-Freezes-Offshore-Wind-Projects-084413480.Html", "Sentiment_Score": -0.6309806705, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-06-27T05:03:23.000Z", "Headline": "BP halts hiring, slows renewables roll-out to win over investors", "Summary": "By Ron Bousso\nLONDON (Reuters) - BP's new CEO Murray Auchincloss has imposed a hiring freeze and paused new offshore wind projects as he places a renewed emphasis on oil and gas amid investor discontent over its energy transition strategy, sources at the company said.\nThe moves, which have not previously been reported, are part of a decision by Auchincloss to slow down investments in big budget, low-carbon projects, particularly in offshore wind, that are not expected to generate cash for years, said several sources at BP who declined to be named.\nThey mark a stark reversal from the direction the CEO's predecessor Bernard Looney took to rapidly move away from fossil fuels. This has weighed on BP's shares as returns from renewables shrank, while profits from oil and gas soared in the wake of the COVID-19 pandemic and Russia's invasion of Ukraine.\nBP has reassigned dozens of people tasked with identifying new renewables opportunities to projects already underway such as offshore wind in Britain and Germany, three sources said.\nAuchincloss and Chief Financial Officer Kate Thomson have prioritised investing in and even acquiring new oil and gas assets, particularly in the Gulf of Mexico and in the U.S. onshore shale basins, where BP already has large operations, company sources briefed on the matter said.\nBP will also consider investing in biofuels and some low-carbon businesses that can generate returns in the short term. Earlier this week, BP agreed to buy grain trader Bunge's 50% stake in Brazilian sugar and ethanol joint venture BP Bunge Bioenergia for $1.4 billion\nIt is also expected to make some job cuts in renewables, although no specific targets have been given, the sources said, adding that BP has imposed a company-wide hiring freeze, with only a few exceptions including frontline and safety personnel.\nAuchincloss has promised a pragmatic approach since taking over in January, four months after Looney resigned for failing to disclose relationships with employees.\nIn May Auchincloss announced a $2 billion cost saving drive by the end of 2026 relative to 2023. The 53-year-old also cut his executive leadership team from 11 to 10 members.\nBP said in a statement to Reuters that Auchincloss introduced six priorities \"to deliver as a simpler, more focused and higher value company\".\nThe priorities include focusing the business and delivering \"the next wave of efficiencies and BP's growth projects\".\n\"The actions we are taking are part of delivering this - and of course are all in service of our aim of growing the value of BP,\" it said.\nBP's most high profile external hire under Looney was Anja-Isabel Dotzenrath, a former head of RWE Renewables who joined in 2022 to lead its renewables and gas division but stepped down for personal reasons in April.\nHer successor, veteran BP executive William Lin, is expected to put a greater focus on gas operations when he takes over in the coming months, two sources said.\nShares in BP have underperformed rivals in recent months, raising speculation that it could be a takeover target.\nThat has piled pressure on Auchincloss as he seeks to reassure investors who are juggling the need to decarbonise the global economy with rising near-term demand for fossil fuels.\nBP spent $2.5 billion on renewables, hydrogen, EV charging and biofuels in 2023, out of a total capex of $16 billion.\nBACK TO BLACK\nBP is the only major oil company to have oil and gas output reduction targets. Shell last year shifted its strategy to focus on high-return business, scaling back investments in many renewables and low-carbon energy businesses.\nIn February 2023, BP slowed its cornerstone pledge to cut oil and gas output between 2019 and 2030 from 40% to 25%. It kept its 2030 renewables targets, including the development of 10 gigwatt of installed capacity.\nAuchincloss last month further softened the language on the 2030 target.\nIn another sign of change, BP has hired several new staff to its exploration team, headed by Bryan Ritchie since May, as it tries to replenish its reserves in order to sustain and even grow output.\nBP is also allocating more capital and workforce to developing new fields such as the Kaskida, Tiber and Gila discoveries in the Gulf of Mexico.\nIn recent weeks it also overhauled its mergers and acquisitions division by combining it with the business development division under Sam Skerry, three sources said.\nLast October BP said it had 18 billion of barrels of oil and gas equivalent in resources which represent 20 years of its current production that could be developed to sustain its 2022 production level within its returns target.\n(Reporting by Ron Bousso; Editing by Alexander Smith)", "Link": "Https://Finance.Yahoo.Com/News/Bp-Halts-Hiring-Slows-Renewables-050323032.Html", "Sentiment_Score": -0.8720697761, "Sentiment_Category": "bearish"}, {"Ticker": "BP", "Time": "2024-06-26T12:52:00.000Z", "Headline": "Oil & Gas Stock Roundup: BP and Shell Take Center Stage", "Summary": "It was a week when oil prices moved up, but natural gas futures posted a loss.\n\nThe headlines revolved around acquisitions by European oil majors BP plc BP and Shell SHEL. Developments associated with ExxonMobil XOM, Cheniere Energy LNG and Oceaneering International OII also grabbed attention.\n\nOverall, it was a mixed seven-day period for the sector. West Texas Intermediate (WTI) crude futures rose around 2.9% to close at $80.73 per barrel, but natural gas prices fell 6.1% to end at $2.71 per million British thermal units (MMBtu).\n\nThe crude price action remained positive after a report from the Energy Information Administration (\"EIA\") showed drawdowns in crude and fuel stockpiles.  \n\nMeanwhile, natural gas settled with a loss following the U.S. Energy Department's inventory release that showed a higher-than-expected increase in supplies.\nRecap of the Week’s Most Important Stories\n1.    BP has announced its agreement to acquire Bunge's 50% stake in their joint venture, BP Bunge Bioenergia S.A., solidifying the London-based oil major’s control over one of Brazil’s top biofuel-producing companies. This strategic acquisition, valued at approximately $1.4 billion, marks a pivotal step in BP's efforts to expand and optimize its bioenergy portfolio.\n\nThe acquisition will allow BP to fully integrate BP Bunge Bioenergia into its operations, leveraging its trading and technology capabilities to maximize value. The deal is expected to lead to the consolidation of 100% of the JV's financial results, including debt of around $0.5 billion and lease obligations of approximately $0.7 billion.\n\nOnce the transaction is completed, BP will have the capacity to produce around 50,000 barrels of ethanol equivalent per day from sugarcane, utilizing BP Bunge Bioenergia's 11 agro-industrial units spread across five Brazilian states. This integrated business model spans the entire production chain, from cultivation to selling ethanol and sugar. (BP to Acquire Full Control of Biofuels Joint Venture for $1.4B)\n\n2.    Larger rival Shell has finalized a deal to acquire Pavilion Energy, the Singaporean liquified natural gas (LNG) firm, from Temasek, a global investment company. The acquisition is likely to strengthen Shell’s overall LNG portfolio and allow the energy major to tap into the key gas markets in Europe and Singapore. Shell is aggressively pursuing an expansion strategy to solidify its position as a leader in LNG markets.\n\nThe purchase will be covered within Shell’s present cash capital guidance. The Zacks Rank #3 (Hold) company has stated that its cash capital guidance will remain unchanged, which implies that it will not need to increase its planned spending to complete the purchase. The deal exceeds Shell’s internal rate of return (IRR) hurdle rate for its Integrated Gas business, aligning with its growth ambition target of a 15-25% increase in purchased LNG volumes from the 2022 level.\n\nYou can see the complete list of today’s Zacks #1 Rank stocks here.\n\nThe acquisition is scheduled to be closed by the first quarter of 2025, contingent upon regulatory approvals, following which Shell will start integrating the asset portfolios. The deal with Temasek should help Shell expand its LNG portfolio and meet its long-term objective of growing its LNG business by 20-30% within 2030 (compared to 2022). (Shell to Expand LNG Portfolio With Pavilion Energy Deal)\n\n3.    ExxonMobil’s ongoing arbitration over its right of first refusal concerning Hess Corporation’s Guyana operations has put a significant hold on Chevron’s $53-billion acquisition of Hess.\n\nThis delay has stalled a decision on whether ExxonMobil has a right of first refusal over Hess’ lucrative Guyana operations. The arbitration panel, tasked with deciding this critical issue, remains incomplete three months after the case was filed, hindering any immediate resolution.\n\nThe sale has become a contentious issue, primarily because it involves a 30% stake in a lucrative Guyana oil consortium, which has discovered at least 11 billion barrels of oil and expects to produce 1.3 million barrels per day by 2027. ExxonMobil, holding a 45% majority stake in the consortium, claims that Chevron's acquisition of Hess circumvents its preemption right as specified in the joint operating agreement (JOA). (ExxonMobil's Right of Refusal Halts Chevron-Hess Deal)\n\n4.    Cheniere Energy, a leading U.S. exporter of liquefied natural gas (“LNG”), has announced a significant enhancement to its capital allocation strategy. The company has approved an additional $4 billion in share repurchase authorization through 2027 and plans to increase its quarterly dividend by 15% to an annualized rate of $2.00 per common share starting in the third quarter of 2024.\n\nCheniere’s 20/20 Vision capital allocation plan, introduced in 2022, has made substantial progress. The plan aims to deploy over $20 billion toward growth, capital returns and maintaining an investment-grade balance sheet.\n\nThe increased share repurchase authorization and dividend hike are part of a broader strategy to enhance shareholder value while supporting accretive growth projects. Further, Cheniere aims to consistently generate over $20 per share in distributable cash flow, leveraging its strategic investments and strong market position. (Cheniere Hikes Dividend, Buyback in Strategic Boost).\n\n5.    Oilfield service provider Oceaneering International's Manufactured Products division has secured a major contract from a U.S. independent energy company. The contract is valued at roughly $50 million and involves supplying a specialized underwater cable for a project in the Gulf of Mexico. This deal highlights OII's strong reputation in the industry and its capacity to deliver high-quality products in a timely manner.\n\nThe contract involves the supply of an electro-hydraulic, steel tube dynamic umbilical. This specialized product will be utilized in a project located in the Gulf of Mexico. The total length of the umbilical is approximately 27 kilometers (17 miles). Such a substantial length indicates the scale and complexity of the project, highlighting OII's technical expertise and manufacturing capabilities.\n\nSecuring this contract is a notable milestone for OII. The anticipated revenues from this contract, approximately $50 million, should significantly boost the company's financial performance. This influx of revenues is expected to enhance OII's market position, providing a competitive edge in the highly dynamic and competitive energy sector. (Oceaneering Secures $50 Million Umbilical Contract)\nPrice Performance\nThe following table shows the price movement of some major oil and gas players over the past week and during the last six months.\n\nCompany    Last Week    Last 6 Months\nXOM                  +1.5%              +12.2%\nCVX                  +1.8%              +4.9%\nCOP                 +1.8%               -2.3%\nOXY                  +1.8%              +3.8%\nSLB                  +6.2%               -10.7%\nRIG                   -0.4%                -20.9%\nVLO                  +0.1%               +18%\nMPC                 +1.5%               +16.1%\n\nWith oil moving up for the week, stocks were mostly positive. The Energy Select Sector SPDR — a popular way to track energy companies — rose 1.9% last week. However, the sector tracker has increased 7.7% over the past six months.\nWhat’s Next in the Energy World?\nAs usual, market participants will closely track the regular releases to look for guidance on the direction of the commodities. In this context, the U.S. government’s statistics on oil and natural gas — one of the few solid indicators that come out regularly — will be on energy traders' radar. Fuel demand and the rate of stock drawdowns in the coming weeks will determine the trend in commodity prices. Data on rig count from the oilfield service firm Baker Hughes, which is a pointer to the trends in U.S. crude/natural gas production, is closely followed, too.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nOceaneering International, Inc. (OII) : Free Stock Analysis Report\nCheniere Energy, Inc. (LNG) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Oil-Gas-Stock-Roundup-Bp-125200853.Html", "Sentiment_Score": 0.0904555023, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-06-24T14:04:00.000Z", "Headline": "Bunge Global (BG) to Sell Its 50% Stake in BP Bunge Bioenergia", "Summary": "Bunge Global SA BG announced that it signed a deal with its joint venture partner, BP plc BP, to sell its 50% share in BP Bunge Bioenergia. As a result of this deal, the company will no longer have any interest in its bioenergy and sugarcane ethanol businesses in Brazil. This move is expected to help BG focus on its core businesses.\n\nBunge and BP created the joint venture, BP Bunge Bioenergia, in 2019 by merging the two companies' Brazilian bioenergy and sugarcane ethanol businesses. It operates 11 mills in the Southeast, North and Midwest areas of Brazil. Following the sale, BP will become the sole owner of BP Bunge Bioenergia.   \n\nThe deal is expected to close by the end of the fourth quarter of 2024. The second and final monetization event of Bunge Global's shareholding in the business is estimated to generate net proceeds of $800 million, depending on the timing of closing and usual closing adjustments.\n\nThe transaction will allow the company to strengthen its balance sheet and focus and invest in its core businesses.\n\nBunge reported first-quarter 2024 adjusted earnings of $3.04 per share, which surpassed the Zacks Consensus Estimate of $2.55. The bottom line fell 7% year over year. Net sales were $13.4 billion in the quarter under review, down 12.5% from the year-ago quarter. The top line missed the Zacks Consensus Estimate of $13.78 billion.\nPrice Performance\nShares of Bunge Global have gained 17% over the past year compared with the industry's growth of 9.9%.\n Zacks Investment Research\n\nImage Source: Zacks Investment Research\n Zacks Rank & Stocks to Consider\nBunge Global currently carries a Zacks Rank #3 (Hold).\n\nTwo better-ranked stocks from the basic materials space are Ero Copper Corp. ERO and Ecolab Inc. ECL. ERO sports a Zacks Rank #1 (Strong Buy) at present and ECL carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nThe Zacks Consensus Estimate for Ero Copper’s 2024 earnings is pegged at $1.66 per share. The consensus estimate for 2024 earnings has moved 20.3% north in the past 60 days. It has an average trailing four-quarter earnings surprise of 53.9%. ERO shares have gained 9.5% in a year.\n\nThe Zacks Consensus Estimate for Ecolab’s 2024 earnings is pegged at $6.59 per share, indicating an increase of 26.5% from the prior year’s reported number. It has an average trailing four-quarter earnings surprise of 1.3%. ECL shares have gained 34.5% in a year.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nEcolab Inc. (ECL) : Free Stock Analysis Report\nBunge Global SA (BG) : Free Stock Analysis Report\nEro Copper Corp. (ERO) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Bunge-Global-Bg-Sell-50-140400047.Html", "Sentiment_Score": 0.0188970882, "Sentiment_Category": "neutral"}, {"Ticker": "BP", "Time": "2024-06-24T14:00:00.000Z", "Headline": "Arcadis completes charger installation for bp pulse's first high-speed EV Gigahub™ in the US", "Summary": "Arcadis has delivered more than 7,000 EV charging stations around the world\nHOUSTON, June 24, 2024 /PRNewswire/ -- Arcadis, a leading global design and consultancy organization for natural and built assets, today announced the completion of bp's (NYSE: BP) latest high-speed EV charging site at the company's North America headquarters in Houston, Texas. The new bp pulse station is the first bp pulse branded Gigahub™ in the US for their EV charging business.\nArcadis Logo (PRNewsfoto/Arcadis)\nArcadis delivered program and construction management for the installation of 24 high-speed charge points at bp's Houston campus.  Twelve Tritium 150kW DC fast chargers were installed at the site, which are configured so any electric vehicle will have the capability to charge at the new EV charging facility. Parking canopies designed to support a Solar PV system may be added in the future.  The site is designed to accommodate potential expansion with additional chargers as needed, as well as restrooms, a lounge, and convenience store.\nBrooke Bonkoski, President of Resilience Environment US at Arcadis, said: \"We are proud to work with bp pulse on energy transition projects such as these that accelerate a planet positive future. Arcadis, like bp, is committed to moving the energy transition forward. Delivering this project in the City of Houston, the energy capital of the world, is particularly impactful.\"\nThe new EV charging facility will provide increased capacity for electric vehicle charging across greater Houston, making EV ownership more convenient and helping to reduce driver hesitation to make the switch from gas and diesel vehicles to full electric vehicles. The new charging Gigahub is a critical addition to the City of Houston that is seeing a rapidly growing number of electric vehicles in the city.\nSujay Sharma, CEO, bp pulse Americas, said: \"The opening of our first bp pulse Gigahub is a major step in bp pulse's plans to build out a national EV charging network. EV drivers need access to reliable, fast, on-the-go charging to enable an exceptional customer experience. Working with leaders in the space, like Arcadis, is allowing us to deliver the charging experience EV drivers need in Houston and beyond.\nbp unveiled the new charging Gigahub during the CERAWeek by S&P Global Conference. The facility is now open to the public.\nABOUT ARCADIS\nAbout bp pulse\nLogo - https://mma.prnewswire.com/media/1838726/4776475/Arcadis_Logo.jpg\nCision\nView original content to download multimedia:https://www.prnewswire.com/news-releases/arcadis-completes-charger-installation-for-bp-pulses-first-high-speed-ev-gigahub-in-the-us-302179290.html\nSOURCE Arcadis", "Link": "Https://Finance.Yahoo.Com/News/Arcadis-Completes-Charger-Installation-Bp-140000180.Html", "Sentiment_Score": 0.7513458133, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-06-24T13:36:00.000Z", "Headline": "The Zacks Analyst Blog Highlights Abbott Laboratories, BP, Gilead Sciences, Smith-Midland and Crimson Wine", "Summary": "For Immediate Release\nChicago, IL – June 24, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Abbott Laboratories (ABT), BP p.l.c. BP, Gilead Sciences, Inc. GILD, Smith-Midland Corp. SMID and Crimson Wine Group, Ltd. CWGL.\nHere are highlights from Friday’s Analyst Blog:\nTop Analyst Reports for Abbott, BP and Gildead\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Abbott Laboratories, BP p.l.c. and Gilead Sciences, Inc., as well as two micro-cap stocks Smith-Midland Corp. and Crimson Wine Group, Ltd.\nThe Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\n\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today’s research reports here >>>\n\nShares of Abbott have declined -1.5% over the past year against the Zacks Medical - Products industry’s decline of -1.6%. The company’s pipeline is generating several new growth prospects, which will help sustain the positive momentum and contribute to the strong growth projection in 2024.\n\nAlinity, the company’s next-generation suite of systems, is a key driver in the core lab diagnostics business. EPD's impressive stretch of strong performance stems from the company’s unique business model. Freestyle Libre CGM device is also on a great trajectory, continually outpacing market growth.\n\nWithin Nutrition, after a period of hiccups, Abbott has finally reestablished itself as the market leader in the infant formula business, underscoring strong customer confidence in the company's products. However, the slump in COVID-19 testing-related sales is hurting Abbott’s overall growth. Tough macro conditions also pose a concern for its operations.\n\n(You can read the full research report on Abbott here >>>)\n\nBP’s shares have gained +1.4% over the past year against the Zacks Oil and Gas - Integrated - International industry’s gain of +6.6%. The company has a strong portfolio of upstream projects, supporting notable growth in production. The integrated energy company exhibits robust upstream growth with the start-up of major projects like Seagull, which boosts its production capacity.\n\nDiversification into renewables through the Lightsource BP acquisition supports long-term sustainability amid energy transitions. The divestment strategy aims to reach $25 billion by 2025, enhancing the balance sheet and returning capital to shareholders.\n\nHowever, a high debt-to-capitalization ratio raises financial flexibility and balance sheet concerns. Also, despite resolving significant litigation expenses from the 2010 oil spill, BP had to sell valuable assets. These divestitures could potentially limit future cash generation. Refining margins may face pressure due to narrower crude differentials.\n\n(You can read the full research report on BP here >>>)\n\nShares of Gilead have declined -8.6% over the past year against the Zacks Medical - Biomedical and Genetics industry’s decline of -11.2%. The company's recent pipeline setbacks weigh on its balance sheet. Gaining incremental market share is likely to get tougher due to the competition in the HIV market.\n\nNevertheless, Gilead’s flagship HIV therapy, Biktarvy, continues to maintain its strong growth, thereby fueling the top line. The approval of new therapies has boosted the company’s market-leading HIV franchise. Gilead’s efforts to develop better HIV treatments are commendable.\n\nSubstantial growth in Yescarta and Tecartus, and the strong uptake of Trodelvy have strengthened its oncology franchise. Gilead's efforts to bolster its oncology and virology franchises through internal pipeline development and collaborations are encouraging.\n\n(You can read the full research report on Gilead here >>>)\n\nSmith-Midland’s shares have outperformed the Zacks Building Products - Concrete and Aggregates industry over the past year (+71.7% vs. +14.7%). This microcap company with market capitalization of $174.47 million hit a record $59.6 million in 2023, up 19% year over year due to expanded sales of soundwalls and barrier rentals, supported by strategic manufacturing investments and a global licensee network.\n\nOperational efficiency improved, turning a prior year operating loss into a $542,000 operating income in fourth-quarter 2023. Infrastructure spending tailwinds from the Infrastructure and Jobs Act may boost the 2024 results. Financial health is strong, with $9.2 million in cash and $5 million invested in production capacity.\n\nHowever, rising material and labor costs, high receivables, and intense competition pose risks. The dependence on key customers and potential regulatory penalties could impact SMID’s financials. The possibility of reduced government infrastructure spending could further strain performance.\n\n(You can read the full research report on Smith-Midland here >>>)\n\nShares of Crimson Wine have declined -2.3% over the past year against the Zacks Beverages - Alcohol industry’s decline of -12.3%. This microcap company with market capitalization of $119.88 million boasts a strong portfolio of seven luxury wine brands, appealing to affluent consumers with wines retailing more than $16 per 750 ml bottle. It has a healthy balance sheet, with $22.6 million in cash and a current ratio of 10.3.\n\nContinued investment in premium brands and a robust inventory of 0.7 million cases position the company well. CWGL has a $60-million credit facility with no drawdowns, reflecting financial flexibility and an improved gross margin. Yet, Crimson Wine Group reported first-quarter net loss of $633,000, with rising operating expenses outpacing revenue growth.\n\nHigh inventory levels suggest misalignment with market demand. Climate change and adverse weather pose risks to grape quality and production costs. Also, CWGL faces technological and cybersecurity risks with its new ERP system and inflationary pressures.\n\n(You can read the full research report on Crimson Wine here >>>)\nWhy Haven’t You Looked at Zacks' Top Stocks?\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAbbott Laboratories (ABT) : Free Stock Analysis Report\nBP p.l.c. (BP) : Free Stock Analysis Report\nGilead Sciences, Inc. (GILD) : Free Stock Analysis Report\nSmith-Midland Corp. (SMID): Free Stock Analysis Report\nCrimson Wine Group Ltd. (CWGL): Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Zacks-Analyst-Blog-Highlights-Abbott-133600089.Html", "Sentiment_Score": 0.0224391501, "Sentiment_Category": "neutral"}, {"Ticker": "BP", "Time": "2024-06-21T20:24:00.000Z", "Headline": "Top Analyst Reports for Abbott, BP & Gilead", "Summary": "Friday, June 21, 2024\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Abbott Laboratories (ABT), BP p.l.c. (BP) and Gilead Sciences, Inc. (GILD), as well as two micro-cap stocks Smith-Midland Corp. (SMID) and Crimson Wine Group, Ltd. (CWGL).\nThe Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\n\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today’s research reports here >>>\n\nShares of Abbott have declined -1.5% over the past year against the Zacks Medical - Products industry’s decline of -1.6%. The company’s pipeline is generating several new growth prospects, which will help sustain the positive momentum and contribute to the strong growth projection in 2024.\n\nAlinity, the company’s next-generation suite of systems, is a key driver in the core lab diagnostics business. EPD's impressive stretch of strong performance stems from the company’s unique business model. Freestyle Libre CGM device is also on a great trajectory, continually outpacing market growth.\n\nWithin Nutrition, after a period of hiccups, Abbott has finally reestablished itself as the market leader in the infant formula business, underscoring strong customer confidence in the company's products. However, the slump in COVID-19 testing-related sales is hurting Abbott’s overall growth. Tough macro conditions also pose a concern for its operations.\n\n(You can read the full research report on Abbott here >>>)\n\nBP’s shares have gained +1.4% over the past year against the Zacks Oil and Gas - Integrated - International industry’s gain of +6.6%. The company has a strong portfolio of upstream projects, supporting notable growth in production. The integrated energy company exhibits robust upstream growth with the start-up of major projects like Seagull, which boosts its production capacity.\n\nDiversification into renewables through the Lightsource BP acquisition supports long-term sustainability amid energy transitions. The divestment strategy aims to reach $25 billion by 2025, enhancing the balance sheet and returning capital to shareholders.\n\nHowever, a high debt-to-capitalization ratio raises financial flexibility and balance sheet concerns. Also, despite resolving significant litigation expenses from the 2010 oil spill, BP had to sell valuable assets. These divestitures could potentially limit future cash generation. Refining margins may face pressure due to narrower crude differentials.\n\n(You can read the full research report on BP here >>>)\n\nShares of Gilead have declined -8.6% over the past year against the Zacks Medical - Biomedical and Genetics industry’s decline of -11.2%. The company's recent pipeline setbacks weigh on its balance sheet. Gaining incremental market share is likely to get tougher due to the competition in the HIV market.\n\nNevertheless, Gilead’s flagship HIV therapy, Biktarvy, continues to maintain its strong growth, thereby fueling the top line. The approval of new therapies has boosted the company’s market-leading HIV franchise. Gilead’s efforts to develop better HIV treatments are commendable.\n\nSubstantial growth in Yescarta and Tecartus, and the strong uptake of Trodelvy have strengthened its oncology franchise. Gilead's efforts to bolster its oncology and virology franchises through internal pipeline development and collaborations are encouraging.\n\n(You can read the full research report on Gilead here >>>)\n\nSmith-Midland’s shares have outperformed the Zacks Building Products - Concrete and Aggregates industry over the past year (+71.7% vs. +14.7%). This microcap company with market capitalization of $174.47 million hit a record $59.6 million in 2023, up 19% year over year due to expanded sales of soundwalls and barrier rentals, supported by strategic manufacturing investments and a global licensee network.\n\nOperational efficiency improved, turning a prior year operating loss into a $542,000 operating income in fourth-quarter 2023. Infrastructure spending tailwinds from the Infrastructure and Jobs Act may boost the 2024 results. Financial health is strong, with $9.2 million in cash and $5 million invested in production capacity.\n\nHowever, rising material and labor costs, high receivables, and intense competition pose risks. The dependence on key customers and potential regulatory penalties could impact SMID’s financials. The possibility of reduced government infrastructure spending could further strain performance.\n\n(You can read the full research report on Smith-Midland here >>>)\n\nShares of Crimson Wine have declined -2.3% over the past year against the Zacks Beverages - Alcohol industry’s decline of -12.3%. This microcap company with market capitalization of $119.88 million boasts a strong portfolio of seven luxury wine brands, appealing to affluent consumers with wines retailing more than $16 per 750 ml bottle. It has a healthy balance sheet, with $22.6 million in cash and a current ratio of 10.3.\n\nContinued investment in premium brands and a robust inventory of 0.7 million cases position the company well. CWGL has a $60-million credit facility with no drawdowns, reflecting financial flexibility and an improved gross margin. Yet, Crimson Wine Group reported first-quarter net loss of $633,000, with rising operating expenses outpacing revenue growth.\n\nHigh inventory levels suggest misalignment with market demand. Climate change and adverse weather pose risks to grape quality and production costs. Also, CWGL faces technological and cybersecurity risks with its new ERP system and inflationary pressures.\n\n(You can read the full research report on Crimson Wine here >>>)\n\nOther noteworthy reports we are featuring today include Constellation Brands, Inc. (STZ), D.R. Horton, Inc. (DHI) and Waste Connections, Inc. (WCN).\n\nMark Vickery\nSenior Editor\n\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nAbbott (ABT) Banks on Nutrition Arm, Solid Libre Prospect\nBP's Robust Upstream Portfolio to Boost Production Capacity\nHIV, Oncology Fuel Gilead (GILD) Amid Pipeline Setbacks\nFeatured Reports\nBrand Building Boosts Constellation Brands' (STZ) Market Share\nPer the Zacks analyst, Constellation Brands' consistent focus on brand building and inclusion of new products are key revenue drivers. This helped boost market share, mostly in the U.S. beer category.\nD.R. Horton's (DHI) Affordable Homes Aid, High Rates Ail\nD.R. Horton to gain from its robust backlog, industry-leading market share, acquisitions and focus on more entry-level affordable homes, per the Zacks analyst. Yet, higher rates are concerns.\nOperating Prowess Aid Waste Connections (WCN), Liquidity Low\nPer the Zacks analyst, Waste Connections' low-overhead, highly efficient operational structure allows it to expand into geographically contiguous markets. Low liquidity remains a concern.\nDarden (DRI) Banks on Unit Growth & Digitization, Costs High\nPer the Zacks analyst, Darden is likely to benefit from new restaurant openings, the integration of Ruth's Chris Steak House and digital efforts. However, commodity and wage inflation is a concern.\nStrength in Aerospace, Industrial Sectors Aids Woodward (WWD)\nPer the Zacks analyst, momentum across Aerospace and Industrial segments is cushioning Woodward's top-line performance. The Industrial unit is expected to gain from higher demand for power generation.\nRayonier (RYN) Rides on Solid Portfolio Amid High Rates\nPer the Zacks analyst, a solid timberland portfolio and unlocking the long-term value of its HBU development and rural property portfolio are likely to support Rayonier despite high interest rates.\nRising Production Aids SolarEdge (SEDG), Lower Demand Woes\nPer the Zacks analyst, growing production capacity and steady inverter shipments is likely to boost SolarEdge's revenues. Yet, lower installation in Europe might adversely impact its overall growth.\nNew Upgrades\nPackaging Demand, Cost Savings Actions Aid WestRock (WRK)\nPer the Zacks analyst, WestRock will gain from stable packaging demand in the food, beverage, and e-commerce sectors. Pricing strategies and cost-saving measures will help improve its margins.\nSprouts Farmers' (SFM) Omnichannel Offering to Propel Sales\nPer the Zacks analyst Sprouts Farmers' assortment of better-for-you products, focus on providing hassle-free shopping through omnichannel offering and a network of fresh distribution centers bode well\nGrowing Top Line, Solid Capital Position Aid Palomar (PLMR)\nPer the Zacks analyst, Palomar's growing revenues driven by higher premiums and net investment income have led to significant growth. Moreover, robust capital position supports capital deployment.\nNew Downgrades\nLower IT Spending to Hurt Avnet's (AVT) Growth Prospects\nPer the Zacks Analyst, Avnet's growth prospects might be hurt by soft IT spending as organizations are pushing back their large IT investment plans amid the macroeconomic headwinds.\nLower Steel Prices, High Debt Ail Nucor (NUE)\nPer the Zacks analyst, the company faces margin headwinds from a significant decline in steel prices due to a slowdown in end-market demand. A high debt level is also a concern.\nDeclining Premiums, Soft Cash Flows Hurt Amerisafe (AMSF)\nPer the Zacks analyst, product concentration and constrained premiums are hurting Amerisafe's top-line growth. A decline in operating cash flows remains a concern.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAbbott Laboratories (ABT) : Free Stock Analysis Report\nBP p.l.c. (BP) : Free Stock Analysis Report\nGilead Sciences, Inc. (GILD) : Free Stock Analysis Report\nConstellation Brands Inc (STZ) : Free Stock Analysis Report\nD.R. Horton, Inc. (DHI) : Free Stock Analysis Report\nWaste Connections, Inc. (WCN) : Free Stock Analysis Report\nSmith-Midland Corp. (SMID): Free Stock Analysis Report\nCrimson Wine Group Ltd. (CWGL): Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Top-Analyst-Reports-Abbott-Bp-202400824.Html", "Sentiment_Score": 0.0034340154, "Sentiment_Category": "neutral"}, {"Ticker": "BP", "Time": "2024-06-21T11:58:00.000Z", "Headline": "BP to Acquire Full Control of Biofuels Joint Venture for $1.4B", "Summary": "BP plc (BP) has announced its agreement to acquire Bunge's 50% stake in their joint venture, BP Bunge Bioenergia S.A., solidifying BP’s control over one of Brazil’s top biofuel-producing companies. This strategic acquisition, valued at approximately $1.4 billion, marks a pivotal step in BP's efforts to expand and optimize its bioenergy portfolio.\nStrengthening Biofuels Operations\nThe acquisition will allow BP to fully integrate BP Bunge Bioenergia into its operations, leveraging its trading and technology capabilities to maximize value. The deal is expected to lead to the consolidation of 100% of the JV's financial results, including debt of around $0.5 billion and lease obligations of approximately $0.7 billion.\nOnce the transaction is completed, BP will have the capacity to produce around 50,000 barrels of ethanol equivalent per day from sugarcane, utilizing BP Bunge Bioenergia's 11 agro-industrial units spread across five Brazilian states. This integrated business model spans the entire production chain, from cultivation to selling ethanol and sugar.\nEmma Delaney, BP’s executive vice president for customers and products, conveyed her excitement about BP Bunge Bioenergia's industry leadership and opportunity to enhance value through its trading and technology capabilities.\nRefocusing Biofuels Development\nAlongside this acquisition, BP is reassessing its approach to new biofuel projects. The company is pausing two potential developments in sustainable aviation fuel (SAF) and renewable diesel while continuing to evaluate three other projects. This strategic shift aligns with BP's goal to simplify its portfolio and focus on high-value, high-return initiatives.\nDelaney elaborated on this strategy, emphasizing that its focus on developing new biofuel projects has been motivated by maximizing value. These adjustments are aimed at achieving anticipated growth and returns from biofuels in a streamlined and targeted manner.\nFinancial and Operational Impact\nThis acquisition meets BP’s expected returns threshold for bioenergy, aiming for more than a 15% return and fitting within its disciplined financial framework. BP plans to allocate around $16 billion in capital expenditures for both 2024 and 2025. This move supports BP’s strategic bioenergy growth targets, contributing to approximately $2 billion in EBITDA from bioenergy by 2025.\nFuture Growth Prospects\nBP’s full ownership of BP Bunge Bioenergia opens up new growth opportunities in the region, including potential advancements in next-generation ethanol, sustainable aviation fuel, and biogas. The company remains committed to expanding its bioenergy business, with ambitious goals to increase biofuels production and biogas supply significantly by 2030.\nPending regulatory approvals, the transaction is expected to close by the end of 2024. This acquisition and the refocused biofuels strategy are set to enhance BP's position in the bioenergy sector, driving sustainable growth and shareholder returns.\nZacks Rank & Key Picks\nBP currently carries a Zack Rank #3 (Hold).\nInvestors interested in the energy sector may look at some better-ranked stocks like Archrock Inc. AROC, Sunoco LP SUN, and SM Energy Company SM. While Archrock and Sunoco sport a Zacks Rank #1 (Strong Buy) each, SM Energy currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nArchrock is an energy infrastructure company based in the United States, focusing on midstream natural gas compression. It provides natural gas contract compression services and generates stable fee-based revenues.\nThe Zacks Consensus Estimate for AROC’s 2024 EPS is pegged at $1.07. The company has a Zacks Style Score of A for Growth. It has witnessed upward earnings estimate revisions for 2024 and 2025 in the past 60 days.\nSunoco is a leading wholesale motor fuel distributor in the United States, boasting a vast distribution network spanning 40 states. With long-term contracts servicing over 10,000 convenience stores, it distributes over 10 fuel brands, ensuring a stable revenue stream. SUN currently has a Value Score of A.\nThe Zacks Consensus Estimate for 2024 and 2025 earnings per unit is pegged at $7.29 and $7.17, respectively. The partnership has witnessed upward earnings estimate revisions for 2024 and 2025 in the past 30 days.\nSM Energy is set to expand its oil-centered operations in the coming years, with an increasing focus on crude oil, especially in the Permian Basin and Eagle Ford regions. The company’s attractive oil and gas investments should create long-term value for shareholders.\nThe Zacks Consensus Estimate for SM’s 2024 EPS is pegged at $6.63. The company has a Zacks Style Score of B for Value. It has witnessed upward earnings estimate revisions for 2024 in the past 30 days.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nSunoco LP (SUN) : Free Stock Analysis Report\nSM Energy Company (SM) : Free Stock Analysis Report\nArchrock, Inc. (AROC) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Bp-Acquire-Full-Control-Biofuels-115800057.Html", "Sentiment_Score": 0.1207342744, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-06-20T13:29:00.000Z", "Headline": "Carlyle Expands Energy Assets With Energean Portfolio Buy of Up to $945 Million", "Summary": "Private-equity firm Carlyle Group is expanding its exploration and production assets with the acquisition of operations in Italy, Egypt and Croatia from Energean for up to $945 million.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/64A2Ccd4-E698-3Ad4-A22C-989140513843/Carlyle-Expands-Energy-Assets.Html", "Sentiment_Score": 0.8652607799, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-06-20T13:00:10.000Z", "Headline": "BP p.l.c. (BP) is Attracting Investor Attention: Here is What You Should Know", "Summary": "BP (BP) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nShares of this oil and gas company have returned -3.2% over the past month versus the Zacks S&P 500 composite's +3.6% change. The Zacks Oil and Gas - Integrated - International industry, to which BP belongs, has lost 6.6% over this period. Now the key question is: Where could the stock be headed in the near term?\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\nRevisions to Earnings Estimates\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nFor the current quarter, BP is expected to post earnings of $1.22 per share, indicating a change of +37.1% from the year-ago quarter. The Zacks Consensus Estimate has changed +1% over the last 30 days.\nThe consensus earnings estimate of $4.80 for the current fiscal year indicates a year-over-year change of +0.4%. This estimate has changed +0.3% over the last 30 days.\nFor the next fiscal year, the consensus earnings estimate of $5.51 indicates a change of +14.9% from what BP is expected to report a year ago. Over the past month, the estimate has changed +1.3%.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for BP.\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\n12-month consensus EPS estimate for BP _12MonthEPSChartUrl\nProjected Revenue Growth\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nIn the case of BP, the consensus sales estimate of $63.26 billion for the current quarter points to a year-over-year change of +27.9%. The $241.74 billion and $258.17 billion estimates for the current and next fiscal years indicate changes of +13.5% and +6.8%, respectively.\nLast Reported Results and Surprise History\nBP reported revenues of $49.96 billion in the last reported quarter, representing a year-over-year change of -12.3%. EPS of $0.97 for the same period compares with $1.66 a year ago.\nCompared to the Zacks Consensus Estimate of $61.77 billion, the reported revenues represent a surprise of -19.12%. The EPS surprise was -5.83%.\nThe company could not beat consensus EPS estimates in any of the last four quarters. The company could not beat consensus revenue estimates in any of the last four quarters.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nBP is graded A on this front, indicating that it is trading at a discount to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about BP. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Bp-P-L-C-Bp-130010919.Html", "Sentiment_Score": 0.057090871, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-06-20T12:40:00.000Z", "Headline": "BP to Take Control of Brazilian Biofuels JV in $1.4 Billion Deal", "Summary": "BP is taking full control of its Brazilian biofuels joint venture, BP Bunge Bioenergia, with the acquisition of its partner’s 50% shareholding, as part of its plan to focus on new biofuels projects.\nContinue Reading", "Link": "Https://Finance.Yahoo.Com/M/1D24766E-50E9-3C9B-9F06-A736846D61D3/Bp-To-Take-Control-Of.Html", "Sentiment_Score": 0.1267177016, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-06-19T15:10:39.000Z", "Headline": "5 High-Yield Dividend Stocks With Over 20% Upside Potential", "Summary": "5 High-Yield Dividend Stocks With Over 20% Upside Potential\nBenzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nAs the AI-led rally pushes stock valuations higher, value-conscious investors seek underappreciated stocks for steady income and stock price appreciation opportunities. The Madison Dividend Income Fund, in its first quarter report, said that it believes dividend stocks will rebound amid a broader sector leadership change in the market observed during the quarter, with Energy, Industrials and Financials pocketing significant gains. The valuation of dividend stocks is another reason behind the fund's optimism, as it cited data from Bank of America (BofA) Global Research, which says some dividend funds are \"historically cheap\" compared with the S&P 500.\nMany other notable Wall Street analysts are recommending dividend stocks in the current volatile environment. Talking to CNBC in April, JoAnne Feeney, Partner and Portfolio Manager at Advisors Capital Management, recommended investors to pile into \"good\" companies that pay dividends and keep their eyes \"firmly on the long run.\" The analyst thinks dividend stocks help investors navigate through cyclical volatility.\nIn this backdrop, let's examine some top high-yield dividend stocks that also have upside potential in terms of stock price. Based on the average target price set by Wall Street analysts, we preferred stocks with at least a 4% dividend yield and 20% upside potential.\nVale SA\nOne-Year Average Analyst Price Target: $15.74\nUpside Potential: 40%\nBrazilian metals and mining company Vale SA (NYSE:VALE) is one of the notable high-yield dividend stocks with upside potential. The stock’s dividend yield touched 11% as of June 18 as Vale shares fell 28% so far this year, driven by volatility in iron ore and copper prices after fresh data from China raised concerns about economic recovery in the country. In May, UBS upgraded the stock to Buy from Neutral and increased its price target to $15 from $13. UBS believes the ESG risks dragging down the stock are set to \"moderate\" as the firm believes the overall risk-reward for the company has also improved.\nWall Street analysts have an average price target of $15.74 for Vale, which presents a 40% upside potential from the stock price as of June 18.\nBP PLC\nOne-Year Average Analyst Price Target: $43.30\nUpside Potential: 22.35%\nBritish oil giant BP PLC (NYSE:BP) was in the news after Citi called the company a potential \"standard-bearer\" in Europe's future energy policy following European Union parliamentary elections which saw right-wing leaders gaining ground. BP has a dividend yield of about 4.9%. In May, BP reported weak Q1 results and expects upstream production in the second quarter to be slightly lower than in the first quarter.\nAccording to data from Yahoo Finance, Wall Street has a $43.30 price target on BP, which shows a 22.35% upside from the stock’s current levels.\nKeyCorp\nOne-Year Average Analyst Price Target: $16.44\nUpside Potential: 21%\nWith a 6% yield and 14 consecutive years of dividend growth, Cleveland, Ohio-based banking company KeyCorp (NYSE:KEY) is one of the noteworthy high-yield dividend stocks with over 20% upside potential.\nWall Street analysts on average expect the stock to hit $16.44 over the next 12 months, which is about 21% higher than the stock price on June 18. In April, the regional bank posted first quarter results that came in weak amid rising expenses and a decline in net interest income. Adjusted EPS from continuing operations came in at $0.22, missing the $0.23 consensus.\nKeyCorp shares were trading at $13.59 as of June 18, while Wall Street analysts have an average price target of $16.44 on the stock, representing a 21% upside.\nRio Tinto\nOne-Year Average Analyst Price Target: $81.38\nUpside Potential: 23%\nMining giant Rio Tinto PLC ADR Common Stock (NYSE:RIO) pays dividends semiannually and has a yield of over 6.5% as of June 18, one of the highest among peers in the mining industry. In April, the company said its iron-ore shipments fell 10% quarter-over-quarter. However, the company maintained its annual shipment guidance of 323 million to 338 million metric tons for the full year.\nWall Street analysts have an average price estimate of $81.38 for Rio Tinto, which represents a 23% upside from the stock’s price as of the June 18 market close.\nUGI Corporation\nOne-Year Average Analyst Price Target: $30.67\nUpside Potential: 39%\nPennsylvania-based natural gas and power distribution company UGI Corp. (NYSE:UGI) has been paying dividends for the last 140 years and, as of 2023, increased its payouts for 36 consecutive years. The stock has a 6.7% dividend yield as of June 18. In the second quarter, the company’s adjusted EPS came in at $1.97, beating estimates by $0.33, while revenue fell 20.3% year over year to $2.47 billion, missing the consensus by $600 million. The company affirmed its 2024 adjusted EPS outlook range of $2.70 to $3. Based on this EPS outlook, the company’s payout ratio of under 50% makes the dividend safe.\nAccording to data compiled by Yahoo Finance, Wall Street analysts expect the stock price to reach about $31 over the next 12 months on average. This estimate represents a 39% upside from the current price.\nAre You Missing Out On Higher Yields?\nThe current high-interest-rate environment has created an incredible opportunity for income-seeking investors to earn massive yields, but not through dividend stocks... Certain private market real estate investments are giving retail investors the opportunity to capitalize on these high-yield opportunities and Benzinga has identified some of the most attractive options for you to consider.\nFor instance, Basecamp Alpine Notes offers a target APY of 9% with a term of only three months, making it a powerful short-term cash management tool with incredible flexibility. EquityMultiple has issued 61 Alpine Notes Series and has met all payment and funding obligations with no missed or late interest payments. With a low minimum investment of just $1,000, Basecamp Alpine Notes makes it easier than ever to start building a high-yield portfolio. \nDon't miss out on this opportunity to take advantage of high-yield investments while rates are high. Check out Benzinga's favorite high-yield offerings.\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nThis article 5 High-Yield Dividend Stocks With Over 20% Upside Potential originally appeared on Benzinga.com", "Link": "Https://Finance.Yahoo.Com/News/5-High-Yield-Dividend-Stocks-151042742.Html", "Sentiment_Score": 0.1509966403, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-06-18T06:36:33.000Z", "Headline": "The world’s biggest offshore oil and gas companies", "Summary": "ExxonMobil\nBiggest Offshore Oil and Gas Industry\nExxonMobil - $422.3bn\nWith $422.3bn market value, ExxonMobil is not only the world's biggest oil and gas company but also the world's biggest seller of petroleum products. It produced 2.1 million barrels of oil per day and 11.1 billion cubic feet of natural gas per day in 2014.\nHeadquartered in Irving, US, ExxonMobil has global presence in 47 countries. Its proven reserves were estimated to be 25.2 billion oil-equivalent barrels as of December 2013. It completed eight major upstream projects in 2014.\nRoyal Dutch Shell - $234.1bn\nBritish-Dutch conglomerate Roy Dutch Shell operates in more than 70 countries and territories. Its total proven reserves at the end of 2014 were 13.1 billion barrels of oil equivalent while production for the full year 2014 was three million barrel of oil equivalent a day.\nThe company's upstream business constitutes Upstream Americas and Upstream International units. Major projects being developed by Shell include Gbaran Ubie Phase Two, Malampaya Phases 2 & 3, Stones, and Prelude FLNG. The company has interests in 30 refineries whose combined processing capacity is approximately 3.3 million barrels of oil a day.\nChevron\nChevron - $227.2bn\nChevron Corporation, one of the world's biggest integrated energy companies, operates in some of the world's major oil and gas regions. It produced 5,167mmcf/d of natural gas and 2,571mb/d of total net oil equivalent in 2014, complemented by first production at the North Rankin 2 Project in Australia, the Papa-Terra Project in Brazil and the Tahiti 2 Project in the U.S. Gulf of Mexico.\nChevron's major activities in 2014 included two natural gas discoveries in the Carnarvon Basin offshore Western Australia and crude oil discovery at the Coronado prospect in the deepwater Gulf of Mexico. The company reported earnings of $19.2bn for the year ended December 2014, while revenue stood at $211.9bn.\nPetroChina - $202.2bn\nPetroChina, a subsidiary of China National Petroleum Corporation (CNPC), produces two-thirds of China's oil and gas, making it the biggest oil and gas producer in China.\nThe company's domestic exploration is centred in oil and gas regions such as Songliao Basin, Erdos Basin, Tarim Basin, Sichuan Basin and Bohai Bay Basin, and the output comes from oil and gas fields in Daqing, Changqing, Xinjiang, Tarim and the south-western region. Its overseas oil and gas operations are spread across Central Asia, the Middle East, America, Africa and Asia Pacific.\nTotal\nTotal - $149.8bn\nTotal, an integrated oil and gas operator engaged in the exploration, production, processing and transportation of oil and gas resources, produced 1.03 million barrels of oil equivalent per day and 6,063 million cubic feet per day gas in 2014.\nTotal is the top deepwater producer in West Africa with interests in fields including Akpo, Egina, Clov, Pazflor, Dalia and Rosa. It also holds interests in LNG projects in Africa (Nigeria LNG), Australia (Ichthys LNG), the Middle East (Yemen LNG) and Russia (Yamal LNG).\nBP - $148.8bn\nBP, also known as British Petroleum, produced 3.2 million barrels of oil equivalent a day in 2014 and has proven oil reserves of 17,996 million barrels of oil equivalent according to December 2013 estimates.\nHeadquartered in London, BP has presence in 80 countries and upstream operations in 28 of these. BP is the biggest foreign player in the Russian oil market, and is also one of the biggest producers of natural gas in North America. It either wholly or partly owns 14 refineries across the world.\nSinopec\nChina Petroleum & Chemical Corporation (Sinopec Corp.) - $94.7bn\nChina Petroleum & Chemical Corporation (Sinopec Corp.), the second biggest producer of crude oil and natural gas in China, had proven developed and undeveloped reserves of 2,841 million barrels of oil and 6,493 billion cubic feet of natural gas as of December 2013.\nThe company has 12 oil and gas subsidiaries and is associated with oil and gas exploration and development zones in the east, west and south regions of China.\nEni - $90.9bn\nEni, the world's eighth biggest oil and gas operator by market value, produced 1.6 million barrels oil equivalent per day and reported $126.3bn of revenue and $1.5bn of net profit in 2014.\nAbout 89% of the Eni's output was from outside Italy, primarily from the US, UK, Angola and Algeria. The company's estimated net proven reserves as of December 2014 stood at 6.60 billion barrels of oil equivalent.\nStatoil\nStatoil - $89.2bn\nNorwegian global energy company Statoil has business operations in 36 countries and upstream operations in 29 locations worldwide. It produced 1,927mboe per day and had proven oil and gas reserves of 5,359mmboe in 2014.\nStatoil operates Oseberg, one of the world's biggest oil fields, and fields including Alve, Asgard, Borg, Heidrun, Kristine, Norne, Njord, Sleipner East and West, Skuld and Vega on the Norwegian continental shelf. Its major oil and gas discoveries in 2014 were in the Drivis prospect in the Barents Sea, and Askja prospects in the Grane area offshore Tanzania.\nGazprom - $88.8bn\nGazprom owns the world's biggest natural gas reserves, estimated at 35.7 trillion cubic meters, and the biggest gas transmission system. Its oil and condensate reserves stood at 3.2 billion tonnes as of December 2013.\nGazprom's gas transmission system constitutes 169,000km of gas trunk-lines and laterals, 247 line compressor stations, and 26 underground gas storages. The company is currently engaged in large-scale gas projects in the Yamal Peninsula, the Arctic seas, Eastern Siberia and the Far East, as well as exploration and production projects overseas.\nNRI Energy Technology\n\"The world’s biggest offshore oil and gas companies\" was originally created and published by Offshore Technology, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.", "Link": "Https://Finance.Yahoo.Com/News/World-Biggest-Offshore-Oil-Gas-063633909.Html", "Sentiment_Score": 0.1608797908, "Sentiment_Category": "bullish"}, {"Ticker": "BP", "Time": "2024-06-14T13:06:00.000Z", "Headline": "Here's Why Retain Strategy is Apt for BP Stock Right Now", "Summary": "BP plc BP, a leading integrated energy company, has witnessed no earnings estimate revisions for 2024 and 2025 in the past seven days.\nWhat's Favoring the Stock?\nWest Texas Intermediate crude prices nearing $80 per barrel are proving highly advantageous for BP’s exploration and production endeavors. The energy giant boasts a robust pipeline of significant upstream projects, either operational or set to commence activities this year and beyond.\nFurthermore, BP is at the forefront of the energy transition movement, aiming to achieve net-zero emissions by 2050 or sooner. The integrated company is committed to expanding its renewable energy capacity to 20 gigawatts by 2025.\nThe company, carrying a Zacks Rank #3 (Hold),demonstrates robust involvement in refining and marketing sectors, offering resilience during business disruptions and periods of depressed oil prices.\nRisks\nHaving a strong presence in the upstream energy space, the company’s exploration and production operations are exposed to volatility in oil and natural gas prices.\nStocks to Consider\nBetter-ranked energy companies include Vitesse Energy Inc VTS, ProPetro Holding Corp. PUMP and Vista Energy SAB de CV VIST. While Vitesse Energy sports a Zacks Rank #1 (Strong Buy), ProPetro Holding and Vista Energy carry a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.    \nVitesse Energy has non-operated working and mineral interests in oil and gas assets, mainly across the prolific Bakken in North Dakota. With interests in 6,932 productive wells, Vitesse Energy has secured a solid production outlook, assuming that the crude pricing scenario will remain extremely favorable.\nThe business scenario for ProPetro Holding is bright, given the current favorable oilfield service demand. Thus, it secures handsome cashflows as it is a leading provider of pressure pumping and other complementary services. For 2024 and 2025, ProPetro Holding has witnessed upward earnings estimate revisions over the past 30 days.\nVista Energy, a leading exploration and production company, has a significant presence in Vaca Muerta, a highly productive shale oil and gas play outside of North America. The company has set an ambitious goal of achieving net-zero emissions by 2026.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nProPetro Holding Corp. (PUMP) : Free Stock Analysis Report\nVista Oil & Gas, S.A.B. de C.V. Sponsored ADR (VIST) : Free Stock Analysis Report\nVitesse Energy, Inc. (VTS) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research", "Link": "Https://Finance.Yahoo.Com/News/Heres-Why-Retain-Strategy-Apt-130600887.Html", "Sentiment_Score": 0.0476183221, "Sentiment_Category": "neutral"}]}